{"text": "5G Connected Future Incubator Program Takes Innovation to the Next Level | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\n5G Connected Future Incubator Program Takes Innovation to the Next Level\nApplications now open for incubator participants to receive mentoring and coaching as they develop new 5G products and services.\nFacebook\nTwitter\nEmail\nBob Siegel a telecommunications industry veteran, is the Advanced Technology Development Center's 5G Connected Future program catalyst.\nAug 31, 2021\n— Atlanta, GA\nTechnology startups may now apply to join the 5G Connected Future incubator program as they work to build and test 5G use cases in areas such as autonomous vehicles, robotics, industrial drones, mixed-reality training and entertainment, remote medical care, personal health and fitness wearables and more.\nThe 5G Connected Future program, launched earlier this year by T-Mobile Accelerator, Curiosity Lab at Peachtree Corners, and the Georgia Institute of Technology, is managed by the Advanced Technology Development Center (ATDC). It is located at Curiosity Lab in the city of Peachtree Corners’ 500-acre smart city technology park, a living lab powered by T-Mobile 5G where more than 8,000 people live or work. Curiosity Lab features a 25,000-square-foot Innovation Center and 3-mile autonomous vehicle test track. T-Mobile has deployed its Extended Range 5G and Ultra Capacity 5G network across the park, enabling developers to build solutions in a real-world environment.\nThe 5G Connected Future vertical is the fourth of its kind at ATDC and follows other targeted programs in health, retail, and financial technologies. Before the launch of the 5G incubator, ATDC only served Georgia-based companies. Now, with this external funding from T-Mobile Accelerator and Curiosity Lab, ATDC will be able to help develop startups in the 5G-connected space from all over the globe.\n“With applications open, the city of Peachtree Corners and Curiosity Lab will soon host even more companies testing the next generation of 5G innovation,” said Betsy Plattenburg, executive director of Curiosity Lab. “No one knows what industries will take off with 5G, but with the coaching, mentoring, and growth that each incubator participant will receive, many will successfully leave the program ready to disrupt the intelligent mobility and smart city industries.”\nNewly hired industry veteran Robert “Bob” Siegel will serve as the 5G program’s connected future catalyst. Siegel comes to ATDC with 25 years of mobility experience, including senior roles at Accenture and Verizon Telematics. He will leverage his extensive network to discover high-potential startups that can benefit from this program. In this new position, Siegel will lead recruitment efforts of startups working on 5G technology and guide their growth while in the incubator. He will be based at Curiosity Lab’s Innovation Center.\n“Innovation doesn't take place in a vacuum, which is why entrepreneurs and startups require the knowledge and resources provided by partnerships such as ours,” said John Avery, director of ATDC. “With technology support and coaching from business leaders at T-Mobile, Georgia Tech, and Curiosity Lab, as well as Bob joining the team, startups in the 5G incubator can transform their ideas into scalable companies with functional 5G technology.”\nTo apply to join the 5G incubator, click  here .\nAdditional Images\nContact\nAyana Isles\nM:  404.660.2927\nE:  aisles3@gatech.edu\nEmail\nperalte.paul@comm.gatech.edu\nAdditional information\nAbout T-Mobile Accelerator\nT-Mobile Accelerator serves as a hub for driving ideas, innovation and action. Focused on collaborative experiences for growth, it delivers year-round programming and activities, including entrepreneurial and tech community engagements, expert speakers and mentorship sessions. Since its inception, the T-Mobile Accelerator has worked with 75 startup companies that have raised an aggregate of over $96 million since participating in the program. Additionally, 80% of the alumni companies are still in business today.\nAbout Georgia Tech\nThe Georgia Institute of Technology, or Georgia Tech, is a top 10 public research university developing leaders who advance technology and improve the human condition. The Institute offers business, computing, design, engineering, liberal arts, and sciences degrees. Its nearly 40,000 students, representing 50 states and 149 countries, study at the main campus in Atlanta, at campuses in France and China, and through distance and online learning. As a leading technological university, Georgia Tech is an engine of economic development for Georgia, the Southeast, and the nation, conducting more than $1 billion in research annually for government, industry, and society.\nAbout the Advanced Technology Development Center (ATDC)\nThe Advanced Technology Development Center (ATDC), a program of the Georgia Institute of Technology, is the state of Georgia’s technology startup incubator. Founded in 1980 by the Georgia General Assembly, which funds it each year, ATDC’s mission is to work with entrepreneurs in Georgia to help them learn, launch, scale, and succeed in the creation of viable, disruptive technology companies. Since its founding, ATDC has grown to become the longest running and one of the most successful university-affiliated incubators in the United States, with its graduate startup companies raising $3 billion in investment financing and generating more than $12 billion in revenue in the state of Georgia. To learn more, visit  atdc.org .\nAbout Curiosity Lab at Peachtree Corners\nCuriosity Lab is a 5G-enabled autonomous vehicle and smart city living laboratory located in Peachtree Corners, Georgia, a northern suburb of Atlanta. The centerpiece of the lab is a 3-mile test and demo track, which provides a real-world environment to explore emerging technologies. Additional infrastructure includes a network operations center, smart poles, DSRC units, dedicated fiber, and a 25,000-square-foot tech innovation center. Additional information can be found at  curiositylabptc.com .\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}