{"text": "Celebrating Inclusive Excellence: Promoting Accessibility for Everyone | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nCelebrating Inclusive Excellence: Promoting Accessibility for Everyone\nIn July 2020, with support from its Diversity and Inclusion Division, the Georgia Tech Research Institute (GTRI) launched six employee resource groups (ERGs) to foster a more inclusive work environment at GTRI.\nFacebook\nTwitter\nEmail\nBrittney Odoi is the head of the Diversity and Inclusion Division and an accessibility advocate at GTRI. (Credit: Sean McNeil, GTRI)\nJul 26, 2021\n— Atlanta, GA\nIn July 2020, with support from its Diversity and Inclusion Division, the Georgia Tech Research Institute (GTRI) launched six employee resource groups (ERGs) to foster a more inclusive work environment at GTRI.  ERGs at GTRI drive opportunities for employee engagement, education and training, recruitment, retention, and community outreach. One of these groups, ACCESS@GTRI, was created for employees who identify as having a visible or a nonvisible disability.\n“Disability has no race, gender, age, [or] religion attached to it,” said Brittney Odoi, head of Diversity and Inclusion Division and an accessibility advocate at GTRI. “It’s all about the experiences you have and how you fight through them.”\nMembers of ACCESS@GTRI see GTRI’s work in accessibility and inclusion within the organization as an innovation for how they “show up” for their employees, which aligns well with the ideals of innovation and problem-solving, upon which GTRI was founded.\nWith the upcoming anniversary of the Americans with Disabilities Act (ADA), which, when signed into law on July 26, 1990, prevented the discrimination of employees with disabilities, three Georgia Tech employees share their stories and discuss how society can be made more accessible for all.\nBrittney Odoi\nDuring Brittney Odoi’s first official week of college at the Xavier University of Louisiana in New Orleans, Hurricane Katrina struck the city. Unable to leave the college, Odoi and many of her classmates were forced to weather the storm, hunkered down in their dormitory with residence staff from the university. Then they were forced to face the chaos that came with the civil disorder and rationing of food in the aftermath of the hurricane.\n“The next few days seemed to take forever with no hot food, no running water, or suction for the commodes,” Odoi recalled. “Our survival of the hurricane was nothing compared with surviving everyday life for the next few days in St. Katharine Drexel Hall.”\nAfter days of devastation and uncertainty, a boat came to ferry the students, residence life staff, and nuns living in the residence hall to a bridge on the interstate above the flooded town. The students waited on that bridge for another 13 hours until the United States Army and Coast Guard evacuated them. Afterward, Odoi prepared to return home to Atlanta. Though the devastating event was behind her, the memories and experiences continue to affect Odoi.\n“When I got home, that’s when things started to hit me,” Odoi said. “I had been categorized as a refugee in the media. My high school held a prayer vigil because they thought I died.”\nOdoi transferred to Tennessee State University, where she completed her first semester as a college freshman. At a weekly counseling session during her one semester at Tennessee State University, Odoi’s counselor mentioned she might be dealing with post-traumatic stress disorder (PTSD), a mental health condition triggered by a traumatizing event. Odoi initially brushed this diagnosis off, associating PTSD with service members.\nFollowing that counseling session, Odoi’s life became increasingly busy as she worked to complete her undergraduate education. She returned to Xavier University in Spring 2006, and transferred to Clark Atlanta University in 2007. After graduating from Clark Atlanta University in five years with both her bachelor’s and master’s degrees in accounting, Odoi began working as an IT consultant and recruiter at an information technology company called Capgemini North America.\nIt wasn’t until life began to slow down, working from home and on slower-paced projects while with Capgemini in 2014 that the trauma of her experience came flooding back. Without her previous coping mechanism of keeping busy, symptoms of her PTSD, such as night terrors and anxiety, began to plague her days. Close friends and medical professionals helped Odoi navigate this time as she processed what having PTSD meant to her. Through their support and prescribed medication, she began to find new coping mechanisms to soothe her condition.\nOdoi’s personal experience has informed her work in diversity and inclusion efforts. Odoi drives GTRI’s internal diversity, equity, and inclusion strategy, leveraging a people-first and engagement approach to promote equal opportunities for success for employees and the GTRI talent pool. As an ACCESS@GTRI initiative, Odoi and the group are conducting a building audit, assessing handicap parking and ramp locations. The group also is working to ensure there are wellness rooms in all GTRI facilities. These rooms, equipped with an internal lock, can be used by nursing parents. They also provide a quiet location for someone with chronic pain or a secluded environment to administer medication.\n“Our people at GTRI are our capital, and we need to invest in them,” Odoi said.\nLiz Persaud\nWhen Liz Persaud went off to college, she had a lot on her mind. She wrestled with many questions like: Should I move out or go to a community college? Do I need to hire someone to help during the day? Do I need a driver?\nThese are questions she needed to address as someone who lives with a disability. Thankfully, she had access to many resources at Georgia State University, where she earned a bachelor’s degree in sociology. She now works as the program outreach manager at the\nCenter for Inclusive Design and Innovation\nat Georgia Tech, where she works to raise awareness and increase independence for the disability community.\nAt Georgia Tech, Persaud works with two programs: Tools for Life (Georgia’s Assistive Technology Act program), where she helps others identify their assistive technology needs, and the National Pass It On Center, which helps people with disabilities find refurbished assistive equipment.\nThough many programs are available for people with disabilities, Persaud finds that many still aren’t aware of what is available despite outreach and public speaking efforts. However, once they become aware, her team is happy to meet and help them find what they need.\n“We call it ‘hanging out with intent,’ and that’s part of our service, you know, identifying technology to help them with more independent living,” Persaud said.\nPersaud believes sometimes, “it takes a village” to become the person you want to be.\n“And I don’t mean that in a negative way,” she elaborated. “We’re all very interdependent on each other, and I think that’s super important. Yes, I believe in myself. Yes, I push myself, but if it weren’t for my amazing husband, and my family, and my friends — and even my coworkers who got to know me for me and the support that they provided,” Persaud says she wouldn’t be who she is today.\nLiz Weldon\nElizabeth (Liz) Weldon is a senior research scientist in the Human Systems Engineering Branch at GTRI and the chairperson for special projects within ACCESS@GTRI. She has conducted impact work at GTRI since joining in 2007.\nDuring her early days at GTRI, Weldon oversaw user testing of various projects. She worked on a contract GTRI had with the Arthritis Foundation to conduct product testing for items needing the foundation’s “Ease of Use” logo. After bringing in a test group, Weldon had them use the product, make observations, record feedback, and eventually determine if the product could receive the commendation. Weldon now works on projects for the U.S. Department of Defense. However, she explains there is an overlap between her current work and designing for people with disabilities.\n“When you have a pilot in a helicopter, for example, there are limitations for what they can and cannot do,” Weldon said. “[Their limitations] are imposed by the environment, so they can only reach so far without their seat belt becoming an issue.”\nAs someone who lives and works with disabilities, Weldon faces a unique set of challenges. But thanks to helpful teammates, managers, and policies at the organization, Weldon feels supported in an environment where she can do the work she enjoys.\n“GTRI as a whole has been excellent for me,” Weldon said. “Luckily, I was approved to get a laptop several years ago before it was the norm, and I signed a flex work agreement. That was a lifesaver.”\nWeldon also noticed that GTRI has been receptive to her suggestions for how the organization can be more accessible. Weldon works in one of GTRI’s newest facilities, the\nCobb County Research Facility . When the doors to enter the first floor were first installed, they were very heavy and had to be opened manually after using a badge reader with a code.\n“They have since changed that so that now there is a little sensor that you pass when going in that allows the door to open automatically,” Weldon said. “That’s not helpful just for me; it’s helpful for anyone who has their hands full.”\nBoth Weldon’s professional and personal experiences make her a great asset to ACCESS@GTRI’s leadership team.\nACCESS@GTRI aims to make it easier for people with long-term or short-term disabilities to find the resources they need with little to no added stress. The group wants to have a website with all the forms and documents people living with disabilities may need and plan to add a section on workplace accommodations.\nWeldon is also involved with ideas to ensure compliance with Section 508 of the Rehabilitation Act of 1973 and to revamp GTRI’s wellness rooms across the organization.\n“Being chronically ill is like having two jobs — one that makes money and one that keeps you alive,” Weldon said. “Trying to juggle those two can be very difficult.”\nThe efforts of Weldon and other members of ACCESS@GTRI create assistance for people with visible and nonvisible disabilities, promoting accessibility so all feel included, welcomed, and supported at GTRI.\nAdditional Images\nContact\n(Interim) Director of Communications\nMichelle Gowdy\nMichelle.Gowdy@gtri.gatech.edu\n404-407-8060\nEmail\nmichelle.gowdy@gtri.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}