{"text": "Robotic Arm Probes Chemistry of 3-D Objects by Mass Spectrometry | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nRobotic Arm Probes Chemistry of 3-D Objects by Mass Spectrometry\nA new robotic system at Georgia Tech’s Center for Chemical Evolution could soon let scientists better simulate and analyze the chemical reactions of early Earth on the surface of real rocks.\nFacebook\nTwitter\nEmail\nThe scientists programmed the robotic arm to poke the sample with an acupuncture needle.\nMar 25, 2014\n— Atlanta, GA\nWhen life on Earth was first getting started, simple molecules bonded together into the precursors of modern genetic material. A catalyst would have been needed, but enzymes had not yet evolved. One theory is that the catalytic minerals on a meteorite’s surface could have jump-started life’s first chemical reactions. But scientists need a way to directly analyze these rough, irregularly shaped surfaces. A new robotic system at Georgia Tech’s\nCenter for Chemical Evolution\ncould soon let scientists better simulate and analyze the chemical reactions of early Earth on the surface of real rocks to further test this theory. In a proof-of-concept study, scientists selected a region for analysis on round or irregularly-shaped objects using a 3-D camera on a robotic arm, which mapped the 3-dimentional coordinates of the sample’s surface. The scientists programmed the robotic arm to poke the sample with an acupuncture needle. The needle collected a small amount of material that the robot deposited in a nearby mass spectrometer, which is a powerful tool for determining a substance’s chemical composition. “You see the object on a monitor and then you can point and click and take a sample from a particular spot and the robot will go there,” said\nFacundo Fernandez , a professor in the School of Chemistry and Biochemistry, whose lab led the study. “We’re using an acupuncture needle that will touch very carefully on the surface of the object and then the robot will turn around and put the material inside of a high resolution mass spectrometer.” The research was published online February 28 in the journal\nAnalyst , a publication of the Royal Society of Chemistry. The research will be featured on the cover of an upcoming print issue. The work was supported by a National Science Foundation (NSF) Major Research Instrumentation Program (MRI) grant and by the National Science Foundation (NSF) and NASA Astrobiology Program, under the NSF Center for Chemical Evolution. Mass spectrometry is a powerful tool for analyzing surface chemistry or for identifying biological samples. It’s widely used in research labs across many disciplines, but samples for analysis typically have to be cleaned, carefully prepared, and in the case of rocks, cut into thin, flat samples. The new robotic system is the first report of a 3-D mass spectrometry native surface imaging experiment. “Other people have used an acupuncture needle to poke a sample and then put that in mass spec, but nobody has tried to do a systematic, three-dimensional surface experiment,” Fernandez said. “We are trying to push the limits.” To show that the system was capable of probing a three-dimensional object, the researchers imprinted ink patterns on the surfaces of polystyrene spheres. The team then used the robotic arm to model the surfaces, probe specific regions, and see if samples collected were sufficient for mass spectrometry analysis. The researchers were able to detect inks of different colors and create a 3-D image of the object with sufficient sensitivity for their proof-of-principle setup, Fernandez said. The research was the result of collaboration between Fernandez’s group, which specializes in mass spectrometry, and Henrik Christensen’s robotics group in the College of Computing. Christensen is the KUKA Chair of Robotics and a Distinguished Professor of Computing. He is also the executive director of the Institute for Robotics and Intelligent Machines (IRIM) at Georgia Tech. “The initial findings of this study mark a significant step toward using robots for three-dimensional surface experiments on geological material,” Christensen said. “We are using the repeatability and accuracy of robots to achieve new capabilities that have numerous applications in biomedical areas such as dermatology.” “It doesn’t happen very often that a group in mass spectrometry will have a very talented robotics group next to them,” Fernandez said. “If we tried to learn the robotics on our own it could take us a decade, but for them it’s something that’s not that difficult.” Christensen’s team loaned a Kuka KR5 sixx R650 robot to Fernandez’s lab for the study. Afterwards, Fernandez’s lab purchased their own robot from Universal Robots. They have also upgraded to a new mass spectrometer capable of resolution nearly eight times higher than the one used in the study. They will soon begin replicating early Earth chemistry on rocks and analyzing the reaction products with their robotic sampling system. “We really want to look at rocks,” Fernandez said. “We want to do reactions on rocks and granites and meteorites and then see what can be produced on the surface.” The technology could also be applied to other research fields, Fernandez said. For example, the robot-mass spec combo might be useful to dermatologists who often probe lesions on the skin, which have distinct molecular signatures depending on if the lesion is a tumor or normal skin tissue. This research is supported by the American Recovery and Reinvestment Act (ARRA) under the National Science Foundation (NSF) Major Research Instrumentation Program (MRI) (Grant number 0923179), and by the NSF and NASA Astrobiology Program under the NSF Center for Chemical Evolution (CHE-1004579). Any conclusions or opinions are those of the authors and do not necessarily represent the official views of the sponsoring agencies. CITATION : Rachel V. Bennett, et al., “Robotic Plasma Probe Ionization Mass Spectrometry (RoPPI-MS) of Non-Planar Surfaces.” (Analyst, February 2014)\nhttp://dx.doi.org/10.1039/c4an00277f\nResearch News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA @GTResearchNews Media Relations Contacts:\nBrett Israel ( @btiatl ) (404-385-1933) ( brett.israel@comm.gatech.edu ) or John Toon (404-894-6986) ( jtoon@gatech.edu ) Writer:\nBrett Israel\nAdditional Images\nContact\nBrett Israel 404-385-1933 brett.israel@comm.gatech.edu\nEmail\nbrett.israel@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}