{"text": "Student Speakers to Share Lessons and Encouragement | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nStudent Speakers to Share Lessons and Encouragement\nThe students selected as reflection speakers for Commencement are honored to talk about their Georgia Tech experience.\nFacebook\nTwitter\nEmail\nDec 14, 2023\nFor the four students selected as Commencement reflection speakers, the honor presents an opportunity to address their fellow graduates, professors, and loved ones.\nAt each of Georgia Tech’s four Fall Commencement ceremonies (Ph.D., and three ceremonies combining bachelor’s and master’s degrees), a graduating student is given three minutes to deliver an inspiring message. The Ph.D. speaker is Chidinma Imediegwu in\nmechanical engineering . The Friday afternoon speaker is Tess Greene, a master’s candidate in\ncomputer science . The Saturday morning speaker is\nKojo Bekoe-Sakyi, a bachelor’s candidate in\naerospace engineering .\nAnd the Saturday afternoon speaker is Tepolak Seth, a master’s candidate in\ncivil engineering .\nStudents must apply to become a reflection speaker. A panel of faculty, staff, and students selects a group of finalists who present a full version of their speech to the committee. The reflection speakers are required to work with Tech’s\nCommunication Center\nin preparation for the ceremony.\nChidinma Imediegwu\nAuditioning to be the Ph.D. reflection speaker was exciting and a little complex for Chidinma Imediegwu because she was already two months into her new job as a consultant with Boston Consulting Group (BCG).\nAs a student she served as president of Georgia Tech’s chapter of the Surface Mount Technology Association and was awarded the Charles Hutchins Grant for outstanding research and community leadership. She also worked as a graduate peer coach in the Career Center.\n“I became interested in consulting after my involvement with the Georgia Tech Ph.D. Consulting Club. In this role, I led a pro bono project to develop a growth strategy for a nonprofit that empowers and provides business and legal support to minority women entrepreneurs,” Imediegwu said.\nFor her reflection speech, she will look back at how far she and her classmates have come and encourage her classmates to continue to pursue their goals.\nImediegwu is Igbo, and her family is from Abia State, Nigeria, and she grew up in Lagos. “My sister, who is an emergency room physician, has been one of my biggest supporters since my Ph.D. program began. And my parents have stood beside me prayerfully throughout my journey. I have made it this far solely by grace.”\nShe will celebrate Commencement with 80 to 100 guests, including her parents, who are coming from Nigeria, and her siblings, cousins, and friends from around the world. Her sister, who is helping to plan the celebration, has hired an event coordinator, a DJ, and entertainment.\n“If you’re Nigerian and you’re having a party, you need to go all the way!” Imediegwu laughed.\nTess Greene\nWhen Tess Greene received her undergraduate degree in May 2020, her graduation was at home because of the pandemic, and she missed out on having a big moment. So, this time, she went all out and applied to be the reflection speaker.\n“I hoped I would be selected so my second graduation — and my first time walking — would be extra memorable. I have also been pushing myself to do more public speaking, and I couldn’t ask for a more meaningful opportunity,” she said.\nGreene will be speaking to an audience of her fellow master’s candidates in computer science, bachelor’s candidates in the Ivan Allen College of Liberal Arts, and bachelor’s candidates in the College of Design.\n“When I saw it was such a mixed group, I wanted to talk about connecting to those whose backgrounds, academic or otherwise, are very different from your own,” she said. “We each depend on each other for different facets of our lives, and we can accomplish more working with those whose talents are unlike our own.”\nGreene is from Xenia, Ohio and works at General Motors in Detroit. She plans to use her computer science degree to pivot from vehicle safety to cybersecurity. Her parents and her boyfriend will attend the ceremony, and they don’t know she is the reflection speaker.\n“I want to give a shoutout to my fellow online students,” she said. “We only connected on class Slack channels and the occasional group project call, but they were always incredibly supportive and understanding. They created a wonderful learning culture.”\nKojo Bekoe-Sakyi\nWhen Kojo Bekoe-Sakyi opened the program at last spring’s Commencement ceremony, he was surprised to learn that two of his friends were reflection speakers. Hearing his friends speak inspired him to apply.\n“I have always enjoyed the student speakers,” he said. “I remember my first-year Convocation speaker and how it was an inspiring and relatable part of the ceremony.” In his reflection speech, he will talk about one of Georgia Tech’s famous traditions and what it means to him.\nBekoe-Sakyi, an aerospace engineering major with a minor in industrial design, began looking at aerospace programs when he was in middle school. “Georgia Tech was among the top schools, so I always had Tech in mind.”\nNext year, the Turlock, California native plans to apply to the master’s program in industrial design. His dream job is to be an aircraft concept designer.\nHe will celebrate Commencement with his parents, siblings, Georgia Tech friends, and one of his high school teachers who encouraged him to apply to Tech.\n“I am excited to have this moment with my class and to be able to thank the entire Georgia Tech community for the impact they have had on my life by helping me to become the person that my 5-year-old self dreamed about. It’s very humbling.”\nTepolak Seth\nTepolak Seth applied to be a reflection speaker because she has a good story to tell. She is an international student from Phnom Penh, Cambodia who came to the U.S. in 2015 and attended high school in Atlanta.\n“I faced many challenges\n—\nthe culture, the people, and the academic environment. I had to not only relearn how to learn, but I also had to adapt to the American high school experience without losing myself along the way. After graduating from high school, I had to do that all over again when I entered Tech,” she said.\nAt times she felt like an imposter because she didn’t think she was as smart as other students. Along the way, she met friends and professors who encouraged her.\n“All of these people told me, ‘You got this.’ My parents also believed in and supported me,” she said. “So, I wanted my speech to show people that although we may sometimes feel like an imposter, that doesn’t mean we are one. I am forever grateful for the people who believed in me.”\nFamily and friends will join Seth to celebrate her big day. “Unfortunately, my dad could not make it,” she said. “However, my mom will be there, along with my younger sister, my two aunts and uncles, and my little cousins. I believe some of my friends will also be watching the livestream. No pressure on me at all! But to be fair, I did do this to myself.”\nIn February, she will move to the Bay Area to begin her job as a civil engineer with Tesla.\nRelated links\nFall Commencement Changes Include Moving to McCamish\nContact\nVictor Rogers\nInstitute Communications\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}