{"text": "Solar-Induced Hybrid Fuel Cell Produces Electricity Directly from Biomass | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nSolar-Induced Hybrid Fuel Cell Produces Electricity Directly from Biomass\nResearchers have developed a new type of low-temperature fuel cell that directly converts biomass to electricity with assistance from a catalyst activated by solar or thermal energy.\nFacebook\nTwitter\nEmail\nA new solar-induced direct biomass-to-electricity hybrid fuel cell can operate on fuels as varied as powdered wood. The fuel cell, shown on the right, relies on a polyoxometalate (POM) catalyst (shown in the vials) which changes color as it reacts with light. (Georgia Tech Photo: John Toon)\nFeb 18, 2014\n— Atlanta, GA\nAlthough low temperature fuel cells powered by methanol or hydrogen have been well studied, existing low temperature fuel cell technologies cannot directly use biomass as a fuel because of the lack of an effective catalyst system for polymeric materials. Now, researchers at the Georgia Institute of Technology have developed a new type of low-temperature fuel cell that directly converts biomass to electricity with assistance from a catalyst activated by solar or thermal energy. The hybrid fuel cell can use a wide variety of biomass sources, including starch, cellulose, lignin – and even switchgrass, powdered wood, algae and waste from poultry processing. The device could be used in small-scale units to provide electricity for developing nations, as well as for larger facilities to provide power where significant quantities of biomass are available. “We have developed a new method that can handle the biomass at room temperature, and the type of biomass that can be used is not restricted – the process can handle nearly any type of biomass,” said\nYulin Deng , a professor in Georgia Tech’s\nSchool of Chemical and Biomolecular Engineering\nand the\nInstitute of Paper Science and Technology\n(IPST). “This is a very generic approach to utilizing many kinds of biomass and organic waste to produce electrical power without the need for purification of the starting materials.” The new solar-induced direct biomass-to-electricity hybrid fuel cell was described February 7, 2014, in the journal\nNature Communications . The challenge for biomass fuel cells is that the carbon-carbon bonds of the biomass – a natural polymer – cannot be easily broken down by conventional catalysts, including expensive precious metals, Deng noted. To overcome that challenge, scientists have developed microbial fuel cells in which microbes or enzymes break down the biomass. But that process has many drawbacks: power output from such cells is limited, microbes or enzymes can only selectively break down certain types of biomass, and the microbial system can be deactivated by many factors. Deng and his research team got around those challenges by altering the chemistry to allow an outside energy source to activate the fuel cell’s oxidation-reduction reaction. In the new system, the biomass is ground up and mixed with a polyoxometalate (POM) catalyst in solution and then exposed to light from the sun – or heat. A photochemical and thermochemical catalyst, POM functions as both an oxidation agent and a charge carrier. POM oxidizes the biomass under photo or thermal irradiation, and delivers the charges from the biomass to the fuel cell’s anode. The electrons are then transported to the cathode, where they are finally oxidized by oxygen through an external circuit to produce electricity. “If you mix the biomass and catalyst at room temperature, they will not react,” said Deng. “But when you expose them to light or heat, the reaction begins. The POM introduces an intermediate step because biomass cannot be directly accessed by oxygen.” The system provides major advantages, including combining the photochemical and solar-thermal biomass degradation in a single chemical process, leading to high solar conversion and effective biomass degradation. It also does not use expensive noble metals as anode catalysts because the fuel oxidation reactions are catalyzed by the POM in solution. Finally, because the POM is chemically stable, the hybrid fuel cell can use unpurified polymeric biomass without concern for poisoning noble metal anodes. The system can use soluble biomass, or organic materials suspended in a liquid. In experiments, the fuel cell operated for as long as 20 hours, indicating that the POM catalyst can be re-used without further treatment. In their paper, the researchers reported a maximum power density of 0.72 milliwatts per square centimeter, which is nearly 100 times higher than cellulose-based microbial fuel cells, and near that of the best microbial fuel cells. Deng believes the output can be increased five to ten times when the process is optimized. “I believe this type of fuel cell could have an energy output similar to that of methanol fuel cells in the future,” he said. “To optimize the system, we need to have a better understanding of the chemical processes involved and how to improve them.” The researchers also need to compare operation of the system with solar energy and other forms of input energy, such as waste heat from other processes. Beyond the ability to directly use biomass as a fuel, the new cell also offers advantages in sustainability – and potentially lower cost compared to other fuel cell types. “We can use sustainable materials without any chemical pollution,” Deng said. “Solar energy and biomass are two important sustainable energy sources available to the world today. Our system would use them together to produce electricity while reducing dependence on fossil fuels.” In addition to Deng, the research team included Wei Liu, Wei Mu, Mengjie Liu, Xiaodan Zhang and Hongli Cai, all from the School of Chemical and Biomolecular Engineering or the Institute of Paper Science and Technology at Georgia Tech. CITATION : Wei Liu, et al., “Solar-induced direct biomass-to-electricity hybrid fuel cell using polyoxometalates as photocatalyst and charge carrier,” (Nature Communications, 2014). ( http://www.dx.doi.org/10.1038/ncomms4208 ). Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia  30332-0181  USA Media Relations Contacts : John Toon (404-894-6986) ( jtoon@gatech.edu ) or Brett Israel (404-385-1933) ( brett.israel@comm.gatech.edu ). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}