{"text": "Machine Learning Predicts Biodiversity and Resilience in the Coral Triangle | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMachine Learning Predicts Biodiversity and Resilience in the Coral Triangle\nThe team's new methodology offers hope for better coral connectivity monitoring and protection in the future.\nFacebook\nTwitter\nEmail\nFeb 09, 2023\nCoral reef conservation is a steppingstone to protect marine biodiversity and life in the ocean as we know it. The health of coral also has huge societal implications: reef ecosystems provide sustenance and livelihoods for millions of people around the world. Conserving biodiversity in reef areas is both a social issue and a marine biodiversity priority.\nIn the face of climate change,\nAnnalisa Bracco , professor in the\nSchool of Earth and Atmospheric Sciences\nat Georgia Institute of Technology, and Lyuba Novi, a postdoctoral researcher, offer a new methodology that could revolutionize how conservationists monitor coral. The researchers applied machine learning tools to study how climate impacts connectivity and biodiversity in the Pacific Ocean’s Coral Triangle — the most diverse and biologically complex marine ecosystem on the planet.\nTheir research , recently published in\nNature Communications Biology , overcomes time and resource barriers to contextualize the biodiversity of the Coral Triangle, while offering hope for better monitoring and protection in the future.\n“We saw that the biodiversity of the Coral Triangle is incredibly dynamic,” Bracco said. “For a long time, it has been postulated that this is due to sea level change and distribution of land masses, but we are now starting to understand that there is more to the story.”\nConnectivity refers to the conditions that allow different ecosystems to exchange genetic material such as eggs, larvae, or the young. Ocean currents spread genetic material and also create the dynamics that allow a body of water — and thus ecosystems — to maintain consistent chemical, biological, and physical properties. If coral larvae are spread to an ecoregion where the conditions are very similar to the original location, the larvae can start a new coral.\nBracco wanted to see how climate, and specifically the El Niño Southern Oscillation (ENSO) in its phases — El Niño, La Niña, and neutral conditions — impacts connectivity in the Coral Triangle. Climate events that move large masses of warm water in the Pacific Ocean bring enormous changes and have been known to exacerbate coral bleaching, in which corals turn white due to environmental stressors and become vulnerable to disease.\n“Biologists collect data\nin situ , which is extremely important,” Bracco said. “But it’s not possible to monitor enormous regions\nin situ\nfor many years — that would require a constant presence of scuba divers. So, figuring out how different ocean regions and large marine ecosystems are connected over time, especially in terms of foundational species, becomes important.”\nMachine Learning for Discovering Connectivity\nYears ago, Bracco and collaborators developed a tool, Delta Maps, that uses machine learning to identify “domains,” or regions within any kind of system that share the same dynamic. Bracco initially used it to analyze domains of climate variability in models but also suspected it could be used to study ecoregions in the ocean.\nFor this study, they used the tool to map out domains of connectivity in the Coral Triangle using 30 years of sea surface temperature data. Sea surface temperatures change in response to ocean currents over scales of weeks and months and across distances of tens of kilometers. These changes are relevant to coral connectivity, so the researchers built their machine learning tool based on this observation, using changes in surface ocean temperature to identify regions connected by currents. They also separated the time periods that they were considering into three categories: El Niño events, La Niña events, and neutral or “normal” times, painting a picture of how connectivity was impacted during major climate events in particular ecoregions.\nNovi then applied a ranking system to the different ecoregions they identified. She used rank page centrality, a machine learning tool that was invented to rank webpages on the internet, on top of Delta Maps to identify which coral ecoregions were most strongly connected and able to receive the most coral larvae from other regions. Those regions would be the ones most likely sustain and survive through a bleaching event.\nClimate Dynamics and Biodiversity\nBracco and Novi found that climate dynamics have contributed to biodiversity because of the way climate introduces variability to the currents in the equatorial Pacific Ocean. The researchers realized that alternation of El Niño and La Niña events has allowed for enormous genetic exchanges between the Indian and Pacific Oceans and enabled the ecosystems to survive through a variety of different climate situations.\n“There is never an identical connection between ecoregions in all ENSO phases,” Bracco said. “In other parts of the world ocean, coral reefs are connected through a fixed, often small, number of ecoregions, and if you eliminate this fixed number of connections by bleaching all connected reefs, you will not be able to rebuild the corals in any of them. But in the Pacific the connections are changing all the time and are so dynamic that soon enough the bleached reef will receive larvae from completely different ecoregions in a different ENSO phase.”\nThey also concluded that, because of the Coral Triangle’s dynamic climate component, there is more possibility for rebuilding biodiversity there than anywhere else on the planet. And that the evolution of biodiversity in the Coral Triangle is not only linked to landmasses or sea levels but also to the evolution of ENSO through geological times. The researchers found that though ENSO causes coral bleaching, it has helped the Coral Triangle become so rich in biodiversity.\nBetter Monitoring Opportunities\nBecause coral reef survival has been designated a priority by the United Nations Sustainable Development Goals, Bracco and Novi’s research is poised to have broad applications. The researchers’ method identified which ecoregions conservationists should try hardest to protect and also the regions that conservationists could expect to have the most luck with protection measures. Their methodology can also help to identify which regions should be monitored more and the ones that could be considered lower priority for now due to the ways they are currently thriving.\n“This research opens a lot of possibilities for better monitoring strategies, and especially how to monitor given a limited amount of resources and money,” Bracco said. “As of now, coral monitoring often happens when groups have a limited amount of funding to apply to a very specific localized region. We hope our method can be used to create a better monitoring over larger scales of time and space.”\nCITATION: Novi, L., Bracco, A. “Machine learning prediction of connectivity, biodiversity and resilience in the Coral Triangle.”  Commun Biol   5 , 1359 (2022).\nDOI:\nhttps://doi.org/10.1038/s42003-022-04330-8\nContact\nCatherine Barzler, Senior Research Writer/Editor\nEmail\ncatherine.barzler@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}