{"text": "Ants: Both Solid-like and Liquid-like | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nAnts: Both Solid-like and Liquid-like\nStudy finds that ants are actually liquid-like and solid-like simultaneously\nFacebook\nTwitter\nEmail\nAnts were put in a rheometer, a machine used to test the solid-like and liquid-like response of materials such as food, hand cream or melted plastic.\nOct 26, 2015\n— Atlanta, GA\nCollections of ants have a remarkable ability to change shapes and tasks based on the demands of their environment. When floodwaters hit, they self-assemble and form rafts to stay alive. They can also use their bodies to build bridges and span gaps. What are the properties of these ant aggregations that allow for this wide range of abilities? New research from the Georgia Institute of Technology says it’s because the insects are actually liquid-like and solid-like simultaneously. The study is currently published in Nature Materials. The Georgia Tech group probed the mechanical properties of fire ant aggregations by putting thousands of ants into a rheometer, a machine used to test the solid-like and liquid-like response of materials such as food, hand cream or melted plastic. The ants were sheared at constant speeds from about 0.0001 rpm up to about 100 rpm. The researchers found that the behavior of live ants was similar to that of dead ants: when the aggregation is forced to flow, live ants let go and play dead. In this case, the viscosity dramatically decreased as the speed increased. “It’s not unlike ketchup,” said Alberto Fernandez-Nieves, an associate professor in the School of Physics. “The harder you squeeze, the easier it flows. But with ants, this happens much more dramatically than with ketchup.” “ Ants seem to have an on/off switch\nin that they let go for sufficiently large applied forces,” said David Hu, an associate professor in the George W. Woodruff School of Mechanical Engineering. “Despite wanting to be together, they let go and behave like a fluid to prevent getting injured or killed.” This same behavior\ncan be seen by dropping a penny\nthrough an ant aggregation. Ants will flow around the coin as it sinks through the aggregation. This flow takes a relatively long time to happen. However, when the aggregation is poked quickly, it responds like a spring and returns to its original shape. “This is the hallmark of viscoelastic behavior,” said Fernandez-Nieves. “The ants exhibit a springy-response when probed at short times, but behave fluid-like at longer times.” The group quantified this by looking at the ants’ response to tiny wiggles of the rheometer. They found that the ants are equally liquid-like and solid-like. They did the same experiment with dead ants and saw that they are also solid-like. This showed that live ants are liquid-like and solid-like because of their activity. “Remarkably, the observed behavior is similar to what is seen in materials that are not alive, like polymer gels right at the point when they become a gel,” said Fernandez-Nieves. “This is quite puzzling, and we are now performing many more experiments to try and understand where these similarities arise from and how much they can be pushed. Doing this will hopefully extend our current way of thinking about materials, that like the ants, are active and thus out-of-equilibrium. There is much more interesting work we plan on doing with ants.” Hu has studied ant behavior for nearly 10 years. Fernandez-Nieves is a physicist who uses rheology to understand the mechanics of soft materials and unravel the microscopic origin of their overall properties and behaviors. Michael Tennenbaum , a graduate research assistant who participated in the study, also compared the behavior of the ant aggregation to jello. “Imagine if you wanted to make the most jello possible out of a packet of gelatin. It would be solid, but also very liquidy,” he said. “That’s because there would be just barely enough gelatin to make it solid-like but not enough to make it completely solid. The jello would be both solid-like and liquid-like.” Hu has also used the liquid-like nature of the ants to study self-healing materials. “If you cut a dinner roll with a knife, you’re going to end up with two pieces of bread,” said Hu. “But if you cut through a pile of ants, they’ll simply let the knife go through, then reform on the other side. They’re like liquid metal – just like that scene in the Terminator movie.” Hu says it’s this flexibility that allows ants to enjoy the best of both worlds. They’re able to become solids to make things and liquids to avoid breaking into “smithereens.” The study, “ Mechanics of Ant Aggregations ,” was published in Nature Materials on October 26, 2015. This research is supported by the U.S. Army Research Laboratory and the U.S. Army Research Office Mechanical Sciences Division, Complex Dynamics and Systems Program, under contract numbers W911NF-12-R-0011 and W911NF-14-1-0487.\nAny conclusions expressed are those of the principal investigator and may not necessarily represent the official views of the funding organization.\nADDITIONAL PHOTOS AND VIDEO ARE AVAILABLE HERE:\nhttps://www.dropbox.com/sh/hycnwywaxdeau60/AAAHt79dAvREDICnt3nL4nlba?dl=0\nAdditional Images\nRelated links\nRead the study\nGeorge W. Woodruff School of Mechanical Engineering\nSchool of Physics\nAnt Physics Website\nContact\nJason Maderer National Media Relations 404-660-2926 maderer@gatech.edu\nEmail\nmaderer@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}