{"text": "Research Reveals Small Business Can Struggle to Leverage Tech Benefiting Workers | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nResearch Reveals Small Business Can Struggle to Leverage Tech Benefiting Workers\nResearch highlighting crucial role of front-line workers in designing automated technologies earns best paper award at premier social computing conference.\nFacebook\nTwitter\nEmail\nOct 18, 2023\nA new Georgia Tech study reveals that excluding front-line workers from the design process can increase employee turnover rates, leading to higher costs and reduced efficiency for businesses implementing new automated technologies.\nAlyssa Sheehan has seen firsthand how companies can struggle to leverage new technologies meant to improve systems and benefit workers. She collaborated with dozens of companies as the director of the Georgia Center of Innovation's aerospace team from 2022 to 2023.\nThat experience inspired the Ph.D. candidate and 2022 Foley Scholar to explore the effects on workers when technology is implemented to automate traditional paper-based processes.   Making Meaning from the Digitalization of Blue-Collar Work   won a best paper award at the 2023 Conference on   Computer Supported Cooperative Work and Social Computing   (CSCW) this week in Minneapolis.\n“I’m trying to cast meaningful work into a new light with automation and technology design,” Sheehan said. “The intention is so focused on delivering efficiency and optimizing the process. Companies and technologists forget about user input from workers using these systems.”\nMicrosoft and other major tech companies have   announced commitments   to use technology to foster a culture of meaningful work within the workplace. However, Sheehan said that small businesses often lack the resources and knowledge required to incorporate such beneficial technology. Others design the technology with only productivity in mind and without considering if it makes their employees’ jobs more meaningful.\n“There’s a lot of research that shows there’s a technology gap, particularly for small businesses,” Sheehan said. “I’m not always advocating for technology as a solution, but I look at what exists critically and ask, ‘Is this technology doing what we want it to? If the goal is to support workers, how is it doing that?’”\nSheehan worked with a small Georgia-based manufacturing company to conduct an 18-month study. She designed and deployed off-the-shelf tools to automate the company’s shipping and receiving processes that required time and paperwork.\nWith the support of researchers from Georgia Tech’s   Institute of People and Technology   (IPAT), she customized a wearable and mobile app. The workers used the app to check off critical tasks within the shipping process one by one.\nThe results were mixed.\nSheehan said many ground-floor shipping experts were frustrated by the frequency of having to repack orders because of customer complaints about improper shipping. The workers insisted they’d done the job correctly. The mobile app allowed them to take pictures of each order after packaging for quality assurance.\nThe workers appreciated the feature, but they also provided negative feedback. In some cases, the app required workers to perform tasks contrary to methods that suited them and made them feel productive. It also took away a sense of autonomy and pride in expertise from workers because it instructed them what to do step by step. Instead of making the job easier, workers felt like their superiors didn’t trust them to do the job correctly.\n“It helped in certain areas like not having to take notes on paper anymore and using outdated equipment. However, they struggled to see how it would preserve meaning in their job in terms of working with their hands and doing various tasks at any given time.\n“We create universal systems and solutions for mobile apps that are often deployed without understanding the context of organizational practices. That’s a problem. Now, the workers have to adapt their processes to make this tool work in practice. They’re being asked to give up how they do things,” Sheehan said.\nShe added that automated technology systems need to go beyond convenience and productivity, and these systems may cause more harm than good if it diminishes meaning and value from workers.\n“By leaving the worker perspective out of the design process, we limit the potential of these technologies,” she said. “Productivity still relies on people being engaged in the process. If we’re going to create true productivity, we need to make sure those jobs are valuable and that people feel what they do matters. That leads to less turnover and higher job satisfaction rates.”\nAdditional Images\nContact\nNathan Deen, Communications Officer\nSchool of Interactive Computing\nnathan.deen@cc.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}