{"text": "What is New @ GT in Packaging? 5G and mm-wave Packaging | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nWhat is New @ GT in Packaging? 5G and mm-wave Packaging\nGeorgia Tech and its industry partners are developing 5G and mm-wave packaging using ultra-thin Glass panel Fan-out technology\nFacebook\nTwitter\nEmail\nPrinted mm-wave antenna arrays at Georgia Tech.\nOct 17, 2016\n— Atlanta, GA\nGeorgia Tech and its industry partners are developing 5G and mm-wave packaging using ultra-thin Glass panel Fan-out technology with 10-100X improvement in bandwidth for consumer, computer, communication and automotive applications.\nThe explosive growth of data traffic from increasing number of digital and sensor devices, connected to the network, and the escalating demand for self-driving cars requiring both long-range vehicle-to-network and short-range vehicle-to-vehicle connectivity, has created a need for 10-100X increase in wireless data communication rates beyond current 4G LTE connectivity. This extreme traffic density requires high-frequency mobile bands, much beyond WLAN at 6 GHz, requiring mm-wave (e.g., 28-39 GHz and above) communications. Many challenges in achieving these goals such as those associated with system-level design, materials, processes, antennas and module integration must be addressed.\nTraditional mm-wave packages are based on ceramic substrates. The high cost and low-integration limitations of ceramics have led to the evolution of organic packages. A fully-integrated antenna-in-package (AiP) for W-band phased-array system, with 64 dual-polarization antennas embedded in a multi-layer organic substrate, with SiGe transceiver dies that are flipchip-attached has been demonstrated by IBM. In addition, ultra-low loss organic substrates using Teflon and LCPs were explored with high gains and high bandwidth. The evolution of embedded and fan-out wafer level ball grid array package technology (eWLB) further enhanced the performance of mm-wave packages by eliminating the wirebonds, as demonstrated by Infineon technologies, with SiGe-BiCMOS technology. However, organic laminates and molding-compound based fan-outs are limited by the precision and tolerance of circuitry for mm-wave components.\nIn contrast to the above approaches for 5G and beyond, Georgia Tech and its industry partners are pioneering ultra-thin, panel-based glass fan-out (GFO) embedded technology. GFO offers many advantages such as low electrical loss, superior dimensional stability for precision circuitry, stability to high temperature and humidity, matched CTE to Si and other devices and availability in thin and large glass panels processed with Cu-through vias, similar in dimensions to TSVs and RDL wiring layers, and similar to BEOL on Si. The Georgia Tech approach leads to major design, material, process and 3D package architecture innovations.\nSome of the key research innovations of the Georgia Tech 5G and beyond program include:\nLow-loss transmission with innovative waveguide structures on glass substrates with insertion losses approaching 0.05 dB/mm.\nFormation of precision circuitry enabled by high dimensional stability and surface smoothness of glass resulting in further lowering of the losses.\nMiniaturized and high bandwidth, high gain antenna arrays enabled by glass, in combination with ultra-low loss thinfilm polymers with initial results indicating that the bandwidth can be improved by 20% with a gain of 10 dBi than those on organic substrates.\nFormation of via arrays in glass with double-side interconnections enabling compact passive elements such as couplers and filters.\nIntegrated power amplifiers with thermal management using large copper through-via structures in glass thus eliminating the hotspots and reliability issues with embedded high-power dies.\nFeasibility of transparent RF electronics enabled by transparent glass substrates, transparent dielectrics and conductors in automotive windshields and windows.\nInnovative materials and processes such as 3D printing on flex substrates being pioneered by Georgia Tech for low-cost IoT applications.\nInnovative module integration of passives and actives with ultra-short interconnection length and ultra-small-vias in glass, resulting in very low via inductance, less than 50 pH and via-related transition losses, to less than 0.03 dB.\nThe 5G project is currently active in collaboration with many industry partners, including glass companies such as Corning Glass, Asahi Glass, and Schott Glass, supplying the ultra-thin glass panels; low-loss dielectric material suppliers such as Rogers; tool companies such as Ushio for precision lithography; Disco for planarization and dicing; Atotech for supplying the plating chemistry for advanced metallization processes; and end-users like Qualcomm.\nAbout the Authors\nAtom Watanabe is a PhD student under the advisement of Prof. Rao Tummala. His research focus is on EMI shielding and mm-wave module integration;\natom@gatech.edu .\nProf. Manos Tentzeris, Ken Byers Professor in ECE Department, Georgia Tech, is the faculty lead for the mm-wave program;\netentze@ece.gatech.edu .\nProf. Rao Tummala is the Joseph M. Pettit Chair Professor in ECE and MSE, and the Director of Georgia Tech’s 3D Systems Packaging Research Center (GT PRC);\nrao.tummala@ece.gatech.edu .\nDr. Raj Pulugurtha is a Research Professor and the Program Manager of Power and RF Module Programs;\npm86@mail.gatech.edu .\nDr. Venky Sundaram is a Research Professor and the Program Manager of Glass Substrate Program;\nvs24@mail.gatech.edu .\nAdditional Images\nContact\nKaren May\nMarketing & Communications Coordinator\nPackaging Research Center\nkaren.may@ece.gatech.edu\n(404) 385-1220\nEmail\nkaren.may@ece.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}