{"text": "Using Vibrations to Control a Swarm of Tiny Robots | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nUsing Vibrations to Control a Swarm of Tiny Robots\nIndividual robots can work collectively as swarms to create major advances in everything from construction to surveillance, but microrobots’ small scale is ideal for drug delivery, disease diagnosis, and even surgeries.\nFacebook\nTwitter\nEmail\nZhijian Hao (left) and Azadeh Ansari in their lab.\nNov 09, 2022\n— Atlanta, GA\nVibrating tiny robots could revolutionize research.\nIndividual robots can work collectively as swarms to create major advances in everything from construction to surveillance, but microrobots’ small scale is ideal for drug delivery, disease diagnosis, and even surgeries.\nDespite their potential, microrobots’ size often means they have limited sensing, communication, motility, and computation abilities, but new research from the Georgia Institute of Technology enhances their ability to collaborate efficiently. The work offers a new system to control swarms of 300 3-millimeter microbristle robots’ (microbots) ability to aggregate and disperse controllably without onboard sensing.\nThe breakthrough is unique to Georgia Tech’s expertise in electric and computer engineering and robotics and its push for interdisciplinary collaborations.\n“By collaborating with roboticists we were able to ‘close the gap’ between single robot design and swarm control,” said\nAzadeh Ansari , an assistant professor in the\nSchool of Electrical and Computer Engineering\n(ECE). “So I guess the different elements were there, and we just made the connection.”\nThe researchers presented the work, “ Controlling Collision-Induced Aggregations in a Swarm of Micro Bristle Robots ,” in\nIEEE Transactions on Robotics .\nThe Challenges of Microbots\nWhile larger robots can control movement through sensing the environment and wirelessly sending this data to each other, microbots do not have the capacity to carry the same sensors, communications, or power units. In this study, the researchers instead utilized inter-robot physical interactions to encourage robots to swarm.\n“Microbots are too small to interpret and make decisions, but by using the collision between them and how they respond to frequency and the amplitude of global vibration actuation, we could influence how individual robots move and the collective behaviors of hundreds and thousands of these tiny robots,” said Zhijian Hao, an ECE Ph.D. student.\nThese behaviors, or motility characteristics, determine how microbots move linearly and the randomness in their rotation. By using vibration, the researchers could control these motility characteristics and perform motility-induced phase separation (MIPS). The researchers borrowed the concept from thermodynamics, when an agitated material can change phases from solid to gas to liquid. The researchers manipulated the level of vibration to influence the microbots to form clusters or disperse to create good spatial coverage.\nTo better understand these phase separations, they developed computational models and a live tracking system for the 300-robot swarm using computer vision. These enabled the researchers to analyze microrobots’ behavior and motion data that give rise to the swarm’s characteristics.\n“This project is the first complete pipeline using this MIPS that can be generalized to different microbot swarms,” Hao said. “We hope people will find that using physical interactions is another new way to control the microbots, which initially was very difficult to do.”\nCollaborating for Innovation\nA Georgia Tech\nseed grant\nfrom the\nInstitute for Robotics and Intelligent Machines  (IRIM)  and the\nInstitute for Electronics and Nanotechnology\nenabled this high-risk research.\nThe success of the project can be attributed to the interdisciplinary nature of the research. While the ECE researchers had expertise in building microelectromechanical systems (MEMS) to fabricate technology such as computer chips or microbots, the robotics researchers brought modeling experience. Ansari first created\nmicrobristle bots\nin 2019 from 3D-printed polymers, which seeded the collaboration with IRIM Director and Professor\nSeth Hutchinson\nand Professor\nMagnus Egerstedt , now at University of California, Irvine, and their Ph.D. students Sid Mayya and Gennaro Notomista.\n“We knew more about how to build micro devices and actuate them, and they knew more about the algorithms, modelings, and the closed-loop and open-loop control,” Ansari said. “So, it was very good interdisciplinary work because each group benefited from the new perspectives that the others brought to this.”\nCITATION: Z. Hao, S. Mayya, G. Notomista, S. Hutchinson, M. Egerstedt and A. Ansari, \"Controlling Collision-Induced Aggregations in a Swarm of Micro Bristle Robots,\" in  IEEE Transactions on Robotics , 2022, doi: 10.1109/TRO.2022.3189846.\nAdditional Images\nContact\nTess Malone, Research Writer/Editor\nEmail\ntess.malone@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}