{"text": "Meet True Merrill, senior research scientist | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMeet True Merrill, senior research scientist\nTrue Merrill is proud to be part of the team leading Georgia Tech's Covid-19 surveillance testing program.\nFacebook\nTwitter\nEmail\nTrue Merrill is a senior research scientist on the team that developed and implemented the Georgia Tech Covid-19 surveillance testing program. (Photo by Allison Carter)\nNov 16, 2020\n— Atlanta, GA\nTrue Merrill is a team player. When interviewed about his efforts with\nGeorgia Tech’s Covid-19 surveillance testing program\nhe repeatedly said how proud he is to be part of the campuswide team working on it.\n“I’ve never had the opportunity in my career to work on a problem where I could help so many people in my own community and see those results in real time,” Merrill said. “Throughout my Ph.D. work and career at the Georgia Tech Research Institute (GTRI), we’re frequently thinking about either far out future technologies or rare or difficult problems that might occur in the distant future. Now one of those problems is real, and it’s here now. It is really gratifying to feel like we’re able to have an impact today and you see it immediately.”\nIn his ‘regular’ job as a senior research scientist at GTRI, Merrill’s group works primarily on defense problems related to Chemical, Biological, Radiological, and Nuclear (CBRN) defense.\n“We think about worst case scenarios of how to protect soldiers or civilians from chemical or biological attacks,” Merrill said. “We’re a bit of a unicorn because there aren’t many other teams in Georgia who have that kind of thinking experience. That’s part of the reason why when the pandemic occurred we were mobilized to start work on testing.\"\nMerrill is a senior scientist on the team that developed and implemented Georgia Tech's Covid-19 surveillance testing program. His research group has been tracking the coronavirus since January.\n“There were points in January and February where we could have told you how many cases were in each Chinese province. We were following it very closely, and so it wasn't a surprise when it was here in March,” he said.\nIn April the State of Georgia asked GTRI to come up with ways to use the University System of Georgia’s (USG) resources to expand coronavirus testing to support the Georgia Department of Public Health. Early in the pandemic the supply chain for testing supplies was stressed, with critical reagents sometimes backordered for months. To lower costs and reduce supply risk, the GTRI team developed a saliva-based PCR test which uses local and Georgia-based suppliers. GTRI clinically validated the saliva test at specimen point of collection sites operated by the Georgia Department of Public Health.\n“Our Covid-19 test is actually a story about how the state government, the University System of Georgia, and Georgia's biotech industry were mobilized in order to protect us,” Merrill said, “and how Georgia Tech is also setting an example for other institutions within the USG on how to build a surveillance testing program. Young adults appear to be the primary drivers of the pandemic today, so it’s really essential to control the spread on campuses in order to control it in Georgia. Young people are more mobile and they tend to be more asymptomatic, so they get more people sick without appearing to be sick themselves. To control the degree of spread, testing young people is really important.”\nSince August Georgia Tech has conducted almost\n130,000 cumulative surveillance tests .\nMerrill said the most rewarding parts of his job are being able to see its immediate impact and working to solve new problems.\n“I’m never bored. I have the advantage of working with some of the best colleagues within GTRI and also on campus. There’s really very little that we can’t go tackle, and that is really attractive because it gives you the flexibility to adapt to the really pressing problems,” he said.\n“One of the big advantages of working at GTRI is that I can completely change my technical domain and not leave my seat, and I do that all the time. In my current role I work as a chemist and as an optical engineer — and as a biologist, as I am right now in Covid-19 testing,” he said.\nMerrill earned a Ph.D. in physical chemistry from Georgia Tech in 2013.\n“A long time ago I was more interested in biology than chemistry. But gradually I fell in love with the mathematics behind physical chemistry and as I gained experience I was just really motivated and interested in systems that I could explain with math. So even in physical chemistry I migrated naturally towards physics.”\nAway From the Office\nTrue Merrill has been a runner for about 10 years. He ran his first marathon in 2015 and he would like to run another one when he has time to train properly. In the meantime, he runs occasionally through the Druid Hills, Emory University, and Decatur neighborhoods.\n“It’s awesome just to be able to see where I can go on my own feet and look at all of things you miss when you’re driving a car,” he said. He also likes to grow cacti and he has a succulent collection.\n“They are fascinating plants, so well adapted for the environment they live in, and they come in all kinds of varieties,” he said.\nOne more thing — True is a family name. Long ago in New Hampshire there was a True Family and a Merrill Family. Through the union of the two families they combined their name to True Merrill.\n“I have distant ancestors named Nathaniel True Merrill and James True Merrill,” said Merrill, who is named for his grandfather. “My name is James True Merrill, and I have always been called True.”\nAdditional Images\nRelated links\nCoronavirus Testinng\nMore Staff Stories\nFaces of Testing\nContact\nVictor Rogers\nInstitute Communications\nEmail\nvictor.rogers@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}