{"text": "Computer Simulations Shed Light on the Milky Way’s Missing Red Giants | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nComputer Simulations Shed Light on the Milky Way’s Missing Red Giants\nSimulations provide test of why the center of the Milky Way has no visible older stars.\nFacebook\nTwitter\nEmail\nA sequence of snap shots based on a simulation of a red giant entering and exiting a clump in a fragmenting accretion disk. In this case, it takes 4 days for the star to travel through the clump (each .1 unit of time is approximately 1 hour).\nJun 07, 2016\n— Atlanta, GA\nNew computer simulations from the Georgia Institute of Technology provide a conclusive test for a hypothesis of why the center of the Milky Way appears to be filled with young stars but has very few old ones. According to the theory, the remnants of older, red giant stars are still there — they just aren’t bright enough to be detected with telescopes. The\nGeorgia Tech simulations\ninvestigate the possibility that these red giants were dimmed after they were stripped of 10s of percent of their mass millions of years ago during repeated collisions with an accretion disk at the galactic center. The very existence of the young stars, seen in astronomical observations today, is an indication that such a gaseous accretion disk was present in the galactic center because the young stars are thought to have formed from it as recently as a few million years ago. The study is published in the June edition of\nThe Astrophysical Journal . It is the first to run computer simulations on the theory, which was introduced in 2014. Astrophysicists in Georgia Tech’s College of Sciences created models of red giants similar to those that are supposedly missing from the galactic center — stars that are more than a billion years old and 10s of times larger in size than the Sun. They put them through a computerized version of a wind tunnel to simulate collisions with the gaseous disk that once occupied much of the space within .5 parsecs of the galactic center. They varied orbital velocities and the disk’s density to find the conditions required to cause significant damage to the red giant stars. “Red giants could have lost a significant portion of their mass only if the disk was very massive and dense,” said Tamara Bogdanovic, the Georgia Tech assistant professor who co-led the study. “So dense, that gravity would have already fragmented the disk on its own, helping to form massive clumps that became the building blocks of a new generation of stars.” The simulations suggest that each of the red giant stars orbited its way into and through the disk as many as dozens of times, sometimes taking as long as days to weeks to complete a single pass-through. Mass was stripped away with each collision as the star blistered the fragmenting disk’s surface. According to former Georgia Tech undergraduate student Thomas Forrest Kieffer, the first author on the paper, it’s a process that would have taken place 4 to 8 million years ago, which is the same age as the young stars seen in the center of the Milky Way today. “The only way for this scenario to take place within that relatively short time frame,” Kieffer said, “was if, back then, the disk that fragmented had a much larger mass than all the young stars that eventually formed from it — at least 100 to 1,000 times more mass.” The impacts also likely lowered the kinetic energy of the red giant stars by at least 20 to 30 percent, shrinking their orbits and pulling them closer to the Milky Way’s black hole. At the same time, the collisions may have torqued the surface and spun up the red giants, which are otherwise known to rotate relatively slowly in isolation. “We don’t know very much about the conditions that led to the most recent episode of star formation in the galactic center or whether this region of the galaxy could have contained so much gas,” Bogdanovic said. “If it did, we expect that it would presently house under-luminous red giants with smaller orbits, spinning more rapidly than expected. If such population of red giants is observed, among a small number that are still above the detection threshold, it would provide direct support for the star-disk collision hypothesis and allow us to learn more about the origins of the Milky Way.” The paper, “ Can Star-Disk Collisions Explain the Missing Red Giants Problem in the Galactic Center ,” was published on June 1. This research was funded, in part, by the Alfred P. Sloan Foundation (grant # BR2013-016) and the National Science Foundation (AST-1333360).\nAny opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the National Science Foundation.\nAdditional Images\nRelated links\nSee the Simulation\nRead the Study\nCenter for Relativistic Astrophysics\nContact\nJason Maderer National Media Relations maderer@gatech.edu 404-660-2926\nEmail\nmaderer@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}