{"text": "Marilyn Brown Tapped as First Woman to Receive Class of 1934 Distinguished Professor Award | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMarilyn Brown Tapped as First Woman to Receive Class of 1934 Distinguished Professor Award\nMarilyn Brown is the 2022 recipient of the highest honor given to a Georgia Tech professor, the Class of 1934 Distinguished Professor Award.\nFacebook\nTwitter\nEmail\nMarilyn Brown, Regents' and Brook Byers Professor of Sustainable Systems in the School of Public Policy, and Class of 1934 Distinguished Professor Award recipient for 2022.\nApr 29, 2022\n— Atlanta, GA\nMarilyn Brown is a world-leading expert on renewable energy and energy efficiency, a transformative intellectual thinker, and one of the founders of the field of energy and climate policy.\nHer research has shaped energy policy in the U.S. and globally. Over the past two years, she has been tapped for several prestigious honors, including being elected to both the U.S. National Academy of Engineering and the National Academy of Sciences, and receiving the\n2021 World Citizen Prize in Environmental Performance . Now, she is the first woman to receive the Georgia Tech Class of 1934 Distinguished Professor Award in the 38 years of its existence. It is the highest honor given to a Georgia Tech professor. The award is presented to a professor who has made significant, long-term contributions to teaching, research, and public service.\nBrown is the Regents and Brook Byers Professor of Sustainable Systems in the School of Public Policy. She joined Georgia Tech after 22 years at Oak Ridge National Laboratory, where she directed several national climate change mitigation studies and became a leader in the analysis and interpretation of energy futures.\nAt Oak Ridge National Laboratory, she was the joint highest-ranking female manager. Brown was attracted to Georgia Tech after working with a high-level group of scientists from Oak Ridge, the Imperial College of London, and Georgia Tech on a project involving next-generation energy, including advanced broadband. “I really liked the people from Tech who I worked with on the project,” said Brown. “They had a can-do attitude. At other universities, they might say, ‘That can’t be done.’ The people from Georgia Tech said, ‘We’ll find a way.’” In 2006, she was encouraged to apply for the position of — and was chosen as — a full professor in the School of Public Policy in Georgia Tech’s Ivan Allen College of Liberal Arts.\nThroughout her career, Brown has been known for her transdisciplinary, action-based research and linking behavior to policy. “I started my career in the physical sciences at Rutgers. “From the beginning, I brought sciences into my work and have been quantitative. It has given me the ability to span sciences and related fields,” said Brown. “I tell my students they have to be quantitative in math and the physical sciences to be effective in energy.”\nThe focus of her research has been on the clean energy transition — bridging engineering, social and behavioral sciences, and policy studies to advance the design, adoption, and diffusion of clean energy technologies and policies. She is particularly interested in energy disparities and work to strengthen energy infrastructure, especially in areas of financial need. “It is all about the diffusion of innovation to the benefit of all,” she said.\nDrawdown Georgia\nBrown also leads the research program Drawdown Georgia, which she helped to create with the inspiration and funding of the Ray C. Anderson Foundation. Georgia Tech alumnus Ray C. Anderson was founder and chair of Interface Inc., and a pioneer in sustainability.\nDrawdown Georgia was created and is being conducted in partnership with Emory University, the University of Georgia, and Georgia State University, as well as the Southface Institute, the Partnership for Southern Equity, and Greenlink Analytics.\nDrawdown Georgia has identified a roadmap to significantly cut Georgia’s greenhouse gas emissions and achieve carbon neutrality. The Drawdown Georgia study, localized for Georgia’s urban and rural areas, was published in the\nProceedings of the National Academy of Sciences\nin 2021. The plan identified technology and practices that could resonate with individuals, towns, and corporations throughout the state, including ways to bring more clean energy resources and technologies to rural Georgia and help people use limited resources more efficiently.\nThrough collaboration with the Scheller College of Business, 25 Georgia CEOs from throughout the state agreed to join Drawdown Georgia. The project includes a dashboard of emissions by Georgia’s 159 counties, tracked monthly. The next step will be to track implementation of the 20 solutions in the plan, measuring investments by counties, and the use of electric vehicles, rooftop solar systems, alternative transportation, recycling, composting, afforestation, and silvopasture — the integration of trees and livestock operations on the same land.\nSustainability as a Way of Life\nWhen asked what she wishes people knew about sustainability, Brown said, “Sustainable technologies and behaviors are not costly. They can be good for your pocketbook. Consider the home refrigerator. Twenty-five years ago, it consumed 2,000 kilowatt hours a year. Today it requires less than 600 kWh, and they don’t cost any more than they used to. People just have to be smart about what they choose and pay attention to cradle-to-grave resource issues.”\nBrown also lives her values. At her home, she grows vegetables and composts, has rooftop solar, a Tesla Powerwall battery, and uses heat pumps for water heating, air conditioning, and heat. Her family has an energy focus. Her husband, Frank Southworth, is an adjunct professor in the School of Civil and Environmental Engineering at Tech, and an accomplished transportation planner. Their daughter, Katie Southworth, is an attorney with Southface Energy Institute.\nWorking with Students\nBrown created and co-leads the Climate and Energy Policy Lab in the School of Public Policy at Tech. She developed the Master of Sustainable Energy and Environmental Management degree. She has advised 19 Ph.D. students, many of whom have gone on to leading roles in government agencies, academia, and industry.\nShe is known as an excellent mentor, communicator, and educator, inside and outside of the classroom. She challenges students to expand their knowledge and excel in their project work while developing their confidence and leadership skills. She has been described as generous with her time in providing students with guidance on professional development. As she was one of very few women in her field when she began her career, she has been purposeful about mentoring women.\nBackground\nBrown earned her Bachelor of Arts degree in political science from Rutgers University, and a Master of Regional Planning degree from the University of Massachusetts. She holds a Ph.D. from The Ohio State University in geography, with a minor in quantitative methods. Before joining Oak Ridge National Laboratory, she was an associate professor of geography at the University of Illinois, the first woman to earn tenure in geography there. Previously, she was a lecturer in the Department of Geography and Geology at Ohio Wesleyan University.\nShe has authored six books and more than 250 publications, and contributed to the United Nations 2007 Intergovernmental Panel on Climate Change (IPCC), a joint winner of the Nobel Peace Prize that year. Her work has had significant influence and visibility in the policy arena as evidenced by her impact on policies and programs, such as the Kyoto Protocol and the U.S. Department of Energy’s Weatherization Assistance Program, and briefings and testimonies before state legislative and regulatory bodies, committees of both the U.S. House of Representatives and Senate, and numerous international organizations.\nBrown served two terms (2010-2017) as a presidential appointee and U.S. Senate-confirmed regulator on the board of directors of the Tennessee Valley Authority (TVA), the nation’s largest public power provider. At TVA, she contributed to reducing TVA’s CO 2\nemissions by 60% over a 15-year period. She also chaired for eight years the Nuclear Oversight Committee, which was responsible for bringing the most recent nuclear unit into commercial operation in the U.S., in 2016 at Watts Bar in Tennessee.\nReflecting her commitment to the role of demand-side management, Brown co-founded the Southeast Energy Efficiency Alliance (SEEA), chaired its board of directors for several years, hired its first executive director, and provided SEEA’s first office space at Georgia Tech.\nQuotes from Colleagues and Former Students\n“In her work, she conceptualizes the coevolution of technology and society, with an emphasis on how to change unsustainable systems for the provision of energy, food, mobility, water and other areas. Rather than adhering to a narrow interpretation and application of geography and economics, her disciplinary background, she uses sociotechnical insights to inform her research and sheds light on the complex processes of societal transformation needed for addressing the climate and biodiversity crises as well as steep inequalities. In short, she draws on science to make extremely compelling, insightful, and even beautiful contributions to addressing contemporary challenges.”\nBenjamin Sovacool\nUniversity Distinguished Professor of Business and Social Sciences – Aarhus University, Denmark\nProfessor of Energy Policy, Science Policy Research Unit – University of Sussex Business School, United Kingdom Professor of Earth and Environment – Boston University, United States\n“Dr. Brown’s contributions to the school and Institute extend beyond her own record to also include those of her students, who are excelling and driving important work both in and out of academia. Her students have founded startups in the explosive new climate tech field, lead energy and climate policy for major corporations like Google, work at multiple energy commissions at the state and federal level in regulatory staff roles, lead new areas of research in economics and policy in research centers across the world, and recently, one of her students was appointed as a deputy assistant secretary at the U.S. Department of Energy. I don’t believe that it is a coincidence that this group of exceptional people all happened to emerge from the same lab at Georgia Tech. Dr. Brown played a formative role in helping develop the attitudes and thought processes that have enabled her students’ success and grown the influence of Georgia Tech around the globe.”\nMatt Cox CEO and Founder, Greenlink Analytics\n“Marilyn challenges students to reflect on what can be done to show impact and relevance. She challenges students and collaborators to identify gaps in research that need to be addressed to advance science and discovery. Marilyn has had an exemplary career in teaching, research, and service, and her impact is significantly amplified by the hundreds of students and collaborators she has developed into the current and future generation of research and policy leaders and mentors.”\nMelissa V. Lapsa Building Technologies Program Manager Energy Science and Technology Directorate Oak Ridge National Laboratory\n“Marilyn led by example as a Clean Energy and Education Empowerment (C3E) ambassador who sought to inspire the next generation of clean energy practitioners and researchers. I have always been impressed by the way Marilyn brought her intellectual acumen, strong moral compass, and sound judgement to bear on the deliberations and decision making with the wide range of different stakeholders involved in C3E. Moreover, Marilyn always made it a point to recognize the work of women researchers in academia and national laboratories in terms of the impact and importance of their contributions.”\nEllen Morris Director, University Partnerships NREL (a national laboratory of the U.S. Department of Energy)\n“The regularly scheduled Friday meetings of students and faculty at Dr. Brown’s direction were among the most innovative and rigorous discussions of clean energy policy and economic analysis anywhere.”\n“Through both her body of work and numerous former students who work at or with the [Georgia Public Service Commission], she has a major indirect influence on the direction of utility regulation in this state and around the country.”\nBenjamin H. Deitchman Utility Analyst, Georgia Public Service Commission Georgia Tech, Ph.D. in Public Policy, 2014\nAdditional Images\nContact\nPatti Futrell\nFaculty Communications Program Manager\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}