{"text": "NIH launches I-Corps pilot program | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNIH launches I-Corps pilot program\nThe National Institutes of Health (NIH) has recently launched I-Corps @NIH, a pilot course designed to cut the time it takes for life-science innovations to move from laboratory to commercialization.\nFacebook\nTwitter\nEmail\nLife-science entrepreneurs in a pilot I-Corps course at the National Institutes of Health in Bethesda, Maryland, listen on the program's opening day to learn about its structure and how it's designed to get innovations from laboratory to commercialization quicker. [Photo credit: Courtesy of I-Corps@NIH]\nOct 24, 2014\n— Atlanta, GA\nThe National Institutes of Health (NIH) has recently launched I-Corps @NIH, a pilot course designed to cut the time it takes for life-science innovations to move from laboratory to commercialization. The pilot has received bipartisan support from Congress and the White House, and is driven by the National Cancer Institute’s Small Business Innovation Research Development Center, with oversight by Director Michael Weingarten and Andrew Kurtz, the center’s program director and team leader. I-Corps @NIH is a unit of the National Science Foundation Innovation Corps (I-Corps), a boot camp of sorts that trains scientists in the same lean startup methods that other industries use to get products from the research phase to market. I-Corps has so far trained 400 teams of scientists from the NSF, DOE, and ARPA-E. Keith McGreggor, director of VentureLab at Georgia Tech’s Enterprise Innovation Institute (EI2), was picked to be one of the professors in I-Corps @NIH. McGreggor, a successful entrepreneur who has co-founded or founded six software companies, was a perfect choice to be one of the program teachers, said startup expert Steve Blank, architect of the I-Corps @NIH curriculum and one of the program’s lead instructors. The I-Corps curriculum is modeled after the Lean LaunchPad class Blank developed at Stanford University. “Keith is probably the best model of someone who gets technology and shares the passion of how we do commercialization,” Blank said. Indeed, VentureLab’s sole mission is to help Georgia Tech researchers, faculty, staff and students build and create startup companies based on their research. And Tech was one of the original universities selected by the National Science Foundation in 2012 as a founding network node for the I-Corps program, which trains scientific researchers on how product opportunities can spin out of their academic findings. With this new pilot course at NIH, which launched Oct. 6 and runs through December in Bethesda, Maryland, the goal is to do the same in the life sciences sector as in other science-related research disciplines. A total of 21 teams are participating in this pilot, which specifically targets life science startups in therapeutics, diagnostics and medical devices. “There is a big difference between making the science ready and whether or not you have a good business,” Blank said. This makes Tech a critical component, because it has an established record of programs that successfully spin out companies from research. “This is the language of how to build a company,” he said. “Georgia Tech’s contribution in training and commercialization of the life sciences is enormous.” The key goals of the course are to have the scientists learn how to:\n• Assess intellectual property rights needs and regulatory risk before the design and build phase. • Define clinical utility before spending huge sums of capital.\n• Understand who their primary and tertiary customers are and the sales and marketing requirements needed for eventual commercialization.\n• Identify different financing vehicles before they are needed. One change under the NIH adoption of I-Corps, McGreggor said, is that teams can apply for direct NSF-funding if they complete I-Corps training through one of the NSF nodes – Tech’s included — that provide training in Georgia and across the Southeast. “If a team goes through our regional training — even if that team has never had any NSF backing — because they’ve gone through our regional training, they can use our node-NSF to let them apply for the NSF I-Corps program itself,” McGreggor said. “It’s actually a big deal because it lets students from Auburn, for example, go through a regional training, or a team from a school that doesn’t have a lot of NSF funding go through a regional training and then be able to apply for funding.”\nAdditional Images\nRelated links\nGT VentureLab\nI-Corps@NIH\nContact\nPeralte Paul -\nperalte.paul@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}