{"text": "Polluted Dust Can Impact Ocean Life Thousands of Miles Away, Study Says | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nPolluted Dust Can Impact Ocean Life Thousands of Miles Away, Study Says\nA new modeling study conducted by researchers in Georgia Tech shows that for decades, air pollution drifting from East Asia out over the world’s largest ocean has contributed to oxygen levels falling in tropical waters thousands of miles away.\nFacebook\nTwitter\nEmail\nTaka Ito\nMay 16, 2016\n— Atlanta, GA\nAs climatologists closely monitor the impact of human activity on the world’s oceans, researchers at the Georgia Institute of Technology have found yet another worrying trend impacting the health of the Pacific Ocean.\nA new modeling study conducted by researchers in Georgia Tech’s School of Earth and Atmospheric Sciences shows that for decades, air pollution drifting from East Asia out over the world’s largest ocean has kicked off a chain reaction that contributed to oxygen levels falling in tropical waters thousands of miles away.\n“There’s a growing awareness that oxygen levels in the ocean may be changing over time,” said Taka Ito, an associate professor at Georgia Tech. “One reason for that is the warming environment – warm water holds less gas. But in the tropical Pacific, the oxygen level has been falling at a much faster rate than the temperature change can explain.”\nThe study, which was published May 16 in Nature Geoscience, was sponsored by the National Science Foundation, a Georgia Power Faculty Scholar Chair and a Cullen-Peck Faculty Fellowship.\nIn the report, the researchers describe how air pollution from industrial activities had raised levels of iron and nitrogen – key nutrients for marine life – in the ocean off the coast of East Asia. Ocean currents then carried the nutrients to tropical regions, where they were consumed by photosynthesizing phytoplankton.\nBut while the tropical phytoplankton may have released more oxygen into the atmosphere, their consumption of the excess nutrients had a negative effect on the dissolved oxygen levels deeper in the ocean.\n“If you have more active photosynthesis at the surface, it produces more organic matter, and some of that sinks down,” Ito said. “And as it sinks down, there’s bacteria that consume that organic matter. Like us breathing in oxygen and exhaling CO2, the bacteria consume oxygen in the subsurface ocean, and there is a tendency to deplete more oxygen.”\nThat process plays out all across the Pacific, but the effects are most pronounced in tropical areas, where dissolved oxygen is already low.\nAthanasios Nenes, a professor in the School of Earth and Atmospheric Sciences and the School of Chemical and Biomolecular Engineering at Georgia Tech who worked with Ito on the study, said the research is the first to describe just how far reaching the impact of human industrial activity can be.\n“The scientific community always thought that the impact of air pollution is felt in the vicinity of where it deposits ,” said Nenes, who also serves as Georgia Power Faculty Scholar. “This study shows that the iron can circulate across the ocean and affect ecosystems thousands of kilometers away.”\nWhile evidence had been mounting that global climate change may have an impact on future oxygen levels, Ito and Nenes were spurred to search for an explanation for why oxygen levels in the tropics had been declining since the 1970s.\nTo understand how the process worked, the researchers developed a model that combines atmospheric chemistry, biogeochemical cycles, and ocean circulation. Their model maps out how polluted, iron-rich dust that settles over the Northern Pacific gets carried by ocean currents east toward North America, down the coast and then back west along the equator.\nIn their model, the researchers accounted for other factors that can also impact oxygen levels, such as water temperature and ocean current variability.\nWhether due to warming sea waters or an increase in iron pollution, the implications of growing oxygen-minimum zones are far reaching for marine life.\n“Many living organisms depend on oxygen that is dissolved in seawater,” Ito said. “So if it gets low enough, it can cause problems, and it might change habitats for marine organisms.”\nOccasionally, waters from low oxygen areas swell to the coastal waters, killing or displacing populations of fish, crabs and many other organisms. Those “hypoxic events” may become more frequent as the oxygen-minimum zones grow, Ito said.\nThe increasing phytoplankton activity is a double-edged sword, Ito said.\n“Phytoplankton is an essential part of the living ocean,” he said. “It serves as the base of food chain and absorbs atmospheric carbon dioxide. But if the pollution continues to supply excess nutrients, the process of the decomposition depletes oxygen from the deeper waters, and this deep oxygen is not easily replaced.”\nThe study also expands on the understanding of dust as a transporter of pollution, Nenes said.\n“Dust has always attracted of a lot of interest because of its impact on the health of people,” Nenes said. “This is really the first study showing that dust can have a huge impact on the health of the oceans in ways that we’ve never understood before. It just raises the need to understand what we’re doing to marine ecosystems that feed populations worldwide.”\nThis material is based upon work supported by the National Science Foundation under Grant No. OCE-1242313. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the National Science Foundation.\nCITATION: Takamitsu Ito, Athanasios Nenes, Matthew Johnson, Nicholas Meskhidze, and Curtis Deutsch,  “Acceleration of oxygen decline in the tropical Pacific over the past decades by aerosol pollutants,” (Nature Geoscience, May 2016).\nMEDIA CONTACT: Josh Brown,\njosh.brown@comm.gatech.edu , 404-385-0500, or John Toon,\njtoon@gatech.edu , 404-894-6986\nAdditional Images\nContact\nJohn Toon\nResearch News\nEmail\njohn.toon@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}