{"text": "Community Garden Unveils Expansion | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nCommunity Garden Unveils Expansion\nFirst opened in 2012, the Community Garden has undergone a complete transformation. The latest expansion has doubled its square footage, converted the garden to full ADA accessibility, and increased the number of beds to expand access to sustainable produ\nFacebook\nTwitter\nEmail\nApr 20, 2023\nAs Georgia Tech continues to celebrate Earth Month, Friday's ribbon-cutting ceremony for the newly expanded Community Garden represents another step in the Institute's commitment to a sustainable future.\nFirst opened in 2012 with six small planting beds, the garden has received a complete transformation over the past decade. With the latest project, which began in July 2022, essentially doubling its square footage, the garden now touts 21 fruit trees and nine large beds that are free and open to students. Two additional medium and nine small beds are available for lease for the Tech community. A new shed for gardening tools has been constructed alongside a brand-new demo kitchen to feature the garden's produce in healthy recipes. With the inclusion of slate-chip pathways and high-density mulch, the garden is now fully ADA accessible — a primary goal of the expansion effort.\nElias Winterscheidt was drawn to the garden while touring the Tech campus in 2019. With prior planting experience, he immediately got involved with\nStudents Organizing for Sustainability (SOS) , taking over as the Community Garden director in April 2021. Over the past three semesters before construction began, the garden donated 50 pounds of produce to\nKlemis Kitchen\n— Georgia Tech's on-campus food bank — in addition to the produce harvested by 500 volunteers during that time.\nWinterscheidt anticipates the growth of the garden community continuing, with hopes of doubling both donations to Klemis Kitchen and the number of volunteers.\nSOS got a head start on its goal at the outset of Earth Month, when Winterscheidt and a group of volunteers planted the first seeds in the expanded garden during a pair of community workdays. Sweet potatoes, tomatoes, strawberries, and various seeds are already in the ground, but plenty more fruits, vegetables, and herbs will be added soon.\nIn addition to a passion for gardening, Winterscheidt arrived at Tech at a time when many students were seeking ways to get outside during the pandemic. A lasting effect of the interruption has been an increase in the number of virtual events, but the garden provides the perfect opportunity to interact with nature and with other people.\n\"We're trying to get people to come outside. Our goal is to get Georgia Tech students away from their computers, away from their homework, and to de-stress and get their hands in the soil,\" he said, adding that the workdays give students a chance to interact with others from different majors and backgrounds. \"Come for a few hours, chat with people, and after two hours, you feel refreshed. It's a kind of group therapy.\"\nCommunity workdays in the garden are typically held on Saturday mornings, depending on the weather.\nBeginning with summer programming, SOS will partner with the\nWellness Empowerment Center\nto highlight the mental and physical health benefits of gardening. They will also be emphasizing sustainability. The Community Garden is entirely permaculture friendly, meaning it's a pesticide-free environment, and seeds are planted with purpose.\n\"We're mimicking nature in how we plant things,\" Winterscheidt explained. “Rather than spraying with pesticide, I can plant a basil plant that will deter hornworms from our tomatoes. Rather than spraying with herbicides, we can pluck all the weeds off individually. It takes a lot longer, but it's much better for our soil. Rather than growing for maximum output, we're growing in a way that benefits our soil the most.\"\nWhile largely student-run, the garden does require constant upkeep, so in years past, the summer months could be challenging. However, with the expansion, Tamsin Leavy has been brought on as staff member to support the garden year-round.\n\"Like any garden or farm space, you don't want to lose all your hard work to the elements or other pests that can quickly annihilate a crop. We have put a lot of effort into this space and are looking forward to watching it grow. No pun intended,\" Leavy said. \"It would be devastating to lose it to the harsh Georgia summer sun, so we will all be working together to keep our garden growing.\"\nVolunteer opportunities remain plentiful over the summer, and in the absence of a large contingent of students, Malte Weiland, senior sustainability project manager for Campus Services, welcomes Tech faculty and staff to lend a hand. He encouraged all Tech employees to reach out to assist the team in maintaining the space and even urges entire departments to inquire about outings that can serve as wellness and team-building exercises.\nFor those looking to get involved with the garden or learn more about its expansion, Friday's ribbon-cutting ceremony will begin at 2 p.m.\n“We all hope that the garden will continue to be a community gathering space where not just horticultural and agricultural education can happen, but anything adjacent to it — discussion on composting, urban gardens, or food justice issues. And day-to-day, for Tech students, I hope it can be a space where they are comfortable, where they can come to smell the flowers, put their hands in the dirt — even if it's just for a few minutes between classes to de-stress and reconnect to the earth,\" Leavy said.\nThe Community Market is another resource that brings sustainably sourced food to the Tech community every Wednesday from 10 a.m. to 2 p.m. along Tech Walkway. The\nOffice of Sustainability\nwill wrap up the spring semester market at the end of April, but selective summer dates will be announced soon. When the market returns in the fall, Weiland said that vendors and patrons can expect several updates, including a market map, and students will be able to make purchases using dining dollars on their BuzzCards.\nAdditional Images\nContact\nSteven Gagliano\n- Communications Officer\nInstitute Communications\nEmail\nsteven.gagliano@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}