{"text": "10 Years after Katrina: Are American Cities Ready? | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\n10 Years after Katrina: Are American Cities Ready?\nGeorgia Tech partners with the National Academy of Engineering to host a roundtable discussion on disaster readiness. Two experts close to Georgia Tech look at the state of preparedness for disaster in America, in light of the decade anniversary.\nFacebook\nTwitter\nEmail\nAug 04, 2015\n— Atlanta, GA\nIt was the costliest natural disaster in our nation’s history. Hurricane Katrina made landfall on August 29, 2005, impacting much of the Gulf Coast region and the Southeast in a multitude of ways. New Orleans was the epicenter of the disaster, but the city did not bear the brunt of the storm’s most severe blow. The failure of levees and floodwalls left much of the city under water. Ten years later, countless studies are still being conducted to try and determine where fault may lie and what actions led to the disaster. How our nation’s cities prepare to handle disasters is also under scrutiny, not only in New Orleans but also in cities from coast to coast. “I don’t think people were ready to learn the lessons of Katrina because they thought of New Orleans as this place that was different,” explains Georgia Tech President Emeritus Wayne Clough. He says some people may have thought that New Orleans was a special case because the city was built below sea level and the general consensus was that the city would have problems during a hurricane.  Clough led an independent panel investigation of the Department of Defense and response to Hurricane Katrina. He was on the ground in New Orleans soon after the storm’s landfall. Looking at the nation’s readiness for the next storm, Clough says a greater understanding of climate change coupled with other storms is transforming how cities are preparing. “Hurricane Sandy was, in a way, a wake-up call that this could happen anywhere,” Clough says.  New York and many other East coast cities are vulnerable, Clough says, particularly as sea levels continue to rise. “Savannah is a little bit inland, so it has a little protection. Miami is right on the coast, so it is much more vulnerable. Norfolk is right on the coast. They are right on the coast and seeing the effects of sea level rise and more frequent flooding,” says Clough. Disaster readiness is not just an East Coast issue. Seattle, San Francisco, Los Angeles and Portland, Oregon, all are facing the same issues, says Clough. Reggie DesRoches, the Karen and John Huff School Chair of Georgia Tech’s School of Civil and Environmental Engineering, agrees. As an expert on the ways to reduce the impact of natural disaster, DesRoches examined bridges and structures in New Orleans after Hurricane Katrina. DesRoches is also an expert in earthquake research and preparedness. “What concerns me is places that we know have a potential for major disaster, but haven’t had an event in recent history,” DesRoches explains. A city of primary concern for DesRoches: Charleston, South Carolina. “It had a large earthquake in 1886 but hasn’t seen one since then, but we know it has the potential for large earthquakes and hurricane activity,” he says. DesRoches also believes the New Madrid region near the borders of Missouri, Illinois, Kentucky, Tennessee and Arkansas may be at risk because there is a potential for major earthquakes, but they are very rare. “I think the issue is whether or not people have recently felt the impact of disaster and whether that makes them think very differently about what they need to do moving forward,” DesRoches says. “We have to change the mindset in this country, one that thinks about resilience.” Clough says engineers are in a unique position to shape how our nation moves forward in preparation for the next disaster. “We can start thinking collectively about things. Put together what you learned from New Orleans, what you learned from Sandy and start to apply these to different areas.” On Wednesday, Aug. 5, Clough and DesRoches will join Lt. Gen. Thomas Bostick from the Army Corps of Engineers and experts from Johns Hopkins University and the University of Maryland in Washington, D.C., to share their ideas about the state of disaster preparedness in our nation in light of the 10-year anniversary of Katrina.\nContact\nSteven Norris Social Media Manager Media Team Institute Communications\nEmail\nsnorris@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}