{"text": "Georgia Tech Strives for Administrative Excellence | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Strives for Administrative Excellence\nA working group of subject matter experts from across the Institute has been collaborating to lay the foundation for Administrative Excellence.\nFacebook\nTwitter\nEmail\nMar 02, 2021\n— Atlanta, GA\nGeorgia Tech’s administrative processes and systems have seen a lot of changes over the past three years. Building on feedback from faculty, students, and staff on our current administrative processes and the need for a more efficient administrative experience for campus users, a working group of subject matter experts from across the Institute has been collaborating to lay the foundation for\nAdministrative Excellence (AdminX) .\nAdminX is a multi-year initiative focused on creating positive experiences for our faculty, staff, and student employees in completing routine administrative activities through:\nAdministrative process improvements , which maximize the value of the new financial, human resources, and service support systems and mitigate the administrative burden involved with everyday activities.\nEnhanced delivery of common, routine, and high-volume administrative services through the establishment of a\ncustomer-centric administrative services center for Georgia Tech.\nContinuous assessment and improvement  that is focused on evaluating the efficacy of our efforts and improving through community engagement.\n“While we will always strive for process improvement, this initiative is actually more about our people and helping them thrive at Georgia Tech,” said Kelly Fox, executive vice president for Administration and Finance. “Many of our processes are complex and employees feel burdened by the administrative work involved. If we can simplify the work and reduce the number of hats they wear, we can help them focus on and perform their core responsibilities.”\nIt is important to note that there are already several initiatives underway to improve administrative processes, especially focused on increasing effective use of our new enterprise resource planning systems – Workday and OneUSG Connect. This includes addressing improvement opportunities, such as student hiring, identified by the academic and research community. These efforts are helping address current process issues while strengthening parts of processes that may integrate into the administrative services center.\nThe Administrative Excellence initiative will help the Institute realize the goals of its strategic plan through  Leading by Example\n(enacting more efficient and effective administrative processes),\nCultivating Well-Being\n(reducing the stress, anxiety, and frustration of our administrative staff), and\nChampioning Innovation\n(discovering new leading-edge ways to operate and implementing innovative practices across the Institute).\nThis initiative involves anyone who performs or engages with administrative processes, and over the next year, students, faculty, and staff will have ample opportunities to become part of the solution through surveys, info sessions, process-improvement working groups, and more.\nThe AdminX team is excited to embark on this journey with the campus community and looks forward to building and implementing solutions that will help employees be less transactional and more transformational with their time and talents. More information will be coming soon and the team plans to begin engaging with targeted groups over the next few weeks. In the meantime, questions and comments may be submitted to\nadminx@gatech.edu .\nAdditional Images\nContact\nAdministrative Excellence adminX@gatech.edu\nAdditional information\nIn November 2020 Georgia Tech Human Resources (GTHR) launched an initiative to review and improve the student hiring process across the Institute. This project is just one element of an 18- to 24-month plan to build an office within GTHR to support the full student employment experience.\nThis project will measurably improve the student hiring process across Georgia Tech by:\nDecreasing the time it takes to hire a student.\nIncreasing transparency around each step of the hiring process.\nDeveloping detailed, end-to-end, useful operating procedures that live in one publicized, accessible location.\nLearn more at\nhr.gatech.edu/student-hiring-improvement-project .\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}