{"text": "Albany plant manager finds passion in manufacturing | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nAlbany plant manager finds passion in manufacturing\nMeet Werhner Washington, plant manager for Procter & Gamble's Albany, Ga. facility. 30 years after first walking into the Albany plant and 19 years after deciding to pursue other jobs within P&G, he returned to the plant that launched his career.\nFacebook\nTwitter\nEmail\nWerhner Washington, plant manager of Procter &amp; Gamble's Albany, Ga. facility, says manufacturing is a passion for him and making a career in the industry is something he was born to do.\nMay 20, 2015\n— Atlanta, GA\nBeing reared in a family of five siblings can provide ample opportunities to learn about teamwork, collaboration, and taking responsibility seriously. These skills would prove to come in handy for Werhner Washington, the new plant manager of the Proctor & Gamble (P&G) paper manufacturing facility in Albany, Ga. The plant produces Bounty paper towels and Charmin toilet paper. “I believe in strong collaboration and cultivating a culture of ownership,” said Washington, who got his start in manufacturing as a process engineer at that very facility in 1985. Now, 30 years later and having worked at a number of different P&G plants in the country, as well as the company’s Cincinnati, Ohio, headquarters, Washington is back in Albany. “When I first arrived at the Albany plant, the plant manager job looked so large,” he said. “When I left 11 years later, I dreamed I would one day have that job.” Now he does, running one of P&G’s largest plants — both in total number of employees and physical space. Washington is the Georgia Manufacturing Extension Partnership’s (GaMEP) May Face of Manufacturing. Each month, GaMEP highlights an individual in the state’s manufacturing sector to emphasize just how important a role the industry plays in Georgia’s economy. As a sector, manufacturing employs 365,000. Beyond the numbers, however, the Faces of Manufacturing initiative illustrates how companies economically sustain the communities they call home. It’s certainly something Washington sees in running the manufacturing plant, the largest in Dougherty County. “It’s humbling to be part of the largest manufacturer in the county. Our team is aware that for every one P&G job at this plant, three to four other jobs have been created within the state of Georgia,” Washington said. “That’s a tremendous responsibility to have, and I take it on my shoulders as the leader to keep this plant strong for the team and for the community.” These companies are integral to their communities’ economic strength, but they have personal impact, too. That fits into Washington’s philosophy of giving back to Albany personally and professionally. He sits on the board of Albany Technical College and the Albany Area Chamber of Commerce and is deeply involved in civic efforts to strengthen the regional economy. All of those efforts, he said, circle back to his original passion, manufacturing, which he believes he was born to do. “It’s this passion and day-to-day appreciation for the opportunities that I’ve had that has kept me happy all of these years and provided me the chance to come back home,” Washington said. “And for that — I will forever be grateful.” By Péralte C. Paul About the Faces of Manufacturing  Each month, GaMEP will highlight a different person as the Face of Manufacturing. Those chosen as the Face of Manufacturing will be selected by a 12-member committee composed of representatives from Georgia Tech, economic development groups, manufacturing companies, and related associations.\nAdditional Images\nRelated links\nWerhner Washington\nGeorgia Manufacturing Extension Partnership\nContact\nFor media inquiries contact: Laura Diamond Georgia Tech Media Relations  laura.diamond@gatech.edu For more information about GaMEP contact: Katie Takacs GaMEP Marketing Manager katie.takacs@innovate.gatech.edu\nEmail\nperalte.paul@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}