{"text": "Modify Hurricane Relief Strategies, National Academies Report Recommends | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nModify Hurricane Relief Strategies, National Academies Report Recommends\nHurricane devastation calls for heavy government relief, but a counterintuitive shift toward restoring private sector supply lines would help more quickly.\nFacebook\nTwitter\nEmail\nHurricane Irma struck in 2017 in the Caribbean and was blamed for more than 130 deaths.\nCredit: NASA/NOAA GOES Project\nFeb 03, 2020\n— Atlanta, GA\nAlleviating suffering more effectively in the wake of hurricanes may require a shift in relief strategies, says a new committee report by the National Academies of Science, Engineering, and Medicine.\nIn the immediate aftermath, relief agencies rush in survival supplies like water, food, medicine, and blankets. But instead of prioritizing and maintaining the relief supply chains, a transition to restoring a place’s normal supply infrastructure could help more people more quickly. That’s the first recommendation from over 125 pages of case studies and analyses, issued by an eight-member National Academies committee that included Pinar Keskinocak, a professor at the Georgia Institute of Technology and the director of its Center for Health and Humanitarian Systems.\nHurricanes can kill many victims by drowning, and in their wake, mangled homes and roads, contaminated water, and shortages of everything compound suffering. Restoring supply lines, primarily of the private sector, would accelerate recovery, according to the report, but relief efforts can unintentionally conflict with that.\n“Relief supply chains inevitably compete with regular supply chains, given limited resources, such as transportation. If the focus is primarily on pushing relief supply rather than restoring infrastructure and supply chains to normalcy, we may unwittingly delay recovery and prolong the aftermath,” said Keskinocak, who is\nWilliam W. George Chair and Professor in Georgia Tech’s School of Industrial and Systems Engineering .\nResearchers on the ground\nIn 2017, in the wakes of hurricanes Harvey, Irma, and Maria, the last of which killed over 3,000 people, FEMA assigned the National Academies to make recommendations on improving relief response. Keskinocak and her colleagues traveled to the storm-damaged sites to collect information for their report.\n“We spoke to stakeholders in affected areas – local governments, businesses, health systems, and more. We learned about the impact of storms on their community, what their participation was in the response process, and what went well and not so well,” Keskinocak said.\nChallenges in the coordination of resource allocation, especially in logistics, have caused hindrances to recovery. This led to the report’s other major recommendations.\n“Areas where hurricanes may strike need to get a good understanding of how supply chains work under normal conditions along with their vulnerabilities, or weak links, so they can be proactive in strengthening supply,” Keskinocak said.\nPublic-private collaboration\nDisaster preparedness requires collaboration between government, relief agencies, and the private sector, all compiling and sharing this understanding together. All sectors would benefit from educational programs on supply chain dynamics and from sharing public-private partnership best practices.\n“After a big storm strikes, it is typically not possible for any one entity to handle it all alone,” Keskinocak said. “Organizations such as FEMA could play the role of a convener to ensure various organizations collaborate, coordinate, and share information well ahead of time and in the aftermath.”\nThe report recommends increasing focus on preparedness over post-disaster response toward preparedness, as this could help alleviate situations in which FEMA marshals ample supplies but then finds that the supplies are not needed or cannot be effectively distributed to those in need.\n“I have the utmost respect for what FEMA does because they have to work under the most difficult circumstances, and these conditions may put them into binds that are out of their control,” Keskinocak said. “More preparedness on the ground could help get FEMA, local governments, private sector, and non-governmental relief agencies to achieve synergies for saving lives and alleviate suffering.\"\nRead the news release by the National Academies of Science, Engineering, and Medicine here .\nAlso read:\nTweaking vaccine distribution could save many more lives in flu season and pandemics\nWriter & Media Representative : Ben Brumfield (404-272-2780), email:  ben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\nAdditional Images\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}