{"text": "Shaping Leaders through the Great Outdoors: Meet David Knobbe | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nShaping Leaders through the Great Outdoors: Meet David Knobbe\nAs the assistant director of Outdoor Recreation at the Campus Recreation Complex (CRC), David Knobbe enjoys seeing Tech students grow and find their way.\nFacebook\nTwitter\nEmail\nheadshot of David Knobbe, CRC\nJul 16, 2018\n— Atlanta, GA\nDavid Knobbe is the assistant director of Outdoor Recreation at the Campus Recreation Complex (CRC), a Health & Well-Being department.\nKnobbe grew up in St. Louis, Missouri, and he earned a bachelor’s degree in psychology from the University of Missouri. After college, he worked for 16 years with an outdoor program that focused on teen leadership. In 2005, he came to Atlanta to work with a leadership initiative for teenagers that was sponsored by the Coca-Cola Company. There he was director of program development and risk management for five years. In 2010, he came to Tech, where he coordinates outdoor recreation with the help of two professionals and about 30 student employees.\n“An essential resource that allows us to deliver the quantity and quality of programming that we provide Tech is a dedicated community of more than 200 student volunteers,” Knobbe said. “They really make the magic work when it comes to leading trips and expeditions all over the Southeast and, frankly, all over the world.”\nDuring the summer, Knobbe, his staff, and Outdoor Recreation Georgia Tech (ORGT) volunteers are busy coordinating Tech Treks, outdoor orientation trips that are an optional way for incoming first-year students to kick off their time at Georgia Tech. This summer, there will be eight Tech Trek expeditions to Montana, Alaska, Corsica, and Canada, with approximately 30 student volunteers serving about 85 students. In addition, outdoor recreation runs six three-day Tech Trek sessions in the Southeast, serving another 80 incoming students.\n“The outcomes of those experiences are long-lasting friendships, an understanding of what people do well and the strengths that set them apart, and a foundation for building a strategy for being more successful when they encounter the challenges of being a Tech student,” Knobbe said. “What is amazing about the trips is how powerful they can be in building awareness and shaping students’ career direction.”\nKnobbe said that he and the ORGT volunteers often stress that a degree from Georgia Tech will get a graduate a very prestigious interview, but the degree alone won’t actually secure the job.\n“It’s really the experiences that you build doing things other than course-work that seal the deal and get you hired,” he said. “We see students — who sometimes volunteer between 5,000 to 7,000 hours over four to five years at Tech — building leadership, communication, and coaching skills.”\nKnobbe enjoys seeing students grow and find their way. It’s his favorite part of the job.\n“What I like most is the impact that we have on the trajectory of students,” he said. “We have individuals who encounter us as shy, uncertain, unaware students. By the time they graduate they are the sort of individuals who are impressive at every level. They understand their power to affect the trajectory of other students. They see their involvement with ORGT not as a way to ‘get outside,’ but as a way to serve the Georgia Tech community.”\nWhile most Outdoor Recreation programs are targeted to students, there are opportunities for Tech employees to engage. Last year, ORGT operated 162 one- and two-day adventure programs and 16 expeditions of approximately 10-12 days each. Faculty and staff are welcome to sign up for weekend programs, but not the expeditions. For those seeking to structure their own outdoor adventure, outdoor recreation can help support that by offering boat, tent, and even backpack rentals.\nIn the past eight years, ORGT has led 95 expeditions to six continents. In December, ORGT will set foot on Antarctica, conquering the seventh continent. A small group of five students and one guide will meet in Chile, skirt the edge of Antarctica, fly back to Chile, do a sea-kayaking expedition on the sub-Antarctic coast of Chile, and do some trekking across glaciers.\nAway from the Office\nWhen asked what he does for fun, Knobbe quickly replied, “I have three teenagers, and I enjoy hanging out with them.”\nHe is married, and their three children are 17-year old twins (a girl and a boy), and a 15-year-old son.\nAn avid gardener, he prefers to be outside whenever possible.\n“I love to watch things grow,” he said, pointing to a couple of jars of homemade pickles sitting on his desk. “I grow cucumbers, squash, green beans, tomatoes, carrots, radishes, eggplant, okra, and collards.”\nKnobbe is trying his hand at writing, too. He’s writing a book about his experience hiking the Appalachian Trail 30 years ago. The hike took 160 days.\n“I was in graduate school. It came time to work on a thesis project, and I just didn’t feel like it,” he said. “So, I hiked the Appalachian Trail.”\nHis book is titled\n10,000 Better Days\nbecause approximately 10,000 days have passed since the hike. The book is based on the idea that the promise of any life-sized adventure done right is that every day thereafter will be just a little better than it might have been otherwise.\n“I use this as the opportunity to tell the story and share a little bit of insight,” he said. “I walked away with the idea that the simplicity and focus of that experience really is one of those things that drives success afterward. I can tie every good thing in my life back to that experience.”\nAdditional Images\nRelated links\nCampus Recreation\nOutdoor Recreation\nRead More Staff Stories\nContact\nVictor Rogers\nInstitute Communications\nEmail\nvictor.rogers@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}