{"text": "How the Hawkmoth Sees, Hovers and Tracks Flowers in the Dark | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nHow the Hawkmoth Sees, Hovers and Tracks Flowers in the Dark\nScientists have learned how the hawkmoth juggles the complex sensing and control challenges of seeing in the dark, hovering in mid-air and tracking moving flowers.\nFacebook\nTwitter\nEmail\nA hawkmoth clings to a robotic flower used to study the insect’s ability to track the moving flower under low-light conditions. The research shows that the creatures can slow their brains to improve vision under low-light conditions – while continuing to perform demanding tasks. (Credit: Rob Felt, Georgia Tech)\nJun 11, 2015\n— Atlanta, GA\nIt's difficult enough to see things in the dark, but what if you also had to hover in mid-air while tracking a flower moving in the wind? That's the challenge the hummingbird-sized hawkmoth ( Manduca sexta ) must overcome while feeding on the nectar of its favorite flowers. Using high-speed infrared cameras and 3-D-printed robotic flowers, scientists have now learned how this insect juggles these complex sensing and control challenges – all while adjusting to changing light conditions. The work shows that the creatures can slow their brains to improve vision under low-light conditions – while continuing to perform demanding tasks. What the researchers have discovered could help the next generation of small flying robots operate efficiently under a broad range of lighting conditions. The research, supported by the National Science Foundation and Air Force Office of Scientific Research, was reported in the June 12 issue of the journal\nScience . “There has been a lot of interest in understanding how animals deal with challenging sensing environments, especially when they are also doing difficult tasks like hovering in mid-air,” said Simon Sponberg, an assistant professor in the School of Physics and School of Applied Physiology at the Georgia Institute of Technology. “This is also a very significant challenge for micro air vehicles.” Scientists already knew that the moths, which feed on flower nectar during the evening and at dusk and dawn, use specialized eye structures to maximize the amount of light they can capture. But they also surmised that the insects might be slowing their nervous systems to make the best use of this limited light. But if they were slowing their brains to see better, wouldn’t that hurt their ability to hover and track the motion of flowers? Sponberg and colleagues at the University of Washington studied this question using high-speed infrared cameras and nectar-dispensing robotic flowers that could be moved from side-to-side at different rates. While varying both the light conditions and the frequency at which the flowers moved, the researchers studied how well free-flying moths kept their tongues – known as proboscises – in the flowers. They also measured real flowers blowing in the wind to determine the range of motion the insects had to contend with in the wild. “We expected to see a tradeoff with the moths doing significantly worse at tracking flowers in low light conditions,” said Sponberg. “What we saw was that while the moths did slow down, that only made a difference if the flower was moving rapidly – faster than they actually move in nature.” In the experiments, the moths tracked robotic flowers that were oscillating at rates of up to 20 hertz – twenty oscillations per second. That was considerably faster than the two-hertz maximum rate observed in real flowers. Because the moth’s wings beat at a rate of about 25 strokes per second, they had to adjust their direction of movement with nearly every wingstroke – a major sensing, computational and control accomplishment. “This is really an extreme behavior, though the moth makes it look simple and elegant,” said Sponberg. “To maneuver like this is really quite challenging. It’s an extreme behavior from both a sensory and motor control perspective.” In the natural world, light intensity varies 10 billion-fold from noon on a sunny day to midnight a cloudy evening. Operating in that range of luminosity is a challenge for both moths and the sensors on human-engineered systems. Understanding how natural systems adjust to this range of conditions could therefore have broader benefits. “If we want to have robots or machine vision systems that are working under this broad range of conditions, understanding how these moths function under these varying light conditions would be very useful,” Sponberg said. To gather the data reported in this paper, the researchers used a robotic flower able to move in one dimension. Recently, they’ve used the actuator devices from a 3-D printer to build a robotic flower that moves in two or three dimensions, providing an additional challenge for the moths. In future research, Sponberg and his colleagues hope to incorporate their robotic flower into a low-speed wind tunnel to study the aerodynamic challenges the moths overcome – including the role of wing vortices and the flow-effect interaction of the insect’s wings with the flowers. The hawkmoth has been studied extensively to investigate the fundamental principles governing the development and function of its neural system, noted Tom Daniel, a professor in the Department of Biology and co-director of the Institute for Neuroengineering at the University of Washington. Daniel’s research group has experimentally characterized the response of flying hawkmoths, using a sensory input comprised of the linear sum of sine waves. Sponberg’s paper, for which much of the data collection was done at the University of Washington while he was a postdoctoral researcher there, extends application of the “sum of sines” approach, Daniel said. “Simon’s work took the formal methods of control theory to dissect out how neural circuits adapt to vast ranges of luminance levels,” he explained. “By looking at the time delays in the movement dynamics of a freely-flying moth – interacting with the input of a robotically moved flower – Simon was able to extract the luminance dependent processing of the moth’s central nervous system.” Human engineered devices must often operate at various speeds and in different environments. Seeing how well an animal with a tiny brain was able to track complicated movements and adjust its performance to different light levels was a surprising result of the work, Sponberg said. “This was an interesting example of how an organism can tune its brain to maintain its ability to gather food,” he added. “The moths do suffer a tradeoff by slowing their brains, but that tradeoff doesn’t end up mattering because it only affects their ability to track movements that don’t exist in the natural way that flowers blow in the wind.” CITATION : Simon Sponberg, Jonathan P. Dyhr, Robert W. Hall and Tom L. Daniel, “Luminance-dependent visual processing enables moth flights in low light,” (Science 2015). Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contacts : John Toon ( jtoon@gatech.edu ) (404-894-6986). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu 404-894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}