{"text": "Ervin Announces Retirement as Inaugural Vice President and Chief Diversity Officer | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nErvin Announces Retirement as Inaugural Vice President and Chief Diversity Officer\nArchie W. Ervin, Georgia Tech’s inaugural vice president and chief diversity officer, has announced his retirement from the Institute, effective January 1, 2024.\nFacebook\nTwitter\nEmail\nJul 18, 2023\nArchie W. Ervin, Georgia Tech’s inaugural vice president and chief diversity officer, has announced his retirement from the Institute, effective January 1, 2024.\nThe vice president and chief diversity officer position was created in 2010 by then-President G.P. “Bud” Peterson to infuse diversity leadership throughout the Institute community. Ervin was selected after an extensive national search to lead the Office of the Vice President of Institute Diversity, and arrived on campus during the 50th anniversary celebration of the matriculation of the first African American students at Georgia Tech.\n“Since Dr. Ervin's arrival, Georgia Tech has changed for the better,” said President Ángel Cabrera. “With the help of his leadership and expertise, Georgia Tech has become more diverse, welcoming, and inclusive than it has ever been. Our work to create a campus community where people of all backgrounds can thrive continues. We appreciate his impact and wish him all the best in his well-earned retirement.”\nUnder Ervin's leadership, Institute Diversity launched the development and implementation of Georgia Tech’s Campus Climate Survey. The survey, conducted every four years, assesses the lived experiences of Institute community members to make data-informed recommendations about areas of opportunity. He created Tech’s first Institute-wide DEI organizational structure that included pan-university responsibilities and the first strategic operational plan for the Office of Institute Diversity. That structure was implemented in 2014, after over a year's work involving cross-campus collaborations that consisted of faculty, staff, and students.\n“When I first arrived at Tech, I found a community that was eager to engage with diversity and inclusion,” said Ervin. “Members of the faculty, including one of our deans, accepted my invitation to serve on my initial ‘kitchen cabinet’ to help with my transition to Tech. What I discovered early in my tenure here was that the desire to ‘move the needle’ was evident, and the only missing ingredients were the tools for engagement and the leadership necessary to leverage the incredible spirit and goodwill to make the university community more welcoming and supportive of everyone who has earned their right to be here whether as students, staff, or faculty. Nearly 13 years later, look at what Tech has become in the DEI space. We are not perfect, as nothing in human nature is, but we certainly are among the national leaders in the quest for inclusive excellence. In the words of Georgia Tech student Nicholas Selby at the 2013 Student Convocation at Georgia Tech: ‘We can do that.’”\nAfter President Cabrera’s arrival in 2019, Ervin was tasked with bringing the Title IX and ADA offices under his umbrella, after which the unit’s name was updated to Institute Diversity, Equity, and Inclusion (IDEI) to reflect the addition of these departments.\nFollowing the creation of IDEI, Ervin engaged the diversity leaders from across campus to complete Georgia Tech’s first-ever DEI Plan, solidifying goals and laying out a strategic roadmap to enhance inclusion efforts across campus. The final plan, spanning from 2022 to 2032, underpins the work being done by IDEI and affirms Georgia Tech’s commitment to thriving on diversity.\nIn addition to supervising Institute Diversity, Equity, and Inclusion, Ervin’s leadership found numerous successes in positioning the Institute as a global leader in diversity in higher education. Some examples include:\nExpanding Institute academic support services for Tech’s historically underserved student communities, which has resulted in improved graduation rates and academic success over the past decade.\nProviding leadership to expand Tech’s graduate recruitment Focus Program that has contributed to the growth of diverse student populations in Tech’s graduate programs.\nCreating an Intercultural Education Lecture/Learning Series to promote cross-cultural education and learning among Tech’s students, staff, and faculty.\nSupporting the Institute’s ADVANCE Professors Program’s gender/racial equity initiatives to ensure gender and racial equity among GT’s Institute faculty.\nEstablishing GT’s Diversity, Equity, and Inclusion Council to provide a forum for discussion and resolution of DEI issues and concerns within the campus community.\nCo-founding the LGBTQIA Resource Center in collaboration with Student Engagement and Well-Being (then-Student Affairs) and establishing the annual Lavender Graduation.\nEstablishing DEI Dashboards, providing a snapshot of the Tech community and the DEI efforts being completed across the Institute.\nProviding a consistent commitment to build an open, welcoming, and inclusive environment for current and former students (including opening the Center for Student Diversity and Inclusion in the newly renovated Chapin Building).\nAdvancing efforts in DEI communication with and outreach to faculty, staff, students, and community partners.\nUnder Ervin’s leadership, Tech has been recognized for its innovative and impactful programs that supported Tech’s DEI mission and vision. Georgia Tech has been regularly awarded the Higher Education Excellence in Diversity Award from INSIGHT Into Diversity, having won the award nine times during his tenure. The award, a national honor that recognizes U.S. colleges and universities that demonstrate an outstanding commitment to diversity and inclusion, is a direct result of the initiatives stemming from Ervin’s leadership during his time at Georgia Tech.\nErvin is a longstanding, nationally recognized DEI expert and served as the president of the National Association of Diversity Officers in Higher Education from 2016 to 2020. Ervin came to Georgia Tech after nine years of senior leadership as the associate provost and chief diversity officer at University of North Carolina at Chapel Hill — and a career that's been dedicated to advancing diversity in higher education.\nTransition decisions regarding his departure will be announced in the next couple of months.\nAdditional Images\nContact\nIan Webb\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}