{"text": "How Will You Grow? | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nHow Will You Grow?\nEmployee Learning Week 2022 is Dec. 5 – 9. The week is being recognized internationally, as well as by the Georgia Governor's Office.\nFacebook\nTwitter\nEmail\nEmployee Learning Week 2022\nNov 30, 2022\n— Atlanta, GA\nHow do you learn best? In what ways do you develop and sharpen your skills? How do you want to grow professionally and creatively?\nEach year the\nAssociation for Talent Development , the world’s largest learning association dedicated to empowering professionals to develop knowledge and skills, celebrates workplace learning through its Employee Learning Week campaign. Employee Learning Week 2022 is Dec. 5 – 9. The week is being recognized internationally, as well as by the Georgia Governor's Office.\nGeorgia Tech Professional Education ’s\nWorkplace Learning and Professional Development\n(WLPD) team believes that there are always opportunities to learn, and during Employee Learning Week we seek to share approaches, methods, and resources for all Georgia Tech employees to take advantage of.\n“The ultimate objective of this year’s Employee Learning Week is to shine a light on the numerous ways our campus community embraces the idea of lifelong learning, promote the value of workplace learning, and celebrate those who take charge of their development and growth” said LaTrese Ferguson, director of Workplace Learning and Professional Development.\nAs we approach the end of the year, Employee Learning Week is a great time to reflect on the learning goals you accomplished over the last 12 months. It also provides an opportunity to review those goals you weren’t able to meet and develop a new learning plan for the upcoming year.\nAll employees are invited to celebrate Employee Learning Week on Friday, Dec. 9, from 10 a.m. to noon at\nPaper and Clay . Get creative by glazing a mug and learn about ways the Institute supports your continued growth and development.\nRegister here\n(limited to the first 50 registrants).\nMaking a Plan\nTo close out the year and plan to make the most of your professional development and growth in 2023, WLPD has some recommendations for laying out a learning plan:\nDetermine your\nwhy.\nIdentify your\nhow.\nSelect your\nwhat.\nLeverage your\nwho.\nSchedule your\nwhen.\nWHY : First, start out with your reason and purpose for learning — do you want to acquire or enhance a skill, tackle an issue, make a career change, need to complete a requirement, earn a promotion, obtain a certification, or just have the satisfaction of learning something new? Ask yourself, “Why do I want to participate in a professional development opportunity?”\nHOW : Next, explore the best learning approach for yourself based on your personal preferences, needs, and desires. Ask yourself, “How do I learn best?” There are many methods and modes of learning, so find the ones that are best for you and consider the following ways to learn a new skill.\nFrom those already performing the skill:\nJob shadowing.\nCross-training.\nJob sharing/rotation.\nBy taking on additional responsibilities:\nStretch assignments.\nWork delegation.\nSpecial projects/committees.\nThrough formal and informal training:\nTraining courses/programs.\nCertifications/certificates/badges.\nDegrees.\nBy group participation:\nCommunities of practice.\nService/volunteerism.\nOnline forums.\nWith guidance from others:\nCoaching.\nMentoring.\nMastermind groups.\nFrom self-study:\nVideos/podcasts.\nBooks/articles.\nSocial media.\nWHAT : Now that you have identified your reason for learning and how you like to learn, determine what you want to do. Check out the courses and programs WLPD has offered in 2022 through our\nLearning Resource Catalog\n(the 2023 catalog will be published by the beginning of the new year), as well as the plentiful opportunities available on campus through the\nCampus Learning Directory .\nSome things to consider to ensure you are fully engaged in the learning experience are examining your interest or passion for it, deciding if it is important or meaningful to you, and determining if it will challenge or stretch you. You will also want to consider what you will do with the learning obtained and how you will apply it. Find opportunities to incorporate your learning into your daily practices. Ask yourself, “What professional development opportunity do I want to participate in?”\nWHO : Research shows that support from others is the best way to ensure that the learning you receive through developmental opportunities is actually put into practice. Involving your manager, peers, and/or direct reports is critical in ensuring this happens. Also, look to engage with others within or outside of your department, unit, or school who might also benefit from your experience. It will not only assist you in using the learning but also help others too. Ask yourself, “Who will support and engage with me?”\nWHEN : Lastly, after laying out your plan, it’s time to set dates and milestones for your learning opportunities. Working with your manager through the\nPerformance Management Cycle\nis a great way to document this and keep yourself on track throughout the performance year. Many times, the Career Development Goals section of the Values-Based Goal Setting Form is not given significant priority, so come prepared with your learning goals when working with your manager during the planning phase of the Performance Management Cycle. Ask yourself, “When will I begin my opportunity?”\nDuring Employee Learning Week 2022, take some time to explore your personal learning goals, think about what is important to you, and establish what you want to achieve in the coming year. Stay tuned next week as more learning resources and articles are shared in the Daily Digest to help you continue planning how you will grow in 2023.\nIf you need assistance or want to learn more about what\nWorkplace Learning and Professional Development\nhas to offer, contact\ntraining@gatech.edu .\nAdditional Images\nContact\ntraining@gatech.edu\nTim Edmonds-King\nWorkplace Learning and Professional Development\nBryan Harber\nWorkplace Learning and Professional Development\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}