{"text": "U.S. Treasury Secretary Jack Lew visits Georgia Tech | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nU.S. Treasury Secretary Jack Lew visits Georgia Tech\nThe treasury secretary came to the Tech campus to meet with startup entrepreneurs and discuss several issues including the national economy and access to capital.\nFacebook\nTwitter\nEmail\nU.S. Treasury Secretary Jack Lew, left, listens to Nashlie H. Sephus, Ph.D. ECE 2014, as she explains visual recognition technology. Sephus is chief technology officer of Partpic, a startup technology company incubating at Georgia Tech's Advanced Technology Development Center (ATDC). Lew came to ATDC to meet with entrepreneurs and discuss the national economy, as well as hear the challenges they face in accessing capital and solutions they had.\nJan 14, 2016\n— Atlanta, GA\nU.S. Treasury Secretary Jack Lew came to the Georgia Institute of Technology Jan. 14 to discuss the national economy and meet with technology entrepreneurs at the Institute’s Advanced Technology Development Center (ATDC). The secretary, who was joined by Atlanta Mayor Kasim Reed, was also touting the Treasury Department’s\nmyRA\n(my Retirement Account) program, a key initiative designed for individuals who want to save for retirement but don’t have access to traditional, employer-sponsored retirement accounts. The initiative is a fee-free Roth Individual Retirement Account that invests in a new U.S. Treasury retirement savings bond. Lew and Reed toured ATDC, Georgia’s technology startup incubator that works with entrepreneurs who want to launch successful companies in the state. Headquartered in Technology Square, ATDC has operations across the state, including in Savannah, Athens and Augusta. Lew and the mayor toured ATDC’s Tech Square operations and learned about how the incubator helps entrepreneurs through its education and coaching curriculum. They also met with some of the startup entrepreneurs in ATDC’s highly competitive Signature program, comprised of those companies that receive intensive one-on-one coaching and guidance and are deemed most likely to succeed as stand-alone enterprises. “There’s no shortage of ideas here,” Lew said. “It’s not just about ideas, it’s about getting funding and being able to have a business come out of the idea.” Lew and Reed hosted a roundtable with several CEOs and startup founders in ATDC Signature to talk to them about access to the financial system and hear challenges entrepreneurs face, and listen to their ideas. “What we see going on here is what we’re talking about when we describe the U.S. economy as being a place where innovation will come in the future because it involves your dreams,” Lew said. Entrepreneurs’ ideas can only become actual businesses if startups have sufficient access to the nation’s financial system. “Financial inclusion is a big part of that,” Lew added, “because if you don’t have a history or a relationship with the financial system, it’s going to be really hard to get the loan or the financing necessary to take an idea and make it a reality.” — Péralte C. Paul\nAdditional Images\nContact\nFor media inquiries contact: Laura Diamond Georgia Tech Media Relations  laura.diamond@gatech.edu\nEmail\nperalte.paul@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}