{"text": "Can Children Swab Themselves for Covid-19? New Study Suggests Yes | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nCan Children Swab Themselves for Covid-19? New Study Suggests Yes\nA new study published in the Journal of the American Medical Association suggests that, with proper instruction, children as young as 4 can effectively perform self-sampling with nasal swabs for testing.\nFacebook\nTwitter\nEmail\nA child swabs their nose for Covid-19 testing.\nSep 20, 2022\n— Atlanta, GA\nEvery parent is likely familiar with the challenge of having a nasal swab taken from their child for a Covid-19 test. A  new study published  in the\nJournal of the American Medical Association\n(JAMA®), however, suggests that with proper instruction, children as young as 4 can effectively perform self-sampling with nasal swabs for testing.\nResearchers enrolled 287 children at Atlanta-area sites in July and August 2021 to assess the ability of children ages 4 to 14 to self-collect nasal samples by comparing swabs taken by the participants with swabs taken by healthcare workers (HCWs).\nAfter hearing and seeing instructional materials, which included a short instructional YouTube video and a one-page handout, children self-sampled themselves, followed by the HCWs. Both samples were then submitted to a clinical laboratory for PCR analysis. The findings show that self-collected nasal swabs from children agreed with swabs collected by HCWs approximately 97% of the time for the detection of Covid-19.\nA usability questionnaire, which was also included in the study, found that children younger than 8 had more difficulty with sample collection but were still able to collect samples and were in concordance with HCWs.\n“Seeing how closely the results line up between the children and trained healthcare workers is a strong indicator that these age groups are fully capable of swabbing themselves if given proper instruction,” says  Jesse Waggoner, M.D ., an assistant professor of infectious diseases with the Emory University School of Medicine and one of the lead authors on the study.\nThis data, which are the first of its kind to evaluate the usability of self-collection tests from both the child and HCW perspective, show the potential for a widespread shift in Covid-19 testing strategies.\nPrior to this study, the FDA had not authorized Covid-19 tests for self-swabbing by children under age 14. Data from the study are now available to test manufacturers seeking authorization for pediatric self-collection.\n”Pediatric self-swabbing will support expanded testing access and should make it even easier to test school age populations with fewer resources,” said Tim Stenzel, M.D., Ph.D., director of the Office of In Vitro Diagnostics at the FDA. “This study furthers our knowledge of test accuracy with these types of samples and provides test manufacturers with data to support their EUA requests to the FDA.”\nThe data could also ease the burden on schools that grapple with conducting group testing of students due to the limited availability of trained healthcare workers to collect samples.\nBeyond possible impacts for test manufacturers and group testing strategies, parents of school-age children can now be confident that their children have the capability to collect their own samples for PCR-based lab tests if the instructions for use are properly followed.\n“Collecting nasal samples, especially when you have to do it multiple times in a short time span, can be an uncomfortable and stressful experience for young kids and being able to swab themselves can make things a bit easier,“ says  Wilbur Lam, M.D ., pediatric hematologist and oncologist at  Aflac Cancer and Blood Disorders Center of Children’s Healthcare of Atlanta,  professor of the  Emory University School of Medicine Department of Pediatrics  and at the  Wallace H. Coulter Department of Biomedical Engineering  at the Georgia Institute of Technology and a senior author on the study. “Maybe at the very least, these data can save parents from having to bribe their kids with an ice cream cone.”\nThis study was a collaboration between Emory University and Emory Healthcare, Children’s Healthcare of Atlanta, the Georgia Institute of Technology, FDA, and the National Institutes of Health's  Rapid Acceleration of Diagnostics (RADx ®) Tech  program, which is administered by the National Institute of Biomedical Imaging and Bioengineering (NIBIB). The research was supported by NIBIB (U54 EB027690-03S1 and U54 EB027690-03S2) and the National Center for Advancing Translational Sciences (UL1 TR002378), both parts of the National Institutes of Health.\nAbout the Rapid Acceleration of Diagnostics (RADx®) initiative: The RADx initiative was launched on April 29, 2020, to speed innovation in the development, commercialization, and implementation of technologies for Covid-19 testing. The initiative has four programs: RADx Tech, RADx Advanced Technology Platforms, RADx Underserved Populations and RADx Radical. It leverages the existing NIH Point-of-Care Technology Research Network. The RADx initiative partners with federal agencies, including the Office of the Assistant Secretary of Health, Department of Defense, the Biomedical Advanced Research and Development Authority, and U.S. Food and Drug Administration. Learn more about the RADx initiative and its programs:  https://www.nih.gov/radx .\nStory by Brian Katzowitz, Senior Director, Health Communications and Media Relations Emory University\nAdditional Images\nContact\nTess Malone, Research Writer/Editor\nEmail\ntess.malone@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}