{"text": "Georgia Tech Students Named Marshall Scholarship Recipients | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Students Named Marshall Scholarship Recipients\nTwo Yellow Jackets have been selected to receive the prestigious scholarship awarded to exceptional American students pursuing post-secondary education in the U.K.\nFacebook\nTwitter\nEmail\nDec 11, 2023\nGeorgia Tech students Maeve Janecka and Haaris Jilani are among this year's 51 recipients of the prestigious\nMarshall Scholarship\n— awarded annually to American students pursuing post-secondary education in the U.K. who demonstrate academic excellence as well as leadership and ambassadorial potential.\nIntroduced in 1953, Marshall Scholars include Supreme Court justices, Pulitzer and Nobel Prize winners, members of Congress, MacArthur “genius grant” winners, and Olympic gold medalists and serve as a “living embodiment of the enduring special relationship between the U.K. and America.”\nThough they conduct research in different areas, Janecka and Haaris share the goal of using this opportunity to assist others.\nMaeve Janecka\nWhen Maeve Janecka was diagnosed with endometriosis at the age of 16, she was confused — not by her condition, but rather by the lack of treatment and diagnostic options for a disease that affects one in 10 women worldwide.\nWhile she endured symptoms for three years, Janecka explains that the average case of endometriosis can go undiagnosed for 10 years, causing debilitating pain, organ damage, and infertility. Following the completion of her bachelor's degree in chemical engineering, Janecka will use the Marshall Scholarship to pursue a\ndoctor of philosophy\nin\nwomen’s and reproductive health\nat Oxford's Endometriosis Care Center, where she plans to conduct research into emerging treatment options and diagnostic improvements.\n\"Women suffer in silence for a really long time,\" she said, also noting that\ndiagnosing\nthe condition typically requires invasive surgery. \" I am passionate about making sure that more women know what endometriosis is and that we have more options available for diagnosis and treatment, because your quality of life can be so much better with the right medical attention.\"\nLiving with this disease has motivated Janecka to help others, and her time at Georgia Tech has allowed her to pursue her dream of identifying solutions.\n\"Being a Georgia Tech student, you get used to seeing a problem, thinking of ways to solve it, and wanting to be the one to bring about change. Tech has empowered me to enter a field that needs innovation and investment, as women's health is one of the least funded areas in the medical field,\" she said.\nJanecka, who is also a Stamps President's Scholar and was among\nthe Institute's five 2023 Barry M. Goldwater Scholarship recipients , has always felt like her time at Georgia Tech was a gift she intended to make the most of. She advises other students to maximize their time on campus by taking full advantage of the resources available to them, including PURA travel awards and the\nInstitute's Fellowship s Office .\nHaaris Jilani\nHaaris Jilani will graduate from Georgia Tech with a bachelor's degree in biomedical engineering, but as he prepares to continue his academic career at the Imperial College of London, he carries the Institute's mission with him.\n\"I'm really passionate about doing work that advances scientific knowledge and translates into innovations that can improve the lives of patients,\" he said.\nAs Jilani began to develop his career path, the potential and the unknowns of stem cell research sparked his interest. He sought out labs on campus at the intersection of stem cell research and biomaterial science.\n\"Stem cells can do so many interesting things, but we don't really know a lot about how they work. So, we're not only learning about how the cells work, but it’s about trying to manipulate them to do things that you want them to do,\" he said.\nThrough\nJohnna Temenoff's lab , Jilani's research has focused on applying stem cell treatments in regenerative medicine therapies for musculoskeletal injuries, and he hopes to create noninvasive treatments for injuries that currently need surgery or are deemed untreatable.\nWhen he arrives in the U.K., he intends to broaden his understanding of stem cell treatments for different aspects of care, examining its potential in skin regeneration.\n\"It's not a part of the body that I have\nnecessarily focused on before, but a lot of the scientific principles are the same with stem cells and how they evolve into different types of cells needed for skin healing,\" he said.\nWhile he'll spend at least a year abroad, Jilani, who is also a Stamps President's Scholar, feels like his time at Georgia Tech has not come to an end. He hopes to return to pursue a Ph.D. in biomedical engineering and eventually become a professor with a research lab of his own.\nFellowship Planning\nFellowships often enable students to craft a more tailored experience than a traditional graduate school experience, and\nGeorgia Tech's Fellowships Office\naids students in the process of applying for prestigious awards such as the Marshall Scholarship. Staff members work with students each step of the way with their applications, reading drafts of essays, and arranging mock interviews.\nKaren Mura, prestigious fellowships advisor, worked closely with both of this year's Marshall Scholars as they applied for this and other awards.\n\"Maeve and Haaris are both extraordinary students with immense potential to make a difference in the world,\" Mura said. \"They have persevered through challenges and setbacks. Both have worked tirelessly on their applications, improving them with each revision. It has been a pleasure to assist them on their academic path and to observe their personal growth. I am eager to hear about their future accomplishments.\"\nRelated links\nPrestigious Fellowships\nAbout the Marshall Scholarship\nContact\nSteven Gagliano\nInstitute Communications\nFor additional information about fellowships, contact\nkaren.mura@gatech.edu .\nEmail\nsteven.gagliano@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}