{"text": "Disappearing Carbon Circuits on Graphene Could Have Security, Biomedical Uses | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nDisappearing Carbon Circuits on Graphene Could Have Security, Biomedical Uses\nResearchers have demonstrated a technique for creating dynamic patterns on graphene surfaces.\nFacebook\nTwitter\nEmail\nSchematic shows how researchers doped the surface of graphene using carbon atoms. (Credit: Fedorov Laboratory, Georgia Tech)\nSep 29, 2015\n— Atlanta, GA\nIn the television drama “Mission Impossible,” instructions for the mission were delivered on an audio tape that destroyed itself immediately after being played. Should that series ever be revived, its producers might want to talk with Georgia Institute of Technology professor Andrei Fedorov about using his “disappearing circuits” to deliver the instructions. Using carbon atoms deposited on graphene with a focused electron beam process, Fedorov and collaborators have demonstrated a technique for creating dynamic patterns on graphene surfaces. The patterns could be used to make reconfigurable electronic circuits, which evolve over a period of hours before ultimately disappearing into a new electronic state of the graphene. Graphene is also made up of carbon atoms, but in a highly-ordered form. Reported in the journal\nNanoscale , the research was primarily supported by the U.S. Department of Energy Office of Science, and involved collaboration with researchers from the Air Force Research Laboratory (AFRL), supported by the Air Force Office of Scientific Research. Beyond allowing fabrication of disappearing circuits, the technology could be used as a form of timed release in which the dissipation of the carbon patterns could control other processes, such as the release of biomolecules. “We will now be able to draw electronic circuits that evolve over time,” said\nAndrei Fedorov , a professor in the\nGeorge W. Woodruff School of Mechanical Engineering\nat Georgia Tech. “You could design a circuit that operates one way now, but after waiting a day for the carbon to diffuse over the graphene surface, you would no longer have an electronic device. Today the device would do one thing; tomorrow it would do something entirely different.” The project began as a way to clean up hydrocarbons contaminating the surface of the graphene. But the researchers soon realized they could use it to create patterns, utilizing the amorphous carbon produced via electron beam “writing” as a dopant to create negatively-charged sections of graphene. The researchers were initially perplexed to discover that their newly-formed patterns disappeared over time. They used electronic measurements and atomic force microscopy to confirm that the carbon patterns had moved on the graphene surface to ultimately form a uniform coverage over an entire graphene surface. The change usually occurs over tens of hours, and ultimately converts positively-charged (p-doped) surface regions to surfaces with a uniformly negative charge (n-doped) while forming an intermediate p-n junction domain in the course of this evolution. “The electronic structures continuously change over time,” Fedorov explained. “That gives you a reconfigurable device, especially since our carbon deposition is done not using bulk films, but rather an electron beam that is used to draw where you want a negatively-doped domain to exist.” Graphene consists of carbon atoms arranged in a tight lattice. The unique structure provides attractive electronic properties that have led to widespread study of graphene as a potential new material for advanced electronics applications. But graphene still consists of carbon atoms, and when patterns are deposited on the surface with ordinary carbon atoms, they begin slowly migrating over the graphene surface. The speed at which the atoms move around can be adjusted by varying the temperature or by fabricating structures that direct the movement of the atoms. The carbon atoms can also be “frozen” into a fixed pattern by using a laser to convert them to graphite – another form of carbon. “There are multiple ways to modulate the dynamic state, through changing the temperature because that controls the diffusion rate of carbon, by directing the atomic flow, or by changing the carbon phase,” Fedorov said. “The carbon deposited through the focused electron beam induced deposition (FEBID) process is linked to graphene very loosely through van der Waals interactions, so it is mobile.” Beyond the potential security applications for disappearing circuits, Fedorov sees the possibility of simplified control mechanisms that would use the diffusing patterns to turn processes off at preset intervals. The technique might also be used to time the release of pharmaceuticals or other biomedical processes. “You could write information in ones and zeroes with the electron beam, use the device to transfer information, and then two hours later the information will have disappeared,” he said. “Instead of relying on complex control algorithms that a microprocessor has to execute, by changing the dynamic state or the electronic system itself, your program could become very simple. Perhaps there could be certain activated, triggered processes that could benefit from this type of behavior in which the electronic state changes continuously over time.” Fedorov and his collaborators have so far shown only the ability to create simple patterns of charged domains in the graphene. Their next step will be to use their p-n junctions to create devices that would operate for specific periods of time. Fedorov admits that this dynamic carbon patterning could pose a challenge for electrical engineers accustomed to static devices that perform the same functions day after day. But he thinks that some will find useful applications for this new phenomena. “We have made a critical step in discovery and understanding,” he said. “The next step will be to demonstrate a complicated and unique application which would otherwise be impossible to do with a conventional circuit. That would bring a whole new level of excitement to this.” Songkil Kim, a post-doctoral fellow in Fedorov group, was a lead researcher in this work assisted by Georgia Tech’s graduate students M. Russell and M. Henry. Other collaborators on the project include S. S. Kim, R. R. Naik, and A. A. Voevodin from the U.S. Air Force Research Laboratory and S. S. Jang, and V. V. Tsukruk from the School of Materials Science and Engineering at Georgia Tech. This research was supported by the U.S. Department of Energy (DOE), Office of Science, Basic Energy Sciences (BES), under Award DE-SC0010729 and by the Air Force Office of Scientific Research (AFOSR) through BIONIC Center Award FA9550-09-1-0162. The comments and conclusions are those of the authors and do not necessarily reflect the official views of the DOE or AFOSR. CITATION : S. Kim, et al., “Dynamic modulation of electronic properties of graphene by localized carbon doping using focused electron beam induced deposition,” (Nanoscale 7, 14946-14952, 2015).\nhttp://dx.doi.org/10.1039/c5nr04063a Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contact : John Toon (404-894-6986) ( jtoon@gatech.edu ). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}