{"text": "Collaboration with CNN Investigates Use of UAVs for Newsgathering | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nCollaboration with CNN Investigates Use of UAVs for Newsgathering\nResearchers from the Georgia Tech Research Institute have been working with CNN to investigate the use of UAVs in newsgathering.\nFacebook\nTwitter\nEmail\nThe Georgia Tech Research Institute (GTRI) and CNN have been working together to study the issues affecting the use of unmanned aerial vehicles for newsgathering. Shown in CNN’s World Headquarters are (left) Greg Agvent, senior director of news operations for CNN, and Cliff Eckert, a GTRI senior research associate who’s working on the project. They are shown with an AirRobot AR 180, one of the devices that may be suitable for newsgathering. (Credit: Rob Felt, Georgia Tech)\nNov 10, 2015\n— Atlanta, GA\nIn June 2014, the Georgia Tech Research Institute (GTRI) and CNN launched a joint research initiative to study the use of unmanned aerial vehicles (UAVs) for newsgathering. In January 2015, CNN signed an agreement with the Federal Aviation Administration (FAA) to share the results of the research. The project is now gaining momentum as researchers shift their focus from evaluating UAV equipment to developing potential protocols for safe operations. The issue: Hobbyists can fly drones without FAA oversight as long as the aircraft weighs 55 pounds or less, flies in unpopulated areas, and remains within line of sight of the operator. Yet flying drones for commercial purposes requires review and approval by the FAA. The only way to get a thumbs-up from the FAA is to pursue airworthiness certification (an expensive and complicated process that can take up to a year), or secure a “Section 333 exemption.” A Section 333 exemption allows the FAA to waive the airworthiness requirement as long as the commercial UAV flights are conducted under a number of restrictions. Among these restrictions: Drone operators must notify local aviation authorities two or three days prior to flight — and operations over people or near airports are off-limits. “Securing a 333 exemption is doable for the movie industry since obtaining aerial footage can be planned far in advance,” observed Mike Heiges, a\nGTRI\nprincipal research engineer who leads the CNN project. “Yet journalists can’t operate under these rules for breaking news and chaotic situations where there may be emergency responders, police helicopters, or the National Guard.” Granted, drones aren’t needed for every news story, but they provide a unique perspective in many situations, said Greg Agvent, senior director of news operations for CNN/US. “Being able to fly over an area after an earthquake or tornado hits would provide a deeper understanding of how widespread the devastation is,” Agvent explained and pointed to the May 12 Amtrak train derailment in Philadelphia. “Part of the issue with the accident was the speed going into the curve. The ability to get footage from 200 feet in the air would have presented a better sense of the curve — context that you simply couldn’t get from the ground.” Safety of news personnel is another benefit of drone journalism, Agvent added. “In many cases, such as a flood, safety would trump context. We could capture footage of an event without putting our people in harm’s way.” Some of the research that comes out of the project will be helpful beyond newsgathering, observed Dave Price, a GTRI senior research technologist working on the project. “Commercial drones are of interest for crop monitoring and inspection of bridges and railroad tracks,” he explained. “Railroads and agriculture agencies will be able see the results of CNN’s camera selection and stabilization systems and take advantage of this for their own applications.” The Right Stuff During the past year, the researchers, including GTRI and CNN staff, have been investigating different UAVs that could carry the type of camera systems journalists need to shoot and transmit aerial footage. That’s easier said than done. For one thing, the commercial drone industry is in its infancy. Manufacturers come and go, and there aren’t a great number with a long track record. Another challenge is finding the right equipment — airframes and payloads that match up. “It’s a trade-off,” Heiges explained. “You have to factor in size, weight, and power of what you want to put on the aircraft with what the aircraft can carry.” Flight times for many commercial drones aren’t long enough for CNN’s purposes, nor is video quality high enough. “To install a better camera, you need a bigger vehicle for endurance,” Heiges said. “And that means stepping up to UAVs that were developed for the military, which dramatically increases price.” GTRI has been testing drones since 2006 through the FAA’s certificate of authorization process, which enables public institutions to operate drones in national airspace for research purposes. Currently, GTRI holds 28 certificates of authorization for specific locations in five states. For the project with CNN, GTRI provides pilots to fly the drones in approved areas, plans the flight tests with CNN’s participation, collects data, and prepares reports with recommendations. One of CNN’s takeaways from the flight tests: Drone journalism is no one-person show. “In most cases, especially for live video, you need three people,” Agvent said. This includes a pilot to guide the actions of the UAV and an operator for the camera, which is usually suspended under the drone and sits on gimbals for stabilization. “The third person, a spotter, is particularly important in urban areas,” Agvent continued. “The spotter focuses solely on situational awareness and communicates to the pilot about people and other aircraft that may be in the area. In some cases, you could get by with a two- person team — a pilot/cameraman and a spotter — but a trio is best to ensure both high quality and safety.” Advancing to Operational Protocols “We’ve hit a lot of milestones in the past year,” Agvent said. “Now, we begin to work on the finer points of flight operations and coordinating with air traffic control.” One of the FAA’s chief concerns with drones is getting the word out to manned aircraft about a UAV’s presence in the area. The current practice is to file a “notice to airmen” two or three days in advance. A new technology known as automatic dependent surveillance-broadcast (ADS-B) could provide a just-in-time alternative to the notice to airmen. Developed by the FAA, this technology enables aircraft to broadcast their GPS coordinates to anyone in the local air space that has ADS-B, and vice-versa, so the drone operator would be able to see other aircraft. “It’s like having an air traffic radar map inside your cockpit,” Heiges said. “Even better, unlike conventional radar, ADS-B works all the way to the ground.” That’s important, because, in some situations, journalists may need to cooperate with police helicopters or medical aircraft flying at low altitudes to pick up patients. Geo-fencing technologies, which prevent UAVs from entering airport and other restricted areas, could add another layer of safety, Heiges added. Because FAA rules prohibit drones from flying over people, crowd-control issues must also be resolved. For example, are journalists responsible for blocking off the area where they wish to fly drones — or do they communicate with on-scene commanders to find out where they can operate? Over the next few months, GTRI and CNN will meet with regional emergency responders and other stakeholders to address these questions and develop an operational framework. Then GTRI will work with law enforcement agencies to test the procedures at remote locations. “We’ll hold mock trials and simulate circumstances that would happen in a breaking news situation,” Heiges explained. Creating appropriate regulations for various types of UAV flights is important, as the flight landscape has changed dramatically in recent years. “When people built radio-controlled airplanes out of balsa wood, they learned the rules for flying and flew aircraft at sanctioned sites,” Heiges said. “Yet in the past few years, we now have multi-rotors and quad-rotors with automatic stabilization that don’t require the same skills. People are flying them out of the box without knowing the rules. That can be dangerous if flown beyond visual range. Any significant accident will set back the industry, punishing those who do follow the rules.” Even small drones could cause a helicopter or aircraft to go down if it gets caught in a propeller or pulled into an engine. Indeed, drones have been in the news this past summer for interfering with firefighting efforts in California, including a San Bernadino wildfire where drones operated by curious hobbyists caused fire pilots to pull out of the fray for 30 minutes, allowing the fire to spread. “The one thing that doesn’t get talked about enough is the differentiation between hobbyists and commercial drone users — and that most of the problems are caused by laymen,” said Agvent. “Our goal is to create a framework that allows for safe integration of commercial drones for newsgathering. It’s about having trusted vendors, trusted aircraft, and trusted procedures in place to act in a safe manner.” Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contact : John Toon (404-894-6986) ( jtoon@gatech.edu ) Writer : T.J. Becker\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}