{"text": "Georgia Tech to Launch State’s First Master’s Program Focused Exclusively on Sustainability | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech to Launch State’s First Master’s Program Focused Exclusively on Sustainability\nThe degree program will help educate the next generation of sustainability leaders for corporations, government, and non-governmental organizations.\nFacebook\nTwitter\nEmail\nGeorgia Institute of Technology's new Master of Sustainable Energy and Environmental Management (MSEEM) is the only graduate degree in Georgia fully dedicated to sustainability issues.\nMar 04, 2019\n— Atlanta, GA\nThe Georgia Institute of Technology is launching a new Master of Sustainable Energy and Environmental Management (MSEEM) — the only graduate degree in Georgia fully dedicated to sustainability issues.\nThe highly technical, science-based, and interdisciplinary program — approved by the Board of Regents on Feb. 12, 2019 — will prepare students to deliver fact-based policy expertise through robust analytical techniques and a deep understanding of energy and environmental issues and sustainability practices.\n“This professionally focused degree will allow Georgia Tech to educate the next generation of sustainability leaders in corporate, government, and non-governmental organizations,” said Rafael L. Bras, provost and executive vice president for Academic Affairs and K. Harrison Brown Family Chair. “Georgia Tech is proud to deliver innovative, affordable, and top-quality education in high-demand areas such as sustainability to meet the needs of our evolving workforce.\"\nWhen the program begins in the Georgia Tech School of Public Policy in August 2019, MSEEM students will study topics such as sustainable energy and voluntary environmental commitments, cost-benefit analysis, utility regulation and policy, Earth systems, economics of environmental policy, big data and policy analytics, climate policy, and environmental management.\nThey also will learn analytical techniques used to estimate and evaluate sustainability metrics, be able to expertly assess the context of energy and environmental problems, and understand environmental ethics and its implications for sustainability practice.\nThe program will combine professional instruction from the nationally-ranked\nSchool of Public Policy\nwith Georgia Tech’s top-notch engineering, business, and planning faculties to educate professionals who can lead organizations toward policies consistent with a sustainable future.\n“This unique interdisciplinary program takes an innovative and integrative approach to sustainability that epitomizes the commitment of the School of Public Policy to collaborate across disciplines to educate future policy analysts and leaders and turn ideas into solutions to public problems,” said\nKaye Husbands Fealing , professor and chair of the school.\nFaculty will be drawn from across the Georgia Tech campus, including from the School of Public Policy, the Scheller College of Business, the H. Milton Stewart School of Industrial and Systems Engineering, the School of Civil and Environmental Engineering, and the School of City and Regional Planning.\nGuest lecturers from Atlanta’s corporate community, government agencies, NGOs and research organizations also will participate — helping connect MSEEM students to the state of the practice and to job opportunities.\nMSEEM students also will have access to Georgia Tech’s summer\nProgram on Sustainable Development and Climate Change in Venice , Italy. The 5-week, 6-credit program features courses in climate policy and sustainable development and provides a multi-disciplinary learning experience that combines classroom lectures, guest speakers and instructional field trips.\n“The world’s energy economy is undergoing transformational change, and as the public and private sectors strengthen their commitment to green practices, the need will increase for well-trained policy experts able to design, implement, and manage responses to sustainability issues. This program will provide such leaders,” said\nMarilyn A. Brown , Regents’ Professor and Brook Byers Professor of Sustainable Systems in the School of Public Policy.\nThe MSEEM program is designed to serve a broad range of students interested in sustainability issues. Students can complete the degree on campus or online as a full-time student. Students also have the option to enroll part-time and complete their degree online. The program is designed to serve working professionals and others who want to participate part-time and earn their degree over several years.\nIn addition to the master’s degree, Georgia Tech is also offering a Certificate in Sustainable Energy and Environmental Management. This 12-credit hour SEEM Certificate can be completed in one or two semesters and can be earned on its own or in combination with the master’s degree.\nApplications are being accepted through June 15 for the inaugural class of MSEEM students, who will begin study in August 2019.\nA generous philanthropic gift has enabled Georgia Tech to offer five fully funded MSEEM fellowships to the program each year for the first three years of the program.\nFor more information on these programs, visit\nhttps://spp.gatech.edu/masters/mseem .\nAdditional Images\nRelated links\nGeorgia Tech Alumni’s AI-Based Energy Grid Modeling Platform is Helping Atlanta…\nMarilyn Brown Leads Atlanta to Win $2.5 Million American Cities Climate Challen…\nStudents in Japan Program Solve Real World Problems in Sustainability\nContact\nMichael Pearson michael.pearson@iac.gatech.edu\n404.894.2290\nEmail\nmichael.pearson@iac.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}