{"text": "Renewable Bioproducts Institute receives $1 million grant | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nRenewable Bioproducts Institute receives $1 million grant\nEndowment will use funds to enhance forest-related research\nFacebook\nTwitter\nEmail\nThe Institute of Paper Science and Technology is now the Renewable Bioproducts Institute.\nJan 29, 2016\n— Atlanta, GA\nThe Institute of Paper Chemistry Foundation Inc. and the Georgia Tech Foundation Inc. have announced a $1 million grant to establish the Institute of Paper Chemistry Legacy Endowment Fund. The fund is being established in recognition of the Institute of Paper Chemistry’s  (IPC) educational and leadership legacy and will be maintained as an endowment fund for support of Georgia Tech’s Renewable Bioproducts Institute (RBI). It will be directed to student and faculty initiatives and programs that enhance the mission of RBI as well as advance forest-related industries. This is not the first large gift from the Institute of Paper Chemistry Foundation (IPCF). In 2014, RBI received a $44 million grant, one of the single largest gifts in Georgia Tech’s history. That endowment currently supports 43 paper science and engineering students who advance the research mission of RBI through their faculty-directed research. Jim Ferris, chair of the IPCF, stated that the IPC Legacy Endowment is targeted to place funding right at the interface of Georgia Tech and forest-related manufacturing sites. “We want the funds generated by this grant to have the best chance of being of value to manufacturing sites,” he said. “The grant will support the development of new technology that will improve competitiveness of existing or future forest-based industries and will support the development of people at these manufacturing locations.” The establishment of this fund further affirms the Institute’s position as a leading driver of the future of the forest bioproducts industry and continues the commitment by the IPCF to strengthen RBI’s hand in developing the next generation of engineers and leaders for the industry, according to RBI Executive Director Norman Marsolan. “The IPC Foundation has played a pivotal role not only in the success found on this campus, but that of all who came before us – more than 85 years of industry leadership and research support,” he said. The primary purpose of the fund is to support faculty and students engaging with the forest-related industries through the RBI. The fund will be used to encourage interaction among industry, students and faculty through programs and events that offer value to forest-related company leadership. The fund will also promote programs that attract undergraduate and graduate students to forest-related industries. “Our members are our partners, providing financial support, but also insight as to what challenges and opportunities the industry is facing today and what the evolution of those will hold for tomorrow,” Marsolan said. “We want to strengthen and maintain our existing RBI industry members, but also cultivate new partners, extending our outreach. The benefits extend beyond the companies’ access and any financial contribution RBI receives. Our students receive a tremendous benefit by gaining a unique foothold in the industry and forming a relationship with a company, which many times translates into career opportunities.” The IPC\nwas founded in 1929 in Wisconsin to provide science, technology and education in support of the pulp and paper industry, a rapidly growing sector of the economy whose executives recognized the need for employees specifically trained in the scientific processes of papermaking.\nIn 1989, IPC, renamed the Institute of Paper Science & Technology, relocated to Atlanta and merged with Georgia Tech in 2003.  The evolution continued in 2014 with an expanded scope of work and research, as well as designation as one of Georgia Tech’s 11 interdisciplinary research institutes, the Renewable Bioproducts Institute. For more information, visit www.rbi.gatech.edu.\nAdditional Images\nRelated links\nRenewable Bioproducts Institute\nContact\nKelly B. Smith kelly.smith@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}