{"text": "Living Building Challenge: The Journey Begins | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nLiving Building Challenge: The Journey Begins\nAdvancing Tech’s master campus plan, the Living Building at Georgia Tech will demonstrate the most advanced measures of sustainability possible in the current built environment.\nFacebook\nTwitter\nEmail\nFeb 01, 2016\n— Atlanta, GA\nSince last fall, when the notion of developing a Living Building on Georgia Tech’s campus became a reality, there has been a flurry of planning activities that have involved a variety of stakeholders on campus and beyond to help ensure the success of this transformative project. “This is unlike any other project we have embarked upon here at Tech,” said Steve Swant, executive vice president for Administration and Finance. “It is more than an opportunity to create a one-of-a kind net positive facility in the Southeast. It is also an opportunity to learn how to leverage and integrate all of our resources — people and technologies — and use Tech’s campus as a living-learning laboratory to educate others. But with these unique opportunities, come challenges.” The Inherent Challenges of a Living Building Advancing Tech’s master campus plan, the Living Building at Georgia Tech will demonstrate the most advanced measures of sustainability possible in the current built environment. Meeting that challenge requires close adherence to some of the world’s most stringent building performance standards. This includes meeting obvious requirements like managing water and energy but also the not-so-obvious specifications like supporting health, happiness, equity, and beauty. To achieve full certification, a Living Building must meet all the program requirements established by the International Living Future Institute ( www.living-future.org ) over a full 12-month period of continued operations and full occupancy. “This project requires us to rethink how we approach the process of planning, designing, building, and even occupying this facility,” stated Scott Jones, director for Design and Construction in Facilities Management. “To meet this criteria, you have to define the end product before you even break ground. This requires a considerable amount of investment in time and resources upfront but creates efficiencies in the long run.” But adherence to building standards is just a part of the challenge. Fundamentally, Living Buildings serve as a catalyst to help reshape how we think about our built environment and its interaction with our immediate surroundings through innovations and adaptations in technology, education, policy, and cultural beliefs. To this end, one of the primary objectives is to ensure that the project is replicable, in terms of cost, materials, and technologies, so that others in the Southeast and around the world will be able to learn from Georgia Tech and build their own Living Buildings. Steps to Building a Platform for Success Since last fall when the Board of Regents gave its final approval to move forward with this project, an internal work group has been involved in an intensive planning phase — to get the right people engaged both on and off campus — to ensure long-term success for this project. With an anticipated groundbreaking in 2017 and occupancy slated for 2018, teams from across campus, including Capital Planning and Space Management, Facilities Management, Office of Campus Sustainability, College of Architecture, and Administration and Finance, are working to define how Tech will thoughtfully engage and integrate design and construction teams, students, faculty, and researchers. In November, Georgia Tech’s Planning and Design Commission and representatives from The Kendeda Fund ( www.kendedafund.org ) agreed upon the planned location — in the northwest vicinity of campus (see map on right) — for the project. This recommendation was based upon several factors including: Proximity to the Eco-Commons and, consequently, its ability to support the stormwater and landscape master plans. Ability to leverage natural resources including solar energy. Accessibility to the greater Tech community. Currently, three integrated design teams (architects, engineers, and landscape architects) are competing to win the project bid. This winter, these teams will generate ideas to present to Georgia Tech’s Planning and Design Commission in March, when the winning team will be announced. In addition, Professor Michael Gamble from the College of Architecture will lead an effort with faculty this spring semester to conduct four team-based, graduate-level design studios to generate additional ideas and excitement around this project. “The Living Building-certified facility at Georgia Tech will positively impact the graduate and undergraduate curriculum for many years to come,” says Gamble. “As educators of the next generation of architects and builders, we embrace this opportunity to rethink the status quo and envision how to make this concept a reality.” Once the final design and construction teams are announced, additional student, faculty, and community engagement opportunities will be forthcoming.\nAdditional Images\nRelated links\nGeorgia Tech Receives $30 Million Grant from The Kendeda Fund\nThe Kendeda Fund\nLiving Building Challenge\nCampus Master Plan\nContact\nRachael Pocklington Institute Communications\nAdditional information\nA leading philanthropic investor in civic and environmental programs in the Atlanta area and beyond, The Kendeda Fund has committed to investing $25 million over the next several years to privately fund 100 percent of the design and construction cost of the Living Building project as well as an additional $5 million to support programming activities.\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}