{"text": "Mineralogical Confirmation for Liquid Water on Present-day Mars | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMineralogical Confirmation for Liquid Water on Present-day Mars\nStudy finds hydrated salts on Mars, suggesting liquid water on the planet.\nFacebook\nTwitter\nEmail\nDark narrow streaks called recurring slope lineae flowing out of the walls of Garni Crater on Mars. The streaks are up to a few hundred meters in length. Photo is color enhanced. Image credit: NASA/JPL/University of Arizona.\nSep 28, 2015\n— Atlanta, GA\nA new study\nled by scientists at the Georgia Institute of Technology provides the strongest evidence yet that there is intermittent flowing liquid water on modern Mars. Using instruments on board NASA’s Mars Reconnaissance Orbiter (MRO), researchers measured spectral signatures of hydrated minerals on slopes where mysterious, possibly water-related streaks are found on the red planet. These streaks, known as recurring slope lineae (RSL), form and snake down the planet’s steep slopes during warm seasons when temperatures exceed -10 degrees Fahrenheit (-23 degrees Celsius). They disappear at colder times during the Martian year.   Lujendra Ojha, the Georgia Tech Ph.D. candidate who led the study, first noticed these puzzling features in High Resolution Imagine Science Experiment (HiRISE) images returned by the MRO spacecraft as an undergraduate at the University of Arizona in 2010. Ojha says spectral signatures of hydrated salts were visible in many RSL if they were relatively wide in diameter. The clincher came when the researchers looked at the same locations when RSL weren’t visible and the hydration signatures had disappeared. “Something is hydrating these salts, and it appears to be these streaks that come and go with the seasons,” said Ojha. “This means the water on Mars is briny, rather than pure. It makes sense because salts lower the freezing point of water. Even if RSL are slightly underground, where it’s even colder than the surface temperature, the salts would keep the water in a liquid form and allow it to creep down Martian slopes.” Up until this point, the recurrence of RSL during the warmest seasons suggested action of a volatile. The still cool ground temperatures suggested brines, but it was difficult to get the footprint of the orbital mapping spectrometers on such narrow features.   The researchers believe that the signatures are caused by hydrated minerals called perchlorates. They state that the hydrated salts most consistent with the chemical signatures are probably a mixture of magnesium perchlorate, magnesium chlorate and sodium perchlorate. Some perchlorates have been shown to keep liquids from freezing even when conditions are as cold as -70 degrees Celsius. On Earth, naturally produced perchlorates are concentrated in deserts, and some types of perchlorates can be used as rocket propellant. Perchlorates have previously been discovered on Mars. The Phoenix lander and Curiosity both found them in the planet’s soil, and some scientists believe that the Viking missions in the 1970s measured signatures of these salts. However, this study of RSL detected perchlorates in entirely different areas from where the landers explored. This is also the first time perchlorates have been identified from orbit. The team – which also included researchers from NASA Ames Research Center, the Johns Hopkins University Applied Physics Laboratory, University of Arizona, Southwest Research Institute and Laboratoire de Planétologie et Géodynamique – used data acquired by MRO’s Compact Reconnaissance Imaging Spectrometer for Mars (CRISM) to identify the spectral signatures. The orbiter began circling the planet in 2006. Four years later, RSL were discovered in MRO/HiRISE images, leading some scientists to think that liquid water might be flowing on the present-day Martian surface. “Almost 40 years after the Viking landers first analyzed the soils on Mars, it’s exciting that we’re able to expand the places where this important resource might be concentrated on the red planet,” said Mary Beth Wilhelm, another Georgia Tech Ph.D. candidate and NASA researcher who co-authored the paper. Their advisor, Georgia Tech Assistant Professor James Wray, says the current process for observing spectral signatures is a bit limited. Because of its fixed orbit, MRO sees the same locations of Mars at the same time every day. “We’re only able to receive data on these RSL locations in mid-afternoon, when the air is dry and the morning humidity is almost gone,” Wray said. “When future spacecraft arrive in the planet’s orbit, we could see larger, wetter RSL at earlier times of the day. This could just be the tip of the iceberg.”    Regardless, for Ojha, the new findings are more proof that the mysterious lines he first saw meandering down Martian slopes five years ago are indeed current-day water. “When most people talk about water on Mars, they’re usually talking about ancient water or frozen water,” he says. “But there’s more. This is the first spectral detection that unambiguously supports our liquid water-formation hypotheses for RSL.” The paper, “ Spectral evidence for hydrated salts in recurring slope lineae on Mars ,” is published in the journal Nature Geoscience. This work is partially funded by the National Science Foundation Graduate Research Fellowship Program under Grant No. DGE-1148903. The research was further supported by MDAP Grant No. NNX13AK01G.\nAny conclusions expressed are those of the principal investigator and may not necessarily represent the official views of the funding organizations.\nAdditional Images\nRelated links\nJames Wray Website\nSchool of Earth and Atmospheric Sciences\nRead the Study\nCSTAR Website\nContact\nJason Maderer National Media Relations maderer@gatech.edu 404-660-2926\nEmail\nmaderer@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}