{"text": "Survey Says CS Majors Have Highest Median Starting Salary at Georgia Tech | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nSurvey Says CS Majors Have Highest Median Starting Salary at Georgia Tech\nGeorgia Tech computer science graduates are in high demand from top tech companies.\nFacebook\nTwitter\nEmail\nMay 17, 2021\n— Atlanta, GA\nAs a Dacula High School senior,\nSabrina Seibel\nsays that computer science (CS) just didn’t click for her.\nBut with an established reputation for pushing herself – she was the kicker for her high school’s varsity football team –  Seibel says she decided to pursue CS anyway “because I felt it really challenged me .”\nLast week, she earned a Bachelor of Science in Computer Science degree from Georgia Tech.\nSeibel credits her ultimate success to the resources that the College of Computing provides to students. Taking advantage of tutoring, teaching assistants,\ncareer services programs , and\nentrepreneurial opportunities , she says one day everything finally “clicked.”\n“The College of Computing gives its students a strong technical background and comprehensive education that set me up for success,” said Seibel (BS CS 21).\nOther new alumni echoed this sentiment. “Being a student in the College of Computing allowed me to learn not only the foundations of computer science but also how to apply them,” said\nJoshua Suber . Having just earned a bachelor’s degree in computational media, Suber is heading to Carnegie Mellon University to work on a master’s degree in human-computer interaction (HCI).\nLike Suber, several new alumni from the class of 2021 are moving on to graduate programs at Georgia Tech, Cornell University, Stanford University, and other institutions.\nMost, however, including Seibel, have accepted jobs with Fortune 500 firms and other leading tech companies. According to a recent survey, the median starting salary for Georgia Tech students graduating with an undergraduate CS degree is just shy of $101,000.\nAt $100,981 – up from $93,000 in Spring 2016 – CS currently has the highest median starting salary of all majors at Georgia Tech.\nThe findings are from the\nGeorgia Tech Career and Salary Survey for 2019-2020 , which is the latest information available. The survey indicates that more than 89 percent of responding Georgia Tech graduating CS majors had job offers, while 87 percent had accepted positions. The median starting bonus for new Georgia Tech CS grads is $15,750.\nSeibel has accepted a job offer from Google. Google is one of the top companies hiring Georgia Tech CS graduates. This year, Amazon, Amazon Web Services, Microsoft, NCR, and Salesforce all hired more than one new CS alumni, mostly as software designers or software engineers.\nSeibel is joining Google’s Experiments Infrastructure team in New York City as a software engineer. Part of her job on the team – which is in charge of the rollout and analytics for new features being added to products like Gmail and Google Drive – will be to identify and fix issues before they make it to the company’s customers.\nAlthough a job search can be intimidating, Seibel says that the college started helping her to prepare as far back as her first year at Tech. With an active\ncorporate affiliates program\nboasting dozens of top high-tech companies and organizations, and two College career fairs each year, Seibel had lots of opportunities to meet directly with recruiters.\n“Given these experiences, I quickly became accustomed to what would’ve been high-pressure situations and became comfortable in interviews and eventually, in industry,” said Seibel.\nAnna Bonatz\n(BS CS 21) also attributes her success on the job market to the College’s career services programs.\n“I decided to schedule some mock interviews and sessions to talk about perfecting my interviewing and networking skills. This ultimately helped me land my job at Deloitte as it prepped me early for the multiple interviews and case studies that I had to complete,” said Bonatz, who is starting at Deloitte as a consultant.\nShe added, “My time in the College of Computing has been challenging but immensely rewarding. Every person I have met has pushed me to be my best and learn as much as I can while finding the joy and creativity within computing.”\nAdditional Images\nContact\nAlbert Snedeker, Communications Mgr. II albert.snedeker@cc.gatech.edu\nEmail\nalbert.snedeker@cc.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}