{"text": "What is New @ GT in Packaging? Advanced Molding Compounds for Fan-out and High-temperature Automotive Electronics | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nWhat is New @ GT in Packaging? Advanced Molding Compounds for Fan-out and High-temperature Automotive Electronics\nGeorgia Tech and its industry partners are developing a new class of molding compounds with superior thermal stability and reliability up to 250°C\nFacebook\nTwitter\nEmail\nNov 17, 2016\n— Atlanta, GA\nGeorgia Tech and its industry partners are developing a new class of molding compounds with superior thermal stability and reliability up to 250°C for a variety of applications, including high-power automotive electronics, and wafer and panel fan-out packages.\nHigh-temperature performance of molding compounds is becoming a key bottleneck for least three reasons: 1) integrated power modules with wide-bandgap (WBG) switches, gate drivers and controllers with ultra-high power densities, leading to escalating package temperatures; 2) under-the-hood automotive electronics; and 3) improvements in molded wafer and panel fan-out packages to address die drift, shrinkage and warpage issues.\nTraditional molding compounds are limited to temperatures below 175°C. Although a number of polymer materials such as polyimide, cyanate ester, and benzocyclobutene (BCB) polymers offer high-temperature stability, epoxies are still the preferred choice because of several advantages that include excellent interfacial adhesion, low moisture absorption, excellent molding processibility and low cost. Recent advances include incorporation of multi-aromatic structures in the epoxy resin to enhance thermal stability of the cured composite. However, undesirable changes in material properties such as resin decomposition and the loss of volatile species become inevitable. Loss in mechanical toughness and oxidative-degradation still remain as the other major limitations with epoxies.\nThe Georgia Tech team, which includes polymer chemists, package processing and reliability experts, is developing higher temperature molding compounds with higher thermal stability stability, higher thermal conductivity, enhanced fracture toughness, and improved resistance to oxidative-degradation. Thermal stability of epoxies is being enhanced by incorporating thermally-stable functionalities derived from cyanate esters. The thermal conductivity of molding compounds is being enhanced with functionalized boron nitride fillers, while the fracture toughness of molding compounds is being enhanced with rubber-coated silica fillers that serve as crack-energy absorbers. The simultaneous synergy of enhancing the thermal stability, thermal conductivity and crack resistance provides unique opportunities to develop high-performance epoxy molding compounds to address some of the limitations of current wafer and panel fan-out packages as well as emerging high-power automotive electronics.\nIn addition to synthesizing the high-temperature molding compounds, the ongoing project will also focus on thermo-mechanical reliability including fracture characterization at various material interfaces up to 250°C. Thermo-mechanical models are also being used to determine stress/strain distribution as well as energy available for crack propagation in packages that use high-temperature mold compounds. Such models will be used to obtain design guidelines for high-temperature applications.\nThis project is part of Georgia Tech industry consortium in System Scaling which includes about 40 end-user and supply chain companies.\nAbout the Authors\nChia-Chi Tuan is a PhD student under the advisement of Prof. CP Wong. Her research focus is on epoxy-based polymer composites.\nchiachituan@gatech.edu .\nDr. Jack Moon is a Research Engineer at the School of Materials Science and Engineering at Georgia Tech.\njack.moon@gatech.edu .\nProf. CP Wong is the Regents' Professor and Smithgall Institute Endowed Chair at the School of Materials Science and Engineering at Georgia Tech.\ncp.wong@mse.gatech.edu .\nProf. Suresh Sitaraman is Morris M. Bryan Jr. Professor with George W. Woodruff School of Mechanical Engineering at Georgia Tech.\nsuresh.sitaraman@me.gatech.edu .\nDr. Raj Pulugurtha is a Research Professor and Program Manager of RF, Power and High-Temperature Materials at GT PRC.\nraj.pulugurtha@ece.gatech.edu .\nProf. Rao Tummala is Joseph. M. Pettit Chair Professor in ECE and MSE and Director of Georgia Tech’s Packaging Research Center.\nrao.tummala@ece.gatech.edu .\nAdditional Images\nContact\nKaren May\nMarketing & Communications Coordinator\nPackaging Research Center\nkaren.may@ece.gatech.edu\n(404) 385-1220\nEmail\nkaren.may@ece.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}