{"text": "Exoplanet Axis Study Boosts Hopes of Complex Life, Just Not Next Door | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nExoplanet Axis Study Boosts Hopes of Complex Life, Just Not Next Door\nAn exoplanet study on axis tilts raises hopes that advanced life may exist elsewhere in the universe.\nFacebook\nTwitter\nEmail\nThe Alpha Centauri group is the closest star - or solar - system outside of our own at a distance of 4.3 lightyears, and it can be found in the night sky in the constellation Centaurus. The stars Alpha Centauri A and Alpha Centauri B comprise a binary system, in which the two stars orbit one another, and close by is an additional faint red dwarf star, Alpha Centauri C, also called Proxima Centauri. Some astronomers have hoped to someday find an exoplanet capable of harboring advanced life in the system, but\nNov 20, 2019\n— Atlanta, GA\n“They’re out there,” goes a saying about extraterrestrials. It would seem more likely to be true in light of\na new study\non planetary axis tilts.\nAstrophysicists at the Georgia Institute of Technology modeled a theoretical twin of Earth into other star systems called binary systems because they have two stars. They concluded that 87% of exo-Earths one might find in binary systems should have axis tilts similarly steady to Earth’s, an important ingredient for climate stability that favors the evolution of complex life.\n“Multiple-star systems are common, and about 50% of stars have binary companion stars. So, this study can be applied to a large number of solar systems,” said Gongjie Li, the study’s co-investigator an  assistant professor at Georgia Tech’s School of Physics .\nSingle-star solar systems like our own with multiple planets appear to be rarer.\nAlpha Centauri B? Wretched\nThe researchers started out contrasting how the Earth’s axis tilt, also called  obliquity , varies over time with the variation of Mars’ axis tilt. Whereas our planet’s mild obliquity variations have been great for a livable climate and for evolution, the wilder variations of Mars' axis tilt may have helped wreck its atmosphere, as explained in the section below.\nThen the researchers modeled Earth into  habitable, or Goldilocks, zones  in Alpha Centauri AB – our solar system’s nearest neighbor, a binary system with one star called “A” and the other “B.” After that, they expanded the model to a more universal scope.\n“We simulated what it would be like around other binaries with multiple variations of the stars’ masses, orbital qualities, and so on,” said  Billy Quarles, the study’s principal  investigator and a research scientist in Li’s lab. “The overall message was positive but not for our nearest neighbor.”\nAlpha Centauri A actually didn’t look bad, but the outlook for mild axis dynamics on an exo-Earth modeled around star B was wretched. This may douse some hopes because Alpha Centauri AB is four lightyears away, and a  mission named Starshot with big-name backers  plans to launch a space probe to examine the system, including for signs of advanced life.\nThe researchers published their study, which was co-led by  Jack Lissauer from NASA  Ames Research Center, in  Astrophysical Journal  on November 19, 2019, under the title:\nObliquity Evolution of Circumstellar Planets in Sun-like Stellar Binaries . The research was funded by the NASA Exobiology Program.\nNo exoplanets have been confirmed around A or B; an exoplanet has been confirmed around the nearby red dwarf star Proxima Centauri, but that planet is likely to be uninhabitable.\n[Ready for graduate school?  Here's how to apply to Georgia Tech. ]\nEarth? Just right\nEven with its ice ages and hot phases, Earth’s climatological framework has been calm for hundreds of millions of years - in part because of its mild orbital and axis-tilt dynamics - allowing evolution to take big strides. Sharply varying dynamics, and thus climate, like on Mars could stand to regularly kill off advanced life, stunting evolution.\nEarth’s orbit around the sun is on a slight incline that seesaws gently and very slowly through a slight precession, a kind of oscillation. As Earth revolves, it shifts position relative to the sun, circling it a little like a  spirograph drawing.  The orbit also  precesses in shape  between slightly more and slightly less oblong over 100,000-year periods.\nEarth’s axis tilt precesses  between 22.1 and 24.5 degrees over the course of 41,000 years. Our large moon stabilizes our tilt through its gravitational relationship with Earth, otherwise, bouncy gravitational interconnections with Mercury, Venus, Mars, and Jupiter would jolt our tilt with resonances.\n“If we didn’t have the moon, Earth’s tilt could vary by about 60 degrees,” Quarles said. “We’d look maybe like Mars, and the precession of its axis appears to have contributed to a loss of atmosphere.”\nMars’ axis precesses between 10 degrees and 60 degrees every 2 million years. At the 10-degree tilt, the atmosphere condenses at the poles, creating caps that lock up a lot of the atmosphere in ice. At 60 degrees, Mars could grow an ice belt around its equator.\nUniverse? Hopeful\nIn Alpha Centauri AB, star B, about the size of our sun, and the larger star, A, orbit one another at about the distance between Uranus and our sun, which is very close for two stars in a binary system. The study modeled variations of an exo-Earth orbiting either star but concentrated on a modeled Earth orbiting in the habitable zone centered around B, with A being the orbiting star.\nA’s orbit is very elliptical, passing close by and then moving very far away from B and slinging powerful gravity, which, in the model, overpowered exo-Earth’s own dynamics. Its tilt and orbit varied widely; adding our moon to the model didn’t help.\n“Around Alpha Centauri B, if you don’t have a moon, you have a more stable axis than if you do have a moon. If you have a moon, it’s pretty much bad news,” Quarles said.\nEven without a moon and with mild axis variability, complex, Earthlike evolution would seem to have a hard time on the modeled exo-Earth around B.\n“The biggest effect you would see is differences in the climate cycles related to how elongated the orbit is. Instead of having ice ages every 100,000 years like on Earth, they may come every 1 million years, be worse, and last much longer,” Quarles said.\nBut a sliver of hope for Earthlike conditions turned up in the model: “Planetary orbit and spin need to precess just right relative to the binary orbit. There is this tiny sweet spot,” Quarles said.\nWhen the researchers expanded the model to binary systems in the broader universe, the probability of gentle obliquity variations ballooned.\n“In general, the separation between the stars is larger in binary systems, and then the second star has less of an effect on the model of Earth. The planet’s own motion dynamics dominate other influences, and obliquity usually has a smaller variation,” Li said. “So, this is quite optimistic.”\nAlso READ:  Observing a “Cosmic Symphony” Using Gravitational Wave Astronomy\nThe research was funded by the NASA Exobiology Program (grant NNX14AK31G). Any findings, conclusions, or recommendations are those of the authors and not necessarily of the NASA Exobiology Program.\nWriter & Media Representative : Ben Brumfield (404-272-2780)\nEmail:  ben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nAdditional Images\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}