{"text": "Apprenticeship Program Helps Students Gain Skills | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nApprenticeship Program Helps Students Gain Skills\nThe Georgia Consortium of Advanced Technical Training (GA CATT) program Georgia high school students an opportunity to get an associate's degree and graduate with technical skills they can use in their professional careers.\nFacebook\nTwitter\nEmail\nGeorgia state governermnent and education leaders stand with Coweta County high school students partirticipating in the Georgia Consortium for Advanced Technical Training program (GA CATT) at Lt. Gov. Casey Cagle’s 10th Annual Business &amp; Education Summit in Griffin on Monday, Nov. 13. Launched in 2016, GACATT allows them to graduate on time with a high school diploma, earn technical college credentials, while obtaining real, hands-on experience in a workplace and technical skills that they can us\nNov 15, 2017\n— Griffin, GA\nAt 4 a.m. on many mornings, 17-year-old Cole McKeehan is already at work at E.G.O. North America in Newnan, Georgia.\nMcKeehan, a junior at Northgate High School in Newnan, is a student apprentice at E.G.O., which makes radiant heating elements and electronic components such as touch controls and induction heaters at the facility.\nHe is in his second year of the program — the Georgia Consortium for Advanced Technical Training (GA CATT) — and is gaining practical experience in machining and lathing. McKeehan is developing those skills under an apprenticeship program that would let him graduate high school with technical college credits. He can use those credits toward earning an associate’s degree in industrial mechanics from West Georgia Technical College.\n“I think this is a great program,” McKeehan said. “I will graduate with an associate’s degree and continue on to college for a four-year degree in engineering or tool and die.”\nMcKeehan was one of several teens in GA CATT who shared their experiences Nov. 13 at Georgia Lt. Gov. Casey Cagle’s 10 th\nAnnual Business & Education Summit.\nThe session where the teens spoke, held on the first day of the two-day summit and hosted by the Griffin Region College and Career Academy, brought Georgia’s business and education leaders together for a series of collaborative meetings.\nThe hope is that these meetings will lead to innovative ideas and initiatives to better prepare high school students for the demands of a 21 st -century workforce.\nThe GA CATT session, which also featured business leaders and officials from the Georgia Institute of Technology who worked on its development and implementation, was designed to answer questions from summit attendees, as state officials look to expand it statewide.\n“Our GA CATT has had great success,” Cagle said. “We’re in our second year now and to be able to listen to the students and the impact that it’s having on their lives and how motivated and focused and determined they are — it’s a win for them, it’s a win for the community, and it’s certainly a win for industry as well.”\nThe Georgia initiative was launched in 2016 with support from the German American Chamber of Commerce of the Southern U.S., the Technical College System of Georgia, West Georgia Technical College, and the Central Educational Center, as well as Georgia Tech’s Georgia Manufacturing Extension Partnership (GaMEP) and Safety and Health Consultation Program.\nThe GA CATT program seeks to follow the German apprenticeship dual education model and begin with 10 th\ngraders, the only program in the U.S. currently doing so.\nAs in Germany, GA CATT requires participating Georgia high school sophomores, juniors, and seniors to spend 70 percent of their time working at their host company and the remaining 30 percent in the classroom.\nThe 70-30 split is designed to allow them to graduate on time with a high school diploma and earn technical college credentials while obtaining real, hands-on experience in a workplace and technical skills that they can use to build their careers. In addition, apprentices have the opportunity to attain a German Certification in Industrial Mechanics that is accepted in Europe and beyond as evidence of their skill and knowledge.\nThe student apprentices are paid for their time at the company, earning $8 an hour when they start and $12 per hour as seniors.\nTwo German companies with operations in Newnan — Grenzebach Corp. and E.G.O. North America — were committed to launching GA CATT and served as the catalysts for the program.\nThe companies asked Larry Alford, GaMEP’s South Metro Atlanta region manager, to leverage his long-term relationships with local companies to invite them to join the program. GA CATT began with eight companies and 10 apprentices.\nGaMEP, which works with manufacturers to innovate, increase top-line growth, and reduce bottom-line costs, also supported the GA CATT initiative, as did the Institute’s Safety and Health Consultation Program.\n“Collaborating with industry from the start has been GA CATT’s secret to success. The educators and the German-American Chamber are key players, but the industry’s commitment will determine its growth and expansion,” Alford said. “Much of the focus rightfully is placed on the students, but equally important are the process and support systems that develop the company mentors, those who are tasked with guiding the activities of the students to meet curriculum requirements and to adequately prepare the apprentices to succeed in the program and at work.”\nThat commitment on all sides also helps manufacturers build a pipeline of talent, said David Keller, E.G.O. North America’s president and managing director of operations. In an industry that has historically had a difficult time finding a skilled workforce, these companies are looking to the future, by developing interest and relationships with talented students early on, he said.\nThe goal is that after graduation, the students will work for those companies where they apprenticed.\nJenny Houlroyd, an industrial hygienist with Tech’s Safety, Health, and Environmental Services program, is helping GA CATT companies understand and comply with U.S. labor laws that provide flexibility for apprentices under 18 to enter the workforce as student-learners.\nIn 2017, GA CATT added two additional clusters, centered in Rockdale & Newton Counties and Spalding County. Each cluster includes local manufacturers, their local college and career academies, and the local Technical College. Alford facilitates the implementation teams in each cluster. A total of 18 manufacturers and 28 students currently participate in the program.\nAdditional Images\nRelated links\nGeorgia Manufacturing Extension Partnership\nSafety, Health, and Environmental Services\nGeorgia Consortium for Advanced Technical Training\nContact\nPéralte C. Paul\nCommunications and Marketing Manager\nEnterprise Innovation Institute (EI 2 )\n404.894.8727\nEmail\nperalte.paul@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}