{"text": "Georgia Tech Focus Program Hosted Virtually For First Time In 29-Year History | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Focus Program Hosted Virtually For First Time In 29-Year History\nThe 2021 Focus Program was hosted virtually for the first time in its 29-year history, bringing together over 300 registered participants in a multidimensional interactive virtual platform.\nFacebook\nTwitter\nEmail\nSybrina Atwaters, Tech alumnus, director of OMED: Educational Services, and program director of Focus, announced seven Focus award recipients during the 2021 program.\nJan 20, 2021\n— Atlanta, GA\nFor almost three decades, the  Georgia Tech Focus Program  has attracted top, diverse students from across the nation to its campus. The annual graduate-recruitment weekend program provides participants an overview of Georgia Tech’s graduate degree programs, including information on financial resources and assistance with the application and decision-making processes involved in selecting a graduate school. Held the preceding weekend before the federal Martin Luther King Jr. holiday, the 2021 program was hosted virtually for the first time in its 29-year history.\nThis year’s program brought together over 300 registered participants in a multidimensional interactive virtual platform, where 60% of participants were current and former Focus Scholars.\nThe typically three-day program was shortened to two days. However, the program still offered participants the same host of opportunities to learn about graduate school at the Institute as its in-person weekend programs have provided.\n“Despite the challenges presented by the Covid-19 pandemic, we made the decision to continue the great Focus tradition by utilizing a virtual format which allows us to continue our commitment to making Georgia Tech the most diverse and inclusive technology-focused university in our nation,” said Vice President for Institute Diversity, Equity, and Inclusion Archie Ervin to participants on the opening evening of the program.\n“Even with our virtual format this year, our commitments and programmatic opportunities provided for this year’s Focus Program remain the same as in past years. Georgia Tech’s president, members of our executive leadership team, our academic deans, faculty, and staff are fully engaged to ensure that your 2021 Focus experience will allow you to do what previous Focus participants have done the past 28 years: that is to learn more about the Georgia Tech graduate experience, to explore academic opportunities that align with your educational goals and aspirations, and to meet with faculty and staff who are eager to help you gain the insights and information you need to determine if the Tech graduate experience meets the expectations you have for your career goals.”\nPresident Ángel Cabrera, who earned two graduate degrees from Georgia Tech before becoming the Institute’s 12th president 24 years later, spoke to participants about the program.\n“As one of the nation’s premiere diversity recruitment programs, Focus has brought more than 3,000 students from across the U.S. to Georgia Tech, and we're proud to have six former Focus Scholars among our very own faculty, including the new dean of the College of Engineering, Dr. Raheem Beyah,\" he said. \"It’s quite fitting that Focus hosts its annual program preceding the King holiday because its mission stems directly from Dr. King’s message of diversity, justice, and excellence.\"\nSybrina Atwaters, Tech alumnus, director of OMED: Educational Services and program director of Focus, announced seven Focus award recipients: Brooke Bosley, Kenneth De Jesus, Julia Harrer, Rachel Harvey, Daniel Okegbu, Kantwon Rogers, and Preety Shakya. Two additional Focus Scholars received 2021 Women of Color Initiative (WOCI) Impact Focus awards: De' Aira Bryant and Nettie Brown.\n“The 2021 cohort was unique in a few ways: the first virtual cohort and the first cohort fully empowered to navigate their own Focus experience,” Atwaters said. “At their fingertips, the participants had the ability to capture breakout sessions, issue one-on-one networking requests, instantly share contact details with faculty and alumni, manage direct access to all speakers and panelists, and have on-demand virtual visits to Atlanta attractions.”\nThe program concluded with a\nGold Table discussion\nmoderated by Tech alumnus and Atlanta City Councilmember Andre Dickens, titled “Women of Color in Tech: Shaping the City of Atlanta and Its Future,” featuring Nisha Botchwey, associate dean of Academic Programs with Georgia Tech Professional Education and an associate professor with the School of City and Regional Planning, and Sheila Isbell, chief of Georgia Tech Research Institute’s Software Engineering & Analytics Division. The group discussed a range of topics including how they chose their graduate school career path, the importance of diversity in graduate programs, and self-advocacy.\n“It’s good to have your own advisory board, but they can’t all look like you,” Botchwey said. “You have to have people in spaces that you’re not in yet. You have to be willing to stretch yourself” she continued.\nIsbell added, in response to a question regarding women of color in tech, “There is a lot of work to do there. As far as being supported or having our work recognized, we are not seeing that. We have to be willing to advocate for each other. We cannot be afraid to self-advocate. We even have to self-nominate sometimes.”\n“I am deeply grateful to the more than 80 members of the Georgia Tech community -– deans, chairs, faculty, staff, alumni, and graduate students who came together to make the many components of Focus 2021 possible. Their efforts exhibit Georgia Tech’s commitment to be a leader in diversity, excellence, equity, and inclusion. It is my honor to continue the Focus legacy and lead these efforts,” Atwaters concluded.\nThis year’s program was\ndedicated to Shayla Chavis , a North Carolina Central University student and 2020 Focus participant who died last August.\nThe 2021 program was supported by Institute Diversity, Equity, and Inclusion, the\nOffice of Minority Educational Development , and the Hopper-Dean Foundation.\nTo learn more about the Focus Program, visit  focus.gatech.edu .\nAdditional Images\nContact\nCourtney Hill\nCommunications Manager\nInstitute Diversity, Equity, and Inclusion\ncourtney.hill@gatech.edu\nEmail\ncourtney.hill@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}