{"text": "From the Butterfly's Wing to the Tornado: Predicting Turbulence | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nFrom the Butterfly's Wing to the Tornado: Predicting Turbulence\nRemember the adage about a flapping butterfly's wing triggering a tornado? Physicists are getting better at predicting the wiles of turbulence.\nFacebook\nTwitter\nEmail\nNOAA stock press handout image of a tornado. Please credit: NOAA/OAR/ERL/NSSL. To be used in turbulence story. (Do not use out of context.)\nMar 15, 2017\n— Atlanta, GA\nAn old adage holds that the flap of a butterfly’s wing in Brazil can trigger a tornado in Texas weeks later. Though chaos theory says it’s basically impossible to compute exactly how that might happen, Georgia Tech scientists are making new advances in getting math around the swirly phenomenon behind it called turbulence.\nRecent progress by physicists from the Georgia Institute of Technology could one day help sharpen weather forecasts and extend their range by making better use of masses of weather and climate data.\nTurbulence can curve as a puff of air, swirl past a river bend or churn as a hurricane, and though its curlicues may appear random, turbulence lays down signature patterns that the physicists are investigating.  They have developed a simple mathematical model that has helped them show how turbulent flows will evolve over intervals .\nAnd, in a novel experiment, they verified their predictions physically in a two-dimensional turbulent flow produced in a lab.\n‘Butterfly Effect’ catchphrase\nThe new Georgia Tech research befits the origins of that adage.\nIt was coined more than 55 years ago by  MIT meteorology professor Edward Lorenz  after he established that tiny forces influenced major weather enough to throw long-range forecasts for a loop. The title of his paper, “Predictability: Does the Flap of a Butterfly’s Wing in Brazil Set Off a Tornado in Texas?” morphed into the well-known catchphrase.\nMichael Schatz  and  Roman Grigoriev ,  professors in Georgia Tech’s  School of Physics , along with graduate researchers Balachandra Suri and Jeffrey Tithof, published their research results online in the journal  Physical Review Letters  on Wednesday March 15, 2017 . The research was funded by the National Science Foundation.\nOrder in chaos\nFor hundreds of years, while scientists used math to get a grip on  Newton’s falling apple , substantiate the  Theory of Relativity  and theorize the existence of  the Higgs boson , turbulence has been like wet soap in math’s grasp. But for all its elusiveness, turbulence impresses with visibly coherent, recurring, recognizable shapes.\nFluid swirls quickly establish themselves then shift or disappear, but they reappear persistently at different locations, producing transient and varying, yet repeating patterns.\n“People have seen these patterns in turbulent flows for centuries, but we’re finding ways to relate the patterns to mathematical equations describing fluid flows,” Grigoriev said. Some recurrent patterns, in particular, interest Grigoriev and Schatz. They’re called  exact coherent structures (ECSs).\nThey give the physicists convenient entry points into computing predictions about what turbulence will do next.\nTurbulent flow snapshots\nBut what are these  exact coherent structures ? Visually, in turbulence, they may show up as fleeting moments when the patterns stop changing. And it can look like the flow is temporarily slowing down.\nTo the untrained eye, an ECS doesn’t look much different from the rest of the swirls and curls, but one can learn to spot them. “That’s exactly how we go about finding them,” Schatz said. “We watch the turbulence, continually taking snapshots. The flow is moving around, moving around. We look for the instant when it slows down the most, and we pick out a snapshot.”\n“We feed that into the mathematical model,” Schatz said, “and it indicates that we’re close, and shows what the math looks like at that point.” That math solution describes a point in the turbulent flow that can be worked with to compute a prediction of what the turbulence will do next.\nTo understand what an  exact coherent structure  is dynamically, we need to step back from what turbulence looks like visually with bunches of curls and swirls. Instead, let’s look at a turbulent flow as a single physical entity by translating it into a crude metaphor, a swinging pendulum -- with some marked oddities.\nPendulum on its head\nThis is going to get a bit abstract: First,  invert the pendulum .\nInstead of picturing the bottom point of a normal pendulum’s swing, the equilibrium, as a stable point in a stable swing, now, with the upside-down pendulum, the equilibrium is the top-most point. And it’s unstable. Also, it doesn’t swing in just two directions but in all directions.\nA turbulent flow’s reliable patterns reflect dynamics that are back-and-forth-to-and-fro but in all kinds of variations.\nAs the metaphorical pendulum swings up toward its peak, it comes to a near but never complete stop. Instead it flops over to some other side. That near-halt point is analogous to an  exact coherent structure , but there are a few more kinks in the metaphor.\n“If we change initial dynamics ever so slightly, an inverted pendulum can swing past its  unstable equilibrium  at the peak, or it can stop and then start moving in the opposite direction. In the same way, the turbulent flow can evolve in various different ways after passing by an ECS,” Grigoriev said.\nMultiple  exact coherent structures  with varying qualities turn up in a turbulent flow.\nTurbulence roads to ECS cities\nThat all may feel unusual for a reason.\n“Usually, people like to look at stable things that are unchanging like the even, symmetric normal pendulum,” Schatz said. “It turns out it’s really these unstable patterns that form a rough core alphabet that we use to build a sort of predictive theory.”\nStaying with the dynamics of that floppy inverted pendulum, now picture each  exact coherent structure  as being a city on a map. There are paths that guide the turbulent flow “traffic” toward, from, and around each city just like roadways. “This road map around and between cities does not change in time, which enables us to predict the evolution of the flow,” Grigoriev said.\nECSs occur regularly, almost like clockwork, opening up the possibility of refining predictions at regular intervals.\nExact coherent structures  were already known to exist, Schatz said. “What no one has done before is demonstrate in a lab experiment how they can be harnessed to describe dynamics, the behavior evolving in time, which is really what you need for prediction.”\nMining weather data\nIn the 19 th  century, math equations were developed to describe the basic flow of fluids. Those who took high school physics may remember  Newton’s Second Law  relating forces, acceleration and mass. The  Navier-Stokes equations ,  used in this study, apply it to fluids.\nTurbulence is challenging to describe mathematically because its swirls contain myriad dimensions, with the flow in each small region appearing to dance to its own tune. But there is clear order that emerges upon finding  exact coherent structures .\nTo make their predictions, Schatz and Grigoriev’s research team devised a way to mathematically connect that high dimensionality to the much simpler roadway concept.\nThey broke down the turbulent flow into regions, each small enough to apply the equations, then used their solutions to precisely place the flows on the road map.\nToday, the compendium of  data on weather and climate , the shape of ocean floors, dimensions of the atmosphere, effects of gravity, rotation, or concentrations of dissolved minerals is impressive and growing.\nPredictive methods like those in this research offer paths into that data to extract better predictions from it.\nThe research was funded by the National Science Foundation under grants  CMMI-1234436 and DMS-1125302. DOI: 10.1103/PhysRevLett.118.114501 .\nAdditional Images\nContact\nWriter and contact: Ben Brumfield\n(404) 660-1408\nEmail\nben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}