{"text": "From Seafloor to Space: New Bacterial Proteins Shine Light on Climate and Astrobiology | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nFrom Seafloor to Space: New Bacterial Proteins Shine Light on Climate and Astrobiology\nGeorgia Tech researchers have uncovered eco-friendly bacterial proteins that stabilize methane clathrates, offering a green solution to climate challenges and potential implications for astrobiology.\nFacebook\nTwitter\nEmail\nSep 26, 2023\nGigatons of greenhouse gas are trapped under the seafloor, and that’s a good thing. Around the coasts of the continents, where slopes sink down into the sea, tiny cages of ice trap methane gas, preventing it from escaping and bubbling up into the atmosphere.\nWhile rarely in the news, these ice cage formations, known as methane clathrates, have garnered attention because of their potential to affect climate change. During offshore drilling, methane ice can get stuck in pipes, causing them to freeze and burst. The 2010 Deepwater Horizon oil spill is thought to have been caused by a buildup of methane clathrates.\nBut until now, the biological process behind how methane gas remains stable under the sea has been almost completely unknown. In a breakthrough study, a cross-disciplinary team of Georgia Tech researchers discovered a previously unknown class of bacterial proteins that play a crucial role in the formation and stability of methane clathrates.\nA team led by\nJennifer Glass , associate professor in the\nSchool of Earth and Atmospheric Sciences , and\nRaquel Lieberman , professor and Sepcic-Pfeil Chair in the\nSchool of Chemistry and Biochemistry , showed that these novel bacterial proteins suppress the growth of methane clathrates as effectively as commercial chemicals currently used in drilling, but are non-toxic, eco-friendly, and scalable. Their study, funded by NASA, informs the search for life in the solar system, and could also increase the safety of transporting natural gas.\nThe research,\npublished in the journal\nPNAS Nexus , underscores the importance of fundamental science in studying Earth’s natural biological systems and highlights the benefits of collaboration across disciplines.\n“We wanted to understand how these formations were staying stable under the seafloor, and precisely what mechanisms were contributing to their stability,” Glass said. “This is something no one has done before.”\nSifting Through Sediment\nThe effort started with the team examining a sample of clay-like sediment that Glass acquired from the seafloor off the coast of Oregon.\nGlass hypothesized that the sediment would contain proteins that influence the growth of methane clathrate, and that those proteins would resemble well-known antifreeze proteins in fish, which help them survive in cold environments.\nBut to confirm her hypothesis, Glass and her research team would first have to identify protein candidates out of millions of potential targets contained in the sediment. They would then need to make the proteins in the lab, though there was no understanding of how these proteins might behave. Also, no one had worked with these proteins before.\nGlass approached Lieberman, whose lab studies the structure of proteins. The first step was to use DNA sequencing paired with bioinformatics to identify the genes of the proteins contained in the sediment.\nDustin Huard , a researcher in Lieberman’s lab and first author of the paper, then prepared candidate proteins that could potentially bind to the methane clathrates. Huard used X-ray crystallography to determine the structure of the proteins.\nCreating Seafloor Conditions in the Lab\nHuard passed off the protein candidates to\nAbigail Johnson , a former Ph.D. student in Glass’ lab and co-first author on the paper, who is now a postdoctoral researcher at the University of Georgia. To test the proteins, Johnson formed methane clathrates herself by recreating the high pressure and low temperature of the seafloor in the lab. Johnson worked with\nSheng Dai , an associate professor in the\nSchool of Civil and Environmental Engineering , to build a unique pressure chamber from scratch.\nJohnson placed the proteins in the pressure vessel and adjusted the system to mimic the pressure and temperature conditions required for clathrate formation. By pressurizing the vessel with methane, Johnson forced methane into the droplet, which caused a methane clathrate structure to form.\nShe then measured the amount of gas that was consumed by the clathrate — an indicator of how quickly and how much clathrate formed — and did so in the presence of the proteins versus no proteins. Johnson found that with the clathrate-binding proteins, less gas was consumed, and the clathrates melted at higher temperatures.\nOnce the team validated that the proteins affect the formation and stability of methane clathrates, they used Huard's protein crystal structure to carry out molecular dynamics simulations with the help of\nJames (JC) Gumbart , professor in the\nSchool of Physics . The simulations allowed the team to identify the specific site where the protein binds to the methane clathrate.\nA Surprisingly Novel System\nThe study unveiled unexpected insights into the structure and function of the proteins. The researchers initially thought the part of the protein that was similar to fish antifreeze proteins would play a role in clathrate binding. Surprisingly, that part of the protein did not play a role, and a wholly different mechanism directed the interactions.\nThey found that the proteins do not bind to ice, but rather interact with the clathrate structure itself, directing its growth. Specifically, the part of the protein that had similar characteristics to antifreeze proteins was buried in the protein structure, and instead played a role in stabilizing the protein.\nThe researchers found that the proteins performed better at modifying methane clathrate than any of the antifreeze proteins that had been tested in the past. They also performed just as well as, if not better than, the toxic commercial clathrate inhibitors currently used in drilling that pose serious environmental threats.\nPreventing clathrate formation in natural gas pipelines is a billion-dollar industry. If these biodegradable proteins could be used to prevent disastrous natural gas leaks, it would greatly reduce the risk of environmental damage.\n“We were so lucky that this actually worked, because even though we chose these proteins based on their similarity to antifreeze proteins, they are completely different,” Johnson said. “They have a similar function in nature, but do so through a completely different biological system, and I think that really excites people.”\nMethane clathrates likely exist throughout the solar system — on the subsurface of Mars, for example, and on icy moons in the outer solar system, such as Europa. The team’s findings indicate that if microbes exist on other planetary bodies, they might produce similar biomolecules to retain liquid water in channels in the clathrate that could sustain life.\n“We’re still learning so much about the basic systems on our planet,” Huard said. “That’s one of the great things about Georgia Tech — different communities can come together to do really cool, unexpected science. I never thought I would be working on an astrobiology project, but here we are, and we’ve been very successful.”\nCitation : Dustin J E Huard, et al.\nMolecular basis for inhibition of methane clathrate growth by a deep subsurface bacterial protein ,  PNAS Nexus , Volume 2, Issue 8, August 2023.\nDOI :  https://doi.org/10.1093/pnasnexus/pgad268\nFunding : National Aeronautics & Space Administration, National Science Foundation, National Institutes of Health, American Chemical Society Petroleum Research Fund\nGeorgia Tech co-authors included Zixing Fan, Ph.D. student, and two undergraduates, Lydia Kenney (now a Ph.D. student at Northwestern University) and Manlin Xu (now a Ph.D. student in the MIT-Woods Hole Oceanographic Institution Joint Program). Ran Drori, associate professor of chemistry at Yeshiva University, also contributed.\nAdditional Media\nContact\nCatherine Barzler, Senior Research Writer/Editor\nInstitute Communications\ncatherine.barzler@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}