{"text": "Women’s Health Takes Center Stage at InVenture Prize 2024 | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nWomen’s Health Takes Center Stage at InVenture Prize 2024\nWinner Lilypad Health disrupts invasive healthcare practices with an accessible alternative.\nFacebook\nTwitter\nEmail\nInVenture Prize 2024 Winners, Lilypad Health. Photo by Allison Carter\nMar 14, 2024\nAfter months of fierce competition, Lilypad Health has been crowned this year’s\nInVenture Prize\nwinners. The team's invention, an at-home, non-invasive menstrual blood screening tool, proposes an alternative to traditional practices in women’s health while making testing more accessible to the uninsured.\nTeammates Rhea Prem, Netra Gandhi, and Ethan Damiani have known each other since their first year and embarked on this transformative journey as a capstone project. Recognizing the significant gap in access to care and preventive health measures, especially in women's health, the team set out to develop a solution that would empower individuals with greater control over their health.\nLilypad Health offers less invasive testing for a range of crucial health indicators, including HPV, cervical cancer, HbA1C, hormones and fertility health, PCOS, and endometriosis. By enabling women to conduct these tests in the comfort and privacy of their own homes, Lilypad Health is poised to revolutionize the way women approach their health and wellness.\nTheir efforts are not just about developing a product — the team is actively working to break down stigmas surrounding menstruation and period-related health issues, fostering a more open and inclusive dialogue around women's health. Their work has been recognized with an AIDS Research Award and was featured in\nWomen’s Health\nearlier this year.\nWith two prototypes already in development and testing underway for preserved biomarkers for sample presentation, Lilypad Health is making significant strides toward bringing their innovative solution to the masses. And they aren’t the only ones who feel their invention is urgently needed — the United States Patent and Trademark Office granted the team a patent acceleration certificate and they are currently in talks with menstrual pad manufacturers about partnering to make their product even more widely available. When asked what they would do with the $20,000 InVenture Prize money, Rhea replied, “Work on getting our product to market.”\nLilypad Health’s vision of becoming a leading women's health company is well within reach. In addition to the award money, the team has gained a coveted spot in Georgia Tech’s\nCREATE-X\nStartup Launch, a 12-week summer program where they will receive coaching and mentorship from experienced entrepreneurs and have the opportunity to pitch their model to investors.\nYou can learn more about Lilypad Health and their transformative invention on their\nwebsite .\nSecond place and $10,000 went to Makr Papr, a team of computer science, computer engineering, and mechanical engineering students who have developed an innovative, patent-pending technology that promises to replace name tags and event apps at conferences with an easy-to-use, tap-and-go printable paper.\n“We want to show others that it doesn't matter where you come from or your background,” says the team. “If we can do it, you can do it.”\nThe People’s Choice Award, selected through audience voting during the live show, went to team Candor. Comprising four computer science majors, this team invented what they call a “Constituent Relationship Management (CRM)” platform that aims to make “democratic participation more accessible and effective for everyone.” The platform offers a streamlined reporting and tracking process to expedite infrastructure maintenance for city governments and municipalities.\nLearn more about all of the 2024 finalists on the\nInVenture Prize\nwebsite, and if you missed the live show, check back for a link to the recording.\nAdditional Media\nInVenture Prize 2024 Second Place Winners, Makr Papr. Photo by Allison Carter\nInVenture Prize 2024 People's Choice Winners, Candor. Photo by Allison Carter\nRelated links\nGeorgia Tech InVenture Prize\nInVenture Prize 2024 Finalists\nContact\nRachael Greene\nOffice of Undergraduate Education\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}