{"text": "Hackathon helps students invent musical instruments | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nHackathon helps students invent musical instruments\nDesign challenge added a student component to the annual Margaret Guthman Musical Instrument Competition\nFacebook\nTwitter\nEmail\nGreg Hendler, a master’s student in music technology, plays his team’s instrument the “VCG.” The VCG, which looks like a guitar but incorporates the reed design found in oboes and other woodwind instruments, won first places at the inaugural Guthman Musical Instrument Student Design Challenge. To play it, a musician breathes into a tube attached to the instrument’s body and runs his fingers along ribbon sensors placed along the guitar neck.\nFeb 17, 2015\n— Atlanta, GA\nA distorted commotion of sounds filled the room. Electronic scratches, drum beats and eerie echoes flowed from the musical instruments. About 50 Georgia Tech students hammered, drilled and plucked strings as they raced to put the finishing touches on the devices they created. The students participated in the inaugural Guthman Musical Instrument Design Challenge, sponsored by synthesizer maker Moog and the Georgia Tech Office of the Arts. The event added a student component to this week’s annual\nMargaret Guthman Musical Instrument Competition , which seeks to find the world’s best new ideas in musical instrument design, engineering and musicianship. “It was important for us to expand the focus of the Guthman Competition toward our own campus and our own students,” said Gil Weinberg, director of the Georgia Tech Center for Music Technology. “A student challenge, combined with an opportunity for students to present their inventions as part of the competition, seemed like the perfect way to do that.” Students spent about a month designing their musical creations and added the electronic elements Sunday during an eight-hour hackathon. Each of the 15 teams received sensors, Arduino boards and Moog Werkstatt kits to hack, manipulate and add to the base instrument. Raja Raman, a master’s student in music technology, belonged to a three-member team that created the “VCG” instrument, which looks like a guitar but incorporates a breath controller that functions similarly to woodwind instruments. To play it, a musician breathes into a tube attached to the instrument’s body and runs his fingers along ribbon sensors placed along the guitar neck. “We wanted to create something that was truly playable and fun,” Raman said. The team succeeded and won the first place prize of $1,500. “I was blown away by what the students created in a short period of time,” said Michael Adams, CEO of Moog Music and one of the judges. The other judges were: Aaron Lanterman, a Georgia Tech professor in the School of Electrical and Computer Engineering who specializes in digital signal processing; and Lee Lerner, a research scientist with the Georgia Tech Research Institute. All 15 teams will present their instruments this Friday during the main Guthman Competition. That contest will be held Thursday and Friday at the Klaus Advanced Computing Building on campus. Before the hackathon students spent hours designing their instruments. Some constructed instruments using 3D printing, welding and other methods found in Georgia Tech’s Invention Studio, a student-run design-build-play space that offers students access to cutting-edge machines. Other students scavenged dumpsters, yards and attics to turn found items into instruments. One team used part of an abandoned bike. Another group added sensors, an accelerometer and Bluetooth technology to a clear beach ball. Some instruments resembled a Frankenstein assembly of parts. But that was part of the charm. “A lot of work went into the design,” said Collin Garnett, a second-year architecture major. “This was probably one of my favorite projects.”\nAdditional Images\nRelated links\nCompetition Submission Site\nContact\nLaura Diamond  Georgia Tech Media Relations 404-894-6016\nEmail\nlaura.diamond@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}