{"text": "Jimmy and Rosalynn Carter To Receive the Ivan Allen Jr. Prize for Social Courage | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nJimmy and Rosalynn Carter To Receive the Ivan Allen Jr. Prize for Social Courage\nThe former president and first lady are the first couple to receive the Georgia Tech award.\nFacebook\nTwitter\nEmail\nJimmy and Rosalynn Carter will receive the 2017 Ivan Allen Jr. Prize for Social Courage.\nIn this photo, the former president and first lady pose at a 2003 event celebrating President Carter’s Nobel Peace Prize, awarded in December 2002.\nPhoto credit: The Carter Center.\nJan 20, 2017\n— Atlanta, GA\nJimmy and Rosalynn Carter will receive the 2017 Ivan Allen Jr. Prize for Social Courage, Georgia Institute of Technology President G.P. “Bud” Peterson announced today.\nThe former president and first lady are being jointly recognized for their partnership in a courageous collaboration to improve human rights and alleviate suffering around the world. Over the span of more than four decades their work has focused on improving health, preventing and resolving conflicts and enhancing freedom and democracy.\nThey are the first couple to receive the award, which recognizes those who demonstrate leadership to improve the human condition despite personal risks and challenges.\nThe Carters will be honored during a symposium on the power of partnerships taking place February 17 at the Biltmore, adjacent to Tech Square in midtown Atlanta. Planned activities include a town hall discussion between Georgia Tech students and the Carters.\n“Rosalynn and I are humbled and honored to receive this award,” said Jimmy Carter, who attended Georgia Tech and received an honorary degree from the Institute in 1979.\n“Our work to advance peace and health for the world’s least fortunate people through The Carter Center has been the pinnacle of our lives,” he said. “We are grateful if our experiences offer some inspiration to others to reach out to do what they can to help make life better for their neighbors next door or those in other nations. You don’t have to be a former president or former first lady to make a difference in the lives of others. Anyone can find the courage to speak out against injustice and lend a helping hand within their own circle.”\nThe Carters, who have been married for more than 70 years, have accomplished much together, whether it be their time in the White House, his receiving the Nobel Peace Prize in 2002 or her groundbreaking work in mental health advocacy.\n“For more than four decades, the Carters have worked tirelessly to improve global health and human rights, as well as to promote democracy in more than 65 countries throughout the world,” Peterson said. “Looking beyond the safe and the convenient, they have traveled to dangerous places, and fearlessly confronted injustice. Their shared vision, tenacity and courage have resulted in conflict resolution between countries and peoples, the eradication of diseases in the developing world and advancements in mental health understanding and support. Former President Jimmy Carter and Rosalynn Carter exemplify the far-reaching global changes that are possible through a lifetime partnership in social courage.”\nEarlier this month The Carter Center announced it is poised to wipe out the Guinea worm disease from the planet. In the mid-1980s the painful disease afflicted about 3.5 million people each year in 21 countries across Africa and Asia. Today the number of cases has dropped to just 25 in three countries – Chad, Ethiopia and South Sudan.\nThe Carter Center’s unique focus on disease eradication has filled a vacuum in the world when few were paying much attention to this problem. The last disease eradicated was smallpox in 1980.\nThe Ivan Allen Jr. Prize in Social Courage honors the people behind the efforts to improve the human condition. The award is named for former Atlanta Mayor Ivan Allen Jr. Funded in perpetuity by a grant from the Wilbur and Hilda Glenn Family Foundation, recipients are awarded a $100,000 stipend.\nThe inaugural prize was awarded in March 2011 to former Senator Sam Nunn. Other past recipients include William Foege, U.S. Rep. John Lewis and humanitarian activist Nancy Parrish.\nLearn more about the prize\nhere .\nAdditional Images\nRelated links\nIvan Allen Jr. Prize for Social Courage\nContact\nLaura Diamond\nMedia Relations\n404-894-6016\n@LauraRDiamond\nEmail\nlaura.diamond@gatech.edu\nAdditional information\nPlease note, due to space limitations this is an invitation-only event. We encourage the campus community and public to view a live webcast beginning at 10 a.m. Friday, February 17, at\nivanallenprize.gatech.edu .\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}