{"text": "Crowd science provides major boost for certain research projects | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nCrowd science provides major boost for certain research projects\nResearchers have taken a comprehensive look at the growth of crowd science, describing the considerable value of donated time and noting the limitations of nonprofessional research assistance.\nFacebook\nTwitter\nEmail\nZooniverse is the most popular platform for hosting crowd science projects, with more than 1.2 million people participating worldwide. It is operated by the Citizen Science Alliance.\nJan 05, 2015\n— Atlanta, GA\nCrowd science is making possible research projects that might otherwise be out of reach, tapping thousands of volunteers to help with such tasks as classifying animal photos, studying astronomical images, counting sea stars and examining cancer cell images. Also known as “citizen science,” these efforts to involve ordinary people in research projects have attracted interest from policy makers, scientific agencies and others. A study published January 5 in the early edition of the journal\nProceedings of the National Academy of Sciences\n(PNAS) takes what may be the first comprehensive look at this trend, finding common threads in seven projects hosted on Zooniverse, now the most popular crowd science platform. The study’s findings regarding the contributions made by thousands of volunteers offer both encouragement and caution, describing the considerable value of donated time and noting the limitations of nonprofessional research assistance. “We are seeing projects that couldn’t be done before, and we are seeing them done on a massive scale and at a fast speed,” said\nHenry Sauerman n, an associate professor in the\nScheller College of Business\nat the Georgia Institute of Technology. “However, these are not conventional laboratory research projects going online. It’s not a substitution of crowd science for conventional research projects.” Though a few crowd science projects require technical knowledge from contributors, most expect little more than the ability to follow simple instructions – such as examining images of galaxies to note their shape, or reporting what animals are doing in photos. Assistance from crowd scientists is important because the sheer volume of work involved would otherwise put projects beyond the reach of conventional research teams. “The key is to translate the complicated science into something that’s easily done by people who don’t need to understand the scientific details,” explained Sauermann, who has been studying the crowd science phenomenon. “The broad idea is to get people involved who have an interest in science, even if it is a fairly shallow interest. Anybody can participate as long as they have a computer and can do the basic tasks required.” Though crowd science is attracting considerable interest right now, it’s actually not a brand new idea. For years, ornithologists have used amateur bird watchers to count populations of different species and report their locations. What’s new is access by the general public to masses of scientific images and data made possible by the broad reach of the Internet and ubiquity of personal computers. With support from the Alfred P. Sloan Foundation, Sauermann and co-author Chiara Franzoni from the Politecnico di Milano in Italy studied seven projects hosted on Zooniverse, one of several platforms providing crowd science infrastructure. They found that most volunteers spend relatively little time on the projects they support, with the majority of work done by a small fraction of the volunteers. But even brief involvement adds up when thousands of volunteers pitch in. Examining the records of the seven projects over a 180-day study period, the researchers followed the activities of 100,386 participants who contributed a total of 129,500 hours of unpaid labor. At the rate normally paid to undergraduate students, that help would have been worth more than $1.5 million. The amount of labor by project ranged from $22,717 to $654,130. The contributions received by projects varied dramatically over time, with large spikes in assistance tied to promotion efforts of projects or news media coverage. While this variability may be problematic for some types of tasks, Sauermann said, it may not be a problem for other types of tasks such as classifying large numbers of archived images. Though the value of the unpaid labor seems attractive, there are costs involved. Projects must be designed for untrained volunteers, infrastructure must be set up, projects must be promoted, and project leaders need to interact with the community to ensure continued involvement. “It’s not like simply outsourcing something,” Sauermann said. “It’s a big-time commitment on the part of the scientists to make these things happen. Because of the investment, this makes the most sense for projects that have a large scale, where a lot of outside help is needed.” Though each project is different, crowd science volunteers usually handle tasks that computers can’t do because they require human judgment. For instance, in one project, volunteers were asked to characterize blurry images of animals. That kind of task is easy for humans, but difficult for computers. In other projects, humans noted unexpected objects that would have been ignored by computers. What motivates people to share their time for research projects? Sauermann says many crowd science projects parallel hobbies such as astronomy or bird-watching. In other cases, people may contribute because they feel they are helping society. “It’s a way to match people who are interested in looking at animal pictures or galaxies with people who need someone to look at animal pictures or galaxies,” Sauermann said. “When they get together, all parties benefit, and that’s what makes crowd science so promising.” The phenomenon also provides an opportunity to build understanding and support for science. “Many people don’t have a tangible connection to science,” he said. “Crowd science can give people the hands-on experience of science, and therefore a better appreciation of it.” Hundreds of crowd science projects have been done so far, with astronomy and the life sciences the most popular fields. Sauermann expects “an explosion” of projects in other areas of science as word spreads about the success of the projects and more infrastructure is created to host them. But he cautions that researchers hoping to use volunteers must continue to present interesting opportunities. “I think we are really at the beginning of something big,” he said. “But it’s going to be difficult to get people to participate in topics that don’t seem interesting or important to society. There may be areas of science that seem boring or unimportant. If asked to help with such projects, people may just prefer to watch television.” CITATION : Henry Sauermann and Chiara Franzoni, “Crowd Science User Contribution Patterns and their Implications,” (Proceedings of the National Academy of Sciences, 2015).\nhttp://www.dx.doi.org/10.1073/pnas.1408907112 Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia  30332-0181  USA Media Relations Contacts : John Toon (404-894-6986) ( jtoon@gatech.edu ) or Brett Israel (404-385-1933) ( brett.israel@comm.gatech.edu ). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}