{"text": "Q&A with Georgia Tech Professors on the Intersection of Science Fiction and the Chemical Elements | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nQ&A with Georgia Tech Professors on the Intersection of Science Fiction and the Chemical Elements\nA discussion with Georgia Tech scientists and science fiction writers explores connection in science, fiction and culture.\nFacebook\nTwitter\nEmail\nNov 04, 2019\n— Atlanta, GA\nCan you still recite the elements of the periodic table?\nThroughout this year, Georgia Tech has celebrated the International Year of the Periodic Table with a variety of events, forums and activities to spotlight the significance of the periodic table and the chemical elements. For the past 150 years, the periodic table has been a foundational element in classroom learning, scientific innovations and the global imagination.\nTo close out the yearlong celebration, the College of Sciences, as well as the School of Literature, Media, and Communication, and the Georgia Tech Library will host the panel discussion “From Myth to Marvel: The Role of Elements in Science, Fiction and Culture.” It will be held from 11 a.m. to 12:15 p.m., November 7, in the Library.\nGeorgia Tech professors M.G. Finn and Deirdre Shoemaker are a part of the panel, which will explore how science and art have long influenced each other. We asked them to share their take on the astounding elements of the periodic table.\nHow relevant is the use of the periodic table 150 years later — in the classroom and in our everyday lives? DS:\nI think our students need to understand the basics of matter, the building blocks.  The elements influence sciences and engineering. We like to adorn ourselves in elements like gold and silver. Our universe is built from hydrogen and helium — at the heart of it all are elements.\nWhy do you think there has been such an emphasis on chemical elements among science fiction writers?\nMGF :\nScience fiction creates alternate worlds or universes, but the elements are still what they have to be made from. Elements are fundamental in the deepest way — if you want to create something authentic, it helps to be familiar with the building blocks.\nWhat are some creative ways you have used the periodic table in your work? MGF:\nMany chemists, including me, look for elemental “analogies.” For example, a key insight of the periodic table is that elements in the same column have similar properties. They also have interesting differences. So, if we have a molecule made out of silicon, it is similar, but also tantalizingly different, from an analogous one made out of carbon. Sometimes, we can make medicines using this kind of similar-but-different trick, or new materials that improve on the properties of the old ones.\nHow has the periodic table affected your life?\nMGF:\nI fell in love with the periodic table when I first started playing with matter in the chemistry laboratory. It was a necessary accompaniment — a framework — to seeing things combine to make new things. In time, I came to appreciate particular elements as having particular “personalities,” and, as a chemist, I can assign whatever expertise I may have to a deepening of that perception.\nDS:\nThe elements impact us constantly. We are built from the elements created in supernovae and colliding neutron stars. There is no us without elements.\nThe title of the panel discussion is “From Myth to Marvel.” Can you explain how the periodic table has influenced this transformation?\nMGF:\nThe most compelling creation of worlds in literature and film are those that connect in well-defined ways to the “real” world. And the most fundamental of those connections is to the elements that comprise the universe. I don’t think it’s an accident that vibranium is a Marvel creation.\nDS:\nI do not know that the elements were ever a myth or a marvel. They do help us understand how humanity can start by making simple observations about the world around us and build up to understanding the universe using basic structures like the table of elements. For me, that is the true marvel.\nAdditional Images\nContact\nDenise Ward\nInstitute Communications\nEmail\ndenise.ward@comm.gatech.edu\nAdditional information\nAbout the professors\nM.G. Finn  is a professor and chair of Georgia Tech’s School of Chemistry and Biochemistry, a faculty member in the School of Biological Sciences, and the James A. Carlos Family Chair for Pediatric Technology. In his research, his laboratory develops new vaccines, ways to find and kill cancer cells, new materials for drug delivery and membrane-based separations, and ways to evolve molecules with desired functions. He is the editor-in-chief of the journal  ACS Combinatorial Science . His science fiction inspirations are decidedly old-school, ranging from Ray Bradbury to Ursula K. Le Guin to Dan Simmons.\nDeirdre Shoemaker  is the Dunn Family Professor of Physics in Georgia Tech’s School of Physics. She is the director of the Georgia Tech Center for Relativistic Astrophysics and associate director of the Institute for Data Engineering and Sciences. Black holes, spacetime wrinkles and gravitational waves — understanding these and other aspects of gravity drives Shoemaker’s research. She is a member of the Astronomy and Astrophysics Advisory Council and the NASA LISA Study Team. She is also a member of the LIGO Scientific Collaboration, which detected gravitational waves for the first time on September 14, 2015, ushering in the era of gravitational wave astronomy. The strange and wondrous predictions of Einstein’s theory are playing out in the universe, and Shoemaker is watching.\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}