{"text": "Delta Jacket Wins 2021 Georgia Tech InVenture Prize | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nDelta Jacket Wins 2021 Georgia Tech InVenture Prize\nFourth-year student’s garment designed to assist homeless populations takes top prize\nFacebook\nTwitter\nEmail\nThe winning invention is an inflatable, reversible, waterproof jacket that can be transformed into an air mattress or a shelter from the elements for homeless populations.\nMar 18, 2021\n— Atlanta, GA\nAya Ayoubi calls it “humanitarian couture.”\nThe fourth-year industrial design student’s unique garment took home top honors at Georgia Tech’s 13 th\nannual InVenture Prize competition, which pits student innovations head-to-head.\nAyoubi says she had to learn how to sew to execute her vision — an inflatable, reversible, and waterproof jacket that transforms, through a series of zips, into an air mattress or a sheltering garment to protect from the elements. She says the garment is geared to provide safety and dignity to homeless populations.\nNot only did Ayoubi’s Delta Jacket win the $20,000 first place prize awarded by the judges, Ayoubi also took home the People’s Choice Award and an additional $5,000 after a public vote during Wednesday night’s airing on Georgia Public Broadcasting. Along with the cash prizes, the winner receives a free U.S. patent filing from Georgia Tech valued at $20,000.\nDelta Jacket will also be accepted into the CREATE-X Startup Launch program, which will provide additional seed funding and access to legal assistance and expert mentors to build a successful startup company.\n“Winning the InVenture Prize means I could help, potentially, hundreds of thousands of people, so thank you,” said Ayoubi.\nDuring her winning pitch, Ayoubi explained the strategy of selling the Delta Jacket to outdoor enthusiasts as a means of creating access to the product for the homeless — with the donation of a jacket to a person in need, for every jacket purchased. Ayoubi has also been in contact with several nonprofit organizations, including the Red Cross, who have expressed interest in her garment.\nAyoubi is already filling online orders and plans to keep developing her wearable innovation as she completes her degree at Georgia Tech.\n“I’ve already received 512 preorders and my website has only launched a few days ago,” she said. “The Red Cross has already committed to distributing 1,000 units of the Delta Jackets as soon as it’s manufactured.”\nTwo team members from StartProto took the second place prize of $10,000.\nEngineering students Zach Cloud and Tim Felbinger developed a digital safety and analytics system that can be used to organize access and safety protocols in makerspaces at schools across the country. The software and app are already being tested by Georgia Tech’s makerspaces on campus.\n“We’ve been approached by other colleges and universities who want to use StartProto,” says Felbinger.\nTwo-time InVenture Prize winner Dev Mandavia returned as one of three judges who adjudicated during this year’s live broadcast.\n“The teams just get better and better each year,” Mandavia said. “All of these companies have elements that can be successful.”\n“This year we’ve seen how important innovation is for changing how we work and live,” said Blake Patton, a judge and founder of Tech Square Ventures in Atlanta. “If these students are any indication, our future’s bright.”\nLearn about the four remaining 2021 InVenture Prize finalists and their innovations here .\n.\nAdditional Images\nContact\nSteven Norris\nInstitute Communications\nEmail\nsnorris@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}