{"text": "A Future Colorfully Lit by the Mystifying Physics of Paint-On Semiconductors | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nA Future Colorfully Lit by the Mystifying Physics of Paint-On Semiconductors\nBucking conventional wisdom about semiconductors, a new class of light-emitting materials is flexible, easily produced from solution, and could be painted onto a surface.\nFacebook\nTwitter\nEmail\nLaser light in the visible range is processed for use in the testing of quantum properties in materials in Carlos Silva's lab at Georgia Tech. Credit: Georgia Tech / Allison Carter\nMar 19, 2018\n— Atlanta, GA\n[Yes, HOIP quantum properties look extremely robust, and their physics are mystifying]\nSome novel materials that sound too good to be true turn out to be true and good. An emergent class of semiconductors, which could affordably light up our future with nuanced colors emanating from lasers, lamps, and even window glass, could be the latest example.\nThese materials are very radiant, easy to process from solution, and energy-efficient. The nagging question of whether hybrid organic-inorganic perovskites (HOIPs) could really work just received a very affirmative answer\nin a new international study\nled by physical chemists at the Georgia Institute of Technology.\nWith significant effort, researchers succeeded in testing an existing HOIP and observed a “richness” of semiconducting physics created by what could be described as electrons dancing on chemical underpinnings that wobble like a funhouse floor in an earthquake. That bucks conventional wisdom because established\nsemiconductors\nrely upon rigidly stable chemical foundations, that is to say, quieter molecular frameworks, to produce the desired quantum properties.\n“We don’t know yet how it works to have these stable quantum properties in this intense molecular motion,” said first author Felix Thouin, a graduate research assistant at Georgia Tech. “It defies physics models we have to try to explain it. It’s like we need some new physics.”\nQuantum properties surprise\nTheir gyrating jumbles have made HOIPs challenging to examine, but the team of researchers from a total of five research institutes in four countries succeeded in measuring a prototypical HOIP and found its quantum properties on par with those of established, molecularly rigid semiconductors, many of which are\ngraphene -based.\n“The properties were at least as good as in those materials and may be even better,” said\nCarlos Silva, a professor in Georgia Tech’s School of Chemistry and Biochemistry . Not all semiconductors also absorb and emit light well, but HOIPs do, making them\noptoelectronic\nand thus potentially useful in lasers, LEDs, other lighting applications, and also in photovoltaics.\nThe lack of molecular-level rigidity in HOIPs also plays into them being more flexibly produced and applied.\nSilva co-led the study with physicist\nAjay Ram Srimath Kandada . Their team published the results of their study on two-dimensional HOIPs on March 8, 2018,\nin the journal\nPhysical Review Materials . Their research was funded by EU Horizon 2020, the Natural Sciences and Engineering Research Council of Canada, the Fond Québécois pour la Recherche, the Research Council of Canada, and the National Research Foundation of Singapore.\nThe ‘solution solution’\nCommonly, semiconducting properties arise from static crystalline lattices of neatly interconnected atoms. In silicon, for example, which is used in most commercial solar cells, they are interconnected silicon atoms. The same principle applies to graphene-like semiconductors.\n“These lattices are structurally not very complex,” Silva said. “They’re only one atom thin, and they have strict two-dimensional properties, so they’re much more rigid.”\n“You forcefully limit these systems to two dimensions,” said Srimath Kandada, who is a\nMarie Curie International Fellow\nat Georgia Tech and the Italian Institute of Technology. “The atoms are arranged in infinitely expansive, flat sheets, and then these very interesting and desirable optoelectronic properties emerge.”\nThese proven materials impress. So, why pursue HOIPs, except to explore their baffling physics? Because they may be more practical in important ways.\n“One of the compelling advantages is that they’re all made using low-temperature processing from solutions,” Silva said. “It takes much less energy to make them.”\nBy contrast, graphene-based materials are produced at high temperatures in small amounts that can be tedious to work with. “With this stuff (HOIPs), you can make big batches in solution and coat a whole window with it if you want to,” Silva said.\nFunhouse in an earthquake\nFor all an HOIP’s wobbling, it’s also a very ordered lattice with its own kind of rigidity, though less limiting than in the customary two-dimensional materials.\n“It’s not just a single layer,” Srimath Kandada said. “There is a very specific perovskite-like geometry.”\nPerovskite\nrefers to the shape of an HOIPs crystal lattice, which is a layered scaffolding.\n“The lattice self-assembles,” Srimath Kandada said, “and it does so in a three-dimensional stack made of layers of two-dimensional sheets. But HOIPs still preserve those desirable 2D quantum properties.”\nThose sheets are held together by interspersed layers of another molecular structure that is a bit like a sheet of rubber bands. That makes the scaffolding wiggle like a funhouse floor.\n“At room temperature, the molecules wiggle all over the place. That disrupts the lattice, which is where the electrons live. It’s really intense,” Silva said. “But surprisingly, the quantum properties are still really stable.”\nHaving quantum properties work at room temperature without requiring ultra-cooling is important for practical use as a semiconductor.\nGoing back to what HOIP stands for -- hybrid organic-inorganic\nperovskites\n– this is how the experimental material fit into the HOIP chemical class: It was a hybrid of inorganic layers of a lead iodide (the rigid part) separated by organic layers (the rubber band-like parts) of phenylethylammonium (chemical formula (PEA) 2 PbI 4 ).\nThe lead in this prototypical material could be swapped out for a metal safer for humans to handle before the development of an applicable material.\nElectron choreography\nHOIPs are great semiconductors because their electrons do an acrobatic square dance.\nUsually, electrons live in an orbit around the nucleus of an atom or are shared by atoms in a chemical bond. But HOIP chemical lattices, like all semiconductors, are configured to share electrons more broadly.\nEnergy levels in a system can free the electrons to run around and participate in things like the flow of electricity and heat. The orbits, which are then empty, are called electron holes, and they want the electrons back.\n“The hole is thought of as a positive charge, and of course, the electron has a negative charge,” Silva said. “So, hole and electron attract each other.”\nThe electrons and holes race around each other like dance partners pairing up to what physicists call an “ exciton .” Excitons act and look a lot like particles themselves, though they’re not really particles.\nHopping biexciton light\nIn semiconductors, millions of excitons are correlated, or choreographed, with each other, which makes for desirable properties, when an energy source like electricity or laser light is applied. Additionally, excitons can pair up to form biexcitons, boosting the semiconductor’s energetic properties.\n“In this material, we found that the biexciton binding energies were high,” Silva said. “That’s why we want to put this into lasers because the energy you input ends up to 80 or 90 percent as biexcitons.”\nBiexcitons bump up energetically to absorb input energy. Then they contract energetically and pump out light. That would work not only in lasers but also in LEDs or other surfaces using the optoelectronic material.\n“You can adjust the chemistry (of HOIPs) to control the width between biexciton states, and that controls the wavelength of the light given off,” Silva said. “And the adjustment can be very fine to give you any wavelength of light.”\nThat translates into any color of light the heart desires.\nLike this article?  Get our email newsletter here.\nALSO read this materials article: Turbocharging Fuel Cells with a Multifunctional NanoCatalyst\nCoauthors of this paper were Stefanie Neutzner and Annamaria Petrozza from the Italian Institute of Technology (IIT); Daniele Cortecchia from IIT and Nanyang Technological University (NTU), Singapore; Cesare Soci from the Centre for Disruptive Photonic Technologies, Singapore; Teddy Salim and Yeng Ming Lam from NTU; and Vlad Dragomir and Richard Leonelli from the University of Montreal. The research was funded\nby:\nThe EU Horizon 2020’s Curie Fellowship (project 705874); the EU 2020 Research and Innovation Program (Grant #643238 SYNCHRONICS); the Natural Sciences and Engineering Research Council of Canada and Fond Québécois pour la Recherche: Nature et Technologies; the Canadian Foundation for Innovation, the Natural Science and Engineering Research Council of Canada; and the National Research Foundation of Singapore (NRF-CRP14-2014-03). Any findings and opinions are those of the authors and not necessarily of the funding agencies.\nAdditional Images\nContact\nWriter & Media Representative : Ben Brumfield (404-660-1408)\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nEmail\nben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}