{"text": "Rattling DNA Hustles Transcribers to Targets | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nRattling DNA Hustles Transcribers to Targets\nDNA is the boss when it comes to the movement of molecules through its dense curls, beating out all other sources of motion.\nFacebook\nTwitter\nEmail\nNaturally occurring DNA is in constant motion, researchers hypothesize, and transports large transcription factors (depicted in green) through its tangles until they reach sites where they bind and carry out their activity. Here a still image from a very large, unique simulation.\nJun 12, 2017\n— Atlanta, GA\nImagine if a dense thicket didn’t obstruct your path but instead picked you up and shuttled you through the forest. That’s what tightly packed DNA might be doing with important life molecules to get them where they’re needed on time.\nNew simulations of DNA as a transport conduit could shatter the way scientists have thought about how large molecules called transcription factors diffuse on their way to carry out genetic missions,\naccording to a study by researchers at the Georgia Institute of Technology . The simulations add important brush strokes to our picture of elusive inner mechanics of cells.\nThe simulations strongly support the hypothesis that, in a live cell, DNA is in constant motion, making it the dominant mover of\ntranscription factors , to their target sites on DNA. There, the factors regulate the transcription of genetic code into life-sustaining action.\nDNA gorilla cage\nHow transcription factors travel through DNA has been a mystery, because the protein molecules are so large, and natural DNA is so tightly tangled. Spaces inside the windings are usually much smaller than the transcription factors that need to pass through them.\n“If the thicket is so thick, and on top of that doesn’t move, then it should be impenetrable. So, how do you get stuff through to the right site?” asked\nJeffrey Skolnick, a professor in Georgia Tech’s School of Biological Sciences .\nIf DNA were indeed immobile, the protein molecule would appear jammed into the DNA thicket like a gorilla into a dog cage.\nDNA watch springs\nBut Skolnick and collaborator\nEdmond Chow, a computer scientist specializing in algorithms that tackle very large scientific questions , believe the widely held assumption that naturally occurring DNA is rigid like bars is false. Their simulations turn the bars into wires,\ntense like watch springs , that flex and rattle around with snake-like motions.\n\"The DNA motion is far and away the dominant force moving molecules through its thicket,\" Skolnick said. \"DNA is a bully.\"\nSkolnick, who directs\nGeorgia Tech’s Center for the Study of Systems Biology , and Chow, an associate professor at\nGeorgia Tech’s School of Computational Science and Engineering , published a paper on their simulations on June 6 in\nBiophysical Journal .\nChow and Skolnick modeled the simulation on a transcription factor called\nLacI\nmoving through the DNA of an\nEscherichia coli\nbacterial cell.\nLacI\nis an inhibitory molecule\nthat depends on lactose, but that function played no role in the study. The well-known transcription factor is a mainstay in many experimental studies on transcription factor movement.\nSlide, hop, and hopscotch\nIn the simulations, DNA strands flex out of\nLacI ’s path and also juggle the large molecule forward into the next pocket in the thicket, and so on.\nHypotheses based on rigid DNA would leave transcription factors moving more slowly than they actually appear to. But Chow and Skolnick’s wiggly simulations square with rates of diffusion established in lab experiments and explain why they’re so fast.\nTranscription factors have been known to slide along DNA strands, like magnets down slippery wires, until they click into a specific groove where they fit perfectly, which is where they do their work. And they’ve been known to hop off the DNA strand and then reattach.\n“But the sliding and hopping combined still don’t account for the speed of diffusion,” Chow said.\nReattaching after a hop can actually reduce the transcription factor’s speed through the DNA, by putting it back on a place on the strand where it’s been before. The simulated wobble of the DNA thicket flicks transcribers to make them hopscotch more and farther, increasing their speed of diffusion.\nHerculean computations\nThe simulations will aid other researchers’ understanding of important cell processes and potentially help boost speed and accuracy in biological and medical research. The computation behind the simulated dynamics was herculean.\n“These simulations are unique to this problem because of their enormity and the advanced computing techniques used. Very efficient algorithms ran in parallel on powerful computers, and, still, it took three weeks for the simulations to complete,” Chow said.\nParallel\ncomputing\nchops a problem into pieces that can be run simultaneously, or in parallel, instead of in one long, time-consuming process. This allows programs to exploit many processors at the same time, multiplying the speed of computation.\nEven with that power, to make the simulation computable at all, the researchers had to slim down the model of the DNA and\nLacI\nto reveal motion dynamics without dressing up all the details of cellular DNA. “You have to choose which parts you ignore and which parts you put in,” Skolnick said. “If you put everything in, you can’t do it, even with the fastest codes.”\nCellular toy land\nThe researchers want to take on much tougher challenges that could, years from now, lead to a toy-like, simplified model of a complete cell.\n“The ultimate goal is to put a whole cell on a computer. Let it live. Let it divide, and understand the processes,” Skolnick said. “Maybe even let the cell mutate and evolve.”\nThe computer science behind that would be aspirational. “When the size of a problem grows, the computing costs to solve it can grow disproportionately,” Chow said. “You have to build algorithms that can run efficiently even when you scale up the problem size.”\nAlso read: Instruction Manual to Repair DNA\nAlso read: Did RNA evolve in puddles?\nAlso read: Was the Secret Spice in Primal Gene Soup a Thickener?\nThis research was supported by the National Science Foundation (grant ACI-1147843). Tadashi Ando from the Tokyo University of Science contributed insights that aided in this research. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the sponsoring agencies.\nAdditional Images\nContact\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contacts : Ben Brumfield (404-385-1933) (ben.brumfield@comm.gatech.edu)\nWriter : Ben Brumfield\nEmail\nben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}