{"text": "Georgia Tech Celebrates the Largest, Most Diverse Transfer Class in Institute History | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Celebrates the Largest, Most Diverse Transfer Class in Institute History\nNational Transfer Student Week is Oct. 19-23, and Georgia Tech is celebrating with a record-breaking transfer class.\nFacebook\nTwitter\nEmail\nDevan Moses is one of a record number of Georgia Tech 2020 transfer students.\nOct 16, 2020\n— Atlanta, GA\nThis year, Tech welcomed 1,146 new transfer students from 224 different colleges, including 39 Georgia colleges, and 76 community colleges. This new class topped the Institute’s record transfer enrollment numbers with 230 more students than last year, and includes 120 more in-state students and 12% more underrepresented minority students.\nChad Bryant, who directs Tech’s transfer initiatives, said, “We are firmly committed to providing more students the opportunity to earn a Tech degree through expanding capacity, establishing a variety of\nTransfer Pathway Programs , and collaborating with other colleges and universities locally and nationally.”\nFirst-generation college students (neither parent graduated from college) represent 14% of Tech’s 2020 transfer class. This is Tech’s largest number of first-generation students in a single transfer class — a 29% increase from 2019. This increase is thanks, in part, to the\nGeorgia First Pathway Program . Under the Georgia First Pathway Program, first-year applicants from Georgia — who are not offered first-year admission and have first-generation college student status — have the opportunity to apply to transfer.\n“Our goal is to ensure Tech is accessible to Georgia’s most talented students. Public institutions are an engine of social mobility and fundamentally a public good for our state. This pathway is an outgrowth of that commitment,” said Rick Clark, director of undergraduate admission.\nThis year’s transfer class includes 33% female and 21% underrepresented students (which includes Black/African-American and Hispanic students). These students come from 61 Georgia counties, 35 states, and 22 nations.\nComing in with an average 3.8 GPA and 51 credit hours, this transfer class has a bright future. The top future careers listed by the students in this class include: engineer, computer programmer, scientific researcher, and physician.\nClick here\nfor the full 2020 transfer profile.\nCharting the Unknown\nNo two students’ paths to a college education are exactly the same. Some students enroll straight out of high school. Some come from the workforce to pursue their degree. Some transfer from community college. No matter their path, one thing is certain: Each student has traveled a unique journey and overcome significant challenges to get to Georgia Tech.\nThe First Step on a New Path: Devan Moses\nIn high school, Devan Moses knew his next step was to attend college. Since no one in his family had pursued higher education before, he saw college as an opportunity to blaze a new trail, break the socioeconomic barrier for his family, and establish stability for his future.\nHe did not know it at the time, but Devan’s pursuit of a college degree would take him on a journey of self-discovery and eventually lead him to Georgia Tech and his dream career in the artificial intelligence research sector.\nGrowing up in a single-parent household, the main concerns for Devan’s family usually centered around making ends meet and keeping food on the table. Since college was not a frequent or typical topic of conversation for his family, Devan did not consider all the planning and preparation involved in the college application process.\n“In a first-generation family, no one tells you the details about college. Parents who have not gone to college think all you need is good high school grades. In reality, you also need extracurriculars —something to stick out from the crowd,” Devan said.\nWhen it came time to complete and submit college applications his senior year, Devan teamed up with a fellow classmate who was also a first-generation student. Together, they stumbled their way through the college application process.\n“I wanted to do my best applying to colleges, but, at the same time, I did not know how to apply or if I even could apply knowing where I came from. It was disheartening, because I grew up around a lot of people who were not interested in going to college,” Devan said.\nBut Devan was accepted to Kennesaw State University’s Southern Polytechnic College of Engineering, where he went on to study computer engineering technology. This was a huge transition and all new to him.\nBy the start of his second semester at Southern Polytech, Devan felt as if he was just going through the motions. He came to the tough realization that he was not ready for college, and decided to join the United States Marines in 2013.\n“I felt like I was wasting my time [at Southern Polytech], because I was not putting in the effort. I was not in the right frame of mind to tackle school. I figured the military would be a better move for me, then I could come back and start college again,” Devan said.\nAfter completing basic training, Devan attended the\nDefense Language Institute\nin Monterey, California where he learned how to speak\nPashto , Afghanistan’s official language, in just 18 months. He attended language classes for eight hours every single day, learning 20 words per day. He also participated in immersive trips to study Afghan culture, all while continuing to maintain his physical training and participate in military drills. That’s where Devan adopted the consistency, motivation, and self-discipline he had been seeking.\n“The people I went to class with at the institute really changed my perspective on life. Everyone was there for a purpose. Seeing my closest friends work hard to accomplish great things and achieve their goals motivated me to push myself harder,” Devan said.\nHe took this new perspective to his station at the\nNational Security Agency\n(NSA) cryptologic center in Georgia where he spent his remaining time in the Marines working as an Afghan linguist and analyst for the government. It was at NSA Georgia that Devan was first introduced to some of the artificial intelligence research projects Georgia Tech was leading for the government. Tech’s interdisciplinary approach using a combination of machine learning, computer science, psychology, and neuroscience inspired Devan to consider a career in academic research.\n“For me, I think it would be really fulfilling to be a researcher, because you are exploring the unknown. I look forward to integrating ideals from psychology and implementing what we know about the human brain into a machine, versus relying solely on statistics and big data,” Devan said.\nAfter finishing up with NSA Georgia, Devan decided he was ready to go back to school. He attended Georgia State University for three semesters to improve his grades, then applied and was accepted to Georgia Tech’s incoming Fall 2020 transfer class through the\nVeterans Pathway\nProgram.\nWhile at Georgia Tech, Devan plans to take advantage of the\nundergraduate research\nopportunities and\nVIP Program . He is excited to experience Tech’s diverse, innovative culture and surround himself with other motivated, competitive people that will push him to be better.\nFor Devan, one of the most important things about being a first-generation student is the ability to help his younger siblings and cousins navigate the college application process, so they can avoid the same experience he had.\nHe hopes his story will encourage other first-generation students to pursue their college goals and be proud of their journey getting there.\n“If you are motivated and want to go to college, then you can do it. Even if you did not do well in high school, there is still a path for you to go to a great school. It may not be the most perfect path, but you can be successful,” said Devan. “Just remember, you are a trailblazer doing something others have not done before. Be proud of that, and don’t diminish your accomplishments within the community.”\nThe Beginning of a New Chapter: Kenisha Stills\nKenisha Stills has always been interested in foreign languages. After studying Japanese in high school, she knew her next step was to attend college. She saw college as an opportunity to expand her horizons — especially as no one in her family had ever pursued higher education.\n“Growing up in Toledo, Ohio, I don’t remember a lot of people talking about going to college or what they wanted to do after high school. For my parents and most of the people I grew up around, the consensus seemed to be that you graduate from high school and then go to work. I wanted to go to college, travel the world, and experience other cultures to learn more about myself and others, and to do more with my life, but my parents didn’t really support that,” Kenisha said.\nIn 2007, before the start of her junior year, Kenisha moved to Raleigh, North Carolina, to spend her last two years of high school living with her aunt and uncle who wanted to provide her more stability and encourage her to chase her professional and educational dreams. Kenisha attended the University of North Carolina at Greensboro after graduating from high school but quickly realized within her first year that, as a first-generation college student, she was not adequately prepared for college life.\n“I didn’t know what to expect. I was not prepared to deal with some of the conflict that I had to face when living in a shared space with other people I didn’t know. It ended up being a bad experience for me that year. After a year at UNCG, I started looking into other universities that would be a better fit for me,” she said.\nKenisha decided to apply to The Ohio State University as a transfer student in 2010. However, she was ultimately unable to attend because she did not receive her parents’ support in completing the Free Application for Federal Student Aid (FAFSA). Kenisha was completely discouraged. She had no idea what was coming next.\nAfter drifting for a year, Kenisha enlisted in the United States Air Force in 2011.\n“At 6 a.m. one day, I walked 8 miles to the first military recruiting center near my father’s house and started my enlistment process with the Air Force that very day. I figured if I could gain responsibility of myself and become an independent by FAFSA’s definition, then I could eventually go back to college,” Kenisha said.\nAfter completing basic military training, she continued her training at the\nDefense Language Institute\n(DLI) in Monterey, California, where she learned how to speak Korean in just 18 months. Kenisha attended language classes for eight hours every single day. She even had the opportunity to study at Korea University in Seoul, South Korea, where she developed a personal appreciation of Korean culture through unforgettable experiences with her homestay family and friends in Korea. That motivated her to continue her Korean studies after DLI — and now here at Georgia Tech.\nKenisha took that passion to her station at\nOsan Air Base\nin Pyeongtaek, South Korea, located just 45 minutes away from the North Korean border. During her two years at Osan, Kenisha excelled as a ground linguist for the 303 rd\nIntelligence Squadron. She even helped develop and implement the base’s official Korean Language Training Program to break down barriers to increasingly more advanced translation and transcription abilities for other Korean linguists preparing for the\nDefense Language Proficiency Test , a regularly administered language aptitude test.\nIt was at Osan Air Base that Kenisha first experienced the advanced technology that the United States Military had at its disposal. She was inspired by how these technologies enabled her team to secure communications over vast distances between ground stations and military reconnaissance systems while in close proximity to a hostile and technologically capable adversary.\n“We were using this technology to monitor potential military provocations from across the DMZ [demilitarized zone], which made me realize how important these high-tech assets were to defending our base and staying steps ahead of our adversaries, and also how important they were to protecting the people right next to me and people back at home,” Kenisha said. “I recognized the value of having these technologies in the context of what we were doing in Korea, but also in keeping people safe, protected from catastrophic events or potentially fatal situations. While in Korea, I discovered a new passion for technology and was influenced by those experiences to study more about computers to ultimately learn how to develop technologies similar to those I deployed at Osan that could potentially save lives.”\nSix years after graduating from high school, Kenisha felt she was ready to leave the Air Force to resume school. She began searching for a college program that would enable her to study cybersecurity and improve her proficiency in the Korean language. As it turns out, Georgia Tech was the perfect fit.\n“I honestly didn’t see anywhere else on the East Coast that could offer me a space where I could engage my passion for applying technology in impactful ways, cultural exploration and dialogue, and the support from a community that would enable me to reach out to and encourage others to pursue an education and life-changing opportunities,” she said. “Georgia Tech is where it’s at for me.”\nShe was accepted into Tech’s Fall 2020 transfer class as a dual-major in computer engineering and applied languages and intercultural studies in Korean.\nWhile at Tech, Kenisha hopes to take advantage of the Institute’s various connections to industry leaders in defense technologies. She also wants to work with Tech’s first-generation student and military advocacy groups to educate low-income, first-generation student and military veteran communities about going to college, and support them on their journey to and through college. And she’s excited about experiencing Tech’s diverse, innovative culture and surrounding herself with others willing to take risks and take initiative in changing lives.\nKenisha hopes her story will provide other first-generation students a sense of inspiration and confidence that they, too, can graduate from college and pursue their dreams.\n“Don’t let the fear of not seeing anyone who looks like you going to college stop you from going to college or educating and improving yourself. It’s OK if you don’t want to go to college straight out of high school; there’s a lot of other options out there for you and a lot of other paths to college that’ll present an opportunity to you that could change your life, open your eyes to the world around you and to things you didn’t know about yourself before, and show you what truly matters to you.”\nAdditional Images\nContact\nDenise Ward\nInstitute Communications\nEmail\ndenise.ward@comm.gatech.edu\nAdditional information\nNational Transfer Student Week\nis an annual event hosted by the National Institute for the Study of Transfer Students every third week of October to celebrate college transfer students around the country. The goal of this event is to not only instill transfer pride on campuses, but also build awareness of the “common barriers and inherently complex transitions” transfer students experience on their pathway to bachelor’s degree completion.\nChad Bryant, Tech’s associate director for operations and transfer, discusses key tips for students in this recent\npodcast.\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}