{"text": "Slick and slender snake beats short and stubby lizard in sand swimming | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nSlick and slender snake beats short and stubby lizard in sand swimming\nFor swimming through sand, a slick and slender snake can perform better than a short and stubby lizard.\nFacebook\nTwitter\nEmail\nThe shovel-nosed snake, which is found in the Mojave Desert of the southeast United States, has an elongated body and low-friction skin, which allow it to swim through sand rapidly and efficiently. It is shown here in a bed of sand in a Georgia Tech laboratory. (Credit: Jason Maderer)\nJan 12, 2015\n— Atlanta, GA\nFor swimming through sand, a slick and slender snake can perform better than a short and stubby lizard. That’s one conclusion from a study of the movement patterns of the shovel-nosed snake, a native of the Mojave Desert of the southwest United States. The research shows how the snake uses its slender shape to move smoothly through the sand, and how its slippery skin reduces friction – both providing locomotive advantages over another sand-swimmer: the sandfish lizard native to the Sahara Desert of northern Africa. The study provides information that could help explain how evolutionary pressures have affected body shape among sand-dwelling animals. And the work could also be useful in designing search and rescue robots able to move through sand and other granular materials. Using X-ray technology to watch each creature as it moved through a bed of sand, researchers studied the waves propagating down the bodies of both the snakes and sandfish lizards. Granular resistive force theory, which considers the thrust provided by the body waves and the drag on the animals’ bodies, helped model the locomotion and compare the energy efficiency of the limbless snake against that of the four-legged lizard – which doesn’t use its legs to swim through the sand. “We were curious about how this snake moved, and once we observed its movement, how it moved so well in the sand,” said\nDan Goldman , an associate professor in the\nSchool of Physics\nat the Georgia Institute of Technology. “Our model reveals how both the snake and the sandfish move as fast as their body shapes permit while using the least amount of energy. We found that the snake’s elongated shape allowed it to beat the sandfish in both speed and energy efficiency.” Information about the factors enabling the snake to move quickly and efficiently could help the designers of future robotic systems. “Knowing how the snake moves could be useful, for instance, in helping robots go farther on a given amount of battery power,” Goldman said. Supported by the National Science Foundation and the Army Research Office, the research was published online December 18, 2014, in the\nJournal of Experimental Biology . The study is believed to be the first kinematic investigation of subsurface locomotion in the long and slender shovel-nosed snake,\nChionactis occipitalis . Measurements made by former Ph.D. student Sarah Sharpe revealed that the snake propagates traveling waves down its body, from head to tail, creating a body curvature and a number of waves along its body that enhance its movement through the sand. As a consequence of the kinematics, the snake’s body travels mostly in the same “tube” through the sand that is created by the movement of its wedge-shaped head and body. Because the snake essentially follows its own tracks through the sand, the amount of slip generated by its motion is small, allowing it to move through the sand using less energy than the sandfish ( Scincus scincus ), whose movement pattern generated a larger fluidized region of sand around its body. Overall, the research showed that each animal had optimized its ability to swim through the sand using its specific body plan. “For each body wave the snake generates, it moves farther than the sandfish does within a single wave of motion of its body,” Goldman noted. “Having a long and slender body allows the snake to bend its body with greater amplitude while generating more waves on its body, making it a more efficient sand swimmer.” The snake’s skin is also more slippery than that of the sandfish, further reducing the amount of energy required to move through the sand. Scientists had suspected that long and slender animals would have a sand-swimming advantage over creatures with different body shapes. The research showed that the advantage results from a high length-to-width ratio that allows the formation of more waves. “If you have the right body shape and slick skin, you can get a very low cost of transport,” explained Goldman. To study the snakes as they moved through sand, Sharpe – from Georgia Tech’s Interdisciplinary Bioengineering Program – and undergraduate Robyn Kuckuk, from the Wallace H. Coulter Department of Biomedical Engineering at Georgia Tech and Emory University, glued tiny lead markers onto the scales of the snakes. The markers, which fall off when the snakes shed their skin, allowed the researchers to obtain X-ray images of the snakes moving beneath the surface of the sand. Sharpe, now a biomechanical engineer with a research and consulting firm in Phoenix, created detailed videos showing how the snakes moved. Associate professor Patricio Vela and graduate student Miguel Serrano, both from Georgia Tech’s School of Electrical and Computer Engineering, developed software algorithms that allowed detailed analysis of the wave-forms seen on the X-ray movies as a function of time. Stephan Koehler, a research associate in applied physics at Harvard University, applied Resistive Force Theory to obtain data on the snakes’ movement and energy efficiency. Animals swimming in sand can only move if the thrust provided by their bodies exceeds the drag created. The theory predicted that the snakes’ skin would have about half as much friction as that of the sandfish, and that prediction was verified experimentally. Joe Mendelson, director of research at Zoo Atlanta, assisted the research team in obtaining and managing the snakes. Understanding how animals move through granular materials like sand could help the designers of robotic systems better understand how to optimize the use of energy, which can be a significant limiting factor in robotics. “This research is really about how body shape and form affect movement efficiency, and how we can go between experiment and theory to improve our understanding of these issues,” said Goldman. “What we are learning could help search and rescue robots maneuver in complex terrain and avoid obstacles.” Beyond the robotics concerns, the work can help scientists understand biological issues, such as how the body plans of desert-dwelling lizards and snakes converge to optimize their ability to move through their environment. “These granular swimming systems turn out to be quite useful for understanding fundamental questions about evolutionary biology, biomechanics and energetics because they are simple to analyze and they can describe a good number of systems,” Goldman added. This material is based upon work supported by the National Science Foundation (NSF) under grant number PHY-0749991 and PHY-1150760, and by the Army Research Office (ARO) under grant number W911NF-11-1-0514. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the author(s) and do not necessarily reflect the views of the National Science Foundation or the Army Research Office. CITATION : Sarah Sharpe, et al., “Locomotor benefits of being a slender and slick sand swimmer,” (Journal of Experimental Biology, 2014).\nhttp://www.dx.doi.org/10.1242/jeb.108357 Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia  30332-0181 Media Relations Contacts : John Toon (404-894-6986) ( jtoon@gatech.edu ) or Brett Israel (404-385-1933) ( brett.israel@comm.gatech.edu ). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}