{"text": "Covid-19 Interventions Can Cut Virus Infections, Severe Outcomes, and Healthcare Needs | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nCovid-19 Interventions Can Cut Virus Infections, Severe Outcomes, and Healthcare Needs\nInterventions such as shelter-in-place taken to control the SARS-CoV-2 virus can reduce infections and overall deaths.\nFacebook\nTwitter\nEmail\nInterventions such as voluntary shelter-in-place, quarantines and other distancing strategies to control the SARS-CoV-2 virus can reduce the peak number of infections and other outcomes, a new case study has found.\nOct 21, 2020\n— Atlanta, GA\nNon-pharmaceutical interventions such as voluntary shelter-in-place, quarantines, and other steps taken to control the SARS-CoV-2 virus can reduce the peak number of infections, daily infection rates, cumulative infections, and overall deaths, a new study published in the journal PLOS ONE has found.\n“High compliance with voluntary quarantine – where the entire household stays home if there is a person with symptoms or risk of exposure in the household – has a significant impact on reducing the spread,” said\nPinar Keskinocak , the William W. George Chair and professor in the\nH. Milton Stewart School of Industrial and Systems Engineering\n(ISyE) and director of the\nCenter for Health and Humanitarian Systems\nat the Georgia Institute of Technology. “Shelter-in-place (SIP) puts the brakes on the spread for some time, but if people go back to ‘business as usual’ after SIP, the significant impact is lost, so it needs to be followed up by voluntary quarantine and other physical distancing measures.”\nUtilizing data from the state of Georgia, the study determined that a combination of non-pharmaceutical interventions, with various levels of compliance that change over time, could in some instances cut cumulative infections in half and reduce the peak number of infections to about a third of what could have been seen, “flattening the peak” to avoid overwhelming a state’s healthcare system.\nThe study compared actual statistics to revised models of what could have happened in the state during the past seven and a half months without the physical distancing. As Covid-19 cases increase toward what may be a new peak this fall, the study could help public health officials evaluate the benefits of potential intervention strategies, for example, in the debate around K-12 school closure.\nThe study modeled the number of Covid-19 infections and resulting severe outcomes, and the need for hospital capacity under social distancing, particularly, school closures, shelter-in-place, and voluntary quarantine.\n“As one would expect, there is variation across the state in the observed data, which depends in large part on people’s behaviors,” said\nNicoleta Serban , who is the Joseph C. Mello chair and professor in ISyE. “For example, mobility increased faster in some counties compared to others, which is likely to be correlated with increased physical and social interactions, and therefore faster spread of the coronavirus.”\nThe team, including Georgia Tech ISyE Ph.D. students Buse Eylul Oruc and Arden Baxter, developed and used an agent-based simulation model to project the infection spread. “This is a sophisticated mathematical model which mimics what might happen in practice – under different scenarios – by capturing the progression of the disease in an individual, as well as the interactions between people in the household, in peer groups such as schools or workplaces, or in community groups such as grocery stores,” Oruc said.\nThe model utilizes parameters specific to Covid-19 and data from Georgia on population interactions and demographics. The study covered a period starting February 18, evaluating different social distancing scenarios, including baselines in which no intervention would have taken place or the only intervention would have been K-12 school closure, comparing them to combinations of shelter-in-place and voluntary quarantine with different timelines and compliance levels.\nOutcomes were compared at the state and community level for the number and percentage of cumulative and daily new symptomatic and asymptomatic infections, hospitalizations, and deaths; Covid-19-related demand for hospital beds, ICU beds, and ventilators.\nThe number of hospitalizations in Georgia turned out to be fewer than models last spring had forecast, but “models accurately predicted which hospital regions of the state that would have the largest gaps between number of people with severe outcomes and available care capacity – and therefore face potential shortages of ICU beds, hospital beds, and ventilators,” Baxter said.\nThe results suggest that shelter-in place followed by voluntary quarantine reduced peak infections to less than a third of what we would have seen if no intervention had taken place and to less than a half if only schools had been closed. The models predicted correctly that the interventions would delay the peak from April to sometime between late July to mid-September, reducing the daily strain on health care systems.\nAccording to the study, increasing shelter-in-place duration from four to five weeks yielded between 2% to 9% and 3% to 11% decrease in cumulative infection and deaths, respectively. Regardless of the shelter-in-place duration, increasing voluntary quarantine compliance decreased daily new infections and cumulative infections by about 50%. The cumulative number of deaths ranged from 6,660 to 19,430 under different scenarios.\nAs infection rates rise in the United States during late October, the study could help public health officials select the best techniques for addressing the viral threat. Georgia’s total population is approximately 10.5 million, and Covid-19 related deaths have exceeded 7,600.\n“The study further highlighted and quantified the impact of how compliance with public health measures impact infectious disease spread,” Keskinocak said. “The takeaway message is that each of us have the power to control our health by making the right choices.”\n“As individuals and as a nation, we often expect technological or medical fixes or cures to health problems, whereas many of these problems, whether they are at the individual level or the public health level, are caused by or exacerbated by our choices and behaviors,” Keskinocak said. “For many of them, we don’t need a new fancy device, drug, or technology to make things better. As individuals, or households, or communities, we have the power and the responsibility to impact and improve our own health, and the public health, by making healthy choices.”\nThis research was supported in part by the William W. George endowment, the Virginia C. and Joseph C. Mello endowments, a National Science Foundation Graduate Research Fellowship (DGE-1650044), an NSF grant to support the high performance computing facilities at Georgia Tech (MRI-1828187), and research cyberinfrastructure resources and services provided by the Partnership for an Advanced Computing Environment (PACE) at Georgia Tech, and the following Georgia Tech benefactors: Andrea Laliberte, Joseph C. Mello, Richard “Rick” E. & Charlene Zalesky, and Claudia & Paul Raines. The funders played no role in the study design, data collection, analysis, interpretation, or in writing the manuscript.\nCITATION : Pinar Keskinocak, Buse Eylul Oruc, Arden Baxter, John Asplund, and Nicoleta Serban, “The impact of social distancing on COVID19 spread: State of Georgia case study.” ( PLOS ONE , 2020)\nhttps://doi.org/10.1371/journal.pone.0239798\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : John Toon (404-894-6986)(jtoon@gatech.edu). Writer : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}