{"text": "Turner Foundation Awards Grant Supporting the Region’s First Sustainability Network | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nTurner Foundation Awards Grant Supporting the Region’s First Sustainability Network\nThe Turner Foundation recently awarded the Georgia Tech Foundation a $40,000 grant.\nFacebook\nTwitter\nEmail\nApr 15, 2019\n— Atlanta, GA\nThe Turner Foundation recently awarded the Georgia Tech Foundation a $40,000 grant to support two projects of the region’s new sustainability network, RCE Greater Atlanta, officially acknowledged by the United Nations University. The projects include a training program on the U.N. SDGs (Sustainable Development Goals) to be led by the RCE Greater Atlanta Youth Network and the fourth iteration of the Environmental Justice Academy leadership development program. Project leads are Georgia Tech’s Center for Serve-Learn-Sustain, Atlanta Metropolitan State College, Center for Sustainable Communities, EPA Region 4, and CIFAL Atlanta at Kennesaw State University.\nRCE Greater Atlanta is part of the Global RCE Network, which includes 168 networks worldwide, with seven in the U.S. RCEs support implementation of the U.N. SDGs at the regional level through education and training. RCE Greater Atlanta brings together 10 universities and colleges with nonprofit, community, government, and business partners to offer broad-based, multi-stakeholder educational and training programs that support key regional sustainable development efforts. It focuses especially on equity and justice issues inherent in sustainable development.\nOne of RCE Greater Atlanta’s most important initiatives is its Youth Network. The RCE Global Network recognizes the need for youth to be educated on the SDGs since they will be the ones facing and solving these problems in the future. The RCE Greater Atlanta Youth Network connects college students and young alumni from the network’s college and university members to each other and to the other members of RCE Greater Atlanta to collaborate on sustainability programs, engage in professional development, and work on projects with other RCE Youth Networks across the U.S. and the world. The Turner Foundation grant will support students in the Youth Network to create an online training program and complementary in-person workshops focused on the network’s seven priority SDGs: 1-No Poverty; 2-Zero Hunger; 3-Good Health and Well-Being; 4-Quality Education; 9-Industry, Innovation, and Infrastructure; 11-Sustainable Cities and Communities; and 13-Climate Action. The grant will also fund a conference on youth action around the SDGs.\n“I am honored that the RCE Greater Atlanta Youth Network is a recipient of the Turner Foundation grant. Working with Youth Network members to create training modules focused on our RCE’s priority SDGs will be a wonderful opportunity to collaborate across schools to ensure we are producing an educational tool that best represents what students want. This project will be a great SDG learning opportunity for not only the Youth Network members involved in the process of creating the modules, but also the larger Greater Atlanta community,” said Isabella Stubbs, Georgia Tech Environmental Engineering student and Youth Network co-lead.\nThe second project to be supported by the Turner Foundation grant is the Environmental Justice Academy (EJA), an intensive leadership development program for community leaders that is now also including faculty, staff, and student participants from higher education partners. Launched in 2016 by EPA Region 4, the EJA trains participants to identify environmental challenges and achieve sustainable, community environmental improvement goals. Redesigned and led by Atlanta Metropolitan State College (AMSC), Center for Sustainable Communities, and EPA Region 4, the fourth Academy began on March 28, 2019. Under the direction of attorney Anne Heard, executive in residence; Kenja McCray, associate professor of history; and Dean Vance Gray of the Social Sciences Division, AMSC’s goal is supporting the academy in growing and thriving in a location central to the communities the college serves. The Turner Foundation grant supported the college’s aims by underwriting scholarships for 16 EJA participants, the overwhelming majority of whom serve the most vulnerable populations in the southeastern region of the United States.\nThe funding will go a long way to ensuring the continued success of the Youth Network and Environmental Justice Academy. “The mission and purpose of the Environmental Justice Academy is to assist front-line organizations and communities in building additional capacity to immediately mitigate current and potential environmental hazards and challenges, and to help transform some of our most distressed and underserved communities into ones that are vibrant, thriving and sustainable. The grant from the Turner Foundation will serve as the principal catalyst for the success of this initiative,” states Garry Harris, president, Center for Sustainable Communities, and lead consultant for the EJA.\nSerena Newhall, program specialist with CIFAL Atlanta at Kennesaw State University, adds, “Youth engagement is at the center of successful implementation of the SDGs, which is why the Youth Network operates at the core of RCE Greater Atlanta. Turner Foundation funding will allow us to create a platform for knowledge-sharing that will address the ongoing training needs of our Youth Network, providing them with the practical tools needed to identify and respond to the social, economic, and ecological sustainability needs of their communities, while in the process learning to recognize their own individual strengths, passions, and potential for leadership.”\nTed Turner, Turner Foundation founder and chairman, has always been interested in the totality of the planet. In fact, he believes so emphatically in protecting the environment from further degradation that he views it as no less than “an effort to ensure the survival of the human species.” To that end, in 1990 he founded the Turner Foundation, whose principles are rooted in its commitment to protecting and restoring the natural systems of  land ,  air , and  water  on which all life depends.\nOne of the Turner Foundation’s priorities is to grow the movement, with an emphasis on engaging youth and addressing environmental injustice. “Supporting the United Nations’ acknowledged Greater Atlanta Regional Center of Expertise was a natural fit,” says Judy Adler, president of Turner Foundation Inc. “We were impressed with the commitment to collaboration among student leaders at 10 of Atlanta’s higher education institutions, and the potential for Atlanta to be a global model for implementing the U.N. Sustainable Development Goals (SDGs) at the local level.” The Turner Foundation’s sister foundation is the UN Foundation, which works with the UN to implement the SDGs – the world’s shared plan to end extreme poverty, reduce inequalities, and protect the planet by 2030.\nThe Turner Foundation hopes this grant will help to harness the energy of students and community leaders to be sustainable development changemakers in Atlanta and beyond.\nAdditional Images\nRelated links\nRCE Greater Atlanta\nContact\nlance.wallace@comm.gatech.edu\nEmail\nlance.wallace@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}