{"text": "Study Ties Poor Sleep to Reduced Memory Performance in Older Adults | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nStudy Ties Poor Sleep to Reduced Memory Performance in Older Adults\nVariability in night-to-night sleep time and reduced sleep quality adversely affect the ability of older adults to recall information.\nFacebook\nTwitter\nEmail\nA new study has found that variability in night-to-night sleep time and reduced sleep quality adversely affect the ability of older adults to recall information about past events.\nJun 24, 2019\n— Atlanta, GA\nA new study has found that variability in night-to-night sleep time and reduced sleep quality adversely affect the ability of older adults to recall information about past events. The study also found unexpected racial differences in the type of sleep patterns tied to lower memory performance across both younger and older African American research participants.\nAlthough further investigation will be needed to confirm the results of the pilot study, the findings could help open up a new area of research aimed at understanding the potential connection between poor sleep and the memory declines associated with aging. And the study, which included 50 Atlanta-area adults, also underscores the importance of sleep in maintaining good cognitive functioning.\n“The night-to-night variability in the older study participants had a major impact on their performance in tests aimed at evaluating episodic memory,” said\nAudrey Duarte , an associate professor in Georgia Tech’s\nSchool of Psychology\nand principal investigator in the\nMemory and Aging Lab . “The association between sleep and memory has been known, but this study’s novelty is showing that the connection is particularly evident for older adults and black participants, regardless of age.”\nThe research, supported by a National Science Foundation Graduate Research Fellowship, was reported June 4 in the journal\nFrontiers in Human Neuroscience . It is believed to be the first study of the relationship between sleep and memory with both age and racial differences.\nDuarte and Emily Hokett, a Ph.D. student in the School of Psychology, recruited 81 volunteers from the Atlanta area. The volunteers were evaluated carefully to screen out those who had mild cognitive impairment or other potentially confounding factors. Younger adults were recruited in the age range of 18 to 37 years, while older adults were recruited in the range from 56 to 76 years. Ultimately, 50 adults were selected for the study.\n“We wanted to look at lifestyle factors to see how people sleep normally, and how their sleep patterns change over time,” Hokett explained. “We wanted to know how sleep affected memory performance – how well they remembered things and how well their brains functioned depending on how well they slept.”\nThe participants were given accelerometers worn on their wrists to measure sleep duration and quality over a period of seven nights. Though they did not measure brain waves, the devices allowed sleep measurements to be done in the participants’ own homes. The researchers sought to provide a more realistic measurement than testing done in sleep labs, which typically lasts just one night.\nParticipants were asked to visit a Georgia Tech laboratory for a memory test that measured electroencephalography (EEG) brain wave activity as they attempted to recall word pairs that had been shown to them earlier. Not surprisingly, better performance correlated with better sleep in most of the older adults.\nBut Duarte and Hokett were surprised that the relationship between poor sleep and memory-related brain activity extended to both older and younger black participants – some of whom were college students. To understand the potential causes of the poor sleep, they administered a standardized questionnaire designed to measure stress levels in those participants.\n“The main factor that correlated with poor sleep quality in black participants was race-related stress,” said Hokett. “When participants had higher values on that measure of stress, they would also have greater sleep fragmentation, on average. We found a very significant relationship here.”\nThe study found that black adults slept for 36 minutes less than other adults, which translated into a 12% decrease in memory-related brain activity. On an average night, black adults in the study spent 15 minutes more time awake after falling asleep than did other participants.\nThe study also found significant variation among subjects in each age group. “Some of our 70-year-old subjects looked like our 20-year-old students,” Duarte said. “There are many factors that contribute to individual differences.”\nIn future research, Duarte and Hokett hope to expand their study to a larger group of participants, to study the relationship between sleep and memory in other underrepresented minorities, and to explore whether variations in sleep patterns could predict a person’s likelihood of experiencing diseases such as Alzheimer’s.\nThe study’s takeaway message may be that regular sleep is important at any age for the best cognitive performance.\n“You can imagine that many people, students among them, may have variable sleep patterns based on staying up late to study and sleeping in on weekends to catch up,” Duarte said. “This data shows that may not be the greatest strategy for optimizing memory ability.”\nYet improvements in sleep may be one area where people concerned about cognitive impairment may have an opportunity to make improvements.\n“In understanding normative aging, lifestyle factors are a good area to target because they are potentially factors we can control,” said Duarte. “It’s been known for decades that important things are happening while you sleep with regard to memory consolidation and strengthening of memories. Because we knew that sleep quality typically declines in normal aging, this was a prime target for study.”\nThis study was supported by the National Science Foundation Graduate Research Fellowship Program (Grant Number: DGE-1650044). Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the National Science Foundation.\nCITATION : “Age and Race-Related Differences in Sleep Discontinuity Linked to Associative Memory Performance and Its Neural Underpinnings,” Frontiers in Human Neuroscience (June 2019) https://doi.org/10.3389/fnhum.2019.00176\nMedia Relations Contact : John Toon (404-894-6986) (jtoon@gatech.edu).\nWriter : John Toon\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}