{"text": "Unique Bacterial Chemist in the War on Potatoes | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nUnique Bacterial Chemist in the War on Potatoes\nA bacterial warrior the only one of its kind? This enzyme is \"wacko\" in the ways it breaks down a poison related to TNT.\nFacebook\nTwitter\nEmail\nA bacterial warrior the only one of its kind? This enzyme is \"wacko\" in many ways in its breakdown of a poison related to TNT. On top of that, 5NAA-A is known so far only to exist in a single living organism on Earth. Could it be the lone master of a rare bacterial enzymatic kung fu, in the war on potatoes? Or does a genomic clue point to its existence in one other solitary case?\nOct 03, 2016\n— Atlanta, GA\nIn fertile farm soils where potatoes grow,\nStreptomyces scabies\nbacteria wage war using chemicals related to explosives and pesticides.\nBut a microbial spoiler defuses one of\nS. scabies ’ poisons. Researchers at the Georgia Institute of Technology have gained new insights into a one-of-a-kind mechanism it employs, which could someday contribute to the development of new agents to degrade tough pollutants and help rescue crops.\nWhen\nS. scabies\ninfects potatoes, it spews poisons called thaxtomins, which riddle potatoes with familiar dark scabs. Perhaps a trifle to the potato connoisseur excising them with a paring knife, on a global scale, the blemishes add up to a slash in agricultural production.\nUnprecedented moves\nScientists investigating potato soil found that bacteria of the species\nBradyrhizobium sp. JS329\nrun interference. Though their tough enzymes don’t break down thaxtomins, they do render innocuous another\nS. scabies\ntoxic secretion called\n5-nitroanthranilic acid\n(5-NAA).\nStill, understanding how it is broken down could prove useful to agriculture. “The 5NAA molecule is similar enough to thaxtomin that studying its degradation might inspire future work to engineer an enzyme or bacterium, or even the plant itself, to detoxify thaxtomin,” Lieberman said.\nOne enzyme in particular uses seemingly unprecedented and spectacular chemical tricks to tear apart 5-NAA’s otherwise ironclad chemical structure.\nResearchers uncovered them and published the results in the\njournal Nature Chemical Biology on Monday, October 3, 2016 . The research was funded by the National Science Foundation, Pew Charitable Trusts, Georgia Internship for Teachers, and the U.S. Department of Energy.\nChemical warfare\nS. scabies\nbacteria are masters of chemical warfare, and not just against potatoes.\n“This family of bacteria is known for the ability to synthesize lots of different molecules, including ones that humans use as antibiotics,” said senior researcher\nRaquel Lieberman, an associate professor\nat Georgia Tech’s\nSchool of Chemistry and Biochemistry .\n“They’re good at killing other organisms,” she said. Though the thaxtomins they secrete are well-known for marring potatoes, little is known about toxin 5NAA.\nEnzymatic kung fu\n5NAA has met its match in bacterium Bradyrhizobium sp. JS329, which we’ll call “Brady” for short.\n“Brady” produces enzymes that can combat 5NAA, the first of which is called 5NAA-A. The added “A” after the dash stands for “aminohydrolase,” a term that means it uses water to alter part of toxin 5NAA.\nThe “substitution reaction” that enzyme 5NAA-A carries out is common in organic synthesis, but extremely rare in living things. “There’s only one other known enzyme confirmed to utilize this particular chemical mechanism,” Lieberman said.\nLieberman’s team, which specializes in making protein crystals of enzymes like 5NAA-A, observed the moment of the ensuing reaction.  “We were able to capture the critical step (hydrolysis) in the crystal for this paper,” she said.\n“It does this wacko chemical reaction,” Lieberman said. 5NAA-A helps destroy toxin 5NAA in two ways that are like outlandish kung fu moves.\nBreaking the wrong arm\nToxin 5NAA enters the “Brady” bacterium with a deadly weapon. A nitro group, or NO2, is part of its structure, which makes 5NAA a nitroaromatic compound.\n“Basically, all these nitroaromatics are either explosive or toxic,” Lieberman said. “ TNT\nis not that different from this compound.”\nPlenty of bacteria have evolved enzymes to tackle synthetic nitroaromatics -- pollutants like dyes, pesticides or explosives that have been dumped in our environment. The enzymes tend to use the same strategy. “The nitro groups are typically the first target of any degrading enzyme, because they are so toxic,” Lieberman said.\nNot so for enzyme 5NAA-A.\nIt goes after another group on the toxic molecule, the amine, which is innocuous. It’s like a kung fu master breaking the arm opposite of the one with the weapon. But it works.\nBy hydrolyzing the amine, enzyme 5NAA-A sets up toxin 5NAA for destruction by other enzymes.  “The fact that it does it without removing the nitro is the weird part. It’s an unexpected move,” Lieberman said.\nKryptonite suicide\nThen there’s the weirdness around metal.\n5NAA-A is a metalloprotease, an enzyme that needs a metal ion to do its work.  But unlike other metalloproteases, it doesn’t have one embedded in it.  It can operate with one of four different metals, but 5NAA-A can’t seem to find the metal on its own.\n“It relies on 5NAA to bring it to the party,” Lieberman said.\nIn other words, poison 5NAA seems to tow a metal ion up to enzyme 5NAA-A, which then takes it away and uses it to destroy the poison. It’s like Superman handing off kryptonite to an arch enemy.\n“At least that’s very much what we think is happening,” Lieberman said.  “We’re going to investigate the details further.”\nSolitary master\nThe sum of 5NAA-A’s weird ways led Lieberman’s team to check an enormous genome database for matches of the gene sequence that can produce an enzyme like 5NAA-A.  They found only one single known other example on Earth.\n“That enzyme gene sequence comes from sediment in Yellowstone National Park,” Lieberman said. It is not yet confirmed that bacteria housing it actually detoxify 5NAA, though it’s likely.\nEven if it does, enzyme 5NAA-A remains uncommonly rare, given the myriad microbes on Earth producing an even higher number of enzymes. “The fact that there may just be one other is mind-boggling,” Lieberman said.\nHigh school researchers\nIn another rarity, a high school science teacher is one of the authors on the research paper.\nCasey Bethel , who was named\nGeorgia Teacher of the Year for 2017 , helped the other researchers break through a barrier that was holding up progress.\n“We use so-called tags to identify the enzyme we’re interested in when we go to harvest it. We suspected the tags were interfering in the crystallization process,” Bethel said. So, he cloned the proteins with removable tags, which significantly helped the project move forward.\nBethel participates in Georgia Tech’s\nmain K-12 outreach, CEISMC , which, among other things, boosts STEM education among underserved populations in Georgia public schools. And for three years, CEISMC has helped him improve his teaching skills.\nBethel has also\nbrought high school students to work in Lieberman’s lab with him . He’s thrilled that he -- and they -- could be a part of the study. “Fantastical! Unimaginable! Who’d think that a high school teacher would be published in a Nature journal?” Bethel said.\nSince starting with Georgia Tech’s outreach, Bethel has seen at least 60 of his former students choose STEM studies and careers. “Whereas before, the number was close to zero,” he said. “It’s indescribable. It’s momentous, magnificent and impactful. I’ll never be able to measure the impact.”\nREAD: Georgia Tech's major outreach to K12 students\nREAD: Hairy nanorods and the fight against cancer\nFormer Georgia Tech researchers Sibel Kalyoncu and David P. Heaner Jr. were the paper’s main authors; Zohre Kurt, Casey M. Bethel, Chiamaka Ukachukwu, Srinivas Chakravarthy and Jim C. Spain, all from Georgia Tech coauthored the paper. The research was funded by the National Science Foundation (CAREER award 0845445), and the U. S. Department of Energy, Office of Science, Office of Basic Energy Sciences (contract W-31-109-Eng-38).\nAdditional Images\nContact\nWriter and contact: Ben Brumfield\nResearch News\n(404) 660-1408\nEmail\nben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}