{"text": "Flexible, Wearable Oral Sodium Sensor Could Help Improve Hypertension Control | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nFlexible, Wearable Oral Sodium Sensor Could Help Improve Hypertension Control\nResearchers have developed a flexible, wearable sensor for measuring how much salt a person consumes.\nFacebook\nTwitter\nEmail\nThe intraoral electronics with a sodium sensor is based on a breathable elastomeric membrane that resembles a dental retainer. The ultrathin device is flexible and stretchable, and can wirelessly transmit data up to 10 meters. (Credit: Rob Felt, Georgia Tech).\nMay 07, 2018\n— Atlanta, GA\nFor people who have hypertension and certain other conditions, eating too much salt raises blood pressure and increases the likelihood of heart complications. To help monitor salt intake, researchers have developed a flexible and stretchable wireless sensing system designed to be comfortably worn in the mouth to measure the amount of sodium a person consumes.\nBased on an ultrathin, breathable elastomeric membrane, the sensor integrates with a miniaturized flexible electronic system that uses Bluetooth technology to wirelessly report the sodium consumption to a smartphone or tablet. The researchers plan to further miniaturize the system – which now resembles a dental retainer – to the size of a tooth.\n“We can unobtrusively and wirelessly measure the amount of sodium that people are taking in over time,” explained Woon-Hong Yeo, an assistant professor in the Woodruff\nSchool of Mechanical Engineering\nat the Georgia Institute of Technology. “By monitoring sodium in real-time, the device could one day help people who need to restrict sodium intake and learn to change their eating habits and diet.”\nDetails of the device are reported May 7 in the\nearly edition of the journal Proceedings of the National Academy of Sciences . The device has been tested in three adult study participants who wore the sensor system for up to a week while eating both solid and liquid foods including vegetable juice, chicken soup and potato chips.\nAccording to the American Heart Association, Americans on average eat more than 3,400 milligrams of sodium each day, far more than the limit of 1,500 milligrams per day it recommends. The association surveyed a thousand adults and found that “one-third couldn’t estimate how much sodium they ate, and another 54 percent thought they were eating less than 2,000 milligrams of sodium a day.”\nThe sodium sensing system could address that challenge by helping users better track how much salt they consume, Yeo said. “Our device could have applications for many different goals involving eating behavior for diet management or therapeutics,” he added.\nKey to development of the intraoral sensor was replacement of traditional plastic and metal-based electronics with biocompatible and ultrathin components connected using mesh circuitry. Sodium sensors are available commercially, but Yeo and his collaborators developed a flexible micro-membrane version to be integrated with the miniaturized hybrid circuitry.\n“The entire sensing and electronics package was conformally integrated onto a soft material that users can tolerate,” Yeo explained. “The sensor is comfortable to wear, and data from it can be transmitted to a smartphone or tablet. Eventually the information could go a doctor or other medical professional for remote monitoring.”\nThe flexible design began with computer modeling to optimize the mechanical properties of the device for use in the curved and soft oral cavity. The researchers then used their model to design the actual nanomembrane circuitry and choose components.\nThe device can monitor sodium intake in real-time, and record daily amounts. Using a smartphone or tablet application, the system could advise users planning meals how much of their daily salt allocation they had already consumed. The device can communicate with a smartphone up to ten meters away.\nNext steps for the sodium sensor are to further miniaturize the device, and test it with users who have the medical conditions to address: hypertension, obesity or diabetes.\nThe researchers would like to do away with the small battery, which must be recharged daily to keep the sensor in operation. One option would be to power the device inductively, which would replace the battery and complex circuit with a coil that could obtain power from a transmitter outside the mouth.\nThe project grew out of a long-term goal of producing an artificial taste system that can sense sweetness, bitterness, pH and saltiness. That work began at Virginia Commonwealth University, where Yeo was an assistant professor before joining Georgia Tech.\nIn addition to Yeo, the paper’s authors include Yongkuk Lee, Saswat Mishra, and Musa Mahmood of Georgia Tech; Matthew Piper, Youngbin Kim, Connor Howe, Dong Sup Lee, Katie Tieu, James Coffey and Richard Costanzo of Virginia Commonwealth University; Hun-Soo Byun of Chonnam National University in Korea, and Mahdis Shayan and Youngjae Chun of the University of Pittsburgh.\nThis research was funded with a research grant from the MEDARVA Foundation, a seed grant from the Georgia Tech Institute for Electronics and Nanotechnology, a grant by the Fundamental Research Program (PNK5061) of the Korea Institute of Materials Science, and startup funding from Georgia Tech.\nCITATION : Yongkuk Lee et al., “Wireless, Intraoral Hybrid Electronics for Real-Time Quantification of Sodium Intake Toward Hypertension Management,” (Proceedings of the National Academy of Sciences, 2018).\nhttp://www.pnas.org/content/early/2018/05/01/1719573115\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia 30332-0181  USA\nMedia Relations Assistance : John Toon (404-894-6986) (jtoon@gatech.edu).\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}