{"text": "Metamaterial Separation Proposed for Chemical, Biomolecular Uses | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMetamaterial Separation Proposed for Chemical, Biomolecular Uses\nResearchers have proposed using metamaterials to offer a new separation technique for chemicals and biomolecules.\nFacebook\nTwitter\nEmail\nConcentration profiles for cloaked compound A at different times and steady-state. (a–e) background, (f–j) anisotropic homogeneous cloak, (k–o) multilayer cloak. (Credit: Martin Maldovan and Juan Manuel Restrepo-Flórez, Georgia Tech)\nMar 02, 2016\n— Atlanta, GA\nThe unique properties of metamaterials have been used to cloak objects from light, and to hide them from vibration, pressure waves and heat. Now, a Georgia Institute of Technology researcher wants to add another use for metamaterials: creating a new directional separation technique that cloaks one compound while concentrating the other. Though the idea must still be proven experimentally, the researchers believe that manipulating mass transfer using metamaterials could help reduce the energy required for certain chemical and biomolecular processes. The proposed technique would use specially-patterned polymeric materials to direct the flow of atoms by taking advantage of their specific physical properties. A detailed explanation for how the technique could be used to separate a mixture of nitrogen and oxygen – by cloaking the nitrogen and concentrating the oxygen – was reported February 25 in the journal Scientific Reports. The research was supported by a seed grant from the American Chemical Society. “We will control how the atoms cross the metamaterial, in which direction they will go,” said Martin Maldovan, an assistant professor in Georgia Tech’s School of Chemical & Biomolecular Engineering and School of Physics. “By designing the diffusivity of the metamaterials, we can make the atoms of one compound go one way, and the atoms of another compound go a different way. We are manipulating the physical properties to control the direction the atoms take through the metamaterial shell.” Maldovan and Graduate Research Assistant Juan Manuel Restrepo-Flórez have evaluated their metamaterial using computational techniques, and plan to build a prototype separation device this summer. The work could have applications in such areas as chemical manufacturing, crystal growth of semiconductors, waste recovery of biological solutes or chemicals, and production of artificial kidneys. The metamaterial technique could supplement traditional membranes, which control the passage of chemicals by varying solubility and diffusivity. Similar in principle to other metamaterials, the mass transfer technique can either direct chemicals around the shell, or concentrate them within the shell. “Inside the metamaterial shell, you can tell one atom to do one thing, and another atom to do something else,” Maldovan said. “Our metamaterials will control the flow because they are anisotropic – certain directions are favored by the structure. We are controlling where the atoms go.” Maldovan’s plan for the mass transfer metamaterials uses four different types of polymers, two with high diffusivity and two with low diffusivity. The size and patterning of blocks made from each material is determined by mathematical algorithms. “With this metamaterial, we can control the direction the atoms can go using the trick of anisotropy,” he explained. “This would be in addition to separation based on solubility and diffusivity. We have added an important parameter to the toolbox of chemical engineers: where to send the atoms.” In addition to separating atoms, the ability of the metamaterials to concentrate atoms could allow sensors to detect more dilute quantities, essentially amplifying the available chemical signal. In their paper, the researchers show how to separate a 50-50 mixture of nitrogen and oxygen using available polymers that have the necessary properties. Each type of separation will require polymers with different properties, not all of which are available in existing materials, meaning not all chemical or biomolecular mixtures will be amenable to separation with the new technique. The new separation process won’t replace traditional distillation and membrane separation processes, but could supplement them, Maldovan said. “Distillation and evaporation are very energy intensive, but they are the workhorses of the chemical industry,” he said. “Membrane processes have been developed to reduce energy use. Our goal is to provide a technique that uses even less energy. This could lead to better and more efficient membranes that would provide better separation.” The metamaterials will ultimately have to be fabricated at the micron scale to be effective. But Maldovan says prototypes can be made using larger structures – at the centimeter scale – to demonstrate the process. “We need first to fabricate them, then optimize the design,” he said. “We know what needs to be fabricated, so future efforts will combine design, fabrication, and optimization.” CITATION : Restrepo-Flórez, J. M. and Maldovan, M., “Mass Separation by Metamaterials,” (Scientific Reports, 2016)\nhttp://dx.doi.org/10.1038/srep21971 . Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contact : John Toon (404-894-6986) ( jtoon@gatech.edu ). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}