{"text": "Wearable Device Could Help EMTs, Surgeons Assess Hemorrhage Blood Loss | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nWearable Device Could Help EMTs, Surgeons Assess Hemorrhage Blood Loss\nA new device under development could help first responders more accurately assess the effects of blood loss due to hemorrhage.\nFacebook\nTwitter\nEmail\nResearchers have shown that they can accurately assess blood loss by measuring seismic vibrations in the chest cavity and by detecting changes in the timing of heartbeats. That could lead to development of a smart wearable device that could be carried by ambulance crews and medics and made available in emergency rooms and surgical facilities.\nAug 31, 2020\n— Atlanta, GA\nEmergency medical technicians (EMTs), military medics, and emergency room physicians could one day be better able to treat victims of vehicular accidents, gunshot wounds, and battlefield injuries thanks to a new device under development that may more accurately assess the effects of blood loss due to hemorrhage.\nA research team has now shown that it can accurately assess blood loss by measuring seismic vibrations in the chest cavity and by detecting changes in the timing of heartbeats. The knowledge, developed in the laboratory, could potentially lead to development of a smart wearable device that could be carried by ambulance crews and medics and made available in emergency rooms and surgical facilities.\n“We envision a wearable device that could be placed on a person’s chest to measure the signs that we found are indicative of worsening cardiovascular system performance in response to bleeding,” said\nOmer Inan , associate professor in the\nSchool of Electrical and Computer Engineering\nat the Georgia Institute of Technology. “Based on information from the device, different interventions such as fluid resuscitation could be performed to help a victim of trauma.”\nThe research, supported by the Office of Naval Research, was reported July 22 in the journal\nScience Advances . It included collaborators from the Translational Training and Testing Laboratories in Atlanta, an affiliate of Georgia Tech, and the University of Maryland.\nBlood loss can result from many different kinds of trauma, but the hemorrhage can sometimes be hidden from first responders and doctors. Heart rates are normally elevated in people suffering from trauma, and blood pressure — now the most commonly used measure of hemorrhage — can remain stable until the blood loss reaches a life-threatening stage.\n“It’s very difficult because the vital signs you can measure easily are the ones that the body tries very hard to regulate,” Inan said. “Yet you have to make decisions about how much fluid to give an injured person, how to treat them — and when there are multiple people injured — how to triage those with the most critical needs. We don’t have a good medical indicator that we can measure noninvasively at an injury or battlefield scene to help make these decisions.”\nUsing animal models, Inan and graduate students Jonathan Zia and Jacob Kimball carefully studied seismic vibrations from the chest cavity and electrical signals from the heart as blood volume was gradually reduced. The researchers wanted to evaluate externally measurable indicators of cardiovascular system performance and compare them to information provided by catheters making direct measurements of blood volume and pressure.\nThe key indicator turned out to be a seismocardiogram, a measure of the micro-vibrations produced by heart contractions and the ejection of blood from the heart into the body’s vascular system. But the researchers also saw changes in the timing of the heart’s activity as blood volume decreased, providing another measure of a weakening cardiovascular system.\n“The most important lower-level feature we found to be important in blood volume status estimation were cardiac timing intervals: how long the heart spends in different phases of its operation,” Inan said. “In the case of blood volume depletion, the interval is an important indicator that you could obtain using signals from a wearable device.”\nIn such a device, these noninvasive mechanical and electrical measures could be combined to show just how critical a patient’s blood loss was. Machine learning algorithms would use the measurements to generate a simple numerical score in which larger numbers indicate a more serious condition.\n“We would give an indicator that is representative of the overall status of the cardiovascular system and how close it is to collapse,” Inan said. “If one patient is rated 50 and another is 90, first responders could give priority to the patient with the higher number.”\nBeyond emergency situations, the new assessment technique could be helpful with many types of surgery in which quickly identifying unseen blood loss could improve the outcome for patients.\nIn future work, Inan and his collaborators expect to create a prototype device that could take the form of a patch just 10 millimeters square. Additional electrical engineering will be needed to filter out the kinds of background noise likely to be found in real-world trauma situations, and for successful operation when the patient is being transported.\n“Long-term, we want to partner with clinicians to do studies in humans where we would use the wearable patch and be able to take measurements when people were coming into the trauma bay, or even while EMTs were still deployed,” Inan said. “This could become a new way of monitoring hemorrhage that could be used outside of clinical settings.”\nThe researchers also want to study the opposite problem — how to determine when enough fluid has been provided to an injured patient. Too much fluid can cause edema, similar to the conditions of heart failure patients whose lungs fill with liquid.\nThis material is based on work supported by the Office of Naval Research (ONR) under grant N000141812579. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the ONR.\nCITATION : Jonathan Zia, Jacob Kimball, Christopher Rolfes, Jin-Oh Hahn, and Omer T. Inan,” “Enabling the assessment of trauma-induced hemorrhage via smart wearable systems.” (Science Advances 2020)\nhttps://doi.org/10.1126/sciadv.abb1708\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : John Toon (404-894-6986) (jtoon@gatech.edu).\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}