{"text": "The Man Behind the Maps | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nThe Man Behind the Maps\nHundreds of maps detail the Tech campus. Doug Sims sees endless opportunities to utilize data to keep the community informed.\nFacebook\nTwitter\nEmail\nSenior Systems Support Engineer for Infrastructure and Sustainability Doug Sims flags an upcoming project using GIS mapping.&nbsp;\nJun 12, 2023\nIf you’re looking for the\nnearest trash can on campus\nor if you’re interested in\nthe type of heating system\nused in any given building, there's a map for that.\nIn a digital age, an endless amount of data is available at the tap of a screen. That accessibility allows Doug Sims to keep all 482 of Infrastructure and Sustainability's (I&S) maps up to date for the Georgia Tech community.\nSims arrived at Tech in 2008 as a utility analyst. With a background in civil engineering and the keen eye of a land surveyor, he began identifying ways to streamline operations using a geographic information system (GIS). At the time, Sims explained that GIS was seldom used outside of tax assessors’ offices, but he recognized its ability to connect lines on a page to valuable data.\n\"If you're looking at a line for a pipe, you can click on the pipe and see that it's a 10-inch pipe, and you can see what it carries, what it's used for, and where it goes,\" Sims said.\nOver the past 25 years, Sims noted how GIS has exponentially evolved to map out entire countries. Georgia Tech is often described as a city within a city, and with the help of GIS, that presents an opportunity for the department to get a better lay of the land.\n\"We have our own electrical distribution system. We have our district energy for the chilled water and the steam managed by I&S. When you look at how GIS is normally used, it's normally looking at larger scales. So, once you start shrinking it to a relatively small area like the Tech campus, it changes how you look at things as they become much more detailed,” he said.\nNow the senior\nsystems support engineer\nfor Infrastructure and Sustainability, Sims' foresight to increase GIS application was a catalyst for\nthe data sets that exist today . In his role, Sims continues to search for ways to capture additional data points and recognizes that the communal nature of a campus setting can provide opportunities for instantaneous collaboration.\n\"It's a big paradigm shift. It's putting power in the hands of the people where they can make the changes immediately. Whether I'm sitting on campus or 50 miles away, I can make a change. They can hit refresh and see that change immediately. It's changing how we think about and use that data every day,\" he said.\nA recent project, working alongside the recycling and zero waste department, invited students to identify the location of all trash cans and recycling bins on campus. Sims' creation allowed participants to use their phones to pinpoint locations that were added to the map, which has since been used for additional analysis of the Institute's sustainability efforts.\nThe ability to connect with data instantaneously has helped Sims and his staff, which recently added a new team member –– a Tech alumna who worked with the department as an undergraduate –– to expedite work orders across campus. The first widespread application of GIS mapping empowers members of the Tech community to\nreport landscaping requests to I&S\nby marking the exact location of the issue, sending photos and any other relevant information directly to an organized dashboard for review. Sims hopes to expand this service to additional services in the coming years.\nKeeping campus informed and operating at its most efficient is a point of personal pride for Sims, and, wielding what he calls the “GIS hammer,” he hopes to be a springboard to assist other departments using GIS.\n\"If people want to map something or see what we have, get in touch with me, and let's see if there's a solution we can provide to you,\" he said. \"I'm here to come up with an answer that makes their day easier, makes their job easier, and provides data for other people to share around campus.\"\nSims laments that while he does get the rare request for printed maps, they are often already outdated while they’re still warm from the printer due to the speed at which data changes at Tech.\nAdditional Images\nContact\nSteven Gagliano\n- Communications Officer\nInstitute Communications\nEmail\nSteven.gagliano@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}