{"text": "Marking Two Years of War in Ukraine. What Does the Future Hold in Store? | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMarking Two Years of War in Ukraine. What Does the Future Hold in Store?\nIvan Allen College of Liberal Arts experts assess the state of the Ukraine war on its second anniversary.\nFacebook\nTwitter\nEmail\nIvan Allen College of Liberal Arts experts assess the state of the Ukraine war on its second anniversary.\nFeb 21, 2024\nSaturday, Feb. 24, marks two years since Russian forces invaded Ukraine. Ivan Allen College of Liberal Arts experts have closely tracked the conflict from the frontlines to potential fault lines in Western support for Ukraine, as well as the potential impact on the global economy. We asked some of these scholars to offer their insights into how the way the war  has evolved in the past year, and what to look out for going forward.\nOur experts:\nGen. Philip Breedlove , former NATO Supreme Commander and distinguished professor of the practice in the Sam Nunn School of International Affairs\nRobert Bell , former senior civilian representative of the U.S. Secretary of Defense in Europe and the defense advisor to the U.S. ambassador to NATO; also a distinguished professor of the practice in the Sam Nunn School of International Affairs\nDina Khapaeva , professor of Russian, School of Modern Languages\nNikolay Koposov , distinguished professor of the practice, School of History and Sociology\nHow has Russia responded to developments in the last year?\nBreedlove : I probably said last year that they were failing and that they were not adaptive ,\nand they were rather rigid, and they were. They have had bad planning, bad logistics, bad general officership, bad decisions, and brought the wrong people to the battlefield. It's just been horrible. But that now is changing. Mr. Putin is having to face up to the fact that he can't keep doing that. He’s going into an election. Support for what even people in Russia are now calling a war is beginning to fall. As we say in America, we’re running out of money, now we have to think. Well, Mr. Putin is running out of troops, so now he has to think. And we’re now starting to see some adaptations in the use of air power and some better tactics more suited to small-unit warfare.\nWhat has Ukraine done well?\nBreedlove : Ukraine has just absolutely rearranged Russia in the Black Sea. They have essentially made the northern 20% of the Black Sea untenable for Russia, and Russia has had to relocate major assets to the south and east. And whenever they're trying to move in and out of Crimea, especially, Ukraine is making them pay and making them pay dearly. They’ve adapted small, commercial, over-the-counter drones and made them into a very lethal flighting fleet: Russia is still losing tanks to $270 drones. And their surface and under-surface naval drone capability is in the middle of defeating the northern part of the Black Sea fleet. That is beyond astounding. They are really leading the world in that way, and we are learning from them.\nWhat military aid does Ukraine most need from the West?\nBreedlove : Victory is not about any one bright shiny object. What Ukraine needs is what the United States would take to this fight if we were involved militarily. They need air superiority to enable modern maneuver warfare, and they need the sensor capabilities to discriminate targets from friends and to command and control. Then we can talk about the thing everybody wants to talk about: the ability to shoot, whether it’s a\nPatriot , a\nTHAAD , or an F-16. You throw a bunch of F-16s out there in the middle of the battlefield, they'd do some pretty good work, but they would do amazing work if they were hooked to a capability to sense, discern, target, shoot.\nBell : The two most critically needed enhancements in Ukraine’s military inventory are modern air superiority fighter aircraft (e.g., the F-16s now being delivered, but in larger numbers) and long-range “deep strike” fires such as the U.S.\nATACMS\nsystem already provided, but in the longer-range missile version, as well as the German-made\nTaurus\nlong-range missile. These systems could alter the course of the war in Ukraine’s favor, especially if their use were to be concentrated on a deliberate strategy of denying Russia any military presence on or access to Crimea.\nWere that goal to be achieved, it would constitute a “strategic defeat” for Putin since Russian ambitions have for centuries prioritized control of Crimea. That might increase the admittedly long odds that Putin might see value in negotiating an acceptable outcome to this conflict.\nWhat’s the outlook for continued Western aid?\nBell:\nThe EU has just renewed its support for Ukraine’s economy with a\n€ 54 billion package . Whether the U.S. Congress can pass the pending supplemental appropriations request from President Biden for\n$60 billion\nin further military assistance remains to be seen. The domestic argument over securing the U.S. Southern border is the primary holdup there. However, U.S. support could also be put at risk if Kyiv fails to adequately attack domestic corruption or President Zelenskyy begins to rule in an unacceptably autocratic fashion. Also, priorities could shift if the U.S. military involvement in the Middle East conflicts escalates, or if China were to attempt to reintegrate Taiwan by force.\nKoposov :\nWestern fatigue is obvious and understandable, but the key thing is that Western opinion has not yet appreciated the importance of the problems at stake. We still very much live in a state of post-Cold War triumphalism and do not understand that the world has dramatically changed since communism collapsed and that the new challenges to democracy are no less serious than those it had to face in the   20th\ncentury. Almost all domestic problems should now be postponed, and the West should mobilize all its resources to get rid of Putin once and forever.\nAre there any less-often-discussed underlying structural weaknesses in the Russian military-industrial complex that could significantly limit its ability to continue fighting?\nBell : President Putin is clearly worried about possible civil disobedience and public resistance were he to order a general mobilization. This is why he has relied on mercenaries, generous pay, and bonus offers to recruits from distant corners of Russia, and pardon offers to convicts. Nonetheless, if Putin must choose between a wider conscription or conceding defeat to Ukraine, he will most likely choose the former and amplify his already strong public messaging that suffering and sacrifice for Russia are patriotic and good for one’s soul.\nHence no “tipping point” is yet in sight.\nKhapaeva : Russian volunteers recruited from the most socially and economically disadvantaged groups can expect to receive a payment for their military service that amounts to a lifetime of earnings. The moment Putin’s administration is cut off from its oil and gas profits, Russians may become much less willing to serve as cannon fodder, creating conditions for changing the general political atmosphere in the country.\nAre sanctions having any impact on Russia’s war effort or domestic morale?\nKhapaeva : The historical memory of the conditions under which generations lived in this country must be taken into consideration. Russian history is one of regular famines, starvation, food shortages, and an economy of deficit, all which are alive in the collective memory. Living standards in Russia remain far below those of its Western neighbors, but current sanctions cannot even approach that historical level of poverty. Moreover, many Russians consider their memories of misery as testifying to national resilience. This goes well with Putin’s propaganda, which has been successful in presenting state terror as a matter of national pride and heritage.\nWhat role can diplomacy play in bringing an end to the conflict?\nBell : A Western diplomatic effort to persuade China and key Global South nations to pressure Russia might persuade Moscow to swiftly end its pursuit of total victory in Ukraine, but such a scenario is unlikely. However, some other avenues do exist to hinder Russia's war effort.\nFor instance, the U.S. could work with fellow permanent UN Security Council members France and the UK and incoming members Japan and South Korea on a “name and shame” campaign to expose and condemn Russia’s blatant violation of UN Security Council resolutions that imposed strict sanctions on North Korea’s military exports and imports related to its illegal and dangerous nuclear and ballistic missile programs. That could help isolate Russia and delegitimize its actions.\nKoposov : I do not think there is, or should be, any room for diplomacy at this point. Do we need another Munich?\nWhat are the most concerning \"wildcard\" scenarios you can envision?\nBell : The assassination of Zelenskyy by the Russian FSB or his death in a missile strike, or a collapse of morale within the Ukrainian military.\nKhapaeva : If the “vertical of power” cracks, leaders of the estimated 30 private armies in Russia may start acting as independent warlords, fighting for power and resources inside Russia. This could eventually lead to the collapse of the Russian Federation into several states, helping Ukraine and the West to win the war. The decentralization of the Federation was avoided in 1991 – not without Western help – out of fear that nuclear arms would proliferate into the hands of even smaller and less controllable states. Judging from today, that looks like shortsighted politics.\nBreedlove : The big wild card is that Mr. Putin understands how to yank our chain, and if Ukraine started winning, the first thing you'd probably hear are new threats around the nuclear power plant in Zaporizhia. We told Russia before the war what we were afraid of: We are afraid of nukes and we're afraid of the war widening. Mr. Putin uses those tools constantly to keep us deterred. But if Russia ends up killing a bunch of NATO people, that's a big wild card and one that is frankly really unsavory to talk about.\nHow will this all turn out?\nBell : If President Biden is re-elected and Congress agrees to continue the delivery of U.S. military weaponry at roughly the same level and in the same categories and types as before, we can expect that neither of the two contesting parties will achieve a decisive breakthrough for the foreseeable future. If President Trump is elected in November, we can expect some sort of dramatic U.S. proposal for an immediate halt to the fighting.  Assuming that is rejected outright by Ukraine and Trump cuts off all U.S. military assistance in response, then Ukraine’s ability to continue to prosecute the war for more than a few more months would be at risk, and its incentives, however unwilling, to seek a negotiated settlement would be increased.\nBreedlove : It is my belief that this war will end exactly how Western policy leaders decide it's going to end. If we give Ukraine what they need to win, and we are not doing that now, they will win. If we stop supporting Ukraine, they will lose. And if that happens the fact of the matter is that Russia will again subjugate Ukraine, and many tens of thousands of Ukrainian soldiers and civilians will die in a guerrilla conflict the likes of which Russia has never seen.\nWhat are the potential long-term geopolitical ramifications of the war?\nKoposov : If Putin wins the war, he will most likely continue with other aggressions, and U.S. leadership in the world will be significantly undermined. China will most likely learn the lesson and imitate him, at least to some extent. And the so-called Global South will become even more anti-American than it is now.\nBell : NATO’s own security is inextricably intertwined in the outcome of this conflict.\nAs the leaders of the alliance themselves agreed at their summit in Madrid in 2022, Russia’s willingness to prosecute this aggression means that it cannot be excluded that it might also decide to commit aggression against a NATO ally, NATO’s Article 5 collective security commitments notwithstanding.\nKhapaeva : If Putin wins, the war will not end Russia’s aggression and put to rest its ambitions to restore the Russian Empire/USSR. An attack on an Eastern European or Baltic NATO state is already avidly discussed by Kremlin propagandists. The West showed a feeble and inconsistent response to Russia’s war against Georgia in 2008 and the 2014 annexation of Crimea. After Russia invaded Ukraine, made-up fear of crossing “Putin’s red lines” led to rationing the arms to Ukraine and enabled Russia to buy time and fortify the front line on the occupied territories. It’s going to be hard to persuade the Russians that they now must obey the international norms they have been violating for the past two decades. Hence, Putin will seek to compromise NATO. If, at that moment, the U.S. decides to instead focus on its “domestic agenda,” NATO’s collapse will become imminent.\nContact\nMichael Pearson\nIvan Allen College of Liberal Arts\nEmail\nmichael.pearson@iac.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}