{"text": "Steven McLaughlin Named Provost and Executive Vice President for Academic Affairs at Georgia Tech | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nSteven McLaughlin Named Provost and Executive Vice President for Academic Affairs at Georgia Tech\nMcLaughlin will assume the lead academic role effective October 1, 2020.\nFacebook\nTwitter\nEmail\nSep 15, 2020\n— Atlanta, GA\nSteven McLaughlin will assume the role of Provost and Executive Vice President for Academic Affairs effective October 1, 2020.\n“After an extensive national search, the candidate who rose to the top was our own Steve McLaughlin, the current Dean of our top-ranking College of Engineering,” said Georgia Tech President Ángel Cabrera. “Steve has served in leadership roles at Georgia Tech for nearly 25 years and is co-chairing the Steering Committee for the Institute’s new strategic plan, which will be launched later this fall. He is an inclusive leader who puts words into action as evidenced by the flagship CREATE-X program for student entrepreneurship that he helped develop and launch six years ago, as well as the work he’s done across campus in the areas of diversity, equity, and inclusion, and student mental health and well-being, which he is so passionate about.”\nAside from his proven record in championing innovation, McLaughlin’s strengths also align with the Institute’s new strategic themes of amplifying impact, expanding access, cultivating well-being, leading by example, and connecting globally.\nHe served as deputy director of Georgia Tech-Lorraine for two years and subsequently became the Institute’s first Vice Provost for International Initiatives and the Steven A. Denning Chair in Global Engagement. In addition, he served as the Steve W. Chaddick School Chair in the School of Electrical Engineering before serving as Dean and Southern Company Chair in the College of Engineering. He has also focused efforts to grow diversity, equity, and inclusion in the College of Engineering.\n“The College of Engineering has been consistently ranked by  Diverse Issues in Higher Education  as number one in engineering doctoral degrees awarded to African Americans and is the largest producer of engineering degrees awarded to women and underrepresented minority students,” Cabrera said. “I very much appreciate Steve’s contributions to these outcomes and his commitment to expanding access to students of all backgrounds.”\nDuring his three-year tenure as Dean and Southern Company Chair of the College of Engineering at Georgia Tech, the College has continued to rank among the country’s top five engineering institutions. The  U.S. News & World Report  2021 “Best Colleges” undergraduate rankings announced yesterday reinforced the success of the College under McLaughlin’s leadership. The Institute remains ranked No. 4 for best undergraduate engineering programs overall, and six of the 10 programs are ranked No. 1 among public universities. The College also received more than $270 million in research awards in 2019.\n“It is a dream come true to step into the role of Provost and Executive Vice President for Academic Affairs at Georgia Tech, a top 10 public university, and a place I truly love,” said McLaughlin. “I am filling big shoes as Dr. Rafael Bras steps down, and I am grateful for his guidance over the years. I intend to build on his work while driving forward the strategy we’ve built to develop leaders who advance the human condition.”\nAn 18-person advisory committee, co-chaired by Dr. Charles Isbell, Dean of the College of Computing and John P. Imlay Jr. Chair, and Dr. Susan Lozier, Dean of the College of Sciences and Betsy Middleton and John Clark Sutherland Chair, conducted a thorough national search with the support of Heidrick & Struggles.\n“I extend my deepest gratitude to Charles, Susan, and the entire search committee for the work they did to evaluate an extraordinary pool of candidates and present a talented and diverse set of choices,” said Cabrera. “Even in the midst of the challenges we’ve faced with Covid-19, this group continued to move forward to identify an impressive slate of candidates. Their work helped me select the candidate who will help lead Georgia Tech into the next decade of innovation, research, and academic excellence.”\nMcLaughlin fills the role after a decade of leadership with Dr. Rafael Bras in the position. During that time, Georgia Tech established itself among the leading public universities in the nation. Among his many accomplishments at Georgia Tech, Bras launched the Commission on Creating the Next in Education, an Institute-wide effort to shape the future of higher education. Under his leadership, Georgia Tech launched the pioneering Online Master of Science in Computer Science (OMSCS) program, as well as subsequent online degree programs in analytics and cybersecurity that, together, enroll more than 12,000 students globally. This semester the work Bras did on Library Next, a multimillion-dollar, technology-focused reimagining of the intellectual center of the campus was completed as the final library building opened in the center of East Campus.\n“I am grateful for the lasting impact that Rafael’s leadership has had,” said Cabrera. “I very much look forward to working with Steve to build on that very solid foundation as we find new ways to deliver on our mission of Progress and Service.”\nDetails about an interim Dean for the College of Engineering and plans to begin a search for a permanent replacement will be announced in the coming weeks.\nAbout Dr.   Steven   McLaughlin\nDr. Steven W. McLaughlin is currently the Dean and Southern Company Chair of the College of Engineering at the Georgia Institute of Technology. He currently serves as the chief academic officer of the College and provides leadership to more than 500 faculty members and more than 17,000 students at the largest engineering college in the country.\nMcLaughlin received the B.S.E.E. degree from Northwestern University, the M.S.E. degree from Princeton University, and the Ph.D. degree from the University of Michigan. He joined the School of Electrical and Computer Engineering at Georgia Tech in September 1996. From 2012 to 2017 he was the Steve W. Chaddick School Chair in the School of Electrical and Computer Engineering and from 2007 to 2012, he was Vice Provost for International Initiatives and Steven A. Denning Chair in Global Engagement.\nIn 2014, he co-founded CREATE-X, a campuswide effort to instill entrepreneurial confidence in students and help them launch companies. The program has successfully launched 159 student-led companies and engaged 4,000 students in the principles and practice of evidence-based entrepreneurship.\nIn 2011, he was awarded the honor Chevalier de l`Ordre Nationale du Merite, (Knight of the French National Order of Merit), the second highest civilian award given by the Republic of France. He was the first Georgia Tech recipient of the Presidential Early Career Award for Scientists and Engineers (PECASE) where he was cited by President Bill Clinton \"for leadership in the development of high-capacity, nonbinary optical recording formats.\" He is a past President of the IEEE Information Theory Society and a Fellow of the IEEE.\nHis research interests are in the general area of communications and information theory. His research group has published in the areas of forward error correction and equalization in wireless communications, magnetic/optical data storage, and data security and privacy. His group has published and presented more than 250 papers in journals and conferences and holds 36 U.S. patents.\nAdditional Images\nRelated links\nOffice of the Provost\nContact\nBlair Meeks\nInstitute Communications\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}