{"text": "Working Groups Established to Explore Lifetime Learning Unit | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nWorking Groups Established to Explore Lifetime Learning Unit\nEstablishing a new academic unit is a long process, and Tech is at the very beginning.\nFacebook\nTwitter\nEmail\nGeorgia Tech Campus\nOct 14, 2022\n— Atlanta, GA\nThe Georgia Institute of Technology is announcing its intention to launch a new academic unit dedicated to lifetime learning. The new unit will bring together three entities whose work underpins its mission and vision: Georgia Tech Professional Education (GTPE), the Center for Education Integrating Science, Mathematics, and Computing (CEISMC), and the Center for 21st Century Universities (C21U).\nThis launch means opportunities for new and expanded research, curricula, students, and professional support for educators at every stage “from K to grey.”\nEstablishing a new academic unit is a long process, and Tech is at the very beginning. Dean Nelson Baker and Dean Charles Isbell are leading the effort, which currently has three working groups:\nAcademic vision, research, faculty governance, and strategic planning\nBusiness model and operations\nChange management and communications\nThe Institute has engaged an external consultant, Accenture, to survey the existing state of the lifetime learning market and to provide guidance on possible benchmarks against peers and competitors inside and outside of higher education, market opportunities, and best practices of lifetime education ventures.\nIn the coming weeks, the working groups will ask members of the Georgia Tech community to contribute their knowledge and creative energy to the process. A series of listening sessions will be offered to members of CEISMC, C21U, and GTPE to provide input starting later this month. More information and a sign-up form will be provided to faculty and staff in those units in the next week. If you are outside of these units and wish to participate in the process, please fill out\nthis web form\nand you will be contacted for events in the spring. The working groups will integrate insights from the community, the consultants, and from earlier working groups into a detailed proposal for the Board of Regents and the University System of Georgia. That proposal will be submitted in early spring next year.\nThe idea of a lifetime learning unit has been in development for some time. Georgia Tech’s Commission on Creating the Next in Education and its subsequent report led to the formation of an Institute Strategic Plan working group called “GTPE Next,” also chaired by Deans Baker and Isbell. That group made the recommendation to form the new unit.\nThe members of the lifetime learning working groups are as follows:\nAcademic Vision, Research, Faculty Governance & Strategic Planning\nCo-chaired by: Charles Isbell, Dean, College of Computing and Jonathan Clarke, Associate Professor of Finance, Scheller College of Business\nSonia Alvarez-Robinson, Executive Director of Strategic Consulting\nRichard Barke, Associate Professor, Public Policy\nJuana Cunningham, Senior Director of Strategic Consulting\nLizanne DeStefano, Executive Director, CEISMC and Professor, Psychology\nCharles Domercant, Senior Research Engineer, Georgia Tech Research Institute\nAshok Goel, Professor, Interactive Computing\nStephen Harmon, Interim Executive Director, C21U, Associate Dean of Research, GTPE, and Professor, Industrial Design\nBradley Hastings, Executive Director of Development, Colleges of Computing and Engineering\nDavid Joyner, Executive Director of Online Education & OMSCS, College of Computing\nGreg King, Associate Vice President for Economic Development, Institute Relations\nJulia Kubanek, Vice President for Interdisciplinary Research\nJ. Rhett Mayor, Associate Professor, Mechanical Engineering and Secretary of the Faculty\nMark Nolan, Associate Vice President of Corporate Engagement\nStephen Ruffin, Associate Dean of Academic Affairs, GTPE\nRohan Sohani, Undergraduate Student Body President\nBusiness Model and Operations\nCo-chaired by: Nelson Baker, Dean, Georgia Tech Professional Education and Daren Hubbard, Vice President for Information Technology and Chief Information Officer, Office of Information Technology\nMary Albertson, Director of Technology Licensing, Commercialization\nSonia Alvarez-Robinson, Executive Director of Strategic Consulting\nPam Buffington, Director of External and Faculty Engagement, C21U\nJuana Cunningham, Senior Director of Strategic Consulting\nJeffrey Fischer, Director of Information Technology, GTPE\nBrandi Foley-Rodgers, Senior Director of HR Strategy and Faculty Administration, Office of the Provost and Office of the EVPR\nKathleen Gosden, Associate General Counsel\nLaura Hessler, Senior Director of HR Support, Administrative Service Center\nCindy Hope, Associate Vice President, Research Administration\nGlenn Hopkins, Principal Research Engineer, Georgia Tech Research Institute\nEmily Howell, Senior Director of Budget Reform\nGloria Kobus, Bursar\nCynthia Martin, Director of Institute Financial Support for Research\nPatrice Miles, Assistant Dean of Business Operations, GTPE\nBrandon Mitchell, Director of Finance, CEISMC\nReta Pikowsky, Associate Vice Provost and Registrar\nTanesha Steward, Director of Affiliated Organizations, Office of the General Counsel\nKellye Terrell, Senior Director, HR Business Partners, Georgia Tech Human Resources\nManagement and Communications\nCo-chaired by: Renee Kopkowski, Vice President, Institute Communications and Jennifer Herazy, Associate Vice President for Strategy and Administration, Office of the Provost and Office of the Executive Vice President for Research\nBrittany Aiello, Communications Program Manager, C21U\nSonia Alvarez-Robinson, Executive Director of Strategic Consulting\nSusan Burns, Associate Chair for Finance and Administration, Civil & Environmental Engineering\nAnn Claycombe, Director of Communications, College of Computing\nJuana Cunningham, Senior Director of Strategic Consulting\nMichael Hagearty, Assistant Vice President of Campus News and Special Events, Institute Communications\nShannon Helton-Amos, Director of Marketing and Digital Strategy, GTPE\nSusie Ivy, Director of Organizational, Academic and Research Communications, Institute Communications\nMorgan McCombs, Director of State Relations, Institute Relations\nAlex Orso, Associate Dean of Off-Campus and Special Initiatives, College of Computing\nRachael Pocklington, Program Director of Strategic Communications and Initiatives, Institute Communications\nLaura Pusateri, Director of Employee Engagement and Well-Being, Georgia Tech Human Resources\nJoëlle Walls, Communications Manager, CEISMC\nSara Warner, Senior Director of Communications, Student Engagement and Well-Being\nAdditional Images\nContact\nSusie Ivy, Director\nOrganizational, Academic and Research Communications\nEmail\nprovostsoffice@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}