{"text": "Meet Belinda Person, Customer Service Representative and Artist | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMeet Belinda Person, Customer Service Representative and Artist\nBelinda Person, customer service representative in the Administrative Services Center, is also an artist whose works have been shown in gallery and museum exhibitions.\nFacebook\nTwitter\nEmail\nBelinda Person's painting titled Knowledge, from the collection titled I, You, Us. United to Transform. (Image courtesy of Belinda Person)\nAug 18, 2023\nAnyone who has gone through the onboarding process at Georgia Tech in the last year may have interacted with Belinda Person. She is one of several customer service representatives in the\nAdministrative Services Center , the front door for all Human Resources and IT inquiries, which launched last fall.\n“One of the main reasons people come to HR is to complete their onboarding as a new hire or as a current employee changing positions,” Person said. “Others come for interviews, or perhaps they’re having a problem accessing the system. The Administrative Services Center can help with all of those issues.”\nPerson also helps employees get a BuzzCard, the Tech ID card that provides access to campus buildings and can be used to purchase meals. “New employees get everything they need here. Once you leave this building, you’re ready to work.”\nThe most rewarding aspect of her job is meeting a variety of people every day. “There are people from all over the world at Georgia Tech, and I get to meet everybody,” she said. “In just a few minutes I get to learn a little bit about their culture and language. I’m from Bogot áa,\nColombia, and I get very happy any time I see someone else from Colombia.”\nThe most challenging part of her job is resolving whatever problem an employee is having. “Some of the problems are easy to solve, but others are a little more complex,” she said. “I always try to put myself in other people’s shoes, so I can empathize with them and help resolve the issue by providing the best customer service possible.”\nAway From Work\nWhile growing up in Colombia, Person played tennis and dreamed of a career as a professional player. “In my mind, I was going to be the next Serena Williams. In high school I trained every day after school and all weekend.”\nHer dream of playing professional tennis did not come to fruition. But she played for four years at Benedict College, a private, historically Black college, in Columbia, South Carolina. She chose to major in art because of a passing interest in the subject.\n“I was a little nervous at the beginning because the other students majoring in art really wanted to be artists, while I wanted to play tennis,” she said. “When I was little, I liked drawing, but I thought it was something that everyone does because I come from a family of artists. My grandmother draws, and my dad is a musician. I didn’t think about being an ‘artist.’ But, after I began taking classes, I found this passion for art.”\nWhenever she got an assignment, she recalled, “Ideas would pop into my brain, and after class I would immediately start working on it. It wasn’t easy, because it still required effort, but I didn’t mind because I actually wanted to do it.”\nAfter graduating with a Bachelor of Fine Arts degree in 2015, she continued painting and drawing. Her works express emotions connected to her ancestral home and her current cultural environment. Her home is her studio, and her living room is filled with paintings.\n“Art is my tool of communication,” she said. “I am lucky to have a beautiful family that has taught me a lot of principles that helped guide me. I feel that I can use my art to communicate my ideas and beliefs about life.”\nPerson’s works have been shown in gallery and museum exhibitions, and in magazines. She recently entered a painting in the\nIBB Art Show\non campus. “I try to put my art out there as much as I can,” she said. “Of course, being on social media helps.” She promotes her art on Instagram at belab_art, and on her\nwebsite .\nShe is happy when her plan falls neatly into place. “Before I begin working on a piece, I like to have a clear idea of what I want. And when I can create what I envisioned, I think that’s great.”\nAdditional Images\nRelated links\nAdministrative Services Center\nThe Administrative Services Center Launches\nRead More Staff Stories\nContact\nVictor Rogers\nInstitute Communications\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}