{"text": "Cheerful Chatbots Don’t Necessarily Improve Customer Service | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nCheerful Chatbots Don’t Necessarily Improve Customer Service\nGT researchers conducted experimental studies to determine if positive emotional displays improved customer service and found that emotive AI is only appreciated if the customer expects it, and it may not be the best avenue for companies to invest in.\nFacebook\nTwitter\nEmail\nHan Zhang, Georgia Tech Scheller College of Business, Steven A. Denning Professor of Technology & Management and faculty director, Denning Technology & Management Program\nDec 21, 2022\n— Atlanta, GA\nImagine messaging an artificial intelligence (AI) chatbot about a missing package and getting the response that it would be “delighted” to help. Once the bot creates the new order, they say they are “happy” to resolve the issue. After, you receive a survey about your interaction, but would you be likely to rate it as positive or negative?\nThis scenario isn’t that far from reality, as AI chatbots are already taking over online commerce. By 2025, 95% of companies will have an AI chatbot, according to\nFinance Digest .\nAI might not be sentient yet, but it can be programmed to express emotions.\nHumans displaying positive emotions in customer service interactions have long been known to improve customer experience, but researchers at the Georgia Institute of Technology’s\nScheller College of Business\nwanted to see if this also applied to AI. They conducted experimental studies to determine if positive emotional displays improved customer service and found that emotive AI is only appreciated if the customer expects it, and it may not be the best avenue for companies to invest in.\n“It is commonly believed and repeatedly shown that human employees can express positive emotion to improve customers’ service evaluations,” said\nHan Zhang , the Steven A. Denning Professor in Technology & Management. “Our findings suggest that the likelihood of AI’s expression of positive emotion to benefit or hurt service evaluations depends on the type of relationship that customers expect from the service agent.”\nThe researchers presented their findings in the paper, “ Bots With Feelings: Should AI Agents Express Positive Emotion in Customer Service? ,” in\nInformation Systems Research  in December.\nStudying AI Emotion\nThe researchers conducted three studies to expand the understanding of emotional AI in customer service transactions. Although they changed the participants and scenario in each study, AI chatbots imbued with emotion used positive emotional adjectives, such as excited, delighted, happy, or glad. They also deployed more exclamation points.\nThe first study focused on whether customers responded more favorably to positive emotion if they knew the customer agent was a bot or person. Participants were told they were seeking help for a missing item in a retail order. The 155 participants were then randomly assigned to four different scenarios: human agents with neutral emotion, human agents with positive emotion, bots with neutral emotion, and bots with positive emotion. Then they asked participants about service quality and overall satisfaction. The results indicated that positive emotion was more beneficial when human agents exhibited it, but it had no effect when bots exhibited it.\nThe second study examined if customers’ personal expectations determined their reaction to the bot. In this scenario, the 88 participants imagined returning a textbook and were randomly assigned to either emotion-positive or emotion-neutral bots. After chatting with the bot, they were asked to rate if they were communal (social) oriented or exchange (transaction) oriented on a scale. If the participant was communal-focused, they were more likely to appreciate the positive emotional bot, but if they expected the exchange as merely transactional, the emotionally positive bot made their experience worse.\n“Our work enables businesses to understand the expectations of customers exposed to AI-provided services before they haphazardly equip AIs with emotion-expressing capabilities,” Zhang said.\nThe final study explored why a bot’s positive emotion influences customer emotions, following 177 undergraduate students randomly assigned to emotive or non-emotive bots. The results explained why positive bots have less of an effect than anticipated. Because customers do not expect machines to have emotions, they can react negatively to emotion in a bot.\nThe results across the studies show that using positive emotion in chatbots is challenging because businesses don’t know a customer’s biases and expectations going into the interaction. A happy chatbot could lead to an unhappy customer.\n“Our findings suggest that the positive effect of expressing positive emotion on service evaluations may not materialize when the source of the emotion is not a human,” Zhang said. “Practitioners should be cautious about the promises of equipping AI agents with emotion-expressing capabilities.”\nCITATION: Han, Elizabeth and Yin, Dezhi and Zhang, Han (2022) Bots with Feelings: Should AI Agents Express Positive Emotion in Customer Service?. Information Systems Research.\nPublished online in Articles in Advance 02 Dec 2022\nDOI:\nhttps://doi.org/10.1287/isre.2022.1179\nAdditional Images\nContact\nTess Malone, Senior Research Writer/Editor\nEmail\ntess.malone@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}