{"text": "Selenium Anchors Could Improve Durability of Platinum Fuel Cell Catalysts | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nSelenium Anchors Could Improve Durability of Platinum Fuel Cell Catalysts\nResearchers at the Georgia Institute of Technology have developed a new platinum-based catalytic system that is far more durable than traditional commercial systems and has a potentially longer lifespan.\nFacebook\nTwitter\nEmail\nZhengming Cao, a visiting graduate student at Georgia Tech, is working on improving durability for platinum-based fuel cell catalysts. (Credit: Christopher Moore)\nSep 05, 2019\n— Atlanta, GA\nPlatinum has long been used as a catalyst to enable the oxidation reduction reaction at the center of fuel cell technology. But the metal’s high cost is one factor that has hindered fuel cells from competing with cheaper ways of powering automobiles and homes.\nNow researchers at the Georgia Institute of Technology have developed a new platinum-based catalytic system that is far more durable than traditional commercial systems and has a potentially longer lifespan. The new system could, over the long term, reduce the cost of producing fuel cells.\nIn the study, which was published July 15 in the ACS journal\nNano Letters , the researchers described a possible new way to solve one of the key causes of degradation of platinum catalysts, sintering, a process in which particles of platinum migrate and clump together, reducing the specific surface area of the platinum and causing the catalytic activity to drop.\nTo reduce such sintering, the researchers devised a method to anchor the platinum particles to their carbon support material using bits of the element selenium.\n“There are strategies out there to mitigate sintering, such as using platinum particles that are uniform in size to reduce chemical instability among them,” said Zhengming Cao, a visiting graduate student at Georgia Tech. “This new method using selenium results in a strong metal-support interaction between platinum and the carbon support material and thus remarkably enhanced durability. At the same time, the platinum particles can be used and kept at a small to attain high catalytic activity from the increased specific surface area.”\nThe process starts by loading nanoscale spheres of selenium onto the surface of a commercial carbon support. The selenium is then melted under high temperatures so that it spreads and uniformly covers the surface of the carbon. Then, the selenium is reacted with a salt precursor to platinum to generate particles of platinum smaller than two nanometers in diameter and evenly distributed across the carbon surface.\nThe covalent interaction between the selenium and platinum provides a strong link to stably anchor the platinum particles to the carbon.\n“The resulting catalyst system was remarkable both for its high activity as a catalyst as well as its durability,” said Younan Xia, professor and Brock Family Chair in the Wallace H. Coulter Department of Biomedical Engineering at Georgia Tech and Emory University.\nBecause of the increased specific surface area of the nanoscale platinum, the new catalytic system initially showed catalytic activity three and a half times higher than the pristine value of a state-of-the-art commercial platinum-carbon catalyst. Then, the research team tested the catalytic system using an accelerated durability test. Even after 20,000 cycles of electropotential sweeping, the new system still provided a catalytic activity more than three times that of the commercial system.\nThe researchers used transmission electron microscopy at different stages of the durability test to examine why catalytic activity remained so high. They found that the selenium anchors were effective in keeping most of the platinum particles in place.\n“After 20,000 cycles, most of the particles remained on the carbon support without detachment or aggregation,” Cao said. “We believe this type of catalytic system holds great potential as a scalable way to increase the durability and activity of platinum catalysts and eventually improve the feasibility of using fuel cells for a wider range of applications.”\nPart of the research was supported by the U.S. Department of Energy through the electron microscopy work performed at the Center for Nanophase Materials Sciences. The work was also supported by the China Scholarship Council through the graduate student fellowship. The content is the responsibility of the authors and does not necessarily represent the official views of the sponsoring agencies.\nCITATION :  Haoyan Cheng, Zhenming Cao, Zitao Chen, Ming Zhao, Minghao Xie, Zhiheng Lyu, Zhihong Zhu, Miaofang Chi and Younan Xia, “Catalytic System Based on Sub-2 nm Pt Particles and Its Extraordinary Activity and Durability for Oxygen Reduction,” (Nano Letters, July 2019).  http://dx.doi.org/10.1021/acs.nanolett.9b01221\nAdditional Images\nContact\nJohn Toon\nResearch News\nEmail\njohn.toon@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}