{"text": "Morphing Origami Takes a New Shape, Expanding Use Possibilities | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMorphing Origami Takes a New Shape, Expanding Use Possibilities\nResearchers at the Georgia Institute of Technology have created a new type of origami that can morph from one pattern into a different one, or even a hybrid of two patterns, instantly altering many of its structural characteristics.\nFacebook\nTwitter\nEmail\nA new type of origami can morph from one pattern into a different one, or even a hybrid of two patterns, instantly altering many of its structural characteristics. (Credit: Allison Carter)\nApr 17, 2019\n— Atlanta, GA\nOrigami-based structures have been used to create deployable solar arrays for space, adaptable acoustic systems for symphony halls and even crash protection systems for flying drones.\nNow researchers at the Georgia Institute of Technology have created a new type of origami that can morph from one pattern into a different one, or even a hybrid of two patterns, instantly altering many of its structural characteristics.\nThe research, which was supported by the National Science Foundation and is to be published April 19 in the journal\nPhysical Review Letters , could unlock new types of origami-based structures or metamaterials that leverage the characteristics of two types of origami.\n“This hybrid origami allows for reprogrammable mechanical properties and the ability to change those properties while the material is in service,” said Glaucio Paulino, a professor in the Georgia Tech School of Civil and Environmental Engineering.\nThe researchers started with two types of origami patterns: the Miura-ori and the eggbox, both of which can be formed into sheets of repeating patterns. The Miura-ori looks like rows of folded zig-zags, while the eggbox pattern resembles a mountain range with repeating peaks and valleys.\nBoth are capable of being compressed into a very small space, but when expanded they behave differently from one another in how they respond to bending. The eggbox pattern resembles a dome when bent, and the Miura-ori takes the shape of a saddle.\n“Traditionally, if you have an eggbox pattern, you are locked into the characteristics of that particular pattern,” said Paulino, who is also the Raymond Allen Jones Chair of Engineering in the School of Civil and Environmental Engineering. “With this new pattern, which we are calling morph, that’s no longer the case.”\nThe new origami pattern achieves its morphing ability by a redesign of the geometry of two of the four planes that comprise one section of the origami. By shrinking those two planes on one side, it enables their creases to shift from a mountain to a valley, or in other words, to fold in the opposite direction.\nAnd importantly, the transition from peak to valley can occur whether the origami is formed from a flexible material such as paper or a rigid material such as metal.\nThat means, for example, that origami-based structures used for acoustic systems – which already are capable of expanding and contracting to increase or decrease the volume of the sound response – could go one step further, changing how they bend to potentially offer an even greater range of resonant responses. In the example of the drone crash protection system, the new origami pattern could potentially offer other customization options or alter aspects of its impact resistance, Paulino said.\n“NSF’s investments in fundamental research of architected materials has pushed the frontiers and created ‘shape-shifting’ structures for applications in space exploration, robotics and medicine,” said Robert B. Stone, NSF’s Civil, Mechanical and Manufacturing Innovation division director.\nThe new origami pattern is also capable of taking on a hybrid structure, where certain rows are folded into one configuration and others were folded in the other. In such a configuration, the structure would exhibit characteristics of both types.\n“There are a large number of combinations in terms of how these could be configured, which offers a lot of customization possibilities for structures based on the morph pattern,” said Ke Liu, a former graduate student at Georgia Tech and now a postdoctoral scholar at the California Institute of Technology.\nAnother unique characteristic of the morph pattern is what happens when a Miura-ori row is situated between two eggbox rows. Typically, when tension is applied to pull apart either of the patterns, they respond by giving in and flattening their shape. However, in this new instance, the Miura-ori pattern locks into place.\n“The locking is very strong, and there is no way to break that hold other than to tear the entire structure apart,” said Phanisri Pratapa, a former postdoctoral fellow at Georgia Tech and now an assistant professor of civil engineering at the Indian Institute of Technology Madras.\nThe locking could enable structures to limit the amount of expansion possible and change that limit on the fly, Pratapa said.\nThis research was supported by the National Science Foundation (NSF) under grant CMMI-1538830 and the Raymond Allen Jones Chair at the Georgia Institute of Technology. The content is solely the responsibility of the authors and does not necessarily represent the official views of those organizations.\nCITATION : Phanisri P. Pratapa, Ke Liu, Glaucio H. Paulino, “Geometric mechanics of origami patterns exhibiting Poisson's ratio switch by breaking Mountain/Valley assignment,” (Physical Review Letters, April 2019). https://doi.org/10.1103/PhysRevLett.122.155501\nAdditional Images\nContact\nJohn Toon\nResearch News\nEmail\njohn.toon@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}