{"text": "Volcanic Activity Does Not Contribute to El Ninos, Hard Evidence Says | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nVolcanic Activity Does Not Contribute to El Ninos, Hard Evidence Says\nPhysical evidence has spoken, and it clearly says that volcanic activity does not push El Nino and La Nina events.\nFacebook\nTwitter\nEmail\nEl Nino 1997 (l.), El Nino 2015 (r.) Credit: NOAA (National Oceanographic and Atmospheric Administration)\nMay 19, 2020\n— Atlanta, GA\nHard data gained from fossilized corals have spoken strongly against a popular theoretical assumption that volcanic activity may have influenced El Nino events.\nA study published in the journal  Science\nin March and led by researchers from Rice University and the Georgia Institute of Technology parsed the record archived by ancient tropical Pacific coral over the past millennium. That record could help scientists refine their models of how changing conditions in the Pacific influence the occurrence of  El Niño events , which are major drivers of global climate.\nThe researchers found that the ratio of oxygen isotopes sequestered in coral – an accurate measure of historic ocean temperatures – showed no correlation between El Niño events and estimates of  sulfate particles  ejected into the atmosphere by tropical volcanic eruptions.\nThe coral data was collected on trips to the Pacific over the course of 20 years, by teams led by  Kim Cobb , a professor in Georgia Tech’s School of Earth and Atmospheric Science. Those coral records have shown little connection between known volcanoes and El Niño events over that time. Like tree rings, these  paleoclimate  archives have held chemical indicators, the oxygen isotopes, of oceanic conditions at the time they formed.\nThe corals yield a high-fidelity record that tracks the  El Niño-Southern Oscillation  (ENSO) in the heart of the central tropical Pacific. The ENSO is a natural oscillation of hotter and cooler surface water temperatures that peak every few years to trigger El Ninos in the hot phases and La Ninas in the cool phases.\nChallenging established models\nAccording to Rice climate scientist and the study's corresponding author  Sylvia Dee , previous climate model studies have tied volcanic eruptions, which increase sulfate aerosols in the atmosphere, to increased chances for an El Niño event. But the ability to analyze climate conditions based on oxygen isotopes trapped in fossil corals has extended the climatological record in this key region across more than 20 ancient eruptions. Dee said this has allowed for a more rigorous test of the connection.\n“A lot of climate modeling studies show a dynamical connection where volcanic eruptions can initiate El Niño events,” Dee said. “We can run climate models many centuries into the past, simulating volcanic eruptions for the last millennium. But the models are just that — models — and the coral record captures reality.”\nThe coral records Cobb and her colleagues studied for this particular research held unambiguous markers of conditions over 319 years, from 1146-1465. This and data from other corals spans more than 500 years of the last millennium and, they wrote, “presents a window into the effects of large volcanic eruptions on tropical Pacific climate.”\nThat span of time includes the  1257 eruption of Mt. Samalas , the largest and most sulfurous of the last millennium.\nExpanding coral records\nCobb said her lab has been developing techniques and expanding the coral record for years.\n“My first expedition to the islands was in 1997, and it has been my sole focus pretty much since then to extract the best records that we can from these regions,” she said, noting the lab has issued many papers on the topic, including a groundbreaking 2003 study on ENSO in  Nature .\nCobb said dating the ancient coral samples depends on precise  uranium-thorium dating , followed by thousands of mass spectrometric analyses of coral oxygen isotopes from powders drilled every 1 millimeter across the coral’s growth axis.\n“That speaks to the temperature reconstruction,” she said. “We’re borrowing on 70 years of work with this particular chemistry to establish a robust temperature proxy in corals.”\nThe oxygen-16 to oxygen-18  isotopes  revealed by spectrometry show that the temperature of the water at the time the coral formed, Cobb said.\n“The ratio of those two isotopes in carbonates is a function of the temperature,” she said. “That’s the magic: It’s based on pure thermodynamics.”\n“This beautiful coral record is highly sensitive to El Niño and  La Niña  events based on its location,” Dee added. “Scientists have reconstructed the timing of those volcanic eruptions from  ice-core records . We compared the timing of the largest eruptions to the coral record to see if volcanic cooling events had any impact on tropical Pacific climate.”\n“Our study suggests that linkage doesn’t exist or, if it does, it is obscured by the large natural variability in the climate system,” Dee said. “In general, El Niño is a natural oscillator in the climate system.”\nCo-authors of the paper were Julien Emile-Geay from the University of Southern California; Toby Ault from Cornell University; Lawrence Edwards from the University of Minnesota; research scientist Hai Cheng of Minnesota University and Xi’an Jiaotong University, China; and Christopher Charles from the University of California, San Diego. The research was funded by the National Science Foundation. Any findings, conclusions, or recommendations are those of the funding agencies and not necessarily of the sponsor.\nRice University media inquiries:\nMike Williams, writer mikewilliams@rice.edu\nGeorgia Tech media inquiries:\nBen Brumfield ben.brumfield@comm.gatech.edu\nAdditional Images\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}