{"text": "Paper Tubes Make Stiff Origami Structures | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nPaper Tubes Make Stiff Origami Structures\nFrom shipping and construction to outer space, origami could put a folded twist on structural engineering.\nFacebook\nTwitter\nEmail\nResearchers Glaucio Paulino (left) and Evgueni Filipov with three origami structures showing the size flexibility of the \"zippered tube\" system. Filipov is from University of Illinois at Urbana-Champaign; Paulino is from the Georgia Institute of Technology. (Credit: Rob Felt, Georgia Tech)\nSep 07, 2015\n— Atlanta, GA\nFrom shipping and construction to outer space, origami could put a folded twist on structural engineering. Researchers from the University of Illinois at Urbana-Champaign, the Georgia Institute of Technology and the University of Tokyo have developed a new “zippered tube” configuration that makes paper structures stiff enough to hold weight yet able to fold flat for easy shipping and storage. Their method could be applied to other thin materials, such as plastic or metal, to transform structures ranging from furniture and buildings to microscopic robots. Illinois graduate researcher Evgueni Filipov, Georgia Tech professor Glaucio Paulino and University of Tokyo professor Tomohiro Tachi published their work September 7 in the journal\nProceedings of the National Academy of Sciences . Origami structures would be useful in many engineering and everyday applications, such as a robotic arm that could reach out and scrunch up, a construction crane that could fold to pick up or deliver a load, or pop-up furniture. Paulino sees particular potential for quick-assembling emergency shelters, bridges and other infrastructure in the wake of a natural disaster. “Origami became more of an objective for engineering and a science just in the last five years or so,” Filipov said. “A lot of it was driven by space exploration, to be able to launch structures compactly and deploy them in space. But we’re starting to see how it has potential for a lot of different fields of engineering. You could prefabricate something in a factory, ship it compactly and deploy it on site.” The researchers use a particular origami technique called Miura-ori folding. They make precise, zig-zag folded strips of paper, then glue two strips together to make a tube. While the single strip of paper is highly flexible, the tube is stiffer and does not fold in as many directions. The researchers tried coupling tubes in different configurations to see if that added to the structural stiffness of the paper structures. They found that interlocking two tubes in zipper-like fashion made them much stiffer and harder to twist or bend. The structure folds up flat, yet rapidly and easily expands to the rigid tube configuration. “The geometry is what really plays a role,” Paulino said. “We are putting two tubes together in a strange way. What we want is a structure that is flexible and stiff at the same time. This is just paper, but it has tremendous stiffness.” The zipper configuration works even with tubes that have different angles of folding. By combining tubes with different geometries, the researchers can make many different three-dimensional structures, such as a bridge, a canopy or a tower. “The ability to change functionality in real time is a real advantage in origami,” Filipov said. “By having these transformable structures, you can change their functionality and make them adaptable. They are reconfigurable. You can change the material characteristics: You can make them stiffer or softer depending on the intended use.” The team uses paper prototypes to demonstrate how a thin, flexible sheet can be folded into functional structures, but their techniques could be applied to other thin materials, Filipov said. Larger-scale applications could combine metal or plastic panels with hinges. Next, the researchers plan to explore new combinations of tubes with different folding angles to build new structures. They also hope to apply their techniques to other materials and explore applications from large-scale construction to microscopic structures for biomedical devices or robotics. “All of these ideas apply from the nanoscale and microscale up to large scales and even structures that NASA would deploy into space,” Paulino said. “Depending on your interest, the applications I think are endless. We have just scratched the surface. Once you have a powerful concept, which we think the zipper coupling is, you can explore applications in many different areas.” The National Science Foundation supported this work. Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contacts : Georgia Tech: John Toon ( jtoon@gatech.edu ) (404-894-6986) or University of Illinois: Liz Ahlberg, ( eahlberg@illinois.edu ) (217-244-1073). Writer : Liz Ahlberg, University of Illinois at Urbana-Champaign\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}