{"text": "Georgia Tech Trailblazers Awarded the 2022 Ivan Allen Jr. Prize for Social Courage | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Trailblazers Awarded the 2022 Ivan Allen Jr. Prize for Social Courage\nTech's first enrolled Black students and first Black graduate receive one of the Institute's top honors.\nFacebook\nTwitter\nEmail\nIn recognition of their roles as trailblazers, Tech’s first Black students — Lawrence Williams, Ralph Long Jr., and the late Ford Greene, along with the first Black graduate Ronald Yancey — were awarded the 2022 Ivan Allen Jr. Prize for Social Courage on April 20 at the Biltmore Ballroom in Atlanta.\nPictured left to right: State Rep. David Wilkerson, Ronald Yancey, Ralph Long Jr., Lawrence Williams, and Frankie Hall, wife of the late Ford C. Greene.\nApr 21, 2022\n— Atlanta, GA\nIn 1961, three Black students began classes at Georgia Tech and made history, making the Institute the first higher education entity to peacefully integrate in the Deep South without a court order. Civil unrest was rampant throughout college campuses across the South.\nIn recognition of their roles as trailblazers, Tech’s first Black students — Lawrence Williams, Ralph Long Jr., and the late Ford Greene, along with the first Black graduate Ronald Yancey — were awarded the 2022 Ivan Allen Jr. Prize for Social Courage on April 20 at the Biltmore Ballroom in Atlanta.\nA symposium was led by 2020 Ivan Allen Jr. Prize recipient Charlayne Hunter-Gault where Long Jr., Williams, and Yancey discussed the integration of the Institute, the former students’ personal experiences, and the continued struggle for racial equity and inclusion at higher education institutes across the nation. During the panel session, the three former students recounted the racism they encountered — despite a facade of peaceful integration. Although their experiences left them feeling socially and intellectually isolated from most of the student body at the time, the pioneers expressed their hope that future generations of Black students at Tech feel at home on campus.\n“I’m so thankful for those who continue to matriculate here and carry on the tradition,” said Williams.\nA video greeting from Atlanta Mayor Andre Dickens, a Georgia Tech chemical engineering graduate himself, was presented at the celebration. Dickens honored the trailblazers for their courage in making history and acknowledged the hardship they faced along the way.\n“I cannot imagine the tremendous amount of courage they had to arm themselves with every day they had to walk on campus,” he said. “Thank you for paving the way for those of us who would come behind.”\nThe Ivan Allen Jr. Prize honors those who have made a positive difference by risking their careers, livelihoods, and even their lives to stand up for moral principles. For these trailblazers, though their college years were not easy, they went on to have successful and impactful careers.\nGreene studied chemical engineering at Georgia Tech. He completed his bachelor’s degree in mathematics and computer science at Morgan State University and worked in telecommunications and information technology systems. He died in 2020 at the age of 76.\nAfter attending Tech, Long completed his bachelor’s degree at Clark College (now Clark Atlanta University) in mathematics and physics and was the first Black systems engineer for the Large Systems Group in the Southeastern U.S. at IBM Atlanta.\nAfter his time studying electrical engineering, Williams served honorably in the Air Force during the Vietnam War, earning several distinctions and honors.\nA week after graduating with a degree in electrical engineering from Tech, Yancey began a successful career with the U.S. Department of Defense.\nBecause Greene died in 2020, members of his family joined the other prize recipients at the Biltmore for the day’s events celebrating the honorees’ place in history.\n“Ford has always been a change agent, a disruptor, and him being a recipient of this prestigious award solidifies his place in history that he so richly deserves,” said Frankie Hall, Greene’s wife.\nThe inaugural prize was awarded in March 2011 to former Senator Sam Nunn. A few other past recipients include Dr. Anthony Fauci, Jimmy and Rosalynn Carter, U.S. Rep. John Lewis, and humanitarian activist Nancy Parrish.\nLearn more about the prestigious Ivan Allen Prize for Social Courage here.\nAdditional Images\nContact\nSiobhan Rodriguez\nGeorgia Tech Media Relations\nEmail\nsar30@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}