{"text": "Meet Beatriz Rodriguez: Helping Students Have a Life-Changing Experience | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMeet Beatriz Rodriguez: Helping Students Have a Life-Changing Experience\nBeatriz Rodriguez's work extends through the student life cycle, from orientation to graduation.\nFacebook\nTwitter\nEmail\nBeatriz Rodriguez with student assistant Parth Gandhi, a third-year student in the Scheller College of Business. Photo by Allison Carter.\nSep 19, 2023\nBeatriz Rodriguez began her Georgia Tech career in the Office of Undergraduate Admission in 2006. “I was working for Admission in recruiting, so I got to see the students when they applied, but not much beyond that,” she said. “Meeting our current students and learning what they were doing while at Tech is when I found my passion and realized higher education is where I really wanted to be.”\nIn her next role at Tech, Rodriguez worked in the Office of Minority Educational Development (OMED) with its peer mentoring program. Then she worked in the Office of Undergraduate Education as a learning specialist/academic coach. In 2021 she moved to the Scheller College of Business, where she is the assistant dean of Student Engagement for the Undergraduate Program Office, working with the academic advising team and the leadership team to ensure that students have a successful and life-changing experience.\n“My job touches a little bit of all the operations of the student life cycle, from orientation to graduation,” she said. “I want students to take advantage of the available opportunities for growth and development. I help them get into the classes they need and make them aware of the different clubs that can nurture their leadership styles as they start their careers,” said Rodriguez, who isn’t always directly in front of the students because they all have their own academic advisor. “It’s exciting to observe everything from behind the scenes and see how the students grow throughout the four or five years they are here.”\nOne of the most rewarding parts of her job is interacting with members of the Scheller community. “It brings a smile to my face as I walk through the halls and interact with students, faculty, and staff that I know by name. It’s more than a casual hello. We stop and talk about our work as well as our families or vacation plans. It’s the people that make this place special.”\nAway From Work\nRodriguez grew up in Medellín, Colombia. She came to the U.S. as an international student to attend Kennesaw State University, where she earned a degree in marketing. She also has a master’s degree in professional counseling from Georgia State University. Soon she will become certified as a professional coach with the International Coaching Federation.\n“I found my passion in coaching while at Tech. I really enjoy talking to people and helping them come up with their own solutions to their problems.”\nRodriguez jokes that she has too many hobbies, from knitting to gardening to riding the Peloton bike she purchased in 2020 at the start of the pandemic. “Everything was shutting down. I knew I would go stir crazy if I had to stay in my house, so I got a Peloton to keep active.”\nShe rides about four times a week and often interacts with other members of the Tech community who have a Peloton. “Every time you log into a class there’s a leaderboard,” she said. “You get to see who else is biking at that moment. You can compete against them, but I usually don’t because I’m at the bottom of the leadership board.”\nDuring the pandemic she also taught herself to knit, and she learned how to garden. “I always thought that I didn’t have a green thumb because I would kill my houseplants by overwatering or underwatering them,” she said. Now she has houseplants she has kept alive for several years. “I also started a little garden outside and I have successfully grown tomatoes, cucumbers, squash, zucchini, basil, and cilantro.”\nAdditional Images\nRelated links\nRead More Staff Stories\nContact\nVictor Rogers\nInstitute Communications\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}