{"text": "Tiny “Tornado” Boosts Performance of Electrospray Ionization Mass Spectrometry | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nTiny “Tornado” Boosts Performance of Electrospray Ionization Mass Spectrometry\nResearchers have improved the sensitivity and detection capability of the widely-used ESI-MS analytical technique.\nFacebook\nTwitter\nEmail\nThis schematic represents how the DRILL device operates as it transmits ions to the mass spectrometer using a carefully-designed vortex flow. (Courtesy Peter Kottke, Georgia Tech)\nJun 28, 2017\n— Atlanta, GA\nAdding the equivalent of a miniature tornado to the interface between electrospray ionization (ESI) and a mass spectrometer (MS) has allowed researchers to improve the sensitivity and detection capability of the widely-used ESI-MS analytical technique. Among the scientific fields that could benefit from the new technique are proteomics, metabolomics and lipidomics – which serve biomedical and health applications ranging from biomarker detection and diagnostics to drug discovery and molecular medicine.\nKnown as Dry Ion Localization and Locomotion (DRILL), the new device creates a swirling flow that can separate electrospray droplets depending on their size. In this application, one of many potential uses for DRILL, the smaller droplets are directed to enter the mass spectrometer, while the larger ones – which still contain solvent – remain in the vortex flow until the solvent evaporates. Removing the solvent allows analysis of additional ions that may be lost in current techniques and reduces the chemical “noise” that inhibits selectivity of the mass spectrometer.\n“A major challenge for detecting small quantities of biomolecules using mass spectrometry technology is that we can’t see everything that is actually in the sample,” said\nMatthew Torres , an assistant professor in Georgia Tech’s\nSchool of Biological Sciences . “The DRILL device provides a new way to solve that problem by increasing the number of ions we can get into the mass spec instrument so we can productively detect them. The ions are there now, but not necessarily in a form that the mass spec can handle.”\nDeveloped by researchers at the Georgia Institute of Technology with support from North Carolina State University, DRILL can be added to existing electrospray ionization mass spectrometers without modifying them.\n“The principle is to make the droplets rotate and use inertia to separate them out by size,” explained\nAndrei Fedorov , a professor in Georgia Tech’s Woodruff\nSchool of Mechanical Engineering . “We want the droplets to stay in the flow long enough to remove the solvent. In practice, smaller droplets remain in the center, where they are can be removed first for analysis, while the larger ones remain on the edge of the flow until they are dried.”\nThe key idea of DRILL is based on Fedorov’s 2007 invention “Confining/Focusing Vortex Flow Transmission Structure, Mass Spectrometry Systems, and Methods of Transmitting Particles, Droplets, and Ions.\" (US Patent No. 7,595,487). In the past three years, the DRILL device has been developed with support from the National Institute of General Medical Sciences of the National Institutes of Health, and its latest version was described June 14 in the American Chemical Society journal\nAnalytical Chemistry .\nIn electrospray ionization (ESI), an electric potential is applied to a solution inside a capillary, producing a strong electric field at the spray capillary tip. That leads to the expulsion of an aerosol containing charged droplets that carry the molecules to be analyzed. The ejected droplets then break up into smaller droplets, creating a plume that expands spatially beyond the inlet intake capacity of the mass spectrometer, resulting in sample loss. The DRILL device provides an effective interface for collection and transmission of charged analytes from ionization sources, such as ESI, to detection devices, such as mass spectrometers, resulting in significantly improved detection capability.\nAs much as 80 to 90 percent of large biopolymers (proteins, peptides, and DNA) are currently lost to analysis using existing ESI-MS techniques, which have grown in importance to the life sciences community. Capturing all of the biopolymers could lead to new discoveries, said Torres, whose lab studies post-translational changes in proteins. By allowing analysis of large biomolecules, DRILL could facilitate top-down proteomics in which complete protein molecules could be studied without the need to enzymatically break them up into smaller pieces before MS analysis.\n“This could allow us to see combinatorial modifications that exist on a single protein molecule,” said Torres. “It’s very important for us to understand how proteins communicate with one another, and DRILL may allow us to do that by more effectively removing the solvent from these types of samples.”\nThe Georgia Tech researchers are using DRILL in their lab to interface between liquid chromatography and the ESI-MS instrument. Multiple electrodes and inlet/outlet ports enable precise control over the flow generation and guiding electric field inside the DRILL, so the device can be configured for a variety of uses, Fedorov noted. In a general sense, DRILL adds a new approach for manipulating the trajectory of charged droplets, which, when combined with hydrodynamic drag forces and electric field forces, provides a rich range of possible operational modes.\nDRILL can improve the signal-to-noise ratio by a factor of 10 in the detection of angiotensin I, a peptide hormone, and boost the sensitivity for angiotensin II ten-fold to picomole levels. DRILL demonstrated improved signal strength – up to 700-fold – for eight of nine peptides included in a test extract of biological tissue.\nDRILL could potentially allow the study of entire cell contents, analyzing thousands of different molecule types simultaneously. That could allow researchers to see how these molecules change over time to detect problems in chemical pathways and to determine why drugs work in some people and not others.\n“This could be a huge advance for biologists and others who are interested in protein biochemistry and cell biology because it enhances the sensitivity of the analytical technical and overcomes a major hurdle in studying large biological molecules,” Torres added. “We expect to be able to see things we haven’t been able to see before.”\nThe Georgia Tech researchers have been collaborating with David Muddiman, a professor in the Department of Chemistry at North Carolina State University, on developing DRILL and its analytical characterization using state-of-the-art mass spectrometry experiments. A unique contribution of the North Carolina State University researchers is in using a powerful statistical method called “design of experiments” to guide the multi-parameter optimization of the DRILL device, resulting in identification of a sweet spot for optimal operation.\nFedorov and Torres hope to expand use of the DRILL device beyond Georgia Tech laboratories and further enhance its design. Among the near-term improvements planned is the addition of internal heating to accelerate the removal of solvent. “We see many additional improvements that will allow DRILL to further enhance the ESI-MS process,” said Fedorov. “We plan to continue evolving it as more labs start to use the device.”\nIn addition to those already named, the paper’s co-authors include Peter A. Kottke, Jung Y. Lee and Alex P. Jonke from Georgia Tech and Chinthaka A. Seneviratne and Elizabeth S. Hecht from North Carolina State University.\nResearch reported in this publication was supported by the National Institute of General Medical Sciences of the National Institutes of Health under Award Number R01GM112662. The content is solely the responsibility of the authors and does not necessarily represent the official views of the National Institutes of Health.\nCITATION : Peter A. Kottke, et al., “DRILL: An ESI-MS interface for improved sensitivity via inertial droplet sorting and electrohydrodynamic focusing in a swirling flow,” (Analytical Chemistry, 2017). http://dx.doi.org/10.1021/acs.analchem.7b01555.\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact s: John Toon (404-894-6986) (jtoon@gatech.edu) or Ben Brumfield (404-385-1933) (ben.brumfield@comm.gatech.edu).\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}