{"text": "When Coeds Came to Georgia Tech | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nWhen Coeds Came to Georgia Tech\nHistorian Amy Bix explores the hurdles women have overcome — and still face — in engineering and STEM education.\nFacebook\nTwitter\nEmail\nHistorian Amy Bix explores the hurdles women have overcome — and sitll face — in engineering and STEM education.\nMar 10, 2020\n— Atlanta, GA\nBy the time the first women enrolled at Georgia Tech in 1952, male students, professors, and administrators at other universities had been decrying the “invasion” of women into engineering departments for decades.\nAnd, as historian Amy Bix outlined in a lively lecture March 2, gendered definitions and perceptions of engineering and other STEM fields persist today, despite significant progress and measurable change.\n“When Coeds Came to Georgia Tech” was part of the School of History and Sociology’s Spring 2020 Speakers Series, Social Justice: Power, Inequity, and Change. It was cosponsored by Tech’s chapter of the Society of Women Engineers.\nOutsiders and Oddities\nSince the late 1800s, Bix noted, a significant part of the way men defined their identity as engineering students was to “ridicule the whole idea of women engineers. So you get entire sets of technical traditions set in place over years that link engineering to masculinity.”\nBix walked her audience through a brief chronology of the demarcation of professional engineering as a male sphere — from specialized education at universities that barred women; to exclusion from construction, railroad, and military jobs that provided engineering training; to advertisements for toys like Erector Sets and Lionel Trains aimed specifically at boys.\nBut, beginning in the early 20 th\ncentury, a small number of women pursued engineering degrees, notably at the University of Minnesota, Iowa State University, and Purdue — even though they were commonly viewed as outsiders and oddities.\nA Telling Turning Point\nThen, the manpower shortage caused by U.S. participation in World War II created new opportunities for women in engineering, as it did in so many other sectors of the homefront economy. This historical juncture, Bix explained, represented a larger cultural reexamination of assumptions about gender and about women’s capacity for understanding engineering, machines, and other “masculine” realms.\nWithin this context, allowing women to train in engineering on college campuses was treated as a necessary part of the larger war effort. Some of them even wore pants! And hundreds of them earned engineering degrees. It was an unusual step, but both government and industry supported it as a patriotic plan.\nIt also proved short-lived.\nAfter the war, the GI Bill sent millions of returning (male) veterans flooding into American colleges and universities, while the number of enrolled women declined across the board. A backlash took shape in the form of a retrenchment of traditional values that emphasized women’s inherent suitability for domestic — not professional, and certainly not technological or mechanical — pursuits.\n“Debutantes Looking for Husbands”\nIn the postwar period, Georgia Tech was part of what Bix called “a culture of masculine engineering.”\nIn 1948, Atlanta women’s organizations were raising money to support a test case to compel the Board of Regents to admit women to Georgia Tech — though many feared that Tech’s reputation and, indeed, its quality of instruction would become inferior if women were admitted. The year before, a poll of Tech students showed 64% opposed it. In addition, 54% said they would find women in class “distracting.” Administrators claimed it would cost too much to renovate facilities to make room for women. Many Regents were “hostile,” as Bix put it, chalking it up to “debutantes looking for husbands.”\nBut by the early 1950s, Blake Van Leer, Georgia Tech’s president, was sympathetic to the arugment for coeducation, noting that the legal trend was heading in that direction. According to Bix, he also reasoned that Tech could admit women without too much disruption because so few of them were interested or qualified.\nIn 1952, the Regents voted 7-5 in favor of coeducation. Four women applied, and two of them, Barbara Diane Michel and Elizabeth Herndon, began as full-time Georgia Tech students. While Herndon later left school to marry, Michel became the first woman to go through Tech from start to finish, earning a B.S. in industrial engineering in 1956. She was joined that year by a transfer student, Shirley Clements, who graduated with a degree in electrical engineering.\n“Is everything perfect now?” Bix asked. “You know it’s not. Hostile workplaces, chilly climates, harassment, and discrimination. There is no magic solution to reverse the STEM gender imbalance. But we can’t ignore the historical shift that has taken place.”\nAbout Bix\nBix is a professor of history at Iowa State University whose research connects the history of technology, science, and medicine with studies of women and gender, the history of education, and 20 th -century social, cultural, and intellectual history. In 2013, she published\nGirls Coming to Tech! A History of American Engineering Education for Women\n(MIT Press). She is currently working on a book about the powerful cultural shift to diversifying STEM education and, in particular, improving girls’ STEM education.\nSpring Speakers Series\nTopics in the series thus far have included healthcare, voter suppression, and stop and frisk, and were planned to coincide with Black History Month (February) and Women’s History Month (March). The final two events this spring will address sex selection in a transnational context and debates over immigration.\n“Since many of our faculty in the Ivan Allen College of Liberal Arts focus on research with important social justice implications, we wanted to make this our lens,” said Jennifer Singh, associate professor in the School of History and Sociology, and one of the series’ organizers.\n“These broader topics also allow us to reach students and faculty beyond the liberal arts.”\nSingh sees the value of the interdisciplinary scope of the series for all Tech students. Even more important, she said, is “the opportunity to learn beyond the classroom. These layers of exposure are essential to learning.”\nSee the\nschedule of events\nand learn more about the speakers by visiting the\nSchool of History and Sociology ’s webpage. For more details about the first women to enroll and the early years of the coeducational transition at the Institute, see the Fall 1982 issue of the\nAlumni Magazine\ndevoted to “Women: 30 Years at Tech.”\nAdditional Images\nContact\nStacy Braukman\nInstitute Communications\nEmail\nstacy.braukman@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}