{"text": "Freeing a Scientific Mind to Envision Big Research: Packard Fellowship to Will Ratcliff | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nFreeing a Scientific Mind to Envision Big Research: Packard Fellowship to Will Ratcliff\nFunding can focus science on the long game; just ask Will Ratcliff, freshly named a Packard Fellow.\nFacebook\nTwitter\nEmail\nWill Ratcliff, an assistant professor in Georgia Tech's School of Biology, has been named to Popular Science's annual list of up-and-coming scientists, \"The Brilliant 10.\"Credit: Rob Felt\nOct 14, 2016\n— Atlanta, GA\nA vision recently came to researcher Will Ratcliff about the scientific legacy he’d like to look back on 30 years from now.\nThe moment of clarity was fueled by an award from the\nDavid and Lucile Packard Foundation , which this week named Ratcliff a\nPackard Fellow for 2016 . The prestigious fellowship has freed the evolutionary biologist’s mind to think beyond the previous horizons of his lab’s experimental goals.\nPackard formally announced on Friday, October 14, that the annual fellowship was being awarded to 18 scientists nationwide. They will receive $875,000 each, paid out over a five-year period.\nRatcliff, who studies\nthe evolution of single-cell organisms into multicellular groups\nat the Georgia Institute of Technology, found out he was one of the recipients a few days prior. And when he did, it sent his head reeling.\n“The first night after I heard about it, I had these waves of thoughts like, ‘Hey, we could do\nthis\ncool experiment!’” he said. “Then I’d go to bed and another one would jolt me awake, ‘Woah, and we could do\nthis! ’”\nFast-forward movie of life\nSince then, a legacy goal has crystalized. “I want us to rewind the tape of life and watch it on fast-forward,” he said.\n“I want to see how unicellular organisms evolve into bona fide multicellular organisms with robust division of labor, and multiple cell types. I want to see how development evolves from scratch,” said\nthe assistant professor\nat Georgia Tech’s\nSchool of Biological Sciences .\nRatcliff has gained notoriety among biologists for producing conditions that have accelerated the evolution of yeast and algae cells from single cells into cell clusters that then grow in complexity and begin to specialize in cell function. One of his signature achievements is\nyeast cell groups called “snowflakes.”\nIn August, two months before the Packard announcement, the\nmagazine\nPopular Science\nrecognized Ratcliff in its\nannual list “The Brilliant 10,”\nwhich applauds a select group of up-and-coming scientists and engineers.\nPopSci\ncited his work demonstrating how an\nevolutionary leap may have occurred\nthat was key to the advent of plants and animals, but also arduous, since single cells had to forfeit much of their own fitness for the greater good of creating viable cell groups.\nEvolutionary long game\nRatcliff thinks he may be able to shepherd a recapitulation of the evolutionary path that led to first complex beings within his lifetime by hyper-accelerating natural selection in the lab. And he believes the accomplishment would be valuable to science for a long time to come.\n“We’ve never actually seen that process in real time,” Ratcliff said. “I want to put that movie of the tape of life on fast-forward in my laboratory to be able to understand the general rules that govern this evolutionary process. It would have profound implications of how complex life arises not just on Earth, but also elsewhere in the universe.”\nRatcliff says the Packard Fellowship will allow him to take the long view, and not only due to the award’s ampleness. “It’s very flexible in that they want you to be creative and feel free to pursue the research you find most exciting.”\nUnlike most grants, this one’s not tied to specific research milestones.\n“It’s designed to nurture you,” Ratcliff said. “They’re investing in the researcher, and as a result, I’m stepping back and taking stock of my research thinking in a way I never have before,” he said.\n(READ: Georgia Tech's proud Packard Fellows through the years.)\nLegacy research in future science\nRatcliff sees the fellowship as an opportunity to make an impactful contribution to evolutionary science, and has been inspired by the work of\nbiologist Rich Lenski at Michigan State University .\nLenski has run a 28-year experiment viewed as classic in the field, evolving of\nE. coli\nbacteria in the lab for nearly 60,000 generations. The work has been an endless source of information and created a continuing legacy.\n“One of the great things about experimental evolution is that you can create a living record of the entire experiment by live-archiving your populations in the freezer at regular intervals,” Ratcliff said. As decades pass, scientific and technological advances come along and allow researchers to exponentially boost the usefulness of that archive.\n“In Lenksi’s experiment, for example, the recent revolution in genome sequencing means that they can examine the evolutionary dynamics of his entire experiment in ways they never would have expected,” Ratcliff said.\nRatcliff envisions using some of the Packard funding to establish evolutionary lines that he would continue throughout his career. “Hopefully for 20 or 30 years,” he said. “I’d love to take these simple multicellular things we have already and push them to see how complex we can actually get them.”\nHe would like to end up with a library of simple multicellular beings across multiple evolutionary phases.\nGeorgia Tech collaboration\nBut before he lays down details, Ratcliff wants to consult with his collaborators, particularly\nGeorgia Tech physicist Peter Yunker . He’s been helping Ratcliff solve problems that organisms encounter as they become more complex.\n“We’re looking at the materials properties of our (yeast) snowflakes,” Ratcliff said. “Evolving novel physical properties – bodies with specific functionality – is an often overlooked but major challenge facing nascent multicellular critters.”\nWorking with scientists from a different discipline has changed Ratcliff’s perspective by creating thought synergies, a legendary Georgia Tech strength. “The level of collaboration here is really unreal, actually,” Ratcliff said.\n“From the president through the ranks, there is an ethos of collaboration,” he said. “That helps the science be better in the long term.”\nA rare honor shared\nA Packard Fellowship is a rare honor that starts with the foundation narrowing down to 50 the number of universities prompted to provide applicants. The universities are then instructed to nominate two scientists each, who write a two-page research proposal describing their future work.\n“My faculty advisor told me, ‘This may be the most important two pages of your life,’” Ratcliff said. “I took that to heart and spent close to a month only writing the proposal.”\nAnd he reached out to colleagues for help.\n“I’m pretty confident that I wouldn’t have gotten it, if we didn’t have so many smart faculty here who are so eager to collaborate. I got feedback from about a dozen colleagues in the School, and that made the proposal stronger.”\nDisclaimer: Any opinions, findings and conclustions or recommendations expressed in this material are those of the author(s) and/or researcher(s) and do not necessarily reflect the views of any sponsoring agencies.\nAdditional Images\nContact\nWriter and contact: Ben Brumfield\nResearch News\n(404) 660-1408\nEmail\nben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}