{"text": "Be Afraid: What to Read at Halloween | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nBe Afraid: What to Read at Halloween\nLMC Faculty Recommend Haunting Tales\nFacebook\nTwitter\nEmail\nBook jackets of reading recommendations for Halloween 2021.\nOct 21, 2021\n— Atlanta, GA\nWith Halloween approaching, we asked faculty members in the School of Literature, Media, and Communication (LMC) to recommend a haunting tale. The books range from Victorian ghost stories to a supernatural rapper haunting a bookstore.\nThe Scarlet Plague\nBy Jack London, originally published in\nLondon Magazine\n(1912), and published as a book in 1915 by Macmillan; readily available in pdf.\n“As someone who writes about vampires (an introduction to a new edition of\nDracula\nplus two book chapters during the pandemic), I read or reread a bunch of vampire fiction as well as tried to catch up on Stephen King (who writes faster than I read!). The most terrifying book I read during the pandemic, however, was London’s novella, which I stumbled on this summer.\nThe postapocalyptic story of the scarlet plague (told with hideous detail) that decimated the planet is narrated by James Smith, a classical scholar and one of the few people who remembers pre-plague times. Traveling with his grandsons, who live as hunters, he shares his memory of the plague but realizes he cannot share his knowledge of a lost culture with his primitive and largely illiterate grandsons.\nI recommend London’s novella to people who like horror but also to people who want to reflect on what will happen in a post-Covid-19 world. Smith observes that the survivors in his world ‘have forgotten everything.’ We have not, so we have much on which to rebuild.”\n— Carol Senf, professor and director of Undergraduate Studies, LMC\nThe Ghost Stories of M.R. James\nBy M.R. James, London: British Library Publishing (2018)\n“Short stories allow us to read ‘slices of life’ without having to dedicate entire days or weeks when our hectic schedules only offer half an hour at a time. If you are in the mood to time-travel to some quaint early 20th-century European small town, complete with some gentleman scholar whose discovery of medieval manuscripts or antiquarian objects conjures up threatening supernatural presences, M.R. James’ ghost stories are just what you need. James (1862-1936), a professor of medieval studies and university administrator, is one of the founders of the ghost story genre. His work inspired the likes of H.P. Lovecraft, Ruth Rendell, Kingsley Amis, and Stephen King.”\n— Richard Utz, associate dean, Faculty Development, Ivan Allen College of Liberal Arts\nThe Bookshop\nBy Penelope Fitzgerald, William Collins & Sons (1978); Alfred A. Knopf (2001)\n“Fitzgerald’s novel describes Florence Green, a middle-aged woman who in 1959 sets up a bookshop in Hardborough, where she has lived for 10 years. This small seaside town doesn’t have another bookshop or a library, and the town’s residents  have read all the books they can access through the mobile library. Having worked as bookstore assistant, Florence secures Old House, a historic building, to serve as her shop and residence. But her attempts to attract customers are challenged by a powerful society matron who had other plans for Old House and a poltergeist, a supernatural rapper haunting the building.”\n— Carol Colatrella, professor and co-director, Center for the Study of Women, Science, and Technology\nLet’s Play White\nBy Chesya Burke, Apex Book Company (2011)\n“This short story collection by Chesya Burke — whose writing is regularly compared with that of Octavia Butler and Toni Morrison — revolves around a frightening truth: that life for Black women in the United States is often horrifying. Burke’s stories take back the stereotype of the Black woman as a monstrous threat that needs to be policed, disciplined, and otherwise contained and turns it on its head, allowing her conjure women, demons, and ghosts to speak out and share their terrifying experiences of slavery, genocide, white supremacy, and colonialism. Because yes! There are literal monsters galore in Burke’s stories—but they are so searingly, tenderly wrought that we know they are not really bad people, even if they sometimes do bad things. Indeed, even as Burke’s characters grapple with the harsh realities of their worlds, they sometimes manage to connect with each other across time and space in creative, generous, and often surprising ways that can and should inspire us all.”\n— Lisa Yaszek, Regents Professor of Science Fiction Studies, LMC\nPua's Kiss (Lauele Fractured Folktales Book 1)\nBy Lehua Parker, Makena Press (2020)\n“In the not-too-spooky but persistently popular horror subgenre of paranormal romance, where vampire-werewolf-human teen love triangles rule the roost, Kanaka Maoli (Native Hawaiian) author Lehua Parker draws on Maoli folklore to create this sparky meet-cute between Justin, a newly rejected groom from the U.S. continent, and Pua, the rebellious daughter of ocean god Kanaloa, in the fictional seaside town of Lauele, Hawaii. Blending “The Little Mermaid” with Hawaiian spiritual storytelling, this breezy comic novel starts when the restless Pua, a shapeshifting shark who hangs out on the beautiful white beaches of Lauele (site of Parker’s other book series such as the Niuhu Shark Saga), is discovered by depressed writer-artist Justin while in her human form, whom he finds sleeping on the sand. Soon the two share a deep connection despite their different origins (and Pua’s natural desire to devour people), as Parker deftly deploys both paranormal romance beats (especially unresolved sexual tension or UST) and her Indigenous sociocultural knowledge to feed this modern YA fairytale. Even grown humans can enjoyably surf the hormonal (but PG-rated) UST wave to the end of the couple’s story — as well as ride other imaginatively romantic entries in Parker’s “Kiss” series of Lauele Fractured Folktales including\nRell’s Kiss\n(Cinderella) and\nNani’s Kiss\n(Beauty and the Beast).”\n— Ida Yoshinaga, assistant professor, LMC\nThe Cold Embrace and Other Ghost Stories\nBy Mary Elizabeth Braddon, Ash-Tree Press (2000)\n“There are many dark and uncanny Victorian ghost stories perfect for this season. Mary Elizabeth Braddon, who was a bestselling author of the period, wrote several popular sensational novels and ghost stories. I recommend two pieces by Braddon that address ghostly and vampiric themes. “The Cold Embrace” is a chilling short story about ghostly revenge in which a young aristocratic man is haunted by his former fiancée. “Good Lady Ducayne,” which has vampiric elements, is about an elderly woman who is fixated upon youthfulness and (with the help of her doctor) drains the blood of her young caregiver. Braddon wrote over 100 novels and short stories so there are many to choose from. She is best known for her novels,\nLady Audley’s Secret\nand\nAurora Floyd\n(both are page turners full of plot twists and turns), and I would recommend those as well as her creepier short stories.”\n— Narin Hassan, associate professor and director of Graduate Studies for MS-Global Media and Cultures\nAdditional Images\nContact\nVictor Rogers\nInstitute Communications\nEmail\nvictor.rogers@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}