{"text": "What Not to Wear: Commencement Edition…and Other Tips For Your Graduation Day | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nWhat Not to Wear: Commencement Edition…and Other Tips For Your Graduation Day\nFor those who are still scrambling for the picture-perfect Commencement attire, here are some tips to help out.\nFacebook\nTwitter\nEmail\nA student adjusts their mortar board at Commencement\nApr 18, 2024\nWith\nCommencement\nright around the corner, many of you already know what you’re going to wear. Some of you may have planned your outfits months ago. (Hopefully you've at least taken your regalia out of the plastic to let the wrinkles fall out.)\nThere is no official Commencement dress code, but for those who are still scrambling for picture-perfect attire, here are some practical tips to help dress and prep for the big day.\nThis semester’s five ceremonies will take place in McCamish Pavilion. One ceremony will honor Ph.D. graduates, and the other four will honor bachelor’s and master’s graduates.\nSpring 2024 Commencement is a rain or shine event. Graduates and guests are advised to monitor the weather forecast and dress as needed.\nCommencement Dress DO’s:\nDon’t bring a bag.\nIf you must have a bag, make it clear. Commencement events at McCamish Pavilion are subject to the venue’s clear bag policy. See the full policy at\nramblinwreck.com/clearbag .\nTravel light.  This will save you the hassle of carrying a bag or going through bag check when you arrive.  Any belongings brought with you will have to be taken to your seat for the ceremony — so leave the bags, laptops, or tablets at home.  If you’re wearing a dress or skirt, try to find one with pockets to carry small items such as keys or your cell phone. If you must have a purse, consider a wristlet or small clutch within the\nbag policy size limits .\nDress comfortably.\nYou will be at McCamish Pavilion for about three and a half hours. The event will be a combination of standing and sitting, so make sure you’re dressed comfortably enough for both. Students will process in front of the stage as their names are called, so be sure you can walk in your shoes. If you’re wearing pants, consider a lighter color such as khaki. If you’re planning to wear heels, consult the “don’t wear new shoes” section, and consider a low heel. Keep in mind that if you wear a coat or jacket, it will have to go with you into the ceremony. (Consider light layers instead.)\nSuggest that your guests dress business casual.\nAlthough there is no dress code, many guests like to dress up for this special day. Parents and alumni can often be seen donning Tech colors and gear, and sometimes international guests wear their country’s traditional dress clothes. Tell them about the clear bag entry policy so they, too, can plan accordingly.\nWhatever you choose to wear, the photos you take will be around for a while, so pick something you won’t mind seeing a few years down the road. When in doubt, you can’t go wrong with white and gold.\nCommencement Dress DON’Ts:\nDon’t think that because you’re wearing a robe it doesn’t matter what you’re wearing underneath.\nThroughout the day you’ll be taking numerous photos, and you may at some point want to take off your regalia.\nDon’t wear new shoes.\nCommencement is not the day to break in new shoes. Another tip: Don’t wear high heels if you are not used to walking in them. On your walk across the stage you should be focusing on the moment you’ve been waiting for during the past four (or five) years, not worrying about tripping.\nDon’t spend too much time styling your hair.\nKeep in mind you’ll be wearing a graduation cap for a few hours. If you’re planning an elaborate hairstyle, try it out with your cap before graduation day to make sure that the cap still sits properly.\nDon’t make your mortar board too epic . Remember that someone has to sit behind you, and if you adorn your cap with anything 3D, try to keep it no more than an inch or two off the board.\nDon’t forget your regalia.\nMake sure you have your cap, gown, tassel, cords, and stole (and hood, for graduate students). There will not be extras at the event. And, don’t wait until Commencement day to unwrap it. Take it out of the plastic, make sure you have it all, and hang it up to let some of the wrinkles fall out. (If you’re feeling ambitious, give it an iron or steam.)\nOther Commencement Tips:\nSet an alarm, especially for morning ceremonies . Gates will open one hour before the start of the ceremony. Graduates must report to the venue 30 minutes prior to ceremony start. Set your alarm and have a buddy system to make sure you wake up. ( See the full Commencement schedule ).\nCharge your phone . You will scan a virtual name card as you process into McCamish Pavilion, and you will want to find family members after the ceremony. Bring a phone with a full charge. Pro tip: take a screen shot of your grad pass before you arrive. Better yet, print\nyour GradPass\nand never worry about your phone’s battery life.\nStay hydrated and take a bathroom break before you arrive.\nTry to be well-rested, fed, hydrated, and prepared to sit through the ceremony.\nPlan in advance where to meet your guests after the ceremony.\nThere will be no formal processional in or out of the venue. Suggest a specific meeting spot beforehand, even if it’s not in the vicinity of McCamish, to ensure you are away from others but can still find family members and reunite easily.\nView a seating chart of where in the venue your guests can look for you during the event.\nSend your guests parking information.\nNote available parking areas at\ncommencement.gatech.edu/venue-parking .\nMost importantly, remember to enjoy the day and reflect on all that you’ve achieved at Georgia Tech. Congratulations, graduates!\nFor faculty and staff members: Volunteers are still needed to help Commencement run smoothly.\nLearn more and sign up .\nAdditional Images\nRelated links\nCommencement Website\nContact\nKristen Bailey\nInstitute Communications\nAdditional information\nFor more information about Commencement, including parking, maps, and ticket instructions, visit\ncommencement.gatech.edu .\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}