{"text": "Investors Force Black Families Out of Home Ownership, New Research Shows | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nInvestors Force Black Families Out of Home Ownership, New Research Shows\nNew research from the Georgia Institute of Technology shows investors are most likely to push out Black, middle-class homeowners from neighborhoods.\nFacebook\nTwitter\nEmail\nLarge corporate investment concentration 2013\nAug 07, 2023\nInvestors have been buying houses at a steady rate since the last recession, but how much does it affect availability in the housing market? New research from the Georgia Institute of Technology shows investors are most likely to push out Black, middle-class homeowners from neighborhoods.\nData from\n800 neighborhoods in the Atlanta metropolitan area between 2007 and 2016\nrevealed that major investors bought homes in majority-minority neighborhoods far from downtowns and in lower-income areas. These homes were often undervalued because of their minority populations, but they remained desirable and offered good market value.\nThe neighborhoods where investors bought up real estate were predominantly Black, effectively cutting Black families out of home ownership. Collectively, Black people lost more than $4 billion in home equity over a 10-year period because of investors, according to the research.\n“That $4 billion refers to the home values that would have gone to individual homebuyers if these large institutional investment firms hadn’t purchased those properties,” said\nBrian An , assistant professor in the\nSchool of Public Policy . “This is a very conservative, lower estimate than what the actual effect probably is.”\nAn presented his findings in the paper, “ The Influence of Institutional Single-Family Rental Investors on Homeownership: Who Gets Targeted and Pushed Out of the Local Market? , ” published in the\nJournal of Planning Education and Research\nin June.\nThe Shrinking Homebuyer Market\nOwning a home is one of the main ways for the American middle class to accumulate wealth. Despite this, home ownership declined by 5.5.% between 2007 and 2016. Who owns these homes is even more divided based on race.\nFrom 2015 to 2019, homeownership among Black families in the U.S. was 41.7% and for white families 71.7%.\nSimultaneously, large private investment firms started buying single-family homes often to flip the houses and rent them at higher rates. Although smaller investment groups often buy homes, the major impact on the market comes from large private institutions.\nAnalyzing the Data\nInvestors have long been suspected of buying up substantial portions of the housing market, but determining just how many has been challenging. An used transaction data like buyer names and mailing addresses to determine who property owners were. With a natural language processing tool called OpenRefine that cleans and clusters messy textual data, he combed through millions of observations.\nAn then analyzed the data with the Herfindahl–Hirschman Index (HHI), a measure of market concentration that can determine the diversity of buyers.\n“It means how many properties they are purchasing in one neighborhood,” An said. “For example, let's say there were 500 purchases in the year for single-family houses, then essentially, how many are these large investment firms collectively purchasing? If it’s 500, that is low HHI, meaning a lower market concentration. If it’s only two firms, that’s an extremely high market concentration.”\nUsing these methods and measures, An showed that, on average, neighborhoods experienced an increase of large investor purchases from nearly 0% in 2007 to over 12% in the peak year, 2013. Investors acquired up to 76% of for-sale, single-family homes in some neighborhoods.\nInstitutional investments primarily affected Black families, according to one of An’s models. Results indicated this negative effect is much worse for Black homeownership and totally absent for white homeownership. Whether this is because investment firms mostly purchase in Black neighborhoods or if Black homeowners are specifically targeted is unclear. Regardless of the reasoning, large investors decrease homeownership for anyone in areas they buy out, but especially for Black people.\n“Real estate industry stakeholders say these big firms own no more than 3% of total single-family housing stock in the United States, so there is no way that they can suppress home ownership more,” An said. “But if you look at the neighborhood dynamics, there is a lot more concentration in certain neighborhoods that really drives down home ownership.”\nAn, B.Y. (2023). The Influence of Institutional Single-Family Rental Investors on Homeownership: Who Gets Targeted and Pushed Out of the Local Market?  Journal of Planning Education and Research ,  0 (0).  https://doi.org/10.1177/0739456X231176072\nAdditional Images\nContact\nTess Malone, Senior Research Writer/Editor\ntess.malone@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}