{"text": "Research identifies barriers in tracking meals and what foodies want | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nResearch identifies barriers in tracking meals and what foodies want\nEating healthy is sometimes a challenge on its own, so technology should ease that burden – not increase it – according to new research.\nFacebook\nTwitter\nEmail\nApr 16, 2015\n— Atlanta, GA\nEating healthy is sometimes a challenge on its own, so technology should ease that burden – not increase it – according to new research from the Georgia Institute of Technology and University of Washington. Researchers studied how mobile-based food journals integrate into everyday life and specific challenges when using food journaling technology. Their research suggests how future designs might make it easier and more effective. The research study uncovered three problem areas: barriers to reliable food entry, negative nudges in current food journal apps and challenges in social features. The findings resulted from data collected in a survey of 141 current and former food loggers as well as analysis of 5,526 public posts on the community forums of mobile-based MyFitnessPal, FatSecret and CalorieCount. “Community contributions to the databases allow journalers to publish nutritional entries themselves and create a diverse food base from which to pick, but it also raises concerns about reliability,” says Edison Thomaz, a researcher on the study and Ph.D. candidate in Human-Centered Computing at Georgia Tech. Some users said logging meals took too much effort and was time consuming. They sometimes loosely followed recipes or only ate partial portion sizes, making it difficult to log meals. Another issue was that food databases contained inaccuracies, common foods that were missing, or had multiple listings for a single food because of user-generated listings. Researchers found that not all foods are created equal when it comes to logging them. On a seven-point Likert scale, packaged foods and fast food were a breeze to log (6.5 and 6.3 mean scores), while counting up finger foods at a friend’s house or party took dedication (3.2 and 2.9 mean scores). This made the mobile journals themselves less effective, with some participants straying from their goals or eating the same thing every day to ease the logging ritual. As one respondent put it, it was easier to “scan a code on some processed stuff and be done with it.” Participants also wanted to develop social connections around food goals. Encouragement of goal attainment and mutual support helped strengthen journaling habits. Conversely, when people received no comments, had online friends stop journaling, or had comparatively less progress than others, it negatively impacted their food-tracking goals. The findings led to several recommendations, including one for designing goal-specific systems. “Food journals are an important method for tracking food consumption and can support a variety of goals, including weight loss, healthier food choices, detecting deficiencies, identifying allergies and determining foods that trigger other symptoms,” says James Fogarty, a researcher on the study and associate professor of Computer Science & Engineering at the University of Washington.  “Instead of attempting to capture the elusive ‘everything,’ the results suggest creating a diversity of journal designs to support specific goals,” says Fogarty. Reputation systems were suggested to allow users to filter for specific needs (e.g. tracking sodium intake) or vote on accuracy of entries. Also a priority: streamlining databases with similar foods and providing context for food entry, such as indicating restaurant items or vegan meals. The results have also led to separate research by team members to implement new journaling solutions. Georgia Tech researchers are testing the feasibility of using a mobile device’s built-in microphone to capture ambient sounds related to eating that, when recognized by the mobile device, nudge users to log their food. Washington researchers are using photo-based journaling to augment or replace methods focused on detailed nutritional input in an attempt to remove or reduce barriers to journaling. The research paper “Barriers and Negative Nudges: Exploring Challenges in Food Journaling” will be presented at the ACM Conference on Human Factors in Computing Systems (CHI 2015) in Seoul, South Korea, April 18-23. The work is funded in part by the Intel Science and Technology Center for Pervasive Computing, the National Science Foundation (Awards OAI-1028195 and SCH-1344613) and the National Institutes of Health (Award 1U54EB020404-01).\nAny conclusions or opinions are those of the authors and do not necessarily represent the official views of the sponsoring agencies.\nAdditional Images\nRelated links\nEdison Thomaz website\nSchool of Interactive Computing\nRead the study\nContact\nTara La Bouff College of Computing 602-770-0264\nEmail\ntlabouff@cc.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}