{"text": "The Buzz on Bioscience | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nThe Buzz on Bioscience\nThe biosciences are big at Georgia Tech. Researchers discuss what’s happening and how they see the future.\nFacebook\nTwitter\nEmail\nTop row, left to right: Melissa Kemp, Krish Roy, Susan Thomas. Bottom row, left to right: Manu Platt, M.G. Finn, Ravi Bellamkonda.\nDec 02, 2014\n— Atlanta, GA\nBiomedical engineering at Georgia Tech has risen from a handful of projects to national prominence in just two decades. Today, more than half of all incoming freshman pursue a degree in biomedical engineering, biochemistry, or biology. These students want to both understand living systems and make things that improve people’s lives. Now, more than ever, those opportunities are plentiful in biosciences at Georgia Tech, where researchers are creating medical devices for children, understanding how diseases occur, improving vaccines, and building better biomaterials for drug delivery. Georgia Tech’s unique blend of engineering, biology, chemistry, and computing — along with partnerships with world-class medical facilities in Atlanta, such as Emory University and Children’s Healthcare of Atlanta — has transformed the Institute’s campus into a magnet for bio-minded scientists. “What we bring to the table is a new perspective in the biological sciences that is data driven, that is quantitative, that focuses on devices and techniques and on being unafraid to ask fundamental questions,” said Ravi Bellamkonda, the chair and professor of the Wallace H. Coulter Department of Biomedical Engineering at Georgia Tech and Emory University. “It’s a different approach to biology as an engineer.” The rise of biomedical engineering at Georgia Tech has created a ripple effect across the biosciences on campus. Biologists studying genetics, ecology, and personalized medicine are collaborating with engineers to solve challenging medical problems. The bio quad, home to the Parker H. Petit Institute for Bioengineering and Bioscience (IBB); the U.A. Whitaker Biomedical Engineering Building; the Ford Environmental Science and Technology (ES&T) Building; and the Molecular Science and Engineering (M) Building, already forms a hub of interdisciplinary research. Soon, other collaboration-oriented buildings will be added, solidifying the Institute’s commitment to developing its bioscience portfolio, which touches everything from mechanical engineering, to electrical engineering, to materials science and engineering. Bioscience the Georgia Tech way has attracted high-profile faculty, such as M.G. Finn, pioneer of click chemistry and rumored Nobel Prize candidate. Also flocking to campus are fresh young minds, such as Susan N. Thomas, an assistant professor in the new field of immunoengineering. These researchers and others, who might not have come to Georgia Tech even 10 years ago, say that the Institute is already making a dent in some of the world’s biggest medical challenges, and is poised to do more. Nascent fields of research, such as immunoengineering, systems biology, pediatric bioengineering, chemical biology, and biomanufacturing, are emerging strengths on campus, positioning Georgia Tech to help define what these fields become. Georgia Tech is already recognized as a leader in regenerative medicine, cardiovascular engineering, neuroengineering, and mechanobiology. “Considering what had been done in the past 10 years, I thought the next 10 years at Georgia Tech would be pretty exciting,” said Finn, the interim chair and professor of the School of Chemistry and Biochemistry. “Very few places in the world — if anywhere — will embed fundamental science in with applications science and technology better than we do here.” Read more of this article from Georgia Tech's  Research Horizons  magazine .\nAdditional Images\nContact\nBrett Israel 404-491-6792 @btiatl\nEmail\nbrett.israel@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}