{"text": "Minority business enterprise manufacturers to meet in Atlanta March 24 for inaugural National MBE Manufacturers Summit | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMinority business enterprise manufacturers to meet in Atlanta March 24 for inaugural National MBE Manufacturers Summit\nSummit is designed to focus on incorporating innovation into minority-owned manufacturing enterprises, network with major corporations, and highlight the resources available.\nFacebook\nTwitter\nEmail\nAlejandra Y. Castillo, national director of the Minority Business Development Agency (MBDA) at the U.S. Commerce Department, is one of the featured keynote speakers at the National MBE Manufacturers Summit 2016 on March 24 at Georgia Tech's Global Learning Center.\nMar 09, 2016\n— Atlanta, GA\nAmerica’s manufacturing sector is undergoing rapid change and innovation, incorporating hi-tech advancements across all sectors of the industry. What do these changes mean for minority-owned manufacturers? How are they meeting the demands and partnering with other manufacturers and customers to incorporate innovation into their operations? Those factors and others comprise the central focus of the inaugural National MBE Manufacturers Summit 2016 scheduled for March 24 in Atlanta. The U.S. Department of Commerce Minority Business Development Agency (MBDA) and its MBDA Business Center Network are hosting the Summit, which is sponsored in part by BMW, the Georgia Manufacturing Extension Partnership, Grady Health System, Ingersoll Rand, and Novant Health. It will take place at the Georgia Institute of Technology’s Global Learning Center. “We are focused on ensuring that attendees maximize their day by meeting one-on-one with corporations and original equipment manufacturers seeking to do business with MBE manufacturers,” said Donna Ennis, MBDA Business Center-Atlanta’s director. “We’re bringing all of these parties together in this first-of-its-kind national forum to get those conversations started in a real, substantive way.” The MBE manufacturing community is often overlooked by the broader manufacturing community and, in general, does not access the myriad national and local resources and expertise available to them, Ennis said. The Summit’s breakout sessions are designed to address that. Among the key discussion topics and event highlights: Business-to-business matchmaking and one-on-one fast pitching to multinational and major corporations. A “Poster Walk” showcase of companies that will feature projects in the areas of innovation, productivity, and sustainability. Manufacturing trends in health care and cybersecurity. Access to technology transfer opportunities and information. Opportunities in the global marketplace. Procurement and supplier diversity trends. “This is an excellent opportunity for our MBE Manufacturers to collectively dialogue and share information that will support their success now and in the future,” said Alejandra Y. Castillo, MBDA’s national director and one of the Summit’s featured speakers. “We hope everyone will join us in Atlanta.” Other featured speakers at the Summit include: G.P. “Bud” Peterson , Georgia Tech president. Derreck Kayongo , co-founder of the Global Soap Project and CEO of the Center for Civil and Human Rights. To register for the Summit and for more information, please visit\nwww.mbemanufacturersummit.org . About the MBDA Business Center-Atlanta: As part of a national network of 44 centers, the MBDA Business Center-Atlanta helps MBEs access capital, increase profitability, create jobs, and become sustainable. It is part of Georgia Tech’s Enterprise Innovation Institute (EI 2 ), the nation’s largest and most comprehensive university-based program of business and industry assistance, technology commercialization, and economic development. For more information, please visit mbdabusinesscenter-atlanta.org.\nAdditional Images\nRelated links\nNational MBE Manufacturers Summit 2016\nMinority Business Development Agency (MBDA) Business Center-Atlanta\nContact\nFor information about MBDA  Business Center-Atlanta, contact: Rolanda Powell 404.894.8150 rolanda.powell@innovate.gatech.edu\nEmail\nperalte.paul@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}