{"text": "Georgia Tech's Startup Ecosystems wins $250,000 federal grant | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech's Startup Ecosystems wins $250,000 federal grant\nThe Economic Development Administration’s 2015 Regional Innovation Strategies program awarded $10 million in grants to various economic development initiatives across the United States.\nFacebook\nTwitter\nEmail\nGrupo Guayacán, headquartered in San Juan, Puerto Rico, is a non-profit organization that works with entrepreneurs and private equity investment entities to help the island’s entrepreneurial ecosystem develop and grow. The organiziation has partenered with Georgia Tech's Startup Ecosystems and VentureLab I-Corps Puerto Rico programs to create classes, workshops, and other intiatives toward that effort.\nFeb 09, 2016\n— Atlanta, GA\nStartup Ecosystems, a program of the Georgia Institute of Technology that helps governments, communities, and other groups with their economic growth initiatives, has won a $250,000 grant from the Economic Development Administration’s (EDA) 2015 Regional Innovation Strategies (RIS) program. Separately, the Global Center for Medical Innovation (GCMI), a Georgia Tech affiliate, has been awarded a $249,981 RIS grant for its Medical Technology (MedTech) Seed Fund & Accelerator Program. The 2015 RIS program is managed by EDA’s Office of Innovation and Entrepreneurship ( OIE ) and is designed to advance innovation and capacity-building activities in regions across the U.S. through two different competitions: the i6 Challenge and the Seed Fund Support (SFS) Grants. The 25 total awardees in both competitions, announced by the U.S. Department of Commerce on Feb. 8, will receive $10 million in grants. “This 2015 Regional Innovation Strategy cohort of grantees is truly an exciting group — the diversity in programs and regional representation proves that innovation and entrepreneurship are igniting all corners of the country,” said U.S. Assistant Secretary of Commerce for Economic Development Jay Williams. “From Puerto Rico to Pittsburgh, and Seattle to Blacksburg, these programs will reach all kinds of communities and help entrepreneurs gain the edge they need to succeed.” Startup Ecosystems, which is part of Tech’s Enterprise Innovation Institute, is working with EnterPRize Events and Grupo Guayacan in Puerto Rico to help foster the Caribbean island’s startup ecosystem. “These types of investments are critical to address the economic barriers that exist for many bright and budding entrepreneurs in Puerto Rico,” said Rafael L. Bras, Georgia Tech’s provost and executive vice president for Academic Affairs. “From proof to seed and startup, the life cycle of such ventures can experience a multitude of vulnerabilities if funding isn’t available early on in the venture. Capital-based and technical support systems provided through the Seed Fund Support award provide vital bridge-gap resources, allowing these underrepresented innovators to bring exciting new ventures to the market.” The EDA grant will give Puerto Rico-based startups access to small, early-stage investments for moving customer-validated ideas to the marketplace, said David Bridges, Startup Ecosystems’ director. “Georgia Tech is fortunate to be a partner with EnterPRize Events and Grupo Guayacan in the establishment of this first-ever seed fund for Puerto Rico,” Bridges said. “The Innovation Driven Enterprises or IDE seed fund will be used to support startups with high potential in their quest to reach both local and global markets.” Georgia Tech has worked on efforts such as these with members of Puerto Rico’s startup system for more than three years, Bridges noted. “We believe this grant is yet another important step toward growing a thriving innovation and entrepreneurship culture in Puerto Rico.” For GCMI, the grant will help the program increase the availability of funding to early-stage companies and maximize the opportunities for follow-on private investments, said Executive Director Tiffany Wilson. “GCMI works with university researchers, clinicians, and early-stage companies to help accelerate the development and commercialization of new medical device technologies,” Wilson said. \"One critical hurdle that we see many startup device companies face is access to capital. This grant will enable GCMI to increase the availability of funding for early-stage companies and investing in companies that are solving real unmet clinical needs and customer problems.” The program will have a particular emphasis on funding diverse startup teams and seeing a greater number of female engineers and clinicians involved in the entrepreneurial process, Wilson said. “We know that diverse teams show greater returns to investors.\" — Péralte C. Paul\nAdditional Images\nContact\nLaura Diamond Georgia Tech Media Relations  laura.diamond@gatech.edu\nEmail\nperalte.paul@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}