{"text": "Empathy from the Sick May be Critical to Halting Disease Outbreaks | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nEmpathy from the Sick May be Critical to Halting Disease Outbreaks\nA little empathy can go a long way toward ending infectious disease outbreaks.\nFacebook\nTwitter\nEmail\nEmpathy of infected individuals is necessary to halt a disease outbreak by preventing infection of susceptible persons. Here, a CDC image shows the effects of a sneeze. (Credit: Centers for Disease Control and Prevention)\nMar 15, 2017\n— Atlanta, GA\nA little empathy can go a long way toward ending infectious disease outbreaks.\nThat’s a conclusion from researchers at the Georgia Institute of Technology in collaboration with a researcher from KAUST, who used a networked variation of game theory to study how individual behavior during an outbreak of influenza – or other illness – affects the progress of the disease, including how rapidly the outbreak dies out.\nThe research study pitted the self-interests of susceptible individuals against those of infected persons, and found that only if sick persons took precautions to avoid infecting others could the illness be eradicated. Healthy people attempting to protect themselves couldn’t, by themselves, stop the disease from spreading. Among the key factors was empathy of infected persons.\n“We wanted to understand disease dynamics from an individual’s perspective,” said Ceyhun Eksin, a postdoctoral fellow in the laboratory of Georgia Tech\nSchool of Biological Sciences\nProfessor\nJoshua S. Weitz . “In particular, we wanted to know what role individual behavior plays in disease spread and how behavior might affect forecasting and consequences in the long run when there is an outbreak.”\nThe research, reported March 14 in the journal\nScientific Reports , was sponsored by the U.S. Army Research Office. The work used mathematical models that took into account how infectious diseases spread and the effects of measures taken to control them.\nPublic health initiatives against seasonal diseases like influenza tend to initially focus on immunization programs, which move individuals out of the “susceptible” category. Once an outbreak begins, health campaigns focus on encouraging susceptible persons to take precautions such as hand-washing and avoiding infected people.\nThe success of those measures may depend on individual perceptions of how great the risk of infection might be, Eksin noted. The more awareness individuals have of infected persons around them, the more likely they are to protect themselves. Perception can also affect the behavior of infected individuals, who may be more likely to stay home from work or cover their cough, for instance, if they believe their presence could infect a significant number of people.\n“If an infected person really wants to attend a meeting at work, it’s one thing if only one other person could be at risk,” he said. “It may be a different thing if they could affect a whole office of susceptible people.”\nThe empathy of sick persons becomes especially important toward the end of an outbreak, when the number of infected persons may be low, but still enough to sustain the illness. When the number of sick people is low, risk perception falls, leading susceptible people to reduce their precautions – and sick people to feel less concern about infecting others.\nIf those sick persons then decide to head off to work despite their illness, they may infect unsuspecting susceptible people, causing the outbreak to continue. “The behavior of the infected individuals can be more important than the behavior of the susceptible individuals in eradicating the disease,” said Eksin. “A little bit of empathy can be crucial at this point.”\nWhile the research examined the results of individual actions during an outbreak, those individual decisions were actually related because individuals are part of networks of contacts.\n“In a connected network, everyone’s activities can affect you in one way or another,” Eksin said. “If your sick neighbors decide to isolate themselves, then you don’t need to take any action to protect yourself against them. But you don’t necessarily know what your neighbors are doing, and their actions may well be affected by what others are doing. The effect can cascade.”\nWhile calculating such interactions could be intractable from a computing standpoint, the authors introduced an algorithm based on game theoretic concepts that allows a logical resolution. “Our analysis provides a principled response to recent calls to integrate game theory with disease dynamics to understand how individuals should act in response to disease development.”\nThe results of the work may improve the ability to predict individual behavior such as risk aversion or empathy. That would allow better forecasting of outbreaks and facilitate more efficient use of resources such as vaccines and public health awareness advertising. But additional information may be required to effectively make such predictions, Eksin said.\nChanging individual behavior in response to risk perception may point toward the importance of adjusting communication campaigns as disease fluctuates. And the importance of self-isolating for infected individuals may suggest more awareness initiatives aimed specifically at that group rather than susceptible persons.\n“When we studied individual behavior, empathy trumped risk aversion in disease eradication, which was counterintuitive for us,” Eksin added. “We need to champion the benefits of empathy by sick individuals to eradicate disease in the community.”\nThis research is supported by the Army Research Office under grant W911NF-14-1-0402, and in part by KAUST. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the sponsoring organization.\nCITATION : Ceyhun Eksin, Jeff S. Shamma, and Joshua S. Weitz, “Disease dynamics in a stochastic network game: a little empathy goes a long way in averting outbreaks,” (Scientific Reports, 2017).\nhttp://dx.doi.org/10.1038/srep44122 .\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contacts : John Toon (404-894-6986) (jtoon@gatech.edu) or Ben Brumfield (404-385-1933) (ben.brumfield@comm.gatech.edu)\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}