{"text": "Personal Finance 101 | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nPersonal Finance 101\nNew Georgia Tech elective teaches students how to manage their finances before they graduate and embark on careers.\nFacebook\nTwitter\nEmail\nJonathan Clarke, associate professor of finance in the Scheller College of Business, developed a new personal finance class open to all majors. (Photo by Christopher Moore)\nMar 15, 2018\n— Atlanta, GA\nInduja Kannan is majoring in finance, but that doesn’t mean she knows how to manage her own finances.\nTo fix that she signed up for Georgia Tech’s\nnew personal finance course . The one-credit elective shows students how to set a budget and manage expenses. It includes a focus on investing at an early age.\n“I really hadn’t put a lot of consideration into my own finances and thinking about everything that goes into setting my budget and balancing my current expenses and putting away for the future,” said Kannan, a third-year student. “I just wasn’t aware of everything I didn’t know.”\nIncreased awareness is just one lesson students get from the class, said Jonathan Clarke, associate professor of finance in the Scheller College of Business.\nWhile most students wanted to jump to the sections on investing, Clarke structured the course to open with fundamental lessons on budgeting, setting financial goals and managing debt.\nClarke has experience teaching personal finance. He’s taught the subject for the National Football League and developed the\nWall Street on West Peachtree\nsummer program for high school students.\nThe elective is open to students from all majors.\n“I thought I could design a course for Tech students that touched on all of the basics of personal finance,” said Clarke, associate dean of undergraduate programs in the Scheller College. “It’s important material. Being financially secure can lower stress and improve mental health.”\nSteven Girardot, associate vice provost for undergraduate education, approached Clarke about developing the class after hearing students wanted more information on this subject. Financial literacy among students is also a priority of\nComplete College Georgia , he noted.\nDuring a recent class, they discussed the volatile stock market and Clarke advised students not to panic. He reminded them to look at what will happen over the course of 50 years, not five days.\nDuring other classes they weighed the questions that should be asked when determining whether it’s better to buy or rent a home. They reviewed car buying tips, such as negotiating the car purchase price and trade-in value separately. They discussed retirement investments and how to choose a health insurance plan.\nJordan Bergenfeld, a fifth-year mechanical engineering major, signed up for the course after asking his advisor about a class on investments.\n“I’m getting job offers and I don’t know how to evaluate them when they’re talking about stock options and other benefits,” he said. “I really just want to make sure I’m doing what I can to have a good financial future. I’ve already recommended this class to a bunch of friends.”\nThe class will be offered again this summer, Clarke said. He’s exploring ways to offer the class online and to make it a permanent fixture at Georgia Tech.\nApurva Kasam, a fourth-year business administration major, will graduate this fall and appreciated learning how to balance expenses and savings.\n“This should be a required class for everyone,” she said. “Georgia Tech does a good job preparing us for our careers. This class is about giving us the personal preparation for our lives.”\nAdditional Images\nContact\nLaura Diamond\nMedia Relations  laura.diamond@gatech.edu\n404-660-2927\nEmail\nlaura.diamond@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}