{"text": "Georgia Tech Announces Zoom Soft Launch | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Announces Zoom Soft Launch\nGeorgia Tech will begin a soft launch of the Zoom video collaboration platform beginning Monday, Feb. 7, for students, faculty, and staff.\nFacebook\nTwitter\nEmail\nFeb 07, 2022\n— Atlanta, GA\nGeorgia Tech will begin a soft launch of the\nZoom\nvideo collaboration platform beginning Monday, Feb. 7. The announcement comes after an almost yearlong effort to evaluate and introduce a new videoconferencing solution for academic course delivery and collaboration.\nWith the Institute’s existing agreement with BlueJeans set to expire at the end of the spring semester — and the sunset of the WebEx platform in December 2021* — the\nVideo Collaboration Review\n(VCR) team formed in early 2021 to explore new video collaboration platforms that meet the academic and operational needs of students, faculty, and staff. The committee, comprised of members from each division and College, along with students and technology representatives, identified requirements and evaluated possible solutions on their ability to:\nEnable secure, reliable, and flexible course delivery and student learning.\nSupport virtual classrooms and meetings of multiple sizes.\nFacilitate effective collaboration and communication across the Institute.\n“It was critically important to us that we start our selection process with an examination of our needs from a collaboration, teaching, and learning perspective,” said Daren Hubbard, Georgia Tech vice president of Information Technology and chief information officer. “The committee spent a great deal of time articulating these criteria so that we could, as objectively as possible, evaluate a number of options and eventually recommend a solution for Georgia Tech.”\n“Not only did Zoom, to a large extent, meet our committee’s criteria, but it is also one of the most widely used video collaboration tools,” said Yakut Gazi, Ph.D., associate dean for Learning Systems at Georgia Tech Professional Education. “Many of our students, faculty, and staff have participated in Zoom meetings during and even before the pandemic, which we anticipate will facilitate adoption at Georgia Tech.”\nThe VCR team had planned to launch a two-month pilot of Zoom at Georgia Tech last October.\n“Due to unforeseen circumstances, we regrettably had to delay, then ultimately cancel our planned October pilot,” Gazi said. “Thanks to collaborative work between the Office of Information Technology (OIT), Procurement and Business Services, and the Office of the General Counsel, we were able to come to an agreement with Zoom in December, setting us up for our soft launch in February with our campus partners.”\nCanvas has been integrated with Zoom and will enable convenient access for faculty and students in blended and online learning courses. During the first phase of the Zoom soft launch, the platform will only be available to Georgia Tech users who host meetings from inside the U.S. Zoom recordings will be automatically migrated to the user’s\nKaltura MediaSpace\naccount.\n“Over the course of the next few months, our teams will work to tighten the integration of Zoom with the classroom technology systems, as well as with the Kaltura MediaSpace video storage and delivery system, to further enhance the interoperability of our academic technology ecosystem,” Gazi said. “We will also be working with Tech entities and Zoom to expand the platform’s usage to all Georgia Tech learners, independent of their global location.”\nGazi also applauded the extensive due diligence process that guided the committee’s decision to bring the platform to Georgia Tech.\n“I am thankful for the resilience and persistence of the committee members who guided this process for many months. I am excited to introduce this much needed platform to our community and welcome input as we continue to improve our technology tools and services.”\nOIT will work with the Georgia Tech community through the spring to prepare for the transition from BlueJeans. Upcoming communications will share resources for securely migrating stored lecture and meeting recordings and additional information.\nThe campus community is invited to join an upcoming ‘Ask Me Anything’ informational Zoom session:\nMonday, Feb. 14, 3:30 – 4:15 p.m.\nTuesday, Feb. 15, 2 – 2:45 p.m.\nGeorgia Tech users can log into Zoom at\ngatech.zoom.us .\nMore Zoom information and resources will be made available to the Georgia Tech community in the coming months.\n*The Georgia Tech Research Institute will continue to use its version of WebEx ( gtri.webex.com ).\nAdditional Images\nEmail\noit@gatech.edu\nAdditional information\nA few notes about accessing Zoom at Georgia Tech:\nStudents, faculty, and staff can access Zoom at\ngatech.zoom.us.\nSign in with your Georgia Tech login ID and password.\nDuring this first phase, Zoom meetings must be hosted from inside the U.S. (Meeting participants can join from anywhere in the world.)\nZoom will integrate with Canvas to enable course delivery. Please refer to\nUsing Zoom in Canvas\nfor direction.\nBlueJeans will be available through the spring semester but will sunset at Georgia Tech in May. Those already using BlueJeans or Teams for video collaboration, course instruction, and advising are highly encouraged to continue using these platforms through the end of the spring semester.\nZoom recordings will be automatically migrated to\nKaltura MediaSpace . (They will be automatically deleted from Zoom seven business days after their creation.)\nFaculty and course instructors who would like to use Zoom for classroom instruction hosted inside the U.S. may visit\navservices.oit.gatech.edu\nto request a classroom training opportunity.\nZoom provides 24/7 user support at\nsupport.zoom.us . You may also submit a help request at\nservices.gatech.edu .\nBrowse Zoom knowledge articles by searching the\nService Now\nwebsite or via the ‘Zoom’ search provided on the site\nhere . Additional articles and information will be added, as developed.\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}