{"text": "Gulf of Mexico Study Finds Microbes Thriving above Natural Oil Seeps | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGulf of Mexico Study Finds Microbes Thriving above Natural Oil Seeps\nScientists have discovered that phytoplankton are thriving above natural oil seeps in the Gulf of Mexico.\nFacebook\nTwitter\nEmail\nGeorgia Tech Professor Joe Montoya and graduate student Sarah Weber prepare to recover equipment used to gather water samples in the Gulf of Mexico. (Credit: Ryan Sibert, University of Georgia)\nJan 25, 2016\n— Atlanta, GA\nIn the water above natural oil seeps in the Gulf of Mexico, where oil and gas bubbles rise almost a mile to break at the surface, scientists from the Georgia Institute of Technology, Columbia University and Florida State University have discovered something unusual: phytoplankton, tiny microbes at the base of the marine food chain, are thriving. The oil itself does not appear to help the phytoplankton, but the low concentration of oil found above natural seeps isn’t killing them, and turbulence from the rising oil and gas bubbles is bringing up deep-water nutrients that phytoplankton need to grow, according to a study appearing January 25 in the journal\nNature Geoscience . The result is phytoplankton concentrations above oil seeps that are as much as twice the size of populations only a few kilometers away. “This is the beginning of evidence that some microbes in the Gulf may be preconditioned to survive with oil, at least at lower concentrations,” said Ajit Subramaniam, an oceanographer at Columbia University’s Lamont-Doherty Earth Observatory and co-author of the study. “In this case, we clearly see these phytoplankton are not negatively affected at low-concentrations of oil, and there is an accompanying process that helps them thrive. This does not mean that exposure to oil at all concentrations for prolonged lengths of time is good for phytoplankton.” The research shows that the effects of oil and gas at the sea surface can be very different from the impacts of events such as the Deepwater Horizon spill, said\nJoseph Montoya , a professor in\nGeorgia Tech’s School of Biology\nand another of the paper’s co-authors. The research could lead to a reconsideration of the response made to spills. “There may be different responses by different organisms as we look at different regions of the spill itself,” said Montoya.  The study is the first to demonstrate this kind of teleconnection between the sea floor, subsea floor and microbial processes in the upper ocean, said Andy Juhl, an aquatic ecologist at Lamont and co-author. It also provides insight into how microbes and oil interact under water. The researchers, along with colleagues in the Ecosystem Impacts of Oil and Gas Inputs to the Gulf (ECOGIG) consortium, began studying interactions around oil seeps after the Deepwater Horizon oil well disaster in 2010 to better understand what happens to the oil during catastrophic gushers and to find ways to better respond to similar disasters in the future. The natural seeps, found in many parts of the Gulf of Mexico, are tiny compared to an oil well blowout. An oil slick from a natural seep lasts between one and seven days and reaches between 1 and 100 square kilometers. In comparison, the surface oil from the Deepwater Horizon well covered about 11,200 square kilometers and persisted for months, Subramaniam said. But natural seeps still produce enough oil and gas that the scientists can smell it at the surface and see the oil bubbles burst. In the lab, Juhl has been conducting experiments to understand how different concentrations of oil affect different types of phytoplankton. He has found no amount of oil on its own that has a positive effect on phytoplankton. “The direct effect of oil is usually negative, but in some cases small amounts of oil can be outweighed by the positive effect of the nutrients that are tagging along,” Juhl said. Nigel D’Souza, then a post-doctoral researcher at Lamont, discovered the phytoplankton response to oil seeps while on a ship in the Gulf of Mexico monitoring chlorophyll fluorescence – energy that is emitted as light by compounds inside phytoplankton cells used for photosynthesis. Each time the ship crossed over a known oil seep, he noticed a spike in phytoplankton abundance. It was a Eureka moment, Juhl said. The evidence backed up what Susan Phan, a co-author and Columbia University student working on her senior thesis with Subramaniam, had previously noticed in remote sensing data. The scientists were able to compile multiple lines of evidence through chlorophyll fluorescence, water sampling and satellite images that all supported the idea that phytoplankton were benefitting from something connected with the seeps, even though the seeps were thousands of feet below. The biggest impact was seen a few hundred feet deep in the water column, at the point where phytoplankton have enough light from above to still grow, and are receiving the most nutrients rising from below. Over oil seeps, D’Souza – who is now at Georgia Tech – found that the population was about double the usual amount. The measurements also showed increases in phytoplankton abundance at the surface. There are still many questions. For example, scientists don’t yet know which types of phytoplankton are thriving over the seeps, or if some types of phytoplankton in the community are negatively affected by the rising oil. Previous studies have subjected phytoplankton to oil in laboratories to test their sensitivity and found differences in the impact on oceanic versus coastal phytoplankton and differences when phytoplankton were in nutrient-rich or nutrient-poor water, as well as damage to some phytoplankton cells at various concentrations of oil. The study combined sampling from surface vessels with remote sensing from space. “Satellite radar data have given us a detailed picture of where natural seeps are concentrated across deep seafloor of the Gulf of Mexico,” said co-author Ian MacDonald, an oceanographer and professor at Florida State University. “Building on this, the present, novel results show biological effects near the ocean surface in areas where seeps are most prolific.” The research also demonstrates the importance of oceanographic field research in understanding complex ecosystem issues. “There has been a tendency to rely on autonomous samplers in place of researchers out at sea,” Montoya observed. “For this project, it was really important to have diverse groups of scientists with broad interests working together both at sea and onshore, to tease the system apart.” The research team plans two pathways of study next: To analyze the behavior of different types of phytoplankton above seeps to better understand how they interact with oil, and to improve understanding of how oil from deep underwater rises to the surface. The study was part of the ECOGIG Consortium, a multi-institutional group that studies natural oil seeps in the Gulf of Mexico, funded by the Gulf of Mexico Research Initiative. In addition to those already mentioned, coauthors on the study were Mark Hafez, Alexander Chekalyuk, and Beizhan Yan of Lamont-Doherty Earth Observatory; and Sarah Weber of the Georgia Institute of Technology. This work is supported by The Gulf of Mexico Research Initiative's (GOMRI) ECOGIG consortium, with additional support from National Science Foundation (NSF) grant OCE-0928495. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the author(s) and do not necessarily reflect the views of the National Science Foundation. CITATION : N.A, D’Souza, et al., “Elevated surface chlorophyll associated with natural oil seeps in the Gulf of Mexico,” (Nature Geoscience, 2016).\nhttp://dx.doi.org/10.1038/ngeo2631 Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Contact : John Toon (404-894-6986) ( jtoon@gatech.edu ). Written by Columbia University’s Lamont-Doherty Earth Observatory\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}