{"text": "Experts recommend intermediate physical activity goals, especially for older adults | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nExperts recommend intermediate physical activity goals, especially for older adults\nEven moderate increases in physical activity can have health benefits, a new paper argues.\nFacebook\nTwitter\nEmail\nA paper published in the British Medical Journal suggests that existing exercise goals may be too ambitious for many middle-aged and older adults. (Credit: ThinkStock)\nJan 22, 2015\n— Atlanta, GA\nThe recommendation that adults should get 150 minutes of moderate exercise per week may be too ambitious for many middle-aged and older adults. That’s one key recommendation from physical activity and health experts in the United States and Australia who published a paper this week in the\nBritish Medical Journal . While all adults, even those over the age of 65, should strive to attain the weekly goal of 150 minutes, the authors argue that individual goals must be realistic, taking in account possible physical limitations and established patterns of inactivity. “Only about one in ten adults aged 40 and older in the United States and the United Kingdom is getting what is considered to be ‘sufficient’ exercise,” said Phillip Sparling, a professor emeritus in the School of Applied Physiology at the Georgia Institute of Technology and lead author of the paper. Sparling and colleagues make the case that any increase in physical activity, even small amounts, will be beneficial. For sedentary individuals, a gradual transition to increased activity may be the most practical way to improve health. “For example, adding five to ten minutes per day of light walking and standing is a good start, building up to 30 minutes per day during the course of a month,” he said. Long-term sitting has been cited by the World Health Organization as a leading risk factor for death. “A major point we were trying to make is that older adults should replace sitting with standing and light activity,” said Sparling.  An inability to meet the 150 minute per week standard shouldn’t keep sedentary individuals from increasing their physical activity in small increments, though the greatest benefit will go to those who invest the most in their health, he added. “Health benefits depend on the type and amount of activity,” Sparling noted. “In general, the dose-response relationship holds for overall well-being and functional capacity. For the most sedentary persons, benefits can be realized from modest increases in activity levels.\" In their paper, the researchers are careful to point out that a focus on increasing light activity does not replace the goal of 150 minutes of moderate exercise per week. “This is not about a new ‘exercise lite’ program or rolling back consensus standards,” Sparling said. “Adding more light activity throughout the day does not replace the established exercise goal of 30 minutes per day of brisk walking. It should instead be viewed as complementary, or as an intermediate pathway toward the goal.” Older adults should be encouraged to reduce sedentary behavior by introducing activity throughout the day, the researchers suggest in their paper. Sedentary time should be broken up by standing or strolling for one or two minutes at least once an hour. “Advice on how to accumulate time spent in light activity could include getting up from the chair and moving during television commercial breaks, pacing when on the phone, adding gentle five minute walks throughout the day, and walking rather than driving for short trips,” the paper suggests. Exercise is associated with reduced risk of hypertension, heart disease, stroke, diabetes, breast cancer and colon cancer. But older adults may have different health goals than younger persons. For instance, said Sparling, older people may be more concerned about exercise to sustain strength, flexibility and balance required for independent living. The researchers examined data for 7,000 United States adults between the ages of 20 and 79 to calculate average daily time in physical activity. The data from the U.S. National Health and Nutrition Examination Survey was based on actual accelerometer readings, not self-reporting of the study participants. Only in the youngest age groups did the level of daily physical activity rise above 30 minutes per day. Perhaps more importantly, the percentage of time spent sedentary during waking hours rose from 55 percent in the group between 20 and 29 years of age to 67 percent in those between 70 and 79. In addition to Sparling, the authors of the paper included Bethany J. Howard, a doctoral candidate at the Baker IDI Heart and Diabetes Institute in Melbourne, VIC, Australia; David W. Dunstan, a professor at the Baker Institute and the University of Western Australia, and Neville Owens, a professor at the Baker Institute and the University of Queensland, Monash and Melbourne Universities in Australia. Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia  30332-0181 Media Relations Contacts : John Toon (404-894-6986) ( jtoon@gatech.edu ) or Brett Israel (404-385-1933) ( brett.israel@comm.gatech.edu ) . Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}