{"text": "Wallace Coulter at 100: A Legacy of Biomedical Innovation | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nWallace Coulter at 100: A Legacy of Biomedical Innovation\nTo celebrate the life and scientific legacy of Wallace H. Coulter, his namesake department is hosting a celebration on Dec. 5-6 at Georgia Tech and Emory University.\nFacebook\nTwitter\nEmail\nWallace H. Coulter (February 17, 1913 – August 7, 1998) would have turned 100 years old this year. To celebrate his legacy, a celebration will be held Dec. 5-6 at Georgia Tech and Emory University. Credit: Coulter Foundation.\nDec 05, 2013\n— Atlanta, GA\nIn the early 1990s, when Wallace H. Coulter — legendary scientist and inventor of a device to rapidly count cells — was elected as a fellow of the American Institute for Medical and Biological Engineering (AIMBE), he was unable to attend the meeting to accept the nomination. Rather than mail the award to him, Georgia Tech’s Robert Nerem, who was AIMBE’s president at the time, hopped on a plane from Atlanta and flew to Miami to present Coulter with the award in person. Among his many titles, Nerem is the founding director of Georgia Tech’s Parker H. Petit Institute for Bioengineering and Bioscience. He has been a bioengineer for more than 35 years. Nerem knew how important Coulter was to the field, but the man he met in Miami gave no hint of scientific or business celebrity. “He was a fascinating individual, very humble in nature,” Nerem said. “As the CEO of an important company, he did not believe in an executive dining room. So he hosted me for lunch in the cafeteria where all the other employees were. That was just his style.” The connection made then and maintained through the years was instrumental in the formation of the Wallace H. Coulter Department of Biomedical Engineering at Georgia Tech and Emory University. \"Walter H. Coulter's life and approach to work are an inspiration to us all and we try to honor his memory every day in the way we approach our educational and research activities,\" said Steve Cross, Georgia Tech’s Executive Vice President for Research. This year, Wallace Coulter would have turned 100, and to celebrate the life and scientific legacy of Coulter, his namesake department is hosting a celebration on Dec. 5-6 at Georgia Tech and Emory University. “I have heard many wonderful stories about Wallace’s deep commitment to his team and his people and employees,” said Ravi Bellamkonda, who holds a Wallace H. Coulter Chair in the department. “I’d like to think that the Coulter Department has a similar environment of a team and a family.” Coulter studied electronics as a student at Georgia Tech in the early 1930s. The Coulter Foundation, through its philanthropy, helped establish the innovative academic department operated jointly by Georgia Tech and Emory University. “There’s no question that the major gift by the Coulter Foundation was extremely important in building the biomedical engineering department to propel itself in a very short time to being a leading department in the country,” said Don Giddens, the founding chair of the Coulter Department and former dean of the College of Engineering. The biomedical research conducted today might not be possible without the invention of the Coulter Counter. The Coulter Counter transformed diagnostics in hospitals by allowing rapid counting of blood cells. As cells of different sizes go through the counter, the cells change the current that flows through the device. That change in current is used to very rapidly count blood cells, providing information that helps spot illnesses in patients. The invention of the Coulter Counter was the foundation for the successful, multi-national Coulter Corporation. Wallace Counter also held 85 patents and positioned the Coulter Corporation as a leader in the diagnostics technology industry. In October 1997, the Coulter Corporation was acquired by Beckman Instruments, Inc. and the company is now known as Beckman Coulter, Inc. “I will always remember the Coulter Counter as the best way to count cells without having to do it by eye and on a microscope that can be prone with many different errors,” said Manu Platt, an assistant professor and GRA Distinguished Cancer Scientist in the Department of Biomedical Engineering, who also earned his PhD in the Coulter Department. “For it now to be so routinely done in hospitals has allowed for greater processing of a large number of patient blood draws.” Analysis of blood work revolutionized the detection of cancer and many kinds of blood-related diseases. Tests that once took several days took just minutes with the Coulter Counter. “Wallace Coulter firmly believed that technology and engineering can change medicine for the better,” Bellamkonda said. “That is entirely our focus here in the Coulter Department of Biomedical Engineering.” Outside of biology, the Coulter Counter has had commercial impacts in other fields such as manufacturing. For example, the Coulter Counter is used in paint manufacturing to quickly measure particle size and number. The Coulter Counter was based on the Coulter Principle, which says that when cells are passed through microchannels separating electrolyte solutions, a transient current drop is proportional to the particle volume. The Coulter Principle is one of the precursors to microfluidic studies that are commonly used today, Platt said.These studies are now at the forefront of how to miniaturize or “nano-ize” diagnostic detection devices for cheaper, faster and better assays, which are directly applicable to  environments like those in developing countries, such as in rural Africa where Platt does fieldwork studying HIV/AIDS. Microfluidic studies, such as Assistant Professor Todd Sulchek’s work sorting cells by stiffness to spot disease, are a modern legacy of the Coulter Counter. “That principle — the idea of making a very small aperture or very small hole — is a foundation for microfluidics,” said Sulchek, who works in both the Coulter Department and the George W. Woodruff School of Mechanical Engineering. “People realized that if you make very small dimensions, on the scale of individual cells, you can utilize new mechanisms for detection. That idea underpins almost all of microfluidics.” Coulter was driven to innovate, something that the Coulter Department also strives for. Many of the Coulter Department’s faculty members have created startups and are interested in taking their ideas further. They are not satisfied with just publishing a study, Bellamkonda said. Embedded in the DNA of the Coulter Department is a drive to move technologies to patients as fast as possible, he said. Just one example of this drive is found in the Cardiovascular Fluid Mechanics lab of Ajit Yoganathan, the Associate Chair for Translational Research, Regents Professor and the Wallace H. Coulter Distinguished Faculty Chair in Biomedical Engineering. His lab has a rich history of translational research over the past 34 years, working closely with cardiologists and cardiac surgeons, both adult and pediatric, to identify the important questions and challenges that the clinicians face and how the lab’s research could help clinical care. Yoganathan’s lab has developed a repair technology for the mitral valve that is currently licensed for commercialization to a major heart valve company, and the lab has also developed a minimal blood loss access port into the left ventricle, which is in clinical trials in partnership with his startup company Apica Cardiovascular. “The ideas came from basic research that was going on in the lab and having the Coulter funding allowed us to take it to the next level,” Yoganathan said. Helping improve the lives of patients through commercializing biomedical research is a modern-day Coulter principle. “The old Coulter principle is how to count particles. The new Coulter principle, pioneered with single-minded focus by the Coulter Foundation, is helping us take engineering innovations from the lab and successfully commercialize them,” Bellamkonda said. “Wallace’s legacy vibrantly lives on through the work of his foundation.” Research News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA Media Relations Contacts : Brett Israel (404-385-1933) ( brett.israel@comm.gatech.edu ) or John Toon (404-894-6986) ( jtoon@gatech.edu ) Writer : Brett Israel\nAdditional Images\nContact\nBrett Israel 404-385-1933 brett.israel@comm.gatech.edu\nEmail\nbrett.israel@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}