{"text": "Missing Links Brewed in Primordial Puddles? | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMissing Links Brewed in Primordial Puddles?\nResearchers have created nucleotides very similar to those in RNA in surprisingly simple laboratory reactions in water, under everyday conditions. They have produced what could be good candidates for missing links on the pathway to the code of life.\nFacebook\nTwitter\nEmail\nNearly twins and possibly keys to a unlocking the mystery of the evolution of life-coding molecules. Nicholas Hud holds up Uracil, on the right, a nucleobase of RNA. Barbituric acid, on the left, looks very much like it and could have been part of a proto-RNA that preceded RNA.\nApr 25, 2016\n— Atlanta, GA\nThe crucibles that bore out early building blocks of life may have been, in many cases, modest puddles. Now,\nresearchers working with that hypothesis\nhave achieved a significant advancement toward unlocking a longstanding evolutionary mystery -- how components of RNA and DNA formed from chemicals present on early Earth before life existed. It could also have implications on how astrobiologists view the probability of life elsewhere in the universe. In surprisingly simple laboratory reactions in water, under everyday conditions, they have produced what could be good candidates for missing links on the pathway to the code of life. And when those components joined up, the result even looked like RNA. As the researchers’ work progresses, it could reveal that much of the original chemistry that led to life arose not in fiery cataclysms and in scarce quantities, but abundantly and gradually on quiet, rain-swept dirt flats or lakeshore rocks lapped by waves. The research from the\nNSF/NASA Center for Chemical Evolution , headquartered at the Georgia Institute of Technology, is generously funded through a grant from the National Science Foundation and NASA. The recent results\nwere published on April 25, 2016 in\nNature Communications.\nPursuing the origins specifically of RNA, the close chemical relative of DNA, a research team led by Nicholas Hud, a professor in the  School of Chemistry and Biochemistry  at the Georgia Institute of Technology and director of the CCE, worked with a pair of potential chemical ancestors of the nucleobases of RNA. For roughly half a century, scientists have hypothesized that life, which uses DNA to store genetic information, was preceded by life forms that used RNA very broadly. And RNA may have had a precursor,\nproto- RNA, with different but similar nucleotides (the “N” in RNA). “Early Earth was a messy laboratory where probably many molecules like those needed for life were produced. Some survived and prospered, while others eventually vanished,” Hud said. “That goes for the ancestors of RNA, too.” Using two molecules known as barbituric acid and melamine, the researchers formed proto-nucleotides so strongly resembling two of RNA’s nucleotides that it is tempting to speculate that they are indeed their ancestors. The two ingredients would have been readily abundant for reactions on a prebiotic Earth, Hud said.  “And they would have been well suited for primitive information coding,” he added. Because of the resemblances and properties, some scientists already have speculated on an ancestral role for melamine and barbituric acid. But the CCE scientists are careful not to jump to that conclusion just yet. “To claim ancestry, we would have to show a mechanism by which these nucleotides we made in the lab could turn into the existing nucleotides in RNA,” said Ram Krishnamurthy, Hud’s collaborator from\nthe Scripps Research Institute in La Jolla, California .  “It’s a complex path that we’d have to at least design on paper, and we’re not there.” Nonetheless, he’s exited about the results. “There are umpteen possibilities of how that mechanism could have happened. Barbituric acid and melamine may have been place holders that dropped out and allowed adenine and uracil to come together with ribose.” Figuring out how adenine and uracil (nucleobases found in RNA today) combined with the sugar ribose (corresponding to the “R” in RNA) could answer one of the great questions of chemical evolution. The formation of nucleotides from possible proto-nucleobases and ribose marks a significant advancement in research on the origin of life. Nucleobases have been combined with other sugars in past studies, but the efficiency of the reactions discovered in this study is much greater than those of that past. “We’re getting close to molecules that look the way life may have looked in early stages,” Krishnamurthy said. A series of surprises added to the reactions’ scientific significance. First, they occurred quickly and the resulting nucleotides spontaneously paired with each other in water, forming hydrogen bonds like the Watson-Crick base pairs that create the “ladder-rung” pattern inside RNA and DNA helixes. Then the monomers formed long, supramolecular assemblages that look like strands of RNA when viewed with a high resolution microscope. There has been no reported chemical reaction so far that has produced existing components of RNA under commonplace circumstances that spontaneously form Crick-Watson pairs in water. And up until now, there had also been no report of a similar pair of nucleotides, like those produced with barbituric acid and melamine, behaving in a like manner, making this another first. “It works even better then we thought,” Hud said. “It’s almost too easy.” There was one small caveat. “The reaction does not work as well if barbituric acid and melamine are present in the same solution before reacting with ribose because their strong attraction for each other can cause them to precipitate,” Hud said. So, the scientists completed the reaction involving barbituric acid separately from the one involving melamine. But that should not have proven prohibitive on prebiotic Earth. Barbituric acid and melamine nucleotides could have been formed in separate locations, even in the same pond. And they could have very well been plentiful. “These reactions are exceptionally productive, especially if you compare them to analogous reactions with existing RNA components, which do not produce any nucleotides under the same conditions,” Hud said. If melamine and barbituric acid formed their respective nucleotides (C-BMP for barbituric acid and MMP for melamine) in separate puddles on the early Earth, then rain could have easily washed the components together, where they would have rapidly assembled into what could have been a precursor to proto-RNA. “The question is: Can these self-assemblies make the transition into what makes up life today,” Krishnamurthy said. The researchers hope their work will help expand the scientific community’s approach to chemical evolution. “If you want to look at what brought about these properties of life you have to go back and consider all the other molecules that would have been present and see how they would have facilitated the molecules that are present in life today,” Krishnamurthy said. Their work also could serve as a basis for important practical applications, such as the creation of DNA or RNA-like polymers that could spawn production of advanced materials and therapeutic agents. The chemical reactions that produce the barbituric acid and melamine nucleotides don’t require the use of enzymes and extreme parameters like high heat and pressure. Reminiscent of click chemistry, they could contribute to safe, cost-effective and abundant industrial production. In addition to those already named, the paper’s authors include Brian J. Cafferty, David M. Fialho and Jaheda Khanam, all from Georgia Tech. This research was supported by the NSF Centers for Chemical Innovation Program and the NASA Astrobiology Program under the NSF/NASA Center for Chemical Evolution under grant number CHE-1004570. The content is solely the responsibility of the authors and does not necessarily represent the official views of the NSF or NASA. Research News Georgia Institute of Technology Media Relations Contacts:\nBen Brumfield ( ben.brumfield@comm.gatech.edu ) (404-385-1933) Writer:\nBen Brumfield\nAdditional Images\nContact\nBen Brumfield Research News (404) 385-1933\nEmail\nben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}