{"text": "Asymptomatic Spread Could Make the Covid-19 Pandemic Longer and Worse | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nAsymptomatic Spread Could Make the Covid-19 Pandemic Longer and Worse\nA new statistical study may help dispel lingering doubts about whether to be concerned that people without Covid-19 symptoms are spreading the disease.\nFacebook\nTwitter\nEmail\nChart shows the realized proportion of asymptomatic transmission of the coronavirus.\nJul 20, 2020\n— Atlanta, GA\nA new statistical study may help dispel lingering doubts about whether to be concerned that people without Covid-19 symptoms are spreading the disease. The asymptomatic spread of the coronavirus is likely both common and significant, authors of\na new study\nsaid.\n“For the bulk of possible scenarios that can exist, asymptomatic transmission matters in the spread of Covid-19. You have to make very extreme assumptions about the spread for asymptomatic transmission to be unimportant,” said\nJoshua Weitz , a Georgia Institute of Technology professor and the study’s co-principal investigator.\nHow strongly does asymptomatic spread contribute to the Covid-19 pandemic’s curve? The new study addressed the question with mathematical modeling and concluded that this depends on how asymptomatic spread affects what is called the generation interval for new infections.\nSimply put, the generation interval is how long it takes for a person infected today to infect the next person.\nKnowing where these intervals fall allows researchers to calculate a more accurate value for R0 (R naught), a number that indicates the pandemic’s inherent strength of contagion in the absence of measures like distancing or masks to push it down. R0 is used to project how long the pandemic can last, how high the infection curve can go, and how many people in total could get sick and die.\nFor more coverage of Georgia Tech’s response to the coronavirus pandemic, please visit our  Responding to Covid-19 page .\nBut unlike highly visible data such as new cases per day, hospitalizations, or death toll, asymptomatic spread moves in the shadows because those cases very often remain unrecorded. Documenting them would take large-scale virus and antibody testing and meticulous contact tracing.\nAssumption vs. calculation\nThat makes it challenging to accurately measure the real-time impact of asymptomatic spread. In light of this, the researchers calculated how a broad range of asymptomatic spread scenarios would affect the nature of the generation interval and the course of the pandemic.\nThey found that asymptomatic spread’s contributions can reduce or raise the R0 calculation dramatically. That would mean that if current assumptions about asymptomatic spread are significantly inaccurate, R0’s value and the resulting projections of the pandemic’s length and severity would be, too.\n“To get R0, we make an assumption about how generation intervals are distributed. Not accounting for asymptomatic generation intervals leads to biases in how big R0 is for Covid-19,” said Weitz, who is a professor in Georgia Tech’s\nSchool of Biological Sciences\nand founding director of the Quantitative Biosciences Graduate Program.\nThe team, led by Weitz and Jonathan Dushoff from McMaster University,\npublished their results\nin the June 2020 issue of the journal Epidemics. Sang Woo Park of Princeton University and Daniel Cornforth of Georgia Tech coauthored the study. The research was funded by the Simons Foundation, the Army Research Office, the National Institutes of Health, and the National Science Foundation.\nSpeed vs. strength\nThough the study was not about mitigations like distancing and masks, the authors, like public health officials, said both pushback on the virus’s innate strength of transmission. If a society can push the strength below 1 – one infected person infecting just one other person on average – the pandemic starts to fade away, a success a few countries have already achieved.\n“If a lot of transmission is going the asymptomatic route, masks are really going to work in our favor. We should be prioritizing mask-wearing as a public health intervention irrespective of symptoms,” Weitz said.\nThere are important differences between the speed of contagion – how steeply the curve is climbing – and the strength – how sustained contagion is over time and how high the curve will peak. Speed is highly visible, strength much less so.\nBarring measures to slow it, the innate speed of a pandemic is seen by how quickly the number of new cases per day doubles – for example, every four days. But the strength of contagion is partly hidden in the yet-obscured frequency of asymptomatic contagion.\nAdding to that stealth, the speed of spread on the upside of the curve looks exactly the same for many strengths, i.e. R0 values.\n“That is the tricky thing. The difference comes in the long term, and it is big,” Dushoff said. “Right now, we are judging the spread by its speed, but what can make the big difference in the peak and the duration of the pandemic is the strength of the spread.”\nShort vs. long\nA short generation interval can make for a shorter pandemic with a lower peak, and a long interval would expand both. Two polar opposite scenarios illustrate how this works. For the sake of the exercise, let’s assume we know the real value of Covid-19’s generation intervals during a pandemic where case counts double about every four days and symptomatic persons can spread the virus for six days on average.\nLet’s say, hypothetically, that people transmitting the virus asymptomatically, on average, either:\nCan spread the coronavirus for only three days – a short generation interval, half the duration of symptomatic cases.\nOr, alternatively, spread the virus for 12 days – a long generation interval, twice the duration of symptomatic cases.\nTo maintain the speed of spread, in the first scenario, the virus is having to pass to more people more quickly, and herd immunity – when enough people have immunity to stop the spread – is reached sooner. The R0 is lower; the curve peaks and begins its decline sooner, and that reduces the total number of illnesses and deaths.\n“If the generation interval is long, that means it takes fewer infected people to maintain the same speed of contagion and that the spread is stronger, more sustained,” Weitz said. “If asymptomatic people are staying infected longer than we have thought and are infecting more people in the course of their infection than thought, then we are currently underestimating R0.”\nIf so, just when we think we have reached the peak, Covid-19’s climb would keep going, lengthening the pandemic and increasing the number of severe and deadly cases.\nThese researchers coauthored the study: The research was funded by the Simons Foundation (SCOPE Award 329108), the Army Research Office (grant W911NF1910384), the National Institutes of Health (1R01AI46592-01), and the National Science Foundation (grants 1806606 and 1829636). Any findings, conclusions, or recommendations are those of the authors and not necessarily of the sponsors.\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : John Toon (404-894-6986) (jtoon@gatech.edu)\nWriter:\nBen Brumfield\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}