{"text": "Georgia Manufacturing Extension Partnership recruiting companies to participate in new energy management improvement program | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Manufacturing Extension Partnership recruiting companies to participate in new energy management improvement program\nFederal award supports targeted focus on energy management system implementation and improvements for manufacturers in six southern states.\nFacebook\nTwitter\nEmail\nRandy Green, GaMEP project manager in the Energy and Sustainability Group, performs an energy audit with one of his clients in Emanuel County in Georgia.\nDec 13, 2018\n— Atlanta, GA\nThe Georgia Manufacturing Extension Partnership (GaMEP) at Georgia Tech has launched a new program to help manufacturers boost their competitiveness by implementing energy management best practices in ISO 50001.\nA 12-month effort, the Southeast MEP Energy Management Program is being funded with a grant from the U.S. Department of Commerce’s National Institute of Standards and Technology (NIST) Manufacturing Extension Partnership (MEP).\n“The program aims to help companies in the Southeast accelerate their energy and cost savings and reduce greenhouse gas emissions by incorporating best practices as outlined by ISO 50001,” said Bill Meffert, the GaMEP’s group manager for energy and sustainability projects.\nThe ISO 50001 Energy Management System — an international standard in which the GaMEP had a role in developing when first drafted in 2011 and its 2018 revisions — provides business and industry with an energy performance improvement framework.\n“That’s the focus of the ISO 50001 training and coaching. We’re assisting companies in their efforts to bring energy costs under control and make smart energy usage part of their daily processes,” Meffert said.\nParticipants in the Southeast MEP Energy Management Program will take a series of classes and webinar sessions, and receive on-site coaching over a 12-month period. Completing the program allows them to be certified by the U.S. Department of Energy as 50001 Ready by showing they’ve implemented the standard into their operations. They can also take an additional step to become certified, Meffert said.\nThe class for the first cohort launches in early 2019 and applications are being accepted at this link :  https://gamep.org/southeast-energy-management-program/ .\nThe federal grant covers most of the cost for the training, but participating companies will pay about 25 percent of that. As part of the grant, the GaMEP will partner with MEPs in Tennessee, North Carolina, South Carolina, Alabama, and Texas. Those sister MEPs will find clients in those states to work with them to implement the ISO 50001 management system.\n“For many companies, energy use is a critical component of their ability to maintain a competitive edge,” Meffert said.\nA medium- to large-sized company with 250 employees or more could spend more than $1 million a year on energy, including electricity, natural gas, fuel, and water.\n“What we see with the companies that we’ve worked with to adopt the ISO standard in the past is that they achieve energy performance improvements that go beyond the typical approaches,” he said. “Roughly 70 percent of the savings achieved are through operational controls and behavior change.”\nSince the ISO standard’s adoption in 2011, the GaMEP has helped more than 70 facilities in North America to implement ISO 50001, with most becoming certified, including nine in the Southeast.\n“This energy management system is applicable to a whole host of industries from textiles and floor coverings to food and beverage to automotive manufacturing,” Meffert said. “One of the reasons we sought to get more companies in the Southeast to adopt this energy standard is because we have such a strong manufacturing presence in all of these sectors.\n“Incorporating these standards and changing processes for energy usage can really make a difference to the bottom line, while also helping companies meet their competitiveness and sustainability objectives,” Meffert said.\nAbout the Georgia Manufacturing Extension Partnership (GaMEP)\nThe Georgia Manufacturing Extension Partnership (GaMEP) is an economic development program of the Enterprise Innovation Institute at the Georgia Institute of Technology. The GaMEP is a member of the National MEP network supported by the National Institute of Standards and Technology. With offices in 10 regions across the state, the GaMEP has been serving Georgia manufacturers since 1960. It offers a solution-based approach to manufacturers through coaching and education designed to increase top-line growth and reduce bottom-line cost.\nAdditional Images\nRelated links\nGeorgia Manufacturing Extension Partnership\nContact\nFor media inquiries, contact:\nPéralte C. Paul\n404.316.1210\nperalte.paul@comm.gatech.edu\nFor information about GaMEP, contact:\nCaley Landau\n404.385.0630\ncaley.landau@innovate.gatech.edu\nEmail\nperalte.paul@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}