{"text": "Laser-Based System Could Expand Space-to-Ground Communication | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nLaser-Based System Could Expand Space-to-Ground Communication\nResearchers collaborate with satellite communications company on laser-based system.\nFacebook\nTwitter\nEmail\nGeorgia Tech aerospace engineering graduate student Byron Davis shows Xenesis CEO Mark LaPenna one of the RANGE CubeSats scheduled to go into orbit later this fall. (Credit: Allison Carter, Georgia Tech)\nJun 25, 2018\n— Atlanta, GA\nA new research project announced recently as a collaboration between the Georgia Institute of Technology and satellite communications provider Xenesis could help open the bottleneck that now limits the flow of data from Earth-orbiting satellites to ground stations.\nThe project will miniaturize, space qualify and test a laser communications transceiver that could dramatically expand the bandwidth available for downlinking information from the growing number of satellites – and future constellations of space vehicles – in low Earth orbit. Xenesis has licensed the technology from NASA’s Jet Propulsion Laboratory (JPL), and will work with Georgia Tech and JPL to mature it for use as a primary communication system for satellites as small as CubeSats.\n“We expect to significantly add to the total bandwidth of information that we can get down from space, and the more bandwidth we have, the more information we can exchange and the more value we can get from satellite networks,” said\nBrian Gunter , an assistant professor in Georgia Tech’s\nDaniel Guggenheim School of Aerospace Engineering\nwho will be leading the project.\nGunter’s lab has experience with small satellites, and will apply that expertise to the project with Xenesis – which signed a $1.2 million contract on June 14 to support the work. Georgia Tech’s contribution will be to miniaturize the original JPL technology, update the control software, space qualify all the hardware and test the improved system from space – likely from the International Space Station.\n“With all of the satellites that are going into space, everything from CubeSats to major satellites, there is more information being generated than can ever be downloaded,” said Dennis Poulos, chief technology officer at Xenesis. “Most of today’s systems depend on radio frequency downlinks, and there is just a limited amount of bandwidth available for use.”\nLaser-based systems can expand that bandwidth to beyond 10 gigabits per second, Poulos said. In addition to boosting bandwidth, optical systems can use smaller antennas, use power more efficiently, and provide better data security.\nMark LaPenna, CEO of Xenesis, compared the benefits of the planned space-based network to the jump in performance from terrestrial dial-up connections of the 1990s to today’s high-speed broadband services.\n\"Xenesis recognizes the need for a global communications revolution, and we plan to empower space with an optical product called XenHub,” LaPenna said. “Through this architecture, any company, mission or global operator on the ground or in space, will be able to compete on a level playing field for the first time since Sputnik.\"\nThe laser communications transceiver developed by JPL consists of two components: (1) an optics module that includes a five-centimeter telescope, two-axis gimbal, monitoring sensors and thermal control system, and (2) an electronics module with a transmitter, processor, controllers and power conditioning systems.\nThough it is subject to interference from clouds, the laser system will benefit from producing a narrow beam that can travel farther than comparable radio-frequency transmissions at the same power level.\nThe initial focus will be space-to-ground communication, though the system could also be used for cross-linking communication between satellites. The small antenna size is also more suitable to the small-form satellites envisioned for future constellations that may include thousands of spacecraft.\n“Once we can show that this works from space to ground, that will demonstrate that the technology can survive the harsh environment of space, and allow us continue the development of the transceiver for commercial use,” Gunter added. “This has the potential to open up a range of new capabilities, including the ability to provide high-volume data services to anywhere in the world.”\nIn Georgia Tech’s School of Aerospace Engineering, the contract will support three or four graduate students, a postdoctoral researcher, and a group of undergraduate students, Gunter said. “This will be a major satellite project for our lab, and we look forward to advancing the technology with our collaborators.”\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : John Toon (404-894-6986) (jtoon@gatech.edu).\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}