{"text": "Tiny Bottles and Melting Corks: Temperature Regulates a New Delivery System for Drugs and Fragrances | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nTiny Bottles and Melting Corks: Temperature Regulates a New Delivery System for Drugs and Fragrances\nResearch have made microscopic, bottle-like structures with corks that melt at precisely-controlled temperatures, which could potentially release drugs inside the body.\nFacebook\nTwitter\nEmail\nYounan Xia (left) and post-doctoral fellow Dong Choon Hyun, who is holding a sample containing the microscale polymer bottles. (Credit: Rob Felt)\nSep 18, 2013\n— Atlanta, GA\nMicroscopic, bottle-like structures with corks that melt at precisely-controlled temperatures could potentially release drugs inside the body or fragrances onto the skin, according to a recently published study. Typical drug delivery systems act more like sponges than bottles. For example, drugs are absorbed into polymer particles and then allowed to diffuse out over time. The researchers hope that the new system may allow for greater control of drug delivery. Cargo would stay inside the hollow polymer particle when plugged with a solid cork. When the cork is melted by body heat, the drugs would quickly flow out of the particle bottle. “It’s just like when you open wine, you remove the cork,” said Younan Xia, a professor in the Wallace H. Coulter Department of Biomedical Engineering at Georgia Tech and Emory University. Xia also holds joint appointments in School of Chemistry and Biochemistry and the School of Chemical and Biomolecular Engineering at Georgia Tech. The melting corks are made of fatty acids, derived from natural oils and fats. The length of the hydrocarbon chains on these molecules can be made longer or shorter to increase or decrease, respectively, the temperature at which they melt. This way, the fragrances in deodorants, for example, would be released only when a person gets hot and sweaty. The new system for temperature-regulated release was detailed in a recent online edition of the journal\nAngewandte Chemie International Edition . The research was sponsored by the National Cancer Institute, a National Institutes of Health Director’s Pioneer Award, and startup funds from Georgia Tech. Funds were also provided by the Korea Science and Engineering Foundation (KOSEF) and the Korean Ministry of Education and Science. Drug delivery systems have also been designed to release their cargoes in response to pH change, ultrasound, mechanical signals and electric or magnetic fields. Xia’s system is the first bottle-and-cork design, but it isn’t the first to release drugs in response to temperature. His system, however, has several advantages over other temperature-regulated delivery systems, such as quick and efficient loading of small molecules, macromolecules and even nanoparticles up to 100 nanometers in size. Other temperature-based systems can release their cargoes early. In Xia’s system, the contents are bottled up until the body hits the desired temperature and then they are quickly released. “It’s like bottled water,” Xia said. “When you are thirsty, you can just drink it.” The melting corks are made from a group of phase-changing materials — fatty acids or fatty alcohols — that change from solid to liquid when heated to specific melting points. As a proof of principle for the temperature-sensitive delivery system works, in the new study Xia’s lab loaded fluorescent dye into the hollow polymer particles. The holes were then corked with solid 1-tetradecanol, a fatty alcohol. After washing away any dye that might be stuck to the outer surfaces of the bottles, a fluorescent micrograph showed that all of the dye was completely bottled up. The bottles were then heated to 25 and 37 degrees Celsius — just below the corks’ melting point — but no dye escaped, even after 4 days and vigorous washing in a buffer solution. This performance is better than other delivery systems, Xia said, which typically release some of the drug prematurely. When bottles were heated to 39 degrees Celsius, the melting point of 1-tetradecanol, the corks melted and the dye was instantly released. “You can bottle everything and then you put a stopper on top. Whenever you need it, just unplug it and things will come out quickly,” said Xia, who is a Georgia Research Alliance Eminent Scholar in Nanomedicine. The corks tested in the study are expected to pose no harm once inside or on the human body. 1-tetradecanol and lauric acid, a fatty acid that has also been test as a cork, have very low toxicity in small doses, Xia said, because they are derived from natural fats and oils. These same fats are often used as ingredients for food and pharmaceuticals. Xia said that hydrophobic drugs, such as the majority of anticancer treatments, could be easily loaded into the hollow particles for delivery inside the body. Future studies will examine this possibility in more detail in animal models. Hydrophilic drugs could also be delivered with this system, but the surface of the bottle would need to be modified. The hollow polymer particles in Xia’s study were made of polystyrene, which couldn’t be injected safely into the body to deliver drugs, but would work in a scented body cream for applying to the skin. Xia’s lab is currently working on making these microscale particle bottles out of polymers that are approved by the U.S. Food and Drug Administration, such as polycarprolactone, so they can bring translational capability to this system. “No companies are making anything like this yet,” Xia said. Dong Choon Hyun, a post-doctoral fellow at Georgia Tech, was the lead author of the study. Unyong Jeong, a materials science & engineering professor at Yonsei University in Korea, was a collaborator on the project. This research is supported by the National Cancer Institute under award R01CA138527, the National Institutes of Health Director’s Pioneer Award (DP1OD000798), and startup funds from Georgia Tech. The research was also sponsored by KOSEF (008-05103) and a World Class University grant from NRF of the Korean Ministry of Education and Science (R32-20031). Any conclusions or opinions are those of the authors and do not necessarily represent the official views of the sponsoring agencies. CITATION : D.C. Hyun, et al., “Microscale Polymer Bottles Corked with a Phase-Change Material for Temperature-Controlled Release,” (Angewandte Chemie International Edition, 2013). dx.doi.org/10.1002/anie.201305006 Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contacts : Brett Israel (404-385-1933) ( brett.israel@comm.gatech.edu ) or John Toon (404-894-6986) ( jtoon@gatech.edu ) Writer : Brett Israel\nAdditional Images\nContact\nBrett Israel 404-385-1933 brett.israel@comm.gatech.edu\nEmail\nbrett.israel@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}