{"text": "Coweta County native discovers his calling in manufacturing | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nCoweta County native discovers his calling in manufacturing\nSteven Shaw considers himself lucky to have discovered early a true passion for a career in manufacturing.\nFacebook\nTwitter\nEmail\nSteven Shaw of Coweta County is a tooling and design engineer at GT Virtual Concepts (GTVC), a Newnan-based machine shop.\nFeb 18, 2015\n— Newnan, GA\nAsk many 8-year-old boys and girls what they want, and they’re likely to say a bike or toy or electronic games. Steven Shaw wanted a lathe, a machine used to shape wood or metal. It’s not surprising for the Coweta County native and senior at Southern Polytechnic State University. He’s always liked figuring out the mechanics of how things work, ever since he and his big brother worked alongside their dad to help him restore his nine classic cars. “I wanted to know how the engines worked, to take them apart and rebuild them,” Shaw said as he\nshared his story\nof how he came to find his calling in manufacturing. It’s a passion this self-described “gearhead” discovered in high school.  The\nGeorgia Manufacturing Extension Partnership\n(GaMEP) is naming Shaw its February\nFace of Manufacturing . The campaign is designed to honor the often unsung heroes of the industry, 365,000 people strong who work to manufacture products that support the Georgia economy. “Everyone’s journey into manufacturing is different,” said GaMEP Director Karen J. Fite. “Steven found his calling early on and is a great example for today’s generation that the typical beliefs that come to mind when thinking about manufacturing no longer hold true.” Shaw, 22, says discovering his interests early on, and having teachers and mentors to guide him along the way, helped too. As a high school student, he discovered the Central Educational Center (CEC) — a partnership of the Coweta County Schools, West Central Technical College, and local business and industry — during a career fair. “I’m lucky. I was afforded the opportunity to discover what I loved to do at an early age.” He says manufacturing is more than he could have dreamed, explaining there are so many opportunities in 3D design, research and development, and other disciplines. It also allows him to be creative and innovative. In fact, being creative is key to a career in manufacturing, something he discovered as an apprentice three years ago at GT Virtual Concepts (GTVC), a Newnan-based machine shop. Now a tooling and design engineer at GTVC, he sets up the machines, works on programing the software, and anticipates potential glitches that could lead to production issues. “You have to be willing to problem solve and be creative,” he said. As he has grown, so has GTVC, a company founded in 2002 by Golda and Aaron Noble. It is one of 93 manufacturers in Coweta County and one of 950 machine shops in Georgia. By Péralte C. Paul\nAdditional Images\nRelated links\nFaces of Manufacturing\nContact\nFor media inquiries contact: Laura Diamond Georgia Tech Media Relations  laura.diamond@gatech.edu For more information about GaMEP contact: Katie Takacs GaMEP Marketing Manager katie.takacs@innovate.gatech.edu\nEmail\nlaura.diamond@gatech.edu\nAdditional information\nAbout the Faces of Manufacturing Each month, GaMEP, a unit of Georgia Institute of Technology’s Enterprise Innovation Institute, profiles one of the 365,000 Georgians who is involved in manufacturing for the Faces of Manufacturing campaign. Those chosen as the Face of Manufacturing will be selected by a 12-member committee comprised of representatives from Georgia Tech, economic development groups, manufacturing companies, and related associations.\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}