{"text": "Steven McLaughlin Starts as Georgia Tech’s New Provost | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nSteven McLaughlin Starts as Georgia Tech’s New Provost\nOctober 1 marks Steven W. McLaughlin’s first day as Georgia Tech’s new provost and executive vice president for Academic Affairs.\nFacebook\nTwitter\nEmail\nSteven W. McLaughlin\nOct 01, 2020\n— Atlanta, GA\nOctober 1 marks Steven W. McLaughlin’s first day as Georgia Tech’s new provost and executive vice president for Academic Affairs. In his initial days and weeks in this new role, McLaughlin will spend time with students, faculty, and staff across campus in listening sessions, small group meetings, and one-on-one consultations.\n“It’s a dream come true to step into this role at a place I truly love. I have had the great pleasure of serving as a member of the faculty and as an administrator in a number of roles, and all of them have given me a chance to learn a different side of Tech,” said McLaughlin. “I look forward to hearing from my colleagues as we start the next chapter together.”\nMcLaughlin has served Tech for 25 years, most recently as the dean and Southern Company Chair in the College of Engineering. Prior roles include the Steve Chaddick School Chair in the School of Electrical and Computer Engineering (2012-17), and the vice provost for International Initiatives and Steven A. Denning Chair in Global Engagement (2007-12).\nMcLaughlin’s service to Tech has included advocacy and leadership around issues of diversity, equity, and inclusion; student health and well-being; global engagement; and student entrepreneurship. Those passions were a natural fit as McLaughlin committed in early 2020 to serve as co-chair of the steering committee for the Institute’s forthcoming strategic plan, together with Dean Maryam Alavi of the Scheller College of Business.\nHe emphasizes that the Institute’s top priority is to deliver to students the highest quality educational and research experiences and that attracting, retaining, and supporting the very best and most diverse faculty and staff is essential to meeting that commitment to students. But McLaughlin recognizes that Georgia Tech is facing one of the most challenging periods in the university’s history.\n“We must continue to lead, serve, and produce what our city, state, nation, and world need.  With our forthcoming strategic plan, I believe no university is better positioned to face the challenges posed by the rapidly and ever-changing world around us,” said McLaughlin. “We must answer those challenges in a way that reflects our commitment not only to improve the human condition, but to address systemic and cultural changes in our Georgia Tech community.”\nMcLaughlin assumes the role following Rafael L. Bras, who stepped down after serving as provost for 10 years.\n“I am grateful for Dr. Bras’ guidance over the years, and I intend to build on his work to develop creative and compassionate leaders and solution seekers,” said McLaughlin. “My focus is, and will continue to be, on people and an equitable and inclusive environment that supports academic success and is a place where every student, faculty, and staff member can thrive,” said McLaughlin.\nMcLaughlin was named to the position after an extensive national search launched by Georgia Tech President Ángel Cabrera in early 2020 and co-chaired by Charles Isbell, dean and John P. Imlay Jr. Chair in the College of Computing, and Susan Lozier, dean and Betsy Middleton and John Clark Sutherland Chair in the College of Sciences.\n“I very much look forward to working with Steve to build on a solid foundation as we find new ways to deliver on our mission of Progress and Service,” said Cabrera. “I thank the members of the search committee led by Deans Lozier and Isbell for bringing us an outstanding and diverse pool of candidates. Steve’s deep appreciation for Georgia Tech and his passion for innovation, inclusion, and excellence make him just the right person to lead us into the next decade.”\nAdditional Images\nContact\nSusie Ivy\nDirector, Institute Research and Provost Communications\nEmail\nsusie.ivy@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}