{"text": "Chaouki Abdallah Comes Home to Lead Georgia Tech’s Research Enterprise | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nChaouki Abdallah Comes Home to Lead Georgia Tech’s Research Enterprise\nChaouki Abdallah brings a unique perspective as Georgia Tech's new executive vice president for research.\nFacebook\nTwitter\nEmail\nChaouki Abdallah is Georgia Tech's executive vice president for research. He's shown in the Marcus Nanotechnology Buildling. (Credit: Rob Felt, Georgia Tech)\nNov 01, 2018\n— Atlanta, GA\nChaouki Abdallah is a proud Yellow Jacket alumnus, parent of two Georgia Tech students and the newest member of the Institute’s executive leadership team. As Georgia Tech’s executive vice president for research, he has returned to what he considers home after nearly 30 years as a professor, chair, provost and president at the University of New Mexico (UNM) in Albuquerque.\nThe holder of Georgia Tech master’s and Ph.D. degrees in electrical engineering, parent of twin Georgia Tech first-year students Carter and Calvin, and the spouse of a Georgia Tech industrial engineering graduate who started a successful logistics company, Abdallah has a unique perspective on the institution that ranks 8th among public universities in the latest\nU.S. News & World Report\nsurvey.\n“When I was here as a student, Georgia Tech was a good university. It has now become great, world-class – probably because I left,” he joked. “I feel indebted to Georgia Tech. In everything I have done, I can point to my education from Georgia Tech. I’m honored to come back to campus in this capacity.”\nAfter proposing to her on the Skiles Walkway, Abdallah married Catherine Cooper, who earned her bachelor’s degree in industrial and systems engineering. “Every time I walk there, it brings back good memories,” he said.\nA Top Research and Education Institution\nHis sons, his service on the School of Electrical and Computer Engineering advisory board and roles as UNM provost and president give Abdallah a special view of how education and research fit together at a top research university like Georgia Tech.\n“For a long time, we thought that undergraduate and graduate education were two different things,” he said. “It’s actually a continuum. We have undergraduates doing great research here and a lot of research embedded in undergraduate education. Being a top research institution really complements our educational activities.”\nThe skills essential to academic success are also among those essential to research, he notes. Researchers work in interdisciplinary teams to find answers to challenging questions, just as students labor on team projects. Researchers communicate persuasively to convince colleagues to join their projects and funding agencies to provide them support, just as students make presentations, write term papers and take exams.The results of education and research are final products: a journal paper, a new technology, a new product, a new company or a diploma.\n“Research allows us to make the undergraduate and graduate experiences better,” he said. “It helps get students to the point that they are contributing to the development of knowledge, rather than just being its passive consumers.”\nResearch also satisfies a human need to find the answers to questions. Often, those answers ultimately make someone’s life better and society more prosperous, Abdallah noted. “We are in the business of education, and education doesn’t simply mean classroom teaching. It involves teaching and research, which produce critical skills that are essential to everything we do in a modern society.”\nPlanting Basic Research for Future Generations\nThrough efforts such as the Advanced Technology Development Center incubator and the CREATE-X student entrepreneurship initiative, Georgia Tech has become known for transferring new knowledge into the marketplace. Before that can happen, however, there must be an investment in basic research to provide the seeds for applied research and technology transfer. That basic research often does not have a specific commercialization goal, and its end uses may surprise the scientists who pursue it.\n“Google was begun at Stanford by two graduate students doing research on digital libraries with a National Science Foundation grant,” Abdallah pointed out. “Nobody at the time planned Google and all it has become.”\nGrowing up in Lebanon as part of a large family, Abdallah watched his grandfather plant olive trees near century-old trees that were still producing bountiful crops. When he asked why new trees should be planted while the old ones were still producing, his grandfather explained: “Somebody planted those trees for you. You need to plant for future generations.”\nBasic research, Abdallah said, is planting for the next generation. Though it may not lead to predictable outcomes, planting basic research is an essential part of Georgia Tech’s innovation pipeline. “We are enjoying the fruits of basic research done by those who came before us,” he added.\nAbdallah cites the 1939 essay “The Usefulness of Useless Knowledge,” written by higher education reformer Abraham Flexner, for some examples of how curiosity-driven basic research – magnetism and electricity, for instance – has led to important practical applications, including the wireless communication that is so essential today.\nThe University’s Role in Society\nBy educating tomorrow’s leaders and innovators, universities are also helping ensure the future prosperity of their cities, states, nations – and the world. Georgia Tech is making a strong contribution, as a brief visit to Georgia Tech’s Technology Square will attest.\n“Universities are the engines of economic development,” Abdallah noted. “It’s great to have Tech Square and all the companies growing there, because they are employing people, paying taxes and creating activity that feeds back into the economy to the benefit of our institution and the state that supports it. It is also giving our students real work experiences and offering opportunities for careers in innovative companies.”\nAt the University of New Mexico, he served on the board of the university’s commercialization organization and watched that institution’s $300 million research program spin off companies. He is familiar with startups, having helped launch two companies during his time in New Mexico.\n“The first one was in the area of image watermarking during the dot-com era,” Abdallah recalled. “It got first-round and second-round funding, but it didn’t make it.”\nHis second company, which develops analytics for universities to use in targeting resources, is “thriving,” he said. He’s still involved in the firm, which received funding from educational foundations but never took venture capital financing.\nThe Future of University Research\nSeeing down the road is important for making sound decisions regarding Georgia Tech’s research program. Abdallah is careful not to predict the future, but does see trends that the Georgia Tech research enterprise is already beginning to address.\nAmong them is an increasingly interdisciplinary approach to solving real problems. Instead of pursuing narrow disciplines, researchers are tackling grand challenges by involving expertise from multiple areas. The success of Georgia Tech’s interdisciplinary research institutes shows the value of that approach, he said.\n“When I graduated with my Ph.D., we were focused on acquiring tools in specific areas,” he said. “Then the problems we were attacking became broader and more interdisciplinary in the sense that they could not be solved by an electrical engineer alone. Solutions required people from other engineering disciplines and computing, but also from public policy and the humanities. We’ve quickly moved from tools and disciplines to being more problem-focused.”\nAbdallah sees a need for policy issues and ethical concerns to catch up with technology, and for the connection between people and technology to play a larger role in the future. “I think the problems we need to address today are so massive that we need to have all hands on deck.”\nEthics and Legality in Academia\nThe new executive vice president is aware that Georgia Tech has faced some challenges on the ethics front, and he makes ethics reminders part of every talk he gives around campus.\n“Being legal is just the floor,” he explained. “Many activities that are legal we should not do for other reasons. Beyond being legal, there are levels of expected behavior and practices that we must adhere to. By doing so, that benefits us, the people we work with and, ultimately, the Institute.”\nHe believes that transparency is the key to encouraging ethical behavior on the part of faculty, administrators, staff and students.\n“We want to be open with our practices, the way we do things,” he explained. “Invariably, somebody is going to stumble and make a mistake or intentionally do something that is not right. We want people to see these instances as bad things that happen to a good organization. We want to be known as a good and ethical organization so that when something does go wrong, it will not be seen as representing what the organization is all about.”\nGeorgia Tech must be a good steward of the resources entrusted to it to earn the continued support of taxpayers, parents, research sponsors and others. “That’s something that will make the Institute better and benefit us in both the long term and short term.”\nLeadership Style and First-Year Plans\nAbdallah considers himself a servant leader whose job is to help others in the research organization understand the challenges and opportunities that face them, and to help remove roadblocks to the success of both the individuals and the institution. His experience as a systems engineer leads him to a specific approach to challenges.\n“I’m very open to criticism and feedback. I’ll listen to all concerns but will follow processes and structures to make decisions as fairly as possible,” he said. “I don’t have a specific plan for the research enterprise yet, but I do have a specific way of doing things, which is to ask questions, listen and look for outside perspectives. I take the time to acquire the broadest knowledge, but will act swiftly once I become confident in my information.”\nMost research universities face challenges that are similar to those faced by Georgia Tech, though they are shaped by local conditions and the institution’s history and culture.\n“You always think that your problem is unique, but it’s not,” he said. “There are unique circumstances and a certain culture in every place. Everybody in higher education is dealing with complex issues today, and probably 90 percent of them share something in common.”\nIn the weeks since he moved into the Carnegie Building in early September, Abdallah has met with hundreds of people, visited with groups from all across campus and accepted meetings with nearly everyone who could be accommodated on his calendar.\n“People look to the new person for answers,” he admitted. “I think what I can do best is ask the right questions. People have many good ideas, and some of them may be exactly what the institution needs. I’m still in the listening mode and do not believe in applying stock solutions to seemingly similar situations.”\nHe plans to spend his first 100 days listening and learning before charting a course to move Georgia Tech’s research program to the next level.\nPaging Dr. Bunsen Honeydew and Beaker\nWhile he takes his job quite seriously, Abdallah tries not to take himself too seriously. He is already known around campus for his self-deprecating humor, and he says his family keeps him grounded.\n“My wife and kids are always making fun of me,” he admitted. “You have to take yourself down a little bit. The work I do is important, of course, but there’s probably somebody else who could do it. I often remind myself that I am very lucky to be doing what I do today, being married to an amazing person, and to be the parent of two healthy children.”\nAnd if that’s not enough to demonstrate his humble nature, just ask him about his taste in movies.\n“I love to watch animated movies, especially Disney movies,” he said. “When I’m not working or reading something serious, I like to watch The Incredibles, Shrek or the Muppets. It’s my way to recharge, but my kids think it’s funny that dad is often watching the movies I used to watch with them when they were little. One of my favorite movies is\nThe Muppets Take Manhattan .”\nDr. Bunsen Honeydew and his long-suffering lab assistant Beaker would certainly approve of that choice.\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : John Toon (404-894-6986) (jtoon@gatech.edu).\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}