{"text": "Researchers Determine Routes of Respiratory Infectious Disease Transmission on Aircraft | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nResearchers Determine Routes of Respiratory Infectious Disease Transmission on Aircraft\nResearchers have studied how passengers move about on aircraft to evaluate potential transmission of respiratory infections.\nFacebook\nTwitter\nEmail\nThis chart shows the number of passenger contacts by row, for aisle, middle, and window seats for a flight studied by the researchers.\nMar 19, 2018\n— Atlanta, GA\nA recent study conducted by researchers from Emory University and the Georgia Institute of Technology found that an infectious passenger with influenza or other droplet-transmitted respiratory infection will most likely not transmit infection to passengers seated farther away than two seats laterally and one row in front or back on an aircraft. The study was designed to assess rates and routes of possible infectious disease transmission during flights.\nCo-researchers Vicki Hertzberg, Ph.D., professor at Emory University's Nell Hodgson Woodruff School of Nursing and Howard Weiss, Ph.D., professor in the School of Mathematics at the Georgia Institute of Technology, led tracking efforts in their FlyHealthy(TM) study, developing a model that combines estimated infectivity and patterns of contact among aircraft passengers and crew members to determine likelihood of infection.\nFlyHealthyTM team members were assigned to monitor specific areas of the passenger cabin, and made five round trips from the East to West Coast recording movements of passengers and crew. In addition, they collected air samples and obtained surface samples from areas most likely to harbor microbes. They leveraged the movement data to create thousands of simulated flight scenarios and possibilities for direct exposure to droplet-transmitted respiratory diseases.\n“Respiratory diseases are often spread within populations through close contact,” explained Hertzberg. “We wanted to determine the number and duration of social contacts between passengers and crew, but we could not use our regular tracking technology on an aircraft. With our trained observers, we were able to observe where and when contacts occurred on flights. This allows us to model how direct transmission might occur.”\n“We now know a lot about how passengers move around on flights. For instance, around 40 percent of passengers never leave their seats, another 40 percent get up once during the flight, and 20 percent get up two or more times. Proximity to the aisle was also associated with movement. About 80 percent of passengers in aisle seats got up during flights, in comparison to 60 percent of passengers in middle seats and 40 percent in window seats. Passengers who leave their seats are up for an average of five minutes.”\nResearchers also noted fomite transmission – exposure to viruses that remain on certain surfaces such as tray tables, seat belts and lavatory handles – as additional likely contributors to disease transmission. They provide public health recommendations to help prevent the spread of infectious disease.\n“We found that direct disease transmission outside of the one-meter area of an infected passenger is unlikely,” explained Weiss. Respiratory infections can also be transmitted indirectly through contact with an infected surface. This could happen if a sick passenger coughs into their hand, and later touches a lavatory surface or overhead bin handle. “Passengers and flight crews can eliminate this risk of indirect transmission by exercising hand hygiene and keeping their hands away from their nose and eyes.”\nThe study, which was funded in partnership with aerospace leader Boeing, evaluated only the potential spread of infectious agents on an aircraft. Transmission could also occur at other points in a passenger’s journey, underscoring the need to maintain healthy habits, he added.\nComplete findings of the study are available in the journal\nProceedings of the National Academy of Sciences .\nExternal News:  this article was featured in many national news stories, including\nThe Washington Post\nThe NY Times\nMashable\nPopular Science\nAP - Associated Press\nThe Smithsonian\nTODAY Online\nEl Pais (Spanish)\nCITATION : Vicki Stover Hertzberg and Howard Weiss (co-first authors), Lisa Elon, Wenpei Si, Sharon L. Norris, and The FlyHealthy Research Team, “Behaviors, movements, and transmission of droplet-mediated respiratory diseases during transcontinental airline flights,” (Proceedings of the National Academy of Sciences, 2018).  http://www.pnas.org/content/early/2018/03/13/1711611115\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contacts : Georgia Tech: John Toon (jtoon@gatech.edu) (404-894-6986) or Emory University: Melva Robertson: (melva.robertson@emory.edu) (404-416-0822) or Allison Caughey (allison.caughey@emory.edu) (404-727-1225).\nNote: This post originally appeared as a Georgia Tech News Center story by John Toon on Mar 19, 2018.\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}