{"text": "Getting Ready for Georgia's Runoff Election | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGetting Ready for Georgia's Runoff Election\nElection day, Nov. 3, is just around the corner. If you have not registered to vote, there’s still time.\nFacebook\nTwitter\nEmail\nVoting at McCamish Pavilion in October 2020\nDec 04, 2020\n— Atlanta, GA\nThe State of Georgia will host a runoff election Tuesday, Jan. 5, for the state’s two U.S. Senate seats. The results will determine which party will control the Senate for at least the next two years.\nIncumbent Sen. David Perdue (R) is seeking another six-year term against Jon Ossoff (D). For the other seat, incumbent Sen. Kelly Loeffler (R) is running to win the last two years of retired Sen. Johnny Isakson’s term, a seat to which she was appointed by Governor Brian Kemp in 2019. She’s facing off against Rev. Raphael Warnock (D).\nIf one or both Republicans win, the GOP will retain its Senate majority. If the two Democrats win and create a 50-50 split, Vice President-elect Kamala Harris would be able to break any tie votes in the chamber.\nRegistration\nIf you plan to vote in the runoff election, first, check that your voter registration is up to date. If you should be registered in Georgia, check your voter registration status\nhere . The registration deadline for the Jan. 5 runoff is Monday, Dec. 7.\nWho is eligible to vote? To register in Georgia, you must be:\nA U.S. citizen.\nA legal resident of Georgia and the county in which you plan to vote.\nAt least 17 ½ years of age to register and 18 years of age to vote.\nNot serving a sentence for conviction of a felony involving moral turpitude.\nNot found mentally incompetent by a judge, unless the disability has been removed.\nVoter registration is a county function, with counties issuing precinct cards after processing applications.\nTo\nregister online , you need a valid driver’s license or identification card issued by the Georgia Department of Driver Services with a signature on file. You also may register by mail. Download, print, sign, and mail the application to your county registrar\nhere .\nVoting Absentee\nTo vote by absentee ballot, the ballot must be postmarked by election day and delivered by 7 p.m. on Jan. 5. To request an absentee ballot, the information entered online must match your voter registration record.\nIn Georgia, any registered voter can vote by absentee ballot — unlike some states, which require voters to provide a justification for requesting one. Voters can request an absentee ballot\nhere\nor at\nballotrequest.sos.ga.gov .\nDates to Note\nImportant dates related to the Special Election in Georgia:\nDec. 7 - Voter registration deadline for Jan. 5 election.\nDec. 14 - Early (advanced in-person) voting begins for federal offices.\nJan. 5 - Election Day for federal offices.\nAs it did for the November general election, McCamish Pavilion will\nserve as a polling place\nfor the Jan. 5 runoff election. On Election Day, only residents assigned to McCamish can vote there.\nVisit Georgia’s\nrunoff election guide\nor the\nSecretary of State’s office\nfor more information.\nTime to Vote\nPer\nsection 8.2.7.7\nof the\nUSG’s general personnel policies , employees are encouraged to exercise their constitutional right to vote in all federal, state, and local elections. If polls are not open at least two hours before or two hours after an employee’s normally scheduled work shift, sufficient leave time must be granted to permit the employee to vote. Employees should be granted a two-hour block of time in which to vote, if needed.\nPer\nsection 4.1.3\nof the\nUSG’s general Student Affairs policy , students are also encouraged to vote in all federal, state, and local elections. A student whose class schedule would otherwise prevent them from voting will be permitted and excused absence for the interval reasonably required for voting.\nPolitical Activity\nUniversity System of Georgia (USG) employees are encouraged to fulfill their civic obligations and share their views on political issues; however, in doing so, they may act only in their personal capacities and must not use Institute resources or appear to be speaking on behalf of the Institute.\nIn addition, USG employees may not hold elective political offices at the state or federal level while employed by the USG. Political campaigning during work hours, or in a way that interferes with Institute responsibilities, is prohibited.\nView the full USG policy on political activity, under section 8.2.18.3.\nAdditional Images\nContact\nGrace Wyner\nInstitute Communications\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}