{"text": "Devesh Ranjan Selected as 2021 Governor’s Teaching Fellow | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nDevesh Ranjan Selected as 2021 Governor’s Teaching Fellow\nDevesh Ranjan, associate chair for Research, Ring Family Chair, and professor in the George W. Woodruff School of Mechanical Engineering, was recently named a 2021 Governor’s Teaching Fellow for the summer symposium program.\nFacebook\nTwitter\nEmail\nJul 16, 2021\n— Atlanta, GA\nDevesh Ranjan, associate chair for Research, Ring Family Chair, and professor in the George W. Woodruff School of Mechanical Engineering, was recently named a 2021 Governor’s Teaching Fellow for the summer symposium program.\nRanjan, whose research disciplines include propulsion and combustion and aerodynamics and fluid mechanics, is the fifth faculty member from Georgia Tech to be named a Governor’s Teaching Fellow. Established by former Gov. Zell Miller in 1995, the program is offered through the Institute of Higher Education at the University of Georgia to provide opportunities, skills, and networking with the goal of improving the quality of instruction in higher education.\n“I’m looking forward to learning from other educators from different Georgia campuses and different disciplines,”\nRanjan\nsaid. “I see the program as a great opportunity to enhance my teaching expertise and affect the learning experiences of our students.”\nRanjan said he is particularly interested in using the program to inform the delivery of instruction as it concerns the well-being of students, which he describes as a crisis – one that has only been exacerbated by the pandemic.\nLong before Covid-19, administrators and researchers in higher education reported concerns about the mental health of students, with one national study of 155,000 students from nearly 200 campuses showing that seven out of 10 were struggling with emotional or mental difficulties that affected academic performance. Ranjan is optimistic that these concerns can be addressed through choices faculty make about classroom culture, course design, and assignments.\nIn fact, the 13 members in the current Governor’s Teaching Fellows program who come from universities and technical colleges across the state have focused intently on the concept of how to foster student well-being in the wake of a worldwide health crisis.\n“I strongly believe that the 21st-century challenge in higher education is to meet our students where they are,” said Ranjan, who recently completed a stint as interim vice president for Interdisciplinary Research. He expects that student feedback and performance “will ultimately guide the way.”\nRanjan’s participation in the program aligns well with Georgia Tech’s strategic focus on strengthening the Institute’s culture of well-being and creating an environment of holistic learning where all members of the campus community can grow and learn to lead healthy, purposeful lives.\nRanjan was selected as a fellow as part of the Summer 2020 cohort before the coronavirus pandemic hit, postponing the program. He was nominated by Tech President Ángel Cabrera. In a highly competitive process, each year the Institute selects a limited number of fellows for an academic year program and a separate summer program.\nParticipants are selected based on their interest in continuing instructional and professional development, their ability to make a positive impact on their own campus, and a strong commitment by their home institution for release time and other forms of support for the duration of their participation in the program.\n“Devesh Ranjan exemplifies Georgia Tech’s commitment to educational innovation and academic well-being,” Cabrera said in nominating him. “Whether using high-tech or low-tech teaching methods, his commitment to enhance the learning experiences of his students drives him to continuously refine his approach to teaching.”\nAs a Provost Teaching and Learning Fellow at Tech, Ranjan also coordinated a group of engineering faculty working to integrate augmented and virtual reality platforms into select courses, all part of his commitment to both the Governor’s Teaching Fellows program and to his long-range goals as an educator.\n“This a continuous, ongoing process to engage students and enhance their well-being,” he said. “And the symposium was an excellent opportunity to have a dedicated time and space to think about innovation in teaching and education, and to meet and learn from other educators.”\nHe is also a Georgia Tech Diversity and Inclusion Fellow, a program in which he aims to help, for example, first-generation and other students beyond the classroom by enhancing faculty connections with students through mentoring and by spending a few hours in residence halls to support students and their coursework.\nGeorgia State Rep. Jasmine Clark, senior instructor of nursing at Emory University, who was part of the cohort of Teaching Fellows along with Ranjan, said, “The program challenged my entire way of thinking about how I teach in the classroom. Every facet of my teaching experience was called to the carpet in the most meaningful way.”\n“It was unlike anything I have experienced before,” Clark said. “It was fun, educational, and challenging. I also left feeling like I made some amazing connections with faculty members that I may not have ever had the opportunity to meet in any other instance.”\nSince its inception, more than 675 fellows from about 80 disciplines have participated in the program. This year’s summer cohort includes faculty who are experts in a diverse range of areas, including psychology, dental hygiene, chemistry, nursing, political science, women’s studies, classical languages, theater, and mechanical engineering.\nTo learn more about the Institute of Higher Education and the Governor’s Teaching Fellows Program, including information on how to apply, visit\nihe.uga.edu/programs/governors-teaching-fellows .\nAdditional Images\nContact\nJerry Grillo\nResearch News\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}