{"text": "Two-Way Cell-based Treatment Repairs Muscle After Rotator Cuff Injury | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nTwo-Way Cell-based Treatment Repairs Muscle After Rotator Cuff Injury\nNew treatment helps muscle regenerate following shoulder surgery\nFacebook\nTwitter\nEmail\nMar 26, 2024\nA team of Georgia Tech researchers has introduced a\nnew therapeutic system\nto offset the poor clinical outcomes often associated with common rotator cuff surgery.\nIt’s the kind of surgery that makes headlines whenever a famous athlete is sidelined with a torn rotator cuff. Major League Baseball All-Star pitchers Clayton Kershaw and Justin Verlander, for example, both had rotator cuff surgeries and made successful comebacks.\nFor those of us who can’t throw baseballs 95 miles an hour, the rotator cuff may tear over time from repeated overhead motions (painters and carpenters, for instance). Or an injury can occur as we age and our body’s tissues naturally degenerate. And although rotator cuff injuries are common, they can be serious, leading to muscle degeneration after surgery.\nNow, two professors from the\nWallace H. Coulter Department of Biomedical Engineering , a joint department of Georgia Tech and Emory University, have addressed the problem with a novel cell-based dual treatment, which they describe in a study published recently in the journal\nTissue Engineering .\n“We’re thinking mainly of an aging population with this study — the people most likely to have these injuries,” said\nJohnna Temenoff , whose research group collaborated with the lab of\nEd Botchwey\non this work. “The great thing about this system is, it isn’t specific to a particular population. These are cells we all have, and this treatment system might work even better in younger patients.”\nLocal Delivery\nThe rotator cuff is a group of muscles and tendons surrounding and protecting the shoulder joint, keeping the head of the upper arm bone firmly in the shallow socket of the shoulder. It’s tight jumble of tissues, and not an easy environment for muscle regeneration.\n“With a rotator cuff injury, you’re actually tearing the tendon,” said Temenoff, director of the NSF Engineering Research Center for Cell Manufacturing Technologies ( CMaT ) at Georgia Tech. “And that causes the muscle to atrophy.”\nWhile pro athletes have access to world-class training and rehabilitation to help rebuild the shoulder following surgery, for many patients that rotator cuff muscle doesn’t fully regenerate, even after a successful surgery. Temenoff isn’t sure why.\n“That’s a big unknown,” she said. “And it’s a big field of study right now, an active area of research. There is a need for regenerative therapies that can be used in conjunction with rotator cuff restoration surgery, as a long-term treatment option —that is what we are addressing.”\nIn previous studies using mouse models, Temenoff found that she could change the cellular environment in the muscle with the local injection of microparticles loaded with a protein called stromal cell-derived factor (SDF), which can attract various pre-regenerative cells circulating to the muscle.\nThe Push-Pull Effect\nThe idea is to mobilize the cells that can heal, the cells that rebuild muscle at the source. Getting enough of them to do the work is the trick.\nTemenoff’s lab\nhas developed microparticles that use heparin, a natural sugar-based molecule found in the body that has a high negative charge. SDF is positive-charged, so that electrostatic interaction between the two particles allows for controlled release of SDF over time.\nSDF interacts almost magnetically with a receptor on pro-regenerative cells in bone marrow or circulation to “call” them to a certain location. However, older people may not have enough of these cells in circulation to make much of a difference in healing. That’s where\nBotchwey’s lab\nentered with the major assist.\nHis team provided experience with a bone marrow mobilizing agent (called VPC01091) that can send healing cells into circulation around the body. In clinical settings, bone marrow mobilizing agents are used to “push” stem cells out of the marrow and into the blood. These cells can regenerate and differentiate into all kinds of cells in multiple tissue environments.\nThe researchers set out to develop a single therapeutic option by combining the two technologies. Here's what happened when they tested the system in rats: The mobilizing agent was injected systemically while the SDF was injected locally into the shoulder. So, while the mobilizing agent “pushed” pro-healing cells into circulation, SDF’s magnetic effect “pulled” them to the injury site, resulting in the desired regenerative effects.\nThe researchers found different levels of regeneration spatially—in other words, where they applied the local injection really matters. Further research will aim to fine-tune the process, so clinicians can recruit healing cells to even more specific areas of the damaged muscle. Temenoff and her collaborators believe they are onto something that will result in better muscle regeneration, with potential applications beyond the rotator cuff.\nThis work was supported by the National Institutes of Health (grant no. R01AR071026).\nCITATION:\nLeah Anderson, Liane Tellier, Keshav Shah, Joseph Pearson, Alexandra Brimeyer, Ed Botchwey, Johnna Temenoff. “Bone Marrow Mobilization and Local Stromal Cell-Derived Factor-1a Delivery Enhances Nascent Supraspinatus Muscle Fiber Growth,”\nTissue Engineering .\nDOI:\nhttps://doi.org/10.1089/ten.tea.2023.0128\nAdditional Media\nContact\nJerry Grillo\nEmail\njerry.grillo@ibb.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}