{"text": "Georgia Tech's Sonification Lab Revolutionizes Eclipse Experience for Visually Impaired | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech's Sonification Lab Revolutionizes Eclipse Experience for Visually Impaired\nThrough detailed auditory descriptions and immersive virtual environments, the Sonification Lab facilitates accessibility to the wonders of the universe for all, regardless of visual ability.\nFacebook\nTwitter\nEmail\nApr 05, 2024\nAs the April 8 solar eclipse approaches, millions of people anticipate participating in the wonder of this celestial event. Yet, for those with visual impairments, traditional methods of observing such phenomena may present limitations. Fortunately, resources from the team of Tech’s\nSchool of Psychology\nprofessor, Bruce Walker, offer an inclusive approach, ensuring that everyone can engage with and appreciate the eclipse experience. Through detailed auditory descriptions and immersive virtual environments, the\nSonification Lab\nfacilitates accessibility to the wonders of the universe for all, regardless of visual ability.\n“This is the absolute first technology of its kind to give blind and visually impaired users the complete information and spatial knowledge of a map, especially for an eclipse,” said Brandon Biggs, Ph.D. student in the Human Centered Computing (HCC) program in the\nSchool of Interactive Computing.\nAt the forefront of the Sonification Lab’s research efforts are the resources provided by the lab’s website. This comprehensive platform serves as a hub for eclipse enthusiasts, offering detailed maps, predictions, and scientific insights into the upcoming solar eclipse. These resources are integral to the Sonification Lab's work, enabling them to create fully accessible and accurate auditory representations of the eclipse experience, says Walker.\nCrafting an Immersive Soundtrack\nThrough meticulous analysis and interpretation of the data, Walker's team crafts\nauditory representations\nof the eclipse that accurately depict its various phases and phenomena. Each element, from the gradual obscuration of the sun to the fleeting moments of totality, he adds, is translated into carefully composed melodies and rhythms. This soundtrack offers listeners a unique and immersive way to experience the celestial event.\n“It’s almost like infotainment,” said Walker. “We want to give a complete experience of totality during the eclipse, with the immersive sound of what birds and other animal behaviors would be at that time.”\nAs the moon begins to move across the face of the sun, the soundtrack reflects this gradual obscuration through subtle shifts in melody and rhythm. The gradual dimming of light is mirrored by a gradual crescendo in the music, creating a sense of anticipation and tension.\nDuring the brief moments of totality, when the moon completely blocks the sun, the soundtrack reaches a climax. This crescendo symbolizes the awe-inspiring beauty of totality, capturing the profound experience of witnessing the sun's corona against the backdrop of darkness.\n\"Pull\" Style Audio Map:\nThis map\noutlines the precise path the solar eclipse will take across North America. It provides information about the regions that will experience totality, using the same path data from NASA. The map’s features offer both low lighting and an interactive icon to follow the route of the eclipse, making it engaging and web-accessibility compliant. By incorporating data from this map, the Sonification Lab ensures that their auditory representations align with the geographical features of the eclipse path.\n\"Push\" Style Map :\nThis map\nprovides detailed information about the timing of the eclipse in various locations. According to Walker, the map highlights the moments of partial and total eclipse, allowing listeners to follow the progression of the event in real time. By integrating data from this map, the Sonification Lab synchronizes their auditory compositions with the chronological sequence of the eclipse.\nEnhancing Accessibility Through VR Technology\nIn addition to facilitating this auditory experience, the Sonification Lab also explores virtual reality (VR) capabilities to enhance accessibility for those unable to witness the eclipse firsthand. By immersing users in a virtual environment, complete with visual and auditory components, VR technology enables individuals to experience the eclipse in a highly immersive and interactive manner.\nWalker explains that, in the VR environment, users can explore detailed visual representations of the eclipse, including accurate depictions of the sun, moon, and Earth. These visual components provide additional context and enrichment to the auditory experience, allowing users to better understand the celestial mechanics at play.\nTo delve deeper into the wonders of the cosmos and experience the eclipse in a whole new way, individuals are encouraged to visit the website\nhere.\nRelated links\nhttps://news.gatech.edu/news/2024/04/02/total-solar-eclipse-brings-history-with…\nContact\nSiobhan Rodriguez\nInstitute Communications\nEmail\nsar30@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}