{"text": "Humanitarian Activist to Receive Ivan Allen Jr. Prize for Social Courage | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nHumanitarian Activist to Receive Ivan Allen Jr. Prize for Social Courage\nNancy Parrish, who advocates on behalf of victims of sexual assault in the military, will received the $100,000 award\nFacebook\nTwitter\nEmail\nNancy Parrish, Founder and CEO of Protect Our Defenders and the 2016 recipient of the Ivan Allen Jr. Prize for Social Courage\nJan 14, 2016\n— Atlanta, GA\nA humanitarian activist who advocates for a military culture free of sexual assault and violence has been named the recipient of the 2016 Ivan Allen Jr. Prize for Social Courage, Georgia Institute of Technology President G.P. “Bud” Peterson announced today. Nancy Parrish helped launch a national movement to reform how the U.S. military prosecutes sexual violence. Protect Our Defenders works to transform the culture of harassment and rape within the military through legal reform, advocacy, education, and free legal and case assistance for victims. Parrish also co-founded the Human Rights Watch’s Northern California Chapter, which as part of its mission to protect human rights around the world sought to prevent the use of child soldiers. She worked with President Jimmy Carter and Rosalynn Carter in support of their international humanitarian work at the Carter Center. She also served as an officer of the Children’s Guardian Fund Board of Sarasota, which helps foster children. Parrish will be honored during a symposium scheduled for Feb. 18. “Ms. Nancy Parrish has long been at the forefront in addressing the many difficult social issues facing our country today,” Peterson said. “Here at Georgia Tech, we are familiar with her international humanitarian work and the many initiatives she has undertaken to help alleviate human suffering. Through her exemplary efforts as founder and CEO of Protect Our Defenders, she has given a voice to victims of sexual assault in the military. Our world and our country have been greatly enriched by her selfless service.” The Ivan Allen Jr. Prize for Social Courage recognizes individuals who, by standing up for clear moral principles in the social arena, have positively affected public discourse at the risk of their own careers and livelihoods. Parrish has been harassed and threatened because of her work on behalf of active duty service women and men, veterans and civilians who are victims of military sexual assault. “I want to make a significant lasting impact, focusing on the root causes of discrimination, injustice, and inequality in our society,” Parrish said. She created Protect Our Defenders in 2011 after noticing a lack of attention to the issue. “When we as a society witness injustice and suffering, it is in our nature as Americans to stand on the side of fairness,” Parrish said. “Ivan Allen Jr. was a beacon of light in a dark time, and we strive to be that beacon of light today for our young service women and men and veterans.” The prize comes with a $100,000 stipend. The Wilbur and Hilda Glenn Family Foundation endowed the award in perpetuity. Parrish plans to donate the money to Protect Our Defenders. Prior recipients include William Foege, U.S. Rep. John Lewis, Beatrice Mtetwa and former Senator Sam Nunn. Learn more about the prize here:\nhttp://ivanallenprize.gatech.edu\nAdditional Images\nRelated links\nIvan Allen Jr Prize for Social Courage\nProtect Our Defenders\nContact\nLaura Diamond  Georgia Tech Media Relations 404.894.6016\nEmail\nlaura.diamond@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}