{"text": "Researchers Develop Methodology for Streamlined Control of Material Deformation | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nResearchers Develop Methodology for Streamlined Control of Material Deformation\nResearchers demonstrate that new physical theories provide precise predictions of the deformations of certain structures, revealing that a flexible mechanical structure is governed by some of the same math as electromagnetic waves and even black holes.\nFacebook\nTwitter\nEmail\nA conformal deformation of the Kagome Metamaterial gives an example of the dramatic possibilities.\nFeb 04, 2022\n— Atlanta, GA\nCan you crumple up two sheets of paper the exact same way? Probably not — the very flexibility that lets flexible structures from paper to biopolymers and membranes undergo many types of large deformations makes them notoriously difficult to control. Researchers from the Georgia Institute of Technology, Universiteit van Amsterdam, and Universiteit Leiden have shed new light on this fundamental challenge, demonstrating that new physical theories provide precise predictions of the deformations of certain structures, as recently published in\nNature Communications.\nIn the paper, Michael Czajkowski and D. Zeb Rocklin from Georgia Tech, Corentin Coulais from Universiteit van Amsterdam, and Martin van Hecke of AMOLF and Universiteit Leiden approach a highly studied exotic elastic material, uncover an intuitive geometrical description of the pronounced – or nonlinear – soft deformations, and show how to activate any of these deformations on-demand with minimal inputs. This new theory reveals that a flexible mechanical structure is governed by some of the same math as electromagnetic waves, phase transitions, and even black holes.\n“So many other systems struggle with how to be strong and solid in some ways but flexible and compliant in others, from the human body and micro-organisms to clothing and industrial robots,” said Rocklin. “These structures solve that problem in an incredibly elegant way that permits a single folding mechanism to generate a wide family of deformations. We’ve shown that a single folding mode can transform a structure into an infinite family of shapes.”\nA Brief History of Metamaterials\nMetamaterials rely on the use of hinges, folds, cuts, and “flexible” ingredients to display the variety of counterintuitive physics that has been steadily revealed over the past decade of intense research. Many of these new behaviors have emerged from the development of auxetics, materials that tend to shrink in all directions when they are compressed from any direction rather than bulging outward. Although the researchers’ chosen structure, “Rotating Squares,” is already one of the most heavily researched metamaterials, they uncovered entirely new and powerful physics hiding within its deformations.\n“Normally complex real-world structures defy analytical physics, which made it all the more thrilling when Michael found that his conformal predictions could account for 99.9% of the variance in Corentin’s structure,” said Rocklin. “This new approach could allow us to predict and control tough, flexible structures from the size of skyscrapers to the microscale.”\nConformal Findings\nThe results of this paper rely on the novel observation that these maximally auxetic metamaterials deform conformally, which the researchers confirmed with a high degree of accuracy. This means that any angle drawn on the material before and after deformation will still look like the same angle. This seemingly mundane observation activates powerful mathematical structures.\nThis conformal insight allows for a variety of pen-and-paper analytic advances: a nonlinear energy functional, deformation fitting methods, new prediction methods etc. This culminates with a recipe to choose any of these conformal deformations in an exact, reversible, and mathematically straightforward manner via the manipulation of the boundary. By choosing how much the boundary is stretched, the overall shape can be picked from infinite possibilities.\nSuch deformation control is still limited by the essential nature of conformal deformations. However, the underlying principles are quite general, and researchers are working to apply these new principles to more varied and complex structures.\n\"Our results are very promising for the soft microscopic robotics that are being developed for non-invasive surgical purposes,\" said Czajkowski. \"In this effort, scalability and precise external control are two of the primary goalposts, and our style of deformation control seems perfectly suited for the job.\"\nThe jump to more provocative applications is likely not far off, as the realm of metamaterials has steadily become populated with\nmanipulatable faces , a variety of\nnew grabbers\nand hands, and even an elastic worm that can\nthread a series of needles . These advances will become essential in the effort to develop soft microscopic robots, which must be externally manipulated to move through a body and perform noninvasive surgeries.\nCitation:\nMichael Czajkowski, Corentin Coulais, Martin van Hecke and D. Zeb Rocklin, “ Conformal elasticity of mechanism-based metamaterials ,”\nNature Communications\n(January 11, 2022). doi.org/10.1038/s41467-021-27825-0\nAdditional Images\nContact\nGeorgia Parmelee | georgia.parmelee@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}