{"text": "Significant Portion of Postdoc Researchers Eye Non-Academic Careers, Study Shows | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nSignificant Portion of Postdoc Researchers Eye Non-Academic Careers, Study Shows\nAspiring research faculty aren't the only students pursuing a postdoc.\nFacebook\nTwitter\nEmail\nMay 05, 2016\n— Atlanta, GA\nFor doctoral students studying science, technology, engineering and mathematics, landing a job as a research-oriented college or university faculty member typically requires having spent time as a postdoctoral researcher.\nBut a new study from a Georgia Tech-Cornell University team shows that the research faculty path isn’t the only reason students pursue a postdoc.\nIn a survey of nearly 6,000 doctoral students in a broad range of fields, more than a third of the students with plans to pursue postdocs said they had more interest in careers outside of academic research.\nThe finding is surprising because it challenges the notion that postdoctoral research is a stepping stone primarily for research faculty positions, said Henry Sauermann, associate professor at Georgia Tech’s Scheller College of Business.\n“There’s this common belief that Ph.D. students pursue a postdoc because they want to have a faculty career,” Sauermann said. “The answer is it’s much more complex.”\nAlthough more than 60 percent of survey respondents rated a research-oriented faculty position as one of their most attractive career paths, more than one-third rated other careers as more attractive, including research in government, established firms or startups, as well as teaching and other non-research careers.\nThe results of the research were published in May in the journal,\nScience . The work was sponsored by the National Science Foundation and the Ewing Marion Kauffman Foundation.\n“For a lot of these Ph.D.s, the postdoc is an opportunity to consider other options and explore other career paths,” said Michael Roach, the co-author of the paper and an assistant professor in the Dyson School of Applied Economics and Management at Cornell University.\n“It’s an easy natural next step for them, and it gives them flexibility to keep that academic option open,” Roach said.\nSauermann and Roach were prompted to look into the motivations of students pursuing postdocs because of what they saw as an imbalance between the number of postdoc researchers and the number of research-oriented faculty jobs at colleges and universities across the country.\n“Many people believe that students don’t know what the market looks like and that this is why they hope to get a faculty position and do a postdoc,” Sauermann said. “We wanted to understand what was going on inside students’ minds as they were making these decisions.”\nThey surveyed Ph.D. students beginning in 2010 at 39 research-intensive universities in the United States. The students were surveyed again in 2013 after many had already begun a postdoc or entered other full-time positions.\nThe respondents were also asked to estimate how likely it is for them to get a tenure-track position within five years after finishing their Ph.D. While the respondents were knowledgeable about the limited availability of faculty positions in general, some appeared to be overly optimistic about their own chances of getting a faculty position, Sauermann said.\nThe study highlights the need for more data on students’ career preferences in order to compare graduates’ career goals to their actual career transitions, Sauermann said. More data is needed to determine also how useful a postdoc is for non-academic careers, he added.\nWhile students need to consider career plans early, they also need better information to understand the various career paths and their job prospects, Sauermann said. Such information should come from academic advisers, professional organizations or career development programs.\n“In a lot of the conversations I’ve had, Ph.D. students start the program because they have a passion for research,” Roach said. “Although more information about career paths is unlikely to dissuade Ph.D.s from starting the program, it would be extremely valuable to Ph.D. students as they consider whether to do a postdoc.”\nThis material is based upon work supported by the National Science Foundation under Grant No. SMA1262270. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the National Science Foundation.\nCITATION:  Henry Sauermann and Michael Roach, \"Why pursue the postdoc path?\", (Science, May 2016).\nAdditional Images\nContact\nJohn Toon\nResearch News\nEmail\njohn.toon@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}