{"text": "Engineering Research Center Will Help Expand Use of Therapies Based on Living Cells | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nEngineering Research Center Will Help Expand Use of Therapies Based on Living Cells\nA $20 million engineering research center will help expand the uses of cell-based therapies.\nFacebook\nTwitter\nEmail\nResearchers work in the cell manufacturing laboratory of Krishnendu Roy at Georgia Tech. Shown (l-r) are NSF Graduate Research Fellow Joscelyn Mejias, Research Experience for Undergraduates (REU) Program student Angela Jimenez, (background) Postdoctoral Fellow Randall Toy, Georgia Tech Research Institute TAG-Ed High School Intern Gita Balakirsky, and Project ENGAGES High School Intern Ayanna Prather. (Credit: Rob Felt, Georgia Tech)\nSep 12, 2017\n— Atlanta, GA\nThe National Science Foundation (NSF) has awarded nearly $20 million to a consortium of universities to support a new engineering research center (ERC) that will work closely with industry and clinical partners to develop transformative tools and technologies for the consistent, scalable and low-cost production of high-quality living therapeutic cells. Such cells could be used in a broad range of life-saving medical therapies now emerging from research laboratories.\nLed by the Georgia Institute of Technology, the NSF Engineering Research Center for Cell Manufacturing Technologies (CMaT) could help revolutionize the treatment of cancer, heart disease, autoimmune diseases and other disorders by enabling broad use of potentially curative therapies that utilize living cells – such as immune cells and stem cells – as “drugs.” Examples of these highly promising therapies include T cell-based immunotherapies for blood cancers, such as the one developed at the University of Pennsylvania and approved in August by the U.S. Food & Drug Administration, and a gene-modified stem cell therapy recently approved in Europe for a form of the so-called “bubble boy” syndrome.\nTo facilitate the widespread application of these cutting-edge emerging treatments, CMaT will develop robust and scalable technologies, innovative analytical tools, and engineering systems that will enable industry and clinical facilities to reproducibly manufacture efficient, safe and affordable cell-therapy products. The center, one of four ERCs announced September 12 by the NSF, will also develop improved models for a robust supply chain, storage and distribution system for these therapeutic cell products.\n“For over 30 years,\nNSF Engineering Research Centers\nhave promoted innovation, helped to maintain our competitive edge, and added billions of dollars to the U.S. economy,” said NSF Director\nFrance Córdova . “They bring together talented innovators and entrepreneurs with resources from academia, industry and government to produce engineers and engineering systems that solve real-world problems.  I am confident that these new ERCs will strengthen U.S. competitiveness for the next generation and continue our legacy of improving the quality of life for all Americans.”\nIn addition to the consistent manufacture of  cell-based therapies, the public-private CMaT initiative will also help develop a skilled, diverse and inclusive bio-manufacturing workforce through extensive education and training activities at the K-12, technical college, undergraduate, graduate and postdoctoral levels.\nLiving cells become “drugs”\n“Unlike pharmaceuticals and other products now used in medical treatments, cells are living entities whose properties can significantly change depending on nuances in the way they are grown, stored or otherwise manipulated,” said\nKrishnendu Roy , director of CMaT and the Robert A. Milton chair professor in the\nWallace H. Coulter Department of Biomedical Engineering\nat Georgia Tech and Emory University. “The center will develop new engineering tools and scalable methods to better characterize, expand, differentiate, separate, transport and store high-quality cells so they provide consistent therapeutic effects, allowing them to be used in standardized therapies by clinicians to serve large numbers of patients worldwide.”\nBeyond Georgia Tech, the center will include major partners – the University of Georgia, the University of Wisconsin-Madison and the University of Puerto Rico, Mayaguez Campus – as well as affiliate partners such as the University of Pennsylvania, Emory University, the Gladstone Institutes and Michigan Technological University. Additional international academic partners, as well as industry and the U.S. national laboratories, will also be critical collaborators in the effort.\nMoving discoveries into application\n“Georgia Tech has a long history of building collaborative partnerships with industry, the national labs and other research universities. With the support of the NSF and this new ERC, we will be able to capitalize on expertise in multiple areas, taking transformative research from the laboratory to practice much more quickly,” said Georgia Tech President G. P. “Bud” Peterson. “The Center for Cell Manufacturing Technologies will also help us educate, train and prepare the workforce in a new industry, thereby continuing to strengthen the U.S. economy.”\nClinical trials have already established the effectiveness of several cell-based therapies and many other trials are underway. But for these exciting therapies to advance into broad healthcare use, the cells will have to be produced in much larger quantities and with more consistent quality than is now available. There are also very few, if any, established industry standards for analytics and processes in cell manufacturing, which hinders consistent production of safe and efficacious cells. Another key limitation identified by industry is the need for a highly-trained workforce.\nCMaT would address these barriers through transformative innovations that build upon a series of earlier efforts, including the\nNational Cell Manufacturing Consortium\n(NCMC) roadmap, infrastructure established at Georgia Tech with support from the Marcus Foundation, quality and other standards programs from the National Institute of Standards and Technology (NIST) and independent industry-led bodies, and translational activities by industry, entrepreneurs and other partners.\nThe NSF’s multidisciplinary engineering research centers address unique, complex engineering challenges by stimulating knowledge and tech transfer between different sectors, from electronics to energy to infrastructure. Each center takes on a specific engineering research challenge.\n“The overall goal of the NSF Engineering Research Centers program is nothing less than to revolutionize engineering research and education in the United States,” said Dawn Tilbury, NSF assistant director for engineering. “We look forward to the exciting advances and outcomes in these important areas.”\nAccelerating clinical trials\nBeyond established cell-based therapies, the work of CMaT should accelerate the development of new therapies and the testing needed to bring them into the clinic, said\nSteven Stice , director of the University of Georgia’s\nRegenerative Bioscience Center\n(RBC). Regenerative medicine applications could offer new ways of treating diseases for which there are now essentially no treatments, including Parkinson's, Alzheimer’s, heart disease and stroke.\n“There are a significant number of cell therapy clinical trials and investments in the field,” Stice said. “But there is little or no investment in a set of consistent standardization methods to optimize how these therapies should work. For instance, we know that cell therapies will improve human health, but right now it’s difficult to guarantee that each dose produced will be as potent as the next. The work done by CMaT researchers will help solve some of these problems.”\nThe University of Pennsylvania develops cellular therapies and has conducted more than 40 clinical trials of cell-based therapies, including those for engineered T cell therapies and chimeric antigen receptor (CAR) T cells. An example is recently-approved treatment for relapsed and refractory acute lymphoblastic leukemia in pediatric and young adult patients.\n“The cell and gene therapy fields are on the cusp of multiple regulatory approvals in the near term,” said\nBruce Levine , Barbara and Edward Netter Professor in Cancer Gene Therapy in the Perelman School of Medicine at the\nUniversity of Pennsylvania . “The challenges ahead lie in developing manufacturing and testing processes incorporating automation that can bring costs down and allow access to more patients.”\nDeveloping broad-based innovations\nCritical innovations often occur at the boundaries of disciplines, and CMaT will bring together relevant specialties for both research and workforce development, noted\nMadeline Torres-Lugo , a professor in the Department of Chemical Engineering at the University of Puerto Rico, Mayaguez Campus.\n“Due to the complexity of cells as living organisms, a team with a strong background in biology, chemistry, physics, materials science, and engineering is required for this initiative,” Torres-Lugo said. “Our participation and contribution to CMaT will ensure that Puerto Rico not only remains at the forefront of pharma manufacturing, but also supports cell manufacturing technologies here and around the world by educating highly talented engineering students.”\nCMaT testbeds have been selected to address several cell types that are in early stages of clinical adoption or moving toward clinical applications, but it isn't yet clear what cell types will have the greatest therapeutic impacts, noted\nSean Palecek , the Milton J. and A. Maude Shoemaker Professor in chemical and biological engineering at the\nUniversity of Wisconsin-Madison . Therefore, one of the center’s challenges will be to ensure that fundamental discoveries, and tool and technology development efforts, will apply to multiple cell types.\n“Our work will provide safer and more potent cell products that will allow clinical studies to establish the effectiveness of these cells as therapeutics,” Palecek said. “In addition, our work on scaling cell production will enable manufacturing of sufficient numbers of cells to replace damaged organs, such as the loss of heart muscle after a heart attack, at a cost that makes these therapies accessible to broad segments of society. We will also train the future leaders of the emerging therapeutic cell manufacturing industry. These students and their work establishing this industry will be the most significant impact of CMaT.”\nNew centers among 19 ERCs\nSince the program’s inception in 1985, NSF has funded a total of 74 ERCs and will support 19 in this fiscal year, including four new centers. Each center receives NSF funding for up to 10 years. During this time, centers build partnerships with industry, universities and other government agencies that will sustain them for years to come.\nIn May, the National Academies published a report, “A new vision for center-based engineering research,” which was the result of an NSF-funded study to examine the future of the NSF ERC program.\nThe report identifies and recommends strategies to enable NSF multidisciplinary engineering research centers to continue addressing key research, education and innovation needs of the United States in a changing global context.\n“ERCs are widely known as outstanding examples of successful partnerships between universities, private industry and government that have made significant contributions to address national challenges,” said Don Millard, acting division director for the NSF Division of Engineering Education and Centers. “We are continually working with the scientific and engineering communities, as well as private industry and government partners, to ensure NSF-funded centers and grantees are best-equipped to match societal needs with research abilities.”\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contacts : John Toon (404-894-6986) ( jtoon@gatech.edu ) or Ben Brumfield (404-660-1408) ( ben.brumfield@comm.gatech.edu ).\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}