{"text": "AAAS Honors Cola, Fox and Weitz as Fellows | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nAAAS Honors Cola, Fox and Weitz as Fellows\nThree Georgia Tech researchers honored as AAAS Fellows for 2017 for their contributions to the advancement of science.\nFacebook\nTwitter\nEmail\nMary Frank Fox has been named AAAS Fellow for 2917. She is known for her research on women and men in scientific organizations and occupations. Fox is nationally recognized as a leader on issues of diversity, equity, and equity in science.\nDec 04, 2017\n— Atlanta, GA\nThe American Association for the Advancement of Science (AAAS) has named three researchers from the Georgia Institute of Technology as fellows for 2017 for their contributions to the advancement of science.\nBaratunde Cola, Mary Frank Fox, and Joshua Weitz, who are members of AAAS, were elected by their peers to receive the honor and join hundreds of their contemporaries who became fellows this year. “This year 396 members have been awarded this honor by AAAS because of their scientifically or socially distinguished efforts to advance science or its applications,” the AAAS wrote in its announcement of this year’s fellows.\nAll three Georgia Tech fellows saw the AAAS Fellowship as encouragement to continue serving science and humanity.\nThe three have excelled in research in the following fields, according to AAAS: Cola in nanoscale engineering, Fox in the participation and performance of women and men in science, and Weitz in virus dynamics in populations and in ecosystems. Here are summaries of the researchers’ achievements and interests.\nBaratunda Cola\nmay be best known for engineering the first-ever optical rectenna. A rectenna, or rectifying antenna, turns electromagnetic waves into direct current electricity, and Cola’s invention was the first known to work with sunlight instead of radio waves, making it an innovation in efficient solar energy generation.\nCola, who is an associate professor in The George W. Woodruff School of Mechanical Engineering at Georgia Tech, is currently focused on the transfer of heat, and the conversion of energy in nanostructures, particularly those based on carbon nanotubes. He holds three carbon nanotube related patents and is interested in making his innovations producible on a large scale for practical use.\n“I was honored that AAAS chose to recognize my contributions to science over the years,” Cola said. “The fellowship gives a bigger platform to my work so it can reach more people and be useful to them.”\nCola’s vision transcends arbitrary confines of a research field. “I think of myself less as being a mechanical engineer and more as a person concerned with the advancement and well-being of people, and I appreciate the power of science to positively affect lives through practical applications.”\nIn April, Cola\nreceived the highest honor awarded by the National Science Foundation to up-and-coming scientists and engineers . Like the AAAS Fellowship, the Alan T. Waterman award also recognized Cola’s achievements in transforming light and heat into electricity on the nanoscale, and it added $1 million in funding to his research.\nCola also serves as CEO of Carbice Corporation, a Georgia Tech spinoff company that has developed a heat-conducting tape that helps prevent electronic devices from overheating.\nMary Frank Fox\nis known for her research on women and men in scientific organizations and occupations. She is nationally recognized as a leader on issues of diversity, equity, and equity in science, and her work has had a significant influence on science and technology policy.\nFox, who is an\nADVANCE Professor\nat the School of Public Policy in Georgia Tech’s Ivan Allen College of Liberal Arts, is particularly interested in how social and organizational settings, in which scientists are educated and work, influence their performance. She holds multiple board of director positions in societies connected to science and technology policy.\n“I’m deeply honored by the AAAS award,” Fox said. “I value that it recognizes my years of research on women and men in sciences and the policy implications for equity.”\nFox sees the award as recognition that her work advances science and is aligned with AAAS’s commitments. “I’m one of the founders of this area of science, and I value this award recognizing this research that advances science,” Fox said.\nJoshua Weitz\nuses models to predict the effects of viruses on populations and on ecosystems, but his work encompasses many complex biological systems. His group combines methods from physics, math, computational biology, and bioinformatics to develop in-depth analytical models of biological dynamics to understand experimental and environmental data.\nIn the field of virology, he applies this approach to the molecular workings of viruses, their spread through a population and their evolution into new strains. His work is theoretical, but he uses his detailed computational methods to collaborate with experimentalists. Weitz is a professor in Georgia Tech’s School of Biological Sciences, Courtesy Professor of Physics and the Director of the Interdisciplinary Graduate Program in Quantitative Biosciences.\n“When AAAS first informed me, I was honored and humbled.  And I was proud of my group and its collective effort in the last 10 years at Georgia Tech to study viral ecology,” Weitz said.\n“The mission of the AAAS is ever more important in these times, and being a fellow gives us a greater responsibility to communicate our research beyond the scientific community, to let the public know how it serves society’s betterment by improving public health and environmental health.”\nThe American Association for the Advancement of Science lays claim to the distinction of being “the world’s largest general scientific society.” AAAS was founded in 1848 and publishes the journal\nScience\nas well as many other prestigious research periodicals. The AAAS Fellowship began in 1874.\nAdditional Images\nContact\nWriter and Media Relations Contact : Ben Brumfield (404-660-1408)\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nEmail\nben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}