{"text": "Economic Development Administration Visits Georgia Tech, Georgia AIM Partners | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nEconomic Development Administration Visits Georgia Tech, Georgia AIM Partners\nVisit is part of national tour of American Rescue Plan Regional Challenge awardees\nFacebook\nTwitter\nEmail\nAaron Stebner (left), associate professor in the George W. Woodruff School of Mechanical Engineering and Georgia AIM co-lead, discusses how the AI Manufacturing Pilot Facility (AI-MPF) advances Georgia AIM goals with Dennis Alvord, the Economic Development Administration’s deputy assistant secretary for economic development and chief operating officer. (PHOTO: Joya Chapman)\nNov 15, 2022\n— Atlanta, GA\nSenior Economic Development Administration (EDA) officials visited the Georgia Tech campus Nov. 14, to meet with a coalition of partners looking to transform the state’s workforce and create more economic opportunities through a combination of manufacturing and artificial intelligence innovations.\nThe visit, led by Dennis Alvord, the EDA’s deputy assistant secretary for economic development and chief operating officer, follows his department’s award of a $65 million grant in September to Georgia Tech and a coalition of partners to support the initiative called Georgia Artificial Intelligence in Manufacturing or Georgia AIM.\nIt’s one of 21 projects across the country that were funded as part of the $1 billion American Rescue Plan Regional Challenge. Alvord’s Atlanta stop — the 19 th  project visited — is part of the agency’s plan to visit and meet with leaders of all the funded projects across the country.\nEDA expects the 21 projects will create more than 220,000 jobs and collectively attract $20 billion in private investments.\nA 12-partner collaboration of industry, higher education, and government organizations, Georgia AIM seeks to close technology gaps and support a technological opportunity ecosystem across the state that’s inclusive of underrepresented communities and rural counties.\nThe Georgia AIM coalition’s efforts are projected to draw $105 million in private investment and create or save 23,000 jobs over the next five years.\nSpread across eight different projects, the coalition’s goals include nurturing K-12 students who are interested in science and math-related pursuits, building workforce development programs specific to artificial intelligence, and catalyzing outside investments to communities and startups. Finally, Georgia AIM looks to better secure the state’s manufacturing infrastructure.\n“I’m incredibly impressed by the size of and diversity of the of the coalition that you brought together for this project,” Alvord said, following discussions with several members, which, in addition to Georgia Tech, include the  Technology Association of Georgia’s TAG Bridge Builders , the  Robins Air Force Base 21 st  Century Partnership , the  Russell Innovation Center for Entrepreneurs , and the  Technical College System of Georgia .\nCommunity engagement and creating a framework that allows the communities and people affected to actively shape their futures is important to EDA, Alvord said.\n“It’s great to see the ingrained commitment to equity and making sure that diverse populations and underserved populations are really tied to this award and are going to benefit from it,” Alvord said.\nDoing that successfully, he said, means ensuring those communities are exposed to artificial intelligence in comprehensive ways to see “the potential that it has to revolutionize existing industries and to create new entrepreneurial opportunities for new business starts in these underserved geographies and populations.”\nHe noted some of the focus areas of Georgia AIM are doing that, such as the AI InVenture K-12 Experience. That effort, a collaboration of Georgia Tech’s  K-12 InVenture Prize  and  Center for Education Integrating Science, Mathematics and Computing , is piloting a rural regional event with a region-specific prize. They will also create supplemental lessons centered on AI and data science that will be part of a K-12 InVenture Prize curriculum website.\n“I was very much struck by the efforts to reach out to the K-through-12 populations and expose them to AI and its potential in manufacturing very early to get people into the STEM [Science, Technology, Engineering, and Math] ecosystem very early,” he said. “It’s not just about being interested in science or math. It’s understanding how that could tie to a future career path so that individuals can see themselves following that trajectory.”\nEqually impressive, he said, is a Georgia AIM the component of connecting those interested in innovating in AI manufacturing to the resources to make that possible. Several of the Georgia AIM partners, including Georgia Tech’s  Enterprise Innovation Institute , TAG Bridge Builders, and the Technical College System of Georgia are already doing that through creative workforce development programs, implementation strategies, and serving as conduits to draw outside investment.\n“What I love about this particular coalition is that it’s connecting all the parts,” said Loretta Daniels, director of the TAG Bridge Builders program, which is charged with ensuring the state’s technology sector is more equitable and inclusive of Black tech talent.\n“We’re connecting with so many different organizations trying to advance diversity and in the tech arena, but we’ve all come together to try and figure out how we can all advance each other.”\nBridging artificial intelligence and manufacturing is reflective of where Georgia leads and Georgia Tech innovates, said  Aaron Stebner , associate professor in the  George W. Woodruff School of Mechanical Engineering  and the  School of Materials Science and Engineering . Stebner co-leads Georgia AIM with  Donna Ennis , director of Diversity Engagement and Program Development in the Enterprise Innovation Institute, and  Thomas R. Kurfess , executive director of the Georgia Tech Manufacturing Institute.\nThe state’s robust manufacturing economy employs more than 400,000 and generates in excess of $61 billion in economic activity year. Georgia is a leading manufacturing hub in 10 different sectors and Georgia Tech is at the forefront of  AI research and innovations .\n“It seemed like the right place and the right time to bring this group of people together in this endeavor,” Stebner said. “We had this really unique opportunity to ask ourselves what does the future look like and how can we do it better than we have been doing it before.”\nAdditional Images\nContact\nPeralte C. Paul\n404.316.1210\nperalte.paul@comm.gatech.edu\nEmail\nperalte.paul@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}