{"text": "Interactive Visualization Illustrates Uncertainty of NFL Draft | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nInteractive Visualization Illustrates Uncertainty of NFL Draft\nAn interactive visualization created by the Information Interfaces Research Groups shows just how few draftees make it long-term in the NFL.\nFacebook\nTwitter\nEmail\nApr 19, 2017\n— Atlanta, GA\nNext week, 253 players will hear their names called over the course of three days in the 2017 NFL Draft. For many, it will be the beginning of a long and lucrative career in professional football. For most, it will be the highlight in an increasingly competitive business.\nAn\ninteractive visualization\ncreated by a team of researchers in the Georgia Institute of Technology’s School of Interactive Computing illustrates just how fleeting the career of a professional football player can be and how difficult it can be for teams to differentiate between the superstars and the busts.\nThe visualization, which catalogues each of the 32 teams’ draft picks from 2007-16, indicates with a green icon a player who is currently active on the team that drafted him. A blue icon indicates a player still in the league, but playing on a different team, and a red icon indicates a player that is no longer active in the NFL.\nA quick glance at all 32 teams’ charts presents a healthy dose of red in comparison to the green and blue, illustrating the brevity of the average NFL career. An analysis has shown that the average length of a career decreased by about two years, from 4.99 years to 2.66, from 2008-14.\nOnly one team, the Carolina Panthers, have more than one player still active on their roster from their 2007 draft.\nFrom a team perspective, the ebb and flow of a given franchise’s success can be traced within the colors of the visualization.\nThe Atlanta Falcons, owners of an 11-5 record and a near Super Bowl championship this past season, have experienced their fair share. After a 13-3 season in 2012, their third straight season of double-digit wins, they surprised many by slipping to four, six, and eight victories over the next three years, missing the playoffs in each.\nThe visualization, however, shows why it probably shouldn’t have come as such a surprise. The Falcons drafted just three players from 2007-12 that are currently on their roster. Since 2013, however, the mass of red icons has turned to green, as the team has hit on 21 of 30 picks.\nCheck out highlights from a\nhandful of other teams\nin the NFL.\nAlso evident in the visualization is which teams have seen relative success in the draft in comparison to others, as well as how that draft success has correlated to improved returns on the field.\nOn one hand, there are the Houston Texans, who have seen their average wins per season increase from 5.33 over the course of their first seven years of existence to 8.22 in the nine years since. That increase in wins coincides with a string of nine straight hits in the first round of the draft, shown in the visualization by a green icon in the first-round column for each year from 2008-16.\nComparatively, the consistently unsuccessful Cleveland Browns display just five first-round green icons since 2007, three of which have come in the past two years. They have just three in the second round, none coming before 2014.\nIn addition to the player’s league status, active or inactive, the visualization allows the user to toggle to two other categories: Games started and approximate value.\nThe “games started” option indicates much of what you would expect – that players taken earlier in the draft see the field more often – but also indicates which teams have had the most success in finding the proverbial diamonds in the rough.\nThe Seattle Seahawks, for example, found much of the talent that led it to back-to-back Super Bowl appearances in 2013-14 in the later rounds of the 2010-11 drafts. Kam Chancellor, K.J. Wright, and Richard Sherman, who help form the nucleus of Seattle’s stingy defense, were taken in the fourth and fifth rounds but are colored orange to indicate 65-99 NFL starts.\nThe team of researchers includes undergraduate student Se Yeon Kim, graduate student Sakshi Pratap, and School of Interactive Computing Professor John Stasko. Stasko is the director of the\nInformation Interfaces Research Group , whose mission is to help people take advantage of information to enrich their lives by creating information visualizations and visual analytics tools to help analyze and understand large data sets.\nInformation for the visualization was compiled from NFL.com's\ndraft history\nand\nplayer\npages. Games started and approximate value was taken from\nPro Football Reference .\nFollow the link for a look at the\nproject page .\nAdditional Images\nContact\nDavid Mitchell\nCommunications Officer\nEmail\ndavid.mitchell@cc.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}