{"text": "Molecular “hats” allow in vivo activation of disguised signaling peptides | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMolecular “hats” allow in vivo activation of disguised signaling peptides\nUsing molecular \"hats,\" researchers have developed a way to sneak biomaterials containing the signaling molecules into living animals.\nFacebook\nTwitter\nEmail\nResearchers have developed a technique for activating biological signals through the skin of a living animal using light. In this illustration, ultraviolet light is shining through a pattern, initiating fluorescence in the biomaterial implanted in a biomaterial located under the skin of a living animal. (Credit: García Laboratory at Georgia Tech)\nDec 15, 2014\n— Atlanta, GA\nWhen someone you know is wearing an unfamiliar hat, you might not recognize them. Georgia Institute of Technology researchers are using just such a disguise to sneak biomaterials containing peptide signaling molecules into living animals. When the disguised peptides are needed to launch biological processes, the researchers shine ultraviolet light onto the molecules through the skin, causing the “hat” structures to come off. That allows cells and other molecules to recognize and interact with the peptides on the surface of the material. This light-activated triggering technique has been demonstrated in animal models, and if it can be made to work in humans, it could help provide more precise timing for processes essential to regenerative medicine, cancer treatment, immunology, stem cell growth, and a range of other areas. The research represents the first time biological signals presented on biomaterials have been activated by light through the skin of a living animal, and could provide a broader platform technology for launching and controlling biological processes in living animals. “Many biological processes involve complex cascades of reactions in which the timing must be very tightly controlled,” said Andrés García, a Regents Professor in the George W. Woodruff School of Mechanical Engineering at Georgia Tech and principal investigator for the project. “Until now, we haven’t had control over the sequence of events in the response to implanted materials. But with this technique, we can deliver a drug or particle with its signal in the ‘off’ position, then use light to turn the signal ‘on’ precisely when needed.” Supported by the National Science Foundation and the National Institutes of Health, the research was reported December 15, 2014, in the journal\nNature Materials . It resulted from collaboration between scientists from Georgia Tech and the Max-Planck Institute in Germany through the Materials World Network Program. When biomaterials are introduced into the body, they normally stimulate an immune system response immediately. But the researchers used molecular cages like hats to cover binding sites on the peptides that are normally recognized by cell receptors, preventing recognition by the animal’s cells. The cages were designed to detach and reveal the peptides when they encounter specific wavelengths of light. During the five-year project, the research team – which included Ted Lee and Jose Garcia from Georgia Tech and Aranzazu del Campo from Max-Planck – modified peptides that normally trigger cell adhesion to present the molecular cage in order to disguise them. They showed that disguised peptides introduced into animal models on biomaterials could trigger cell adhesion, inflammation, fibrous encapsulation, and vascularization responses when activated by light. They also showed that the location and timing of activation could be controlled inside the animal by simply shining light through the skin. The work involved numerous controls to ensure that the triggering observed by the researchers was actually done by exposure of the peptides – not the light, or the removal of the protective cage. The researchers also had to demonstrate that the “hats” were stable enough that they didn’t come off spontaneously, but only when the link between the molecular cage and the peptide was severed by the ultraviolet light. Among the experiments was use of the peptide to attract cells that would attach themselves to the biomaterial. “We showed that if we left the hat on, there would be few cells attracted to the material, García said. “But when we take the hat off, we recruited a lot of cells to the material. That shows we can activate the peptide, and that the activation has a biological consequence.” Another experiment showed that the timing of peptide activation could affect the quantity of fibrosis, an immune system response that builds a protective capsule around an implanted biomaterial. By delaying the exposure of the peptides until after the bulk of the inflammation reaction had taken place, the thickness of the fibrosis capsule was significantly reduced, allowing it to be better incorporated into the body. In another experiment, the researchers showed that removing the hats could trigger the growth of blood vessels into the material. This vascularization is critical in regenerative medicine, but must take place at the right time to be successful. “We showed that if you keep the hat on, you get no vessel in-growth into the material,” explained García. “But if we turn on the light, we get growth of new blood vessels into the material. We can control what happens and when it happens by when we expose the protective cages to light.” In the future, photochemists at the Max-Planck Institute will be working on alternative cages that would be triggered by different wavelengths of light. As much as 90 percent of the ultraviolet light used in the experiments was lost in passing through the skin of the animal model, limiting the use of that wavelength to locations immediately below the skin. Development of alternate “hats,” the molecular cages that protect the peptides, could allow sequential activation by light, and light activation of molecules at locations deeper inside the body. Light, heat, and electricity have been used to trigger biological processes in vitro, García noted. Light is especially useful because it can be patterned to control processes spatially, which is also important because the processes must occur not only at the right time, but also the right place. “The technique we developed is a general strategy that we can apply to other biological signals to see if they have similar spatio-temporal effects,” said García. “We see this as a beginning. From here, there are many, many applications that we can follow.” In addition to those already mentioned, the research involved Ankur Singh, Edward Phelps and Asha Shekaran from Georgia Tech, and Julieta Paez, Simone Weis and Zahid Shafiq from the Max-Planck Institute. Lee now works for Dexcom, a San Diego-based company that focuses on continuous glucose monitoring systems for use by people with diabetes, and Singh is currently an assistant professor at Cornell University. The research was supported by the Materials World Network Program of the National Science Foundation under grants DFG AOBJ 569628 and NSF DMR-0909002, by the National Institutes of Health under grants R01-AR062368 and R01-AR062920, and by the NIH Cell and Tissue NIH Biotechnology Training Grant T32-GM008433. The content is solely the responsibility of the authors and does not necessarily represent the official views of the National Science Foundation or the National Institutes of Health. CITATION : Lee, Ted, et al., “Light-triggered in vivo Activation of Adhesive Peptides Regulates Cell Adhesion, Inflammation and Vascularization of Biomaterials,” Nature Materials 2014. Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia  30332-0181  USA Media Relations Contacts : John Toon (404-894-6986) ( jtoon@gatech.edu ) or Brett Israel (404-385-1933) ( brett.israel@comm.gatech.edu ). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}