{"text": "Bacterial Biofilms in Hospital Water Pipes May Show Pathogenic Properties | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nBacterial Biofilms in Hospital Water Pipes May Show Pathogenic Properties\nResearchers have described microbial communities found in shower hoses at a major U.S. hospital.\nFacebook\nTwitter\nEmail\nGeorgia Tech Doctoral Student Maria Juliana Soto-Girón and School of Civil and Environmental Engineering Professor Kostas Konstantinidis are shown with images of bacteria. Research done with scientists from the U.S. Environmental Protection Agency documented bacteria in shower hoses taken from hospital patient rooms. (Credit: John Toon, Georgia Tech).\nMar 11, 2016\n— Atlanta, GA\nThe human microbiome, a diverse collection of microorganisms living inside us and on our skin, has attracted considerable attention for its role in a broad range of human health issues. Now, researchers are discovering that the built environment also has a microbiome, which includes a community of potentially-pathogenic bacteria living inside water supply pipes. A paper published March 11 in the journal\nApplied and Environmental Microbiology\ndescribes microbial communities found in shower hoses at a major U.S. hospital. The study documented bacteria – and related genes – using cutting-edge metagenomic techniques that allow the characterization of organisms that cannot be detected using traditional culture-based microbiology assays. Researchers from the U.S. Environmental Protection Agency and the Georgia Institute of Technology collaborated to study these biofilm communities, but can’t say yet if these bacteria pose a threat to hospital patients. But because some of the genes could indicate pathogenic characteristics – such as resistance to antibiotics – the researchers want to learn more about the potential health implications, and whether other buildings house similar biofilms. Antibiotic resistance is a public health emerging priority identified by the World Health Organization, which in 2015 released a global action plan to address the problem. “We can say confidently that if pathogens are in there, they are not there in very high abundance,” said\nKostas Konstantinidis , an associate professor in the\nSchool of Civil and Environmental Engineering\nat Georgia Tech. “But the organisms that we detected as abundant in these biofilms appear to have characteristics that could be of interest because they are related to some bacteria that are opportunistic pathogens that could pose a threat, especially to immunocompromised hospital patients” The study began by culturing bacteria from 40 shower hoses removed from individual hospital rooms by EPA researchers. Nucleic acid was extracted from five of the shower hoses and processed using next-generation sequencing technology. The sequencing data was sent to Georgia Tech, where doctoral student Maria Juliana Soto-Girón matched the sequences against known bacteria – and genes that have known effects, such as virulence and antibiotic resistance. The microbiome study found an abundant population of bacteria that the researchers believe are novel “ Mycobacterium -like” species not described previously, closely related to\nMycobacterium rhodesiae\nand\nMycobacterium tusciae . Traditional culture-based methods instead identified organisms affiliated with\nProteobacteria\n– such as members of the genera\nSphingomonas ,\nBlastomonas\nand\nPorphyrobacter\n– as the most abundant. The biofilm communities harbored genes related to disinfectant tolerance, which constituted 2.3 percent of the total annotated proteins – and a lower abundance of virulence determinants related to colonization and evasion of the host immune system. Additionally, genes potentially conferring resistance to beta-lactam, aminoglycoside, amphenicol and quinolone antibiotics were identified. The frequency of these genes was higher than the frequency found in Lake Lanier, a natural freshwater ecosystem that has been studied by the Georgia Tech research team, suggesting that the drinking water pipe environments merit closer attention. The research grew out of an EPA research project to understand the issues of drinking water systems and building microbiomes – the collection of microbes found in such structures. While biofilms are common in building water pipes, this study generated the most metagenomic data so far for the organisms living in these water systems. Additionally, the researchers analyzed 94 partial genomes of isolated biofilm bacteria, including some that had not been reported before, though they are related to previously-characterized microorganisms. Though well-known pathogens weren’t seen in abundance, the presence of genes for antibiotic resistance, resistance to water disinfectants and virulence raises concerns because bacteria can share such genes to potentially become more significant health threats. “If they have a core of genes, they may be receptive to acquiring other genes that will render these microorganisms more problematic,\" said Jorge Santo Domingo, a microbial ecologist with the EPA’s Office of Research and Development in Cincinnati. “These organisms are very good at living in difficult environmental conditions with limited carbon sources, so fighting them could become a challenging proposition. We don’t know if they constitute a problem, but we certainly want to find out.” The analysis of material taken from the shower hoses is only a preliminary study, and much more research will be needed. Santo Domingo compared the findings to a “check engine” light in an automobile. The warning doesn’t necessarily indicate an immediate problem, though it does show that attention – and potential action – may be required. “Some of the identified genes are the kind that we’d want to keep an eye on,” he explained. “We would like to conduct more studies to gather data on the dynamics of these bacterial groups, but the fact that these genes are present indicates that more studies should be done.” The potential clinical significance of the bacteria needs to studied, and any public health impacts understood, he added. Other questions include whether similar biofilms would be found in other hospitals, whether biofilms differ among facilities, how monitoring should be done – and whether shower heads and hoses should be replaced on a regular basis. The work could also provide a foundation for new research into the types of water disinfection used in hospitals. The chlorine compounds used in public drinking water may not provide sufficient protection for water supplies in these facilities. The sequencing data and bioinformatics analyses will help identify genetic markers that could be used to monitor these genes and determine their public health relevance. While Konstantinidis and his research group have been studying microbes in natural ecosystems such as Lake Lanier in Georgia, this represents their first metagenome analysis of microbial communities in the built environment. They are hopeful that the technique, which is still in the research and development stage, can help understand issues involving microbial populations and their virulence potential in buildings where humans spend most of their time. “Metagenomics gives you a more complete and quantitative picture of what microorganisms are there and how abundant they are,” he said. “This shows that traditional culture methods are limited in what they can detect, and that they can often provide a biased look at what is there.” In addition to those already mentioned, the paper’s authors included Luis Rodriguez and Chengwei Luo from Georgia Tech, Michael Elk and Hodon Ryu from Pegasus, Inc., and Jill Hoelle from the EPA. CITATION : Maria J. Soto-Girón, et al., “Characterization of biofilms developing on hospital shower hoses and implications for nosocomial infections,” (Applied and Environmental Microbiology, 2016). Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contact : John Toon ( jtoon@gatech.edu ) (404-894-6986). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}