{"text": "2020 Georgia Tech Diversity Symposium Focuses on Disability Awareness and Inclusion | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\n2020 Georgia Tech Diversity Symposium Focuses on Disability Awareness and Inclusion\nThe 2020 Georgia Tech Diversity Symposium featured campus presenters discussing disability awareness and its importance to diversity, inclusion, and the campus community.\nFacebook\nTwitter\nEmail\nSep 16, 2020\n— Atlanta, GA\nThe 2020 Georgia Tech Diversity Symposium, Understanding Accessibility as Inclusion: Georgia Tech's Pathway to Accessibility, was presented virtually for the first time in the program’s 12-year history on Sept. 9.\nHosted by\nInstitute Diversity, Equity, and Inclusion\n(IDEI), the event featured campus presenters discussing disability awareness and its importance to diversity, inclusion, and the campus community, and more than 600 viewers tuned in. This year marks the\n30 th\nanniversary of the Americans with Disabilities Act , signed into law on July 26, 1990, by President George H.W. Bush.\n“Unfortunately, many members of the Tech community have a limited understanding of the term ‘access’ when it comes to understanding the myriad challenges faced by some members of our community,” said Archie Ervin, vice president for IDEI, ahead of the event. “Many of us understand issues of physical access to facilities and technologies. However, fewer realize that many members of our community face additional barriers — both visible and invisible to most of us.”\nFeatured speaker Haben Girma, the first deaf-blind person to graduate from Harvard Law School and author of\nHaben: The Deafblind Woman Who Conquered Harvard Law School , opened the event and relayed the importance of disability inclusion and disability technologies.\n“If we can harness more awareness between disability and technology and innovation, everyone will benefit,” Girma said, speaking with the assistance of a hearing translator and braille computer.\n“I have a braille computer; along the bottom are dots. I run my fingers over the dots and feel the patterns,” Girma demonstrated. “The patterns of the dots make braille. During this presentation, this is what I’m using for communication. I have an assistant who will be typing what people are saying.”\nGirma urged viewers to let go of the idea that disabilities are a burden. “We have to resist those stories and instead reframe what disability means.” She described winning battles while at Harvard Law (such as successfully arguing for braille menus in campus cafeterias) and learning to salsa dance and surf. Today, she travels the world teaching the benefits of choosing inclusion.\nThe event also featured three panel presentations and discussions, including a group who discussed their experiences with their disabilities on campus and in everyday life.\n“Awareness is only one part of it,” said Danny Housley, assistive technology manager with Tools for Life, part of the College of Design’s\nCenter for Inclusive Design and Innovation\n(CIDI). “I use a white cane and I’m blind. You’re now aware that I have a disability — what does that change? We want to move toward\nacceptance\nof disability and for people to look at it like a trait, like anything else. I may be blind, but that doesn’t mean that I’m incapable of working.”\n“I think this is a great step toward things that we need to be doing more of,” added Liz Persaud, also a CIDI staffer and panelist. “Recognizing that we have a diversity symposium and being able to focus specifically on disability issues is unbelievably important.”\nOther panels focused on Tech-centered disability technology research and development, design, and Georgia Tech’s IT accessibility policies.\n“The 2020 Diversity Symposium raised critical awareness of accessibility issues and exclusion that many in our Georgia Tech community and around the world face due to poor design of the built and digital environment,” said Chantal Kerssens, panelist and CIDI’s executive director and director of research. “Disabilities, permanent and temporary, are much more common than we think. Removing barriers and designing for inclusion opens up society and unlocks joy and productivity from which we all stand to benefit.”\nThe symposium also featured live captioning from CIDI.\n“The Center for Inclusive Design and Innovation was a proud partner in planning the event and we were proud to share our lived experiences, our scholarship, and our service to communities around the country,” Kerssens added.\nThe event ended with the annual awards presented to this year’s\nFaces of Inclusive Excellence\nhonorees and the Diversity Champion Awards honorees, who were recognized for their achievements in accessibility and inclusion on campus. They included Cassie S. Mitchell, assistant professor, Biomedical Engineering (faculty winner); Johan “John” Rempel, UX/ICT quality assurance manager, CIDI (staff winner); Nandita Gupta, graduate student, Human-Computer Interaction (student winner); and the Writing and Communication Program in the Ivan Allen College of Liberal Arts School of Literature, Media, and Communication (unit winner).\n“This year’s Diversity Symposium told the story that every person in the Tech community is valued and entitled to full access to all that we have to offer to fulfill each person’s aspirations, Ervin added. “Seeing access as an issue of inclusion demonstrates that everyone is welcomed and that we should all be dedicated to eliminating barriers of any kind for our community members.”\nTo learn more and to view the event’s panel recordings, visit:\ndiversity.gatech.edu/12th-annual-georgia-tech-diversity-symposium .\nA full transcript of the event is also available\nhere .\nAdditional Images\nRelated links\nIvan Allen College Faculty, Staff,and Students Honored for Diversity and Inclus…\nDiversity Symposium Celebrates Trailblazers\nContact\nCourtney Hill\nCommunications Manager\nInstitute Diversity, Equity, and Inclusion\ncourtney.hill@gatech.edu\nEmail\ncourtney.hill@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}