{"text": "MagTrack Technology Opens Doors for Independent Operation of Smartphones, Computers, and Other Devices for Wheelchair Users | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMagTrack Technology Opens Doors for Independent Operation of Smartphones, Computers, and Other Devices for Wheelchair Users\nClinical work begins with MagTrack, a cutting-edge assistive technology that enables power wheelchair users to control their connected devices and drive their power wheelchairs using an alternative, multimodal controller.\nFacebook\nTwitter\nEmail\nA squint is an example of a facial gesture that MagTrack can detect and issue a discrete command to control a connected device.\nMar 03, 2022\n— Atlanta, GA\nBrooks Rehabilitation\nrecently announced that the MagTrack study, a collaborative research endeavor with the\nGeorgia Tech School of Electrical and Computer Engineering , has been successfully completed. Feedback from the Brooks clinical team and its patients has allowed Georgia Tech engineers to transform their early research prototype into a user-ready version that was tested by more than 17 power wheelchair users living with tetraplegia — a form of paralysis caused by spinal cord injury that affects the arms, hands, trunk, legs, and pelvic organs.\nThe collaboration between the Brooks and Georgia Tech teams has created a path to a first-of-its-kind, innovative application for individuals living with disabilities. The teams — comprised of physicians, clinical therapists, and engineers — brought together multidisciplinary expertise in advanced science, technology, and clinical rehabilitation.\n“We met with the Georgia Tech team years ago, when we first heard of the research breakthroughs they were achieving for wheelchair users. Brooks is constantly looking for technology that is useful for our patient population living with spinal cord injuries and mobility impairments. To see where the MagTrack project has advanced even just since the early stages of this study is incredible,” said Geneva Tonuzi, medical director of the spinal cord injury program, the spinal cord injury and related disorders day treatment program, and Cyberdyne HAL Therapy at Brooks Rehabilitation.\nAs a result of this engineering-clinical collaboration,\nMagTrack\nwas created as a cutting-edge assistive technology that enables power wheelchair users to control their connected devices (e.g., smartphone, computer) and drive their power wheelchairs using an alternative, multimodal controller. In addition, the assistive device is designed to be wearable, wireless, and adaptable to the user’s specific condition.\nThe MagTrack study is earning the praise of patients and scientists alike and has been\npublished\nin\nIEEE Transactions on Biomedical Engineering . From the beginning, the MagTrack studies have tested the performance of the Head-Tongue Controller (HTC), an earlier version of the MagTrack technology, on its ability to perform complex human-machine interactions that will enhance users’ quality of life. The MagTrack’s HTC allows the user to perform a variety of complex tasks in a single controller through the use of tongue and head movements, which are detected by eyewear and a tiny tracer that is temporarily glued onto the tongue using Glustitch’s\nPeryAcryl\nbio-compatible adhesive. Target-specific commands are generated from these motions using advanced data processing and machine learning models. This combination of input modalities allows the user to perform a variety of daily functions with customizable control, from performing complex computer tasks (e.g., mouse navigation, scrolling, drag-and-drop) to completing advanced driving maneuvers when connected to a power wheelchair.\nIn the latest study, researchers connected the MagTrack technology to a single power wheelchair donated by Quantum Rehab, and recruited 17 patient volunteers from Brooks Rehabilitation to test the functionality and usability of the device by completing a set of both simple and advanced driving tasks. Results showed that new users of MagTrack can complete these tasks as fast, and sometimes even faster, with the MagTrack’s HTC rather than their personal, alternative controller. Since the study session lasted less than 3 hours — and in a power wheelchair that wasn’t their own — it is anticipated that participants would be more proficient, and thus perform better with MagTrack, if they were given more time to familiarize themselves with its multimodal capabilities and using their own power wheelchair.\n\"Working with all of the participants has been very rewarding,” said Jesse Milliken, speech-language pathologist in the spinal cord injury program at\nBrooks Rehabilitation Hospital . “Each patient who came in was someone who has been directly affected by a spinal cord injury and who can truly benefit from this technology. It was amazing to see how their faces lit up when they saw they were able to control their wheelchair with such ease and comfort. They all said they can see this improving their day-to-day lives if it were available to them. It's been such an honor to be a part of this process and see the work and thought process behind such advanced technology.\" Patients from the\nBrooks\nspinal cord injury program who have participated in phase three of the study call the advancement “exciting” and a “great system that can be used for so many things.” After experiencing the technology themselves, they believe it will “touch the lives of those who are able to use it.”\nTo date, the head array and sip-and-puff are the most common alternative controllers recommended by physical therapists to individuals living with tetraplegia, while specialized switches and joystick technology are available for those with mobility in their upper extremities. These technologies were developed many decades ago for the basic need of controlling a power wheelchair. Since then, a lack of innovation in this field has hindered these assistive technologies from adapting to today’s technology. Furthermore, they are affixed to the wheelchair, which becomes inaccessible once the user is transferred to a bed, a couch, or any location away from the wheelchair. Therefore, there is a growing need for this population to have access to new, alternative controllers that will enable them to be active members of an interconnected digital world.\n“The trajectory of the MagTrack study shows an unprecedented possibility for the advancement of independent function as well as mobility for electric wheelchair users. Our team and partners are energized and motivated by the recent patient trials to continue to push this technology and its capabilities as far as possible. This technology can significantly improve people’s lives. We will continue to work to see these advances in assistive technology come to life,” said Georgia Tech’s Omer T. Inan, director of the Inan Research Lab, Linda J. and Mark C. Smith Chair in Bioscience and Bioengineering, associate professor in the School of Electrical and Computer Engineering, and adjunct associate professor in the Wallace H. Coulter Department of Biomedical Engineering.\n“MagTrack is an innovative assistive technology aimed for those living with physical paralysis to have access to more complex human-machine interactions, which will facilitate the control of more devices in their everyday life that they cannot easily use otherwise,” said Nordine Sebkhi, postdoctoral researcher at the Inan Research Lab in the School of Electrical and Computer Engineering. “The development of our wearable alternative controller eliminates the need for having multiple assistive technologies, replacing them with a single multimodal and integrated system.” Sebkhi is the co-creator of MagTrack and the technical lead in the development of this assistive technology.\nAs a result of these studies,\nMagTrack\nhas been refined to offer a fully integrated, all-in-one experience so that a user can seamlessly switch between driving their wheelchair and controlling connected devices in their surroundings (e.g., smartphone, computer, automated door opener, smart TV). The system can be used anywhere since it is wearable, and its built-in wireless connectivity facilitates portability.\nThe team at Georgia Tech is already working on a new version of\nMagTrack\nthat is not only more inconspicuous, but also includes detection of facial gestures that significantly augments its control capabilities. Thanks to a grant from the\nGeorgia Research Alliance , this new version of MagTrack will be tested in a focus group at the\nShepherd Center\nand in simulated testing in a home-like environment. In the coming year, the team plans to make MagTrack available to early adopters for at-home validation testing to further improve the technology before pursuing commercialization.\nThis successful study is only a start since, at its core, MagTrack is a new type of body motion tracking. The Georgia Tech team is working on various designs of MagTrack to be used as a wearable articulograph for motor speech disorders, as a hand and joint tracking system for physical rehabilitation, and even as a finger tracking for VR/AR applications. The MagTrack team will be partnering with the\nGlobal Center for Medical Innovation\nto assist in regulatory strategy and project planning to transition the technology from the lab to the market.\n-----\nSpecial thanks and recognition go to all team members involved in this groundbreaking study, including but not limited to:\nNordine Sebkhi, Ph.D., Postdoctoral Researcher, Inan Research Lab, School of Electrical and Computer Engineering, Georgia Tech\nArpan Bhavsar, M.S., Research Engineer, Inan Research Lab, School of Electrical and Computer Engineering, Georgia Tech\nNazmus Sahadat, Ph.D., Applied Scientist, Amazon\nDavid V. Anderson, Ph.D., Professor, School of Electrical and Computer Engineering, Georgia Tech\nOmer T. Inan, Ph.D., Linda J. and Mark C. Smith Chair in Bioscience and Bioengineering, Associate Professor, School of Electrical and Computer Engineering, Adjunct Associate Professor of Biomedical Engineering, Director of the Inan Research Lab\nGeneva Tonuzi, M.D., Medical Director, Spinal Cord Injury Program and Spinal Cord Injury / Disorders Day Treatment Program, Medical Director, Brooks Cyberdyne HAL Therapy\nErica Walling MPT, ATP/SMS, Wheelchair Clinic Manager, Brooks Rehabilitation\nJesse Milliken, M.S., CCC-SLP, Speech-Language Pathologist, Spinal Cord Injury Program, Brooks Rehabilitation\nRaine Osborne, PT, DPT, EdD, FAAOMPT, Director of Research, Brooks Rehabilitation\nAdditional Images\nContact\nGeorgia Parmelee\nEmail\ngeorgia.parmelee@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}