{"text": "Georgia Tech Introduces Long-Term Initiative to Advance the United Nations Sustainable Development Goals | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Introduces Long-Term Initiative to Advance the United Nations Sustainable Development Goals\nTo advance Georgia Tech’s new mission and strategic plan, the Institute is launching a campuswide sustainability effort to enhance Tech’s teaching, research, and operations.\nFacebook\nTwitter\nEmail\nPresident Ángel Cabrera addresses administrators and faculty members from universities around the world at Rutgers University-Newark on Sept. 23, 2019, during the University Global Coalition's (UGC) 17 Rooms-U event. The event was hosted in partnership with the United Nations to promote its 17 Sustainable Development Goals, which Georgia Tech is working to implement throughout the Institute's teaching, research, and operations. (Photo courtesy of Rutgers Business School.)\nAug 25, 2020\n— Atlanta, GA\nTo advance Georgia Tech’s new mission and strategic plan, the Institute is launching a campuswide sustainability effort to enhance Tech’s teaching, research, and operations. The long-term initiative will begin with two virtual events and a collaborative online activity during the Fall 2020 semester.\nSoon after his investiture last fall, President Ángel Cabrera charged leaders and units throughout campus with spearheading a project that would promote, implement, and advance the 17 United Nations (UN) Sustainable Development Goals (SDGs) at Georgia Tech. Adopted by the UN General Assembly in 2015 as part of the 2030 Agenda for Sustainable Development, the SDGs are designed to address the world’s most pressing challenges, including poverty, inequality, climate change, environmental degradation, and peace and justice.\nFeaturing objectives such as “Affordable and Clean Energy,” “Industry, Innovation, and Infrastructure,” and “Sustainable Cities and Communities,” the SDGs appear by name in Tech’s new strategic plan and align with the Institute’s areas of expertise as well as its mission to develop leaders who advance technology and improve the human condition.\n“Representing some of the most consequential and complex problems we face as a species, the SDGs range from health and hunger to gender equality and ocean biodiversity,” said President Cabrera. “They are not nice-to-haves; they are essential for the long-term sustainability of life and human development on our planet.”\nThe new sustainability initiative stems in part from\nTech’s affiliation with the University Global Coalition (UGC) , which President Cabrera chairs and helped found. Established in 2019, the UGC comprises a group of higher education leaders from across the globe who work together to advance the SDGs through education, research, service, and campus operations.\nFall 2020 Programming\nEvents and activities planned for the Fall 2020 semester will focus on how Tech can use the SDGs as a framework to implement the new strategic plan, advance organizational innovation, unite the Institute’s broad spectrum of activities and responsibilities, strengthen Tech’s local and global collaborations, and address urgent challenges such as Covid-19 and racial injustice.\nAdvancing the Sustainable Development Goals at Georgia Tech\nThursday, September 10, 11 a.m. – 12:15 p.m.\nOpen to the public, the first event will feature a keynote address from President Cabrera and a panel discussion moderated by Anna Stenport, chair of the School of Modern Languages and co-director of the Atlanta Global Studies Center. Programming will focus on introducing the campus community to the SDGs, discussing their global importance and relevance to Tech, and demonstrating how the Institute can lead the region in implementing and advancing them.\nSDG Asset Mapping\nSeptember 10 – 23\nFollowing the kickoff event, the Institute community will be invited to participate in a collaborative online effort to identify SDG-related assets — such as places, programs, projects, organizations, and web-based resources — that Georgia Tech can leverage to lead higher education in working toward achieving the SDGs. This simple mapping activity will allow community members to create an initial list of SDG-related assets that will become the starting point of the third event, 17 Zooms.\n17 Zooms\nThursday, October 1, 9 a.m. – noon\nA virtual version of the 17 Rooms event concept developed by The Brookings Institution and The Rockefeller Foundation, 17 Zooms aims to stimulate collective action toward implementing the SDGs. It works by convening 17 distinct groups of specialists to identify, in concert, high-impact objectives that can be met in 18 months.\n17 Zooms will bring together select Georgia Tech faculty, staff, and students, as well as relevant off-campus partners, for small group discussions in 17 different Zoom sessions, one for each SDG. Participants in each group will work together to recommend projects related to their session’s SDG that link research, teaching, operations, and service. At the same time, attendees will learn about existing SDG-related work and connect with people from different backgrounds and disciplines.\nAfter the event, leaders from each session will team up to identify several action items for Georgia Tech to implement over the following year and a half that will advance the SDGs and the strategic plan.\nLearn More About Sustainability at Tech\nFor more details about these programs and Tech’s campuswide commitment to sustainability, visit\nSDGs at Tech .\nThe Fall 2020 SDG program committee comprises faculty and staff from the following units:\nAtlanta Global Studies Center\nGlobal Leadership LLC\nImpact LLC\nInstitute Communications\nInstitute Diversity, Equity and Inclusion\nInstitute Relations\nOffice of Campus Sustainability\nRay C. Anderson Center for Sustainable Business\nRCE Greater Atlanta\n(officially acknowledged by United Nations University)\nServe-Learn-Sustain\nSustainability and Building Services\nLearn More About the Sustainable Development Goals\n17 Goals to Transform Our World\nUnited Nations Division of Sustainable Development Goals\nUnited Nations Foundation\nRCE Greater Atlanta Resources Wiki\nRCE Americas Resources Wiki\nAdditional Images\nContact\nBenjamin Hodges\nInstitute Communications\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}