{"text": "Homecoming Events Celebrate Georgia Tech Traditions | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nHomecoming Events Celebrate Georgia Tech Traditions\nHomecoming week is here, and the calendar is packed with events celebrating Tech traditions.\nFacebook\nTwitter\nEmail\nOct 22, 2023\nGenerations of Yellow Jackets will come together to celebrate Georgia Tech's Homecoming the week of Oct. 23 – 28. Events throughout the week will honor Institute traditions leading up to the Homecoming football game against the North Carolina Tar Heels.\nHomecoming Carnival\nWhen: Tuesday, Oct. 24, noon – 3 p.m.\nWhere: Tech Green\nThe annual Homecoming Carnival, sponsored by the Student Center Programs Council, promises to be “out of this world” — with inflatables, carnival games, snacks, and slime on Tech Green — in keeping with this year's theme: “to Homecoming and beyond.”\nMore information .\nBuzz Bash\nWhen: Friday, Oct. 27, 5 – 9 p.m.\nWhere: Exhibition Hall\nThe Georgia Tech Alumni Association invites you to celebrate Tech tradition and pride at Buzz Bash, “the premier Homecoming event for the whole community.” Enjoy pep rally performances, food and beverages, photo ops, \"and a ramblin' good time.\" President Ángel Cabrera will give remarks at Exhibition Hall at 7 p.m. This event is for all ages, and admission for adults includes one drink ticket.\nMore information .\nMini 500\nWhen: Friday, Oct. 27, 5:30 – 7:30 p.m.\nWhere: Peters Parking Deck\nThe Mini 500 returns for 2023 as teams of seven — three racers and four pit crew members — compete in an eight-lap tricycle race around Peters Parking Deck.\nEach team must rotate the front tire of their tricycle at least three times throughout the race as they attempt to complete all eight laps without destroying their tricycle. The event has been organized by Ramblin' Reck Club since 1969.\nThose not competing are welcome to line the course and cheer on the teams vying for the title of Mini 500 Champions.\nMore information .\nFreshman Cake Race\nWhen: Saturday, Oct. 28, 6:30 – 8 a.m.\nWhere: Starting Line, corner of Fowler and Eighth Streets; Finish Line, Harrison Square\nOpen to all first-year students, the Cake Race is a half-mile race held annually before sunrise on the morning of the Homecoming football game. All participants, whether they run, jog, or walk, receive a cupcake at the end of the race, while the top male and female winners receive a cake and are brought onto the field during halftime of the football game later that day.\nOnce a recruitment tool for the track team, the race has evolved through the years to become one of Tech's longstanding traditions. The event earned its name in 1913 when wives of faculty members and students' mothers baked cakes to reward the winners. It became a standing event in the Homecoming festivities in 1935.\nMore information .\nRamblin' Wreck Parade\nWhen: Saturday, Oct. 28, 9 – 10 a.m.\nWhere: Along Fowler Street, between Eighth Street and Ferst Drive\nBeginning at 9 a.m. Saturday, line the parade route (starting at McCamish Pavilion and ending across Ferst Drive) to see the vehicles showcased in the 2023 Wreck Parade. The event features three categories of vehicles: classic cars, fixed body, and contraption.\nInspired by the Wreck, a 1930 Model A Ford, any restored vehicle more than 25 years old qualifies for the classic car category. The fixed-body vehicles feature displays designed and built by students to reflect the Homecoming theme. Like a traditional parade float, these vehicles are either machine-powered or can be pulled by another vehicle. And further showcasing the ingenuity of the Institute's student body, the contraption category features vehicles designed and built by students that are completely human-powered, emphasizing creativity and engineering skills.\nThe event began in 1929 as a race from Atlanta to Athens but was altered in 1932, due to safety concerns. The parade has taken place each year since, with the exception of 1942 and 1943 due to gas shortages during World War II.\nMore information .\nHelluva Block Party\nWhen: Saturday, Oct. 28, 4 p.m.\nWhere: North Avenue\nHomecoming week features time-honored Tech traditions, and this event is quickly becoming a fan favorite. Four hours prior to each Georgia Tech home football game, three blocks of North Avenue are transformed into the ultimate tailgate zone with live entertainment, games, food trucks, and concessions.\nMore information .\nHomecoming Football Game vs. North Carolina\nWhen: Saturday, Oct. 28, 8 p.m.\nWhere: Bobby Dodd Stadium at Hyundai Field\nThe Yellow Jackets are looking for their third consecutive win over the Tar Heels after erasing a 17-0 deficit in a 21-17 comeback road victory a year ago in Chapel Hill. Along with the traditional Homecoming festivities, Saturday's game will also feature\nGeorgia Tech's National Football Foundation On-Campus Hall of Fame Salute to Paul Johnson . In his 11 seasons on the Flats, the 2023 College Football Hall of Fame inductee led the Yellow Jackets to nine bowl appearances and three Atlantic Coast Conference Championship Games while amassing 82 wins — the fourth most in Tech history.\nMore information .\nClass Reunions and Campus Tours\nDates, times, and locations vary.\nThe Georgia Tech Alumni Association is sponsoring class reunions throughout the week as well as tours of campus hotspots such as the Price Gilbert Library, The Kendeda Building for Innovative Sustainable Design, Coda at Tech Square, and more.\nMore information .\nAdditional Images\nRelated links\nGeorgia Tech Alumni Association - Schedule of Events\nContact\nSteven Gagliano\n- Institute Communications\nEmail\nSteven.gagliano@gatech.edu\nAdditional information\nAs Tech prepares for the Homecoming festivities,\nvoting for Ramblin’ Royalty opened Sunday, Oct. 22\nand runs through Thursday, Oct. 26. The winners will be announced at Bobby Dodd Stadium at Hyundai Field during halftime of the Yellow Jacket’s matchup with North Carolina.\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}