{"text": "Researchers Hijack Cancer Migration Mechanism to “Move” Brain Tumors | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nResearchers Hijack Cancer Migration Mechanism to “Move” Brain Tumors\nResearchers are fighting brain cancer by hijacking the mechanism the tumors normally use to spread.\nFacebook\nTwitter\nEmail\nS. Balakrishna Pai, a researcher in the laboratory of Ravi Bellamkonda in the Wallace H. Coulter Department of Biomedical Engineering at Georgia Tech and Emory University, studies glioblastoma cell samples. (Georgia Tech Photo: Rob Felt)\nFeb 16, 2014\n— Atlanta, GA\nOne factor that makes glioblastoma cancers so difficult to treat is that malignant cells from the tumors spread throughout the brain by following nerve fibers and blood vessels to invade new locations. Now, researchers have learned to hijack this migratory mechanism, turning it against the cancer by using a film of nanofibers thinner than human hair to lure tumor cells away. Instead of invading new areas, the migrating cells latch onto the specially-designed nanofibers and follow them to a location – potentially outside the brain – where they can be captured and killed. Using this technique, researchers can partially move tumors from inoperable locations to more accessible ones. Though it won’t eliminate the cancer, the new technique reduced the size of brain tumors in animal models, suggesting that this form of brain cancer might one day be treated more like a chronic disease. “We have designed a polymer thin film nanofiber that mimics the structure of nerves and blood vessels that brain tumor cells normally use to invade other parts of the brain,” explained\nRavi Bellamkonda , lead investigator and chair of the\nWallace H. Coulter Department of Biomedical Engineering at Georgia Tech and Emory University . “The cancer cells normally latch onto these natural structures and ride them like a monorail to other parts of the brain. By providing an attractive alternative fiber, we can efficiently move the tumors along a different path to a destination that we choose.” Details of the technique were reported February 16 in the journal\nNature Materials . The research was supported by the National Cancer Institute (NCI), part of the National Institutes of Health; by Atlanta-based Ian’s Friends Foundation, and by the Georgia Research Alliance. In addition to the Coulter Department of Biomedical Engineering, the research team included Children’s Healthcare of Atlanta and Emory University. Treating the Glioblastoma multiforme cancer, also known as GBM, is difficult because the aggressive and invasive cancer often develops in parts of the brain where surgeons are reluctant to operate. Even if the primary tumor can be removed, however, it has often spread to other locations before being diagnosed. New drugs are being developed to attack GBM, but the Atlanta-based researchers decided to take a more engineering approach. Anjana Jain, who is the first author of this GBM study, is now an assistant professor in the Department of Biomedical Engineering at Worcester Polytechnic Institute in Massachusetts. As a Georgia Tech graduate student, Jain worked on biomaterials for spinal cord regeneration. Then, as a postdoctoral fellow in the Bellamkonda lab, she saw the opportunity to apply her graduate work to develop potential new treatment modalities for GBM. “The signaling pathways we were trying to activate to repair the spinal cord were the same pathways researchers would like to inactivate for glioblastomas,” said Jain. “Moving into cancer applications was a natural progression, one that held great interest because of the human toll of the disease.” Tumor cells typically invade healthy tissue by secreting enzymes that allow the invasion to take place, she explained. That activity requires a significant amount of energy from the cancer cells. “Our idea was to give the tumor cells a path of least resistance, one that resembles the natural structures in the brain, but is attractive because it does not require the cancer cells to expend any more energy,” she explained. Experimentally, the researchers created fibers made from polycaprolactone (PCL) polymer surrounded by a polyurethane carrier. The fibers, whose surface simulates the contours of nerves and blood vessels that the cancer cells normally follow, were implanted into the brains of rats in which a human GBM tumor was growing. The fibers, just half the diameter of a human hair, served as tumor guides, leading the migrating cells to a “tumor collector” gel containing the drug cyclopamine, which is toxic to cancer cells. For comparison, the researchers also implanted fibers containing no PCL or an untextured PCL film in other rat brains, and left some rats untreated. The tumor collector gel was located physically outside the brain. After 18 days, the researchers found that compared to other rats, tumor sizes were substantially reduced in animals that had received the PCL nanofiber implants near the tumors. Tumor cells had moved the entire length of all fibers into the collector gel outside the brain. While eradicating a cancer would always be the ideal treatment, Bellamkonda said, the new technique might be able to control the growth of inoperable cancers, allowing patients to live normal lives despite the disease. “If we can provide cancer an escape valve of these fibers, that may provide a way of maintaining slow-growing tumors such that, while they may be inoperable, people could live with the cancers because they are not growing,” he said. “Perhaps with ideas like this, we may be able to live with cancer just as we live with diabetes or high blood pressure.” Before the technique can be used in humans, however, it will have to undergo extensive testing and be approved by the FDA – a process that can take as much as ten years. Among the next steps are to evaluate the technique with other forms of brain cancer, and other types of cancer that can be difficult to remove. Treating brain cancer with nanofibers could be preferable to existing drug and radiation techniques, Bellamkonda said. “One attraction about the approach is that it is purely a device,” he explained. “There are no drugs entering the blood stream and circulating in the brain to harm healthy cells. Treating these cancers with minimally-invasive films could be a lot less dangerous than deploying pharmaceutical chemicals.” Seed funding for early research to verify the potential for the technique was sponsored by Ian’s Friends Foundation, an Atlanta-based organization that supports research into childhood brain cancers. \"We couldn't be more thrilled with the progress that Georgia Tech and Professor Bellamkonda's lab have made in helping find a solution for children with both inoperable brain tumors and for those suffering with tumors in more invasive areas,” said Phil Yagoda, one of the organization’s founders. “With this research team’s dedication and vision, this exciting and exceptional work is now closer to reality. By enabling the movement of an inoperable tumor to an operable spot, this work could give hope to all the children and parents of those children fighting their greatest fight, the battle for their lives.\"   In addition to those already mentioned, the research team included Barunashish Brahma from the Department of Neurosurgery at Children’s Healthcare of Atlanta; Tobey MacDonald from the Department of Pediatrics at Emory University School of Medicine, and Martha Betancur, Gaurangkuma Patel, Chandra Valmikinathan, Vivek Mukhatyar, Ajit Vakharia and S. Balakrishna Pai from the Wallace H. Coulter Department of Biomedical Engineering at Georgia Tech and Emory University. This research was supported by the National Cancer Institute of the National Institutes of Health (NIH) through EUREKA award number R01-CA153229. Any conclusions or opinions are those of the authors and do not necessarily represent the official views of the NIH. CITATION : Anjana Jain, et al., “Guiding intracortical brain tumour cells to an extracortical cytotoxic hydrogel using aligned polymeric nanofibres,” (Nature Materials, 2014). ( http://dx.doi.org/10.1038/nmat3878 ). Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia  30332-0181  USA Media Relations Contacts : John Toon (404-894-6986) ( jtoon@gatech.edu ) or Brett Israel (404-385-1933) ( brett.israel@comm.gatech.edu ). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}