{"text": "Ivan Allen Science Fiction Scholar Lisa Yaszek Featured on AMC Series | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nIvan Allen Science Fiction Scholar Lisa Yaszek Featured on AMC Series\n•\tThe six-part series features Yaszek’s expertise on aspects of science fiction from time travel to robots.\nFacebook\nTwitter\nEmail\nLisa Yaszek, professor of science fiction studies in the School of Literature, Media, and Communication, is featured in the 2018 AMC series James Cameron's History of Science Fiction. (Credit: Rob Felt, Georgia Tech)\nApr 27, 2018\n— Atlanta, GA\nGeorgia Institute of Technology science fiction scholar Lisa Yaszek will be featured on the upcoming AMC program,  James Cameron’s Story of Science Fiction  — a new series from the director of science fiction  blockbusters such as  Avatar ,  Alien , and  The Terminator.\nThe six-part series, which airs Mondays at 10 p.m. ET, explores the “evolution of science fiction from its cult beginnings in pulp to the engine for blockbuster film and television success it is today,” according to the network.\n“I think people are going to learn a lot from this, and I think they will be entertained,” said Yaszek, a professor of science fiction studies in the  School of Literature, Media, and Communication . She researches and teaches science fiction as a global language crossing centuries, continents, and cultures.\nYaszek  said she was surprised to get the call from producers seeking to interview her about appearing on the show. Fellow academics, and a former student, recommended her for the role, she said.\nShe ended up filming interviews for all six episodes. The episodes each focus on a distinct theme: aliens, time travel, outer space, dystopian futures, monsters, and finally, robots, cyborgs and other “intelligent machines.”\nYaszek also wrote a chapter for a companion book to the series, also titled  James Cameron’s Story of Science Fiction.\nThe book includes the full versions of interviews Cameron conducted for the series, bonus materials from Cameron’s archives, and essays corresponding to the main themes around which the show is organized.\n“The book publishers reached out to me and asked me to write the time travel chapter after watching the first cut of the series,” Yaszek said. “It was a challenging but fun task that involved balancing what was covered in the show with a carefully curated selection of other important science fiction time-travel texts across media — and believe me, there are a lot!”\nYaszek, who is particularly interested in issues of gender, race, and science and technology in science fiction, has written several books, including  Sisters of Tomorrow: The First Women of Science Fiction ,  Galactic Suburbia: Recovering Women’s Science Fiction ,  and The Self Wired: Technology and Subjectivity in Contemporary Narrative.\nShe said the team involved in the production seemed extraordinarily well-informed about science fiction’s past, present, and future.\nHer first interview with the team, in April 2017, lasted two hours. The discussion went deep into science fiction topics and allowed the producers to decide if Yaszek would be relatable to a mass audience.\n“It was sort of like taking your graduate school comprehensive exams all over again,” she said.\nShe apparently passed, because they flew her out to Los Angeles a month later to film her part in the first three episodes.\n“The first day was supposed to be a three-hour shoot, but we were there for six or seven hours,” she said.\nShe later filmed three segments in New York for three additional episodes.\nIt was the first time filming a television series for Yaszek, who is often quoted in the news on topics related to science fiction literature, her area of expertise as a professor at Georgia Tech’s  Ivan Allen College of Liberal Arts.\n“It was fascinating to work with visual media creatives,” Yaszek said. “Science fiction scholars tend to approach the genre intellectually, asking questions like, ‘How does this author contribute to ongoing public debates about some aspect of science or technology, and what techniques do they use to make that contribution?’ Creative professionals working in film and TV tend to approach science fiction from an emotional context, asking, ‘How would it feel to have this scientific or technological experience? What’s the human angle here, and what techniques can I use to convey that?’”\nShe will appear in segments sandwiched between discussions featuring Cameron and science fiction luminaries such as George Lucas and Steven Spielberg.\nFor more information about the series, go to  AMC’s website .\nAdditional Images\nContact\nRebecca Keane\nDirector of Communications\nrebecca.keane@iac.gatech.edu\n404.894.1720\nEmail\nrebecca.keane@iac.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}