{"text": "Hispanic and Latinx Heritage: President Ángel Cabrera on Representation, Mentoring, Leadership | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nHispanic and Latinx Heritage: President Ángel Cabrera on Representation, Mentoring, Leadership\nThis National Hispanic Heritage Month, President Ángel Cabrera reflects on his time as a student in the College of Sciences at Georgia Tech — and speaks to recruiting and supporting more Hispanic and Latinx students and faculty in STEM.\nFacebook\nTwitter\nEmail\nOct 08, 2021\n— Atlanta, GA\nGeorgia Tech President  Ángel Cabrera  isn’t just the first native of Spain to lead an American university. He’s also just one of a handful of Hispanic and Latinx leaders to serve as presidents of major U.S. institutions of higher education.\n“It’s not a big group,” he says. “The President of the Massachusetts Institute of Technology is from Venezuela. The President of the University of Miami is Mexican, and actually served in the Mexican government as Minister of Health. Then there are a few others. It’s not many of us, but there is a small group.” (Central Connecticut State University President\nZulma R. Toro , who holds a Ph.D. in Industrial and Systems Engineering from Tech, is both the first female president of and first Hispanic chief executive at CCSU.)\nThat story echoes in  historical Hispanic and Latinx faculty representation in higher education in the U.S. , and in teaching STEM (science, technology, engineering, and mathematics) courses in K-12.\nAnd although the number of Hispanic and Latinx students enrolled in colleges and universities has also steadily increased over the past several generations, national representation for this cohort also remains below their share in the U.S. population. “It’s far less in science and engineering majors,” Cabrera adds. “That’s the key. We tend to be under-indexed in engineering and computing, and most of the scientific disciplines.”\nThat’s why Cabrera values the importance of having Hispanic and Latinx faculty spend time in the community, showing students in grade school that people like them — with similar surnames, backgrounds, and stories — can be scientists, engineers, even university presidents.\nAnd at Georgia Tech, the overall number of Hispanic and Latinx students is  on the rise , thanks in large part to sustained initiatives across campus, along with a number of mentoring and outreach efforts led by faculty, staff, students, and alumni advocates. Hispanic and Latinx enrollment recently topped 3,500 at Tech — 500 more than the 2020-21 school year — making up nearly 14% of the undergraduate student body.\nCabrera’s parents weren’t able to go college, but he found a mentor in his uncle as he was growing up in Madrid. “We always looked up to him. He was a great uncle, but also super smart. He was the guy we would call when we had a tough math problem in school. And as I realized that, hey, I’m good at this math stuff, he was always my role model. That’s why I decided to become an engineer.”\nCabrera received a telecommunications engineering degree (equivalent to an B.S. and M.S. in Electrical and Computing Engineering) from Universidad Politécnica de Madrid. He then received a Fulbright Scholarship to attend graduate school at Georgia Tech. That’s when he decided to switch to Cognitive Psychology, and received a Ph.D. in that discipline from the School of Psychology in the College of Sciences.\nWhat did Hispanic representation look like at Georgia Tech when you were here from 1991-95?\nNot great. I don't recall a single Hispanic professor in Psychology nor any another graduate student. There were a few graduate students in the College of Computing and one faculty member, Norberto Ezquerra, with whom I did some work at the Graphics Visualization and Usability center. But yeah, there was not great representation. I think Georgia Tech had always had a reasonable number of Puerto Rican students and international students from Latin American countries. There was a good community for that, but on the faculty side, very rare.\nGiven your experience, what can and should be done to get more Hispanic and Latinx students in STEM classes in higher education?\nWell, first of all,  why  it is important that we do that? We have a clear mission to educate leaders who advance technology and improve the human condition. And that requires that people of all backgrounds be included. We simply cannot respond to the issues of our society if different perspectives are not represented at Georgia Tech. We have a responsibility to make sure that everybody's at the table.\nAnd right now, not just at Georgia Tech but in general — maybe less so in biology — but in physics, math, and definitely computing and most engineering fields — women are underrepresented, Black students are underrepresented, and Hispanic students are underrepresented. And clearly, what the consequences for that will be is technologies and products that don't necessarily respond to every one’s needs. There are plenty of examples of that. Take for example face recognition software, which is notorious for failing with people with dark skins, or machine learning applications that have managed to incorporate many of our society’s stereotypes and prejudices.\nI think, because we are one of the leading technological universities in the country, and because we're large, we not only have the opportunity, but we have the responsibility to lead and to figure out ways to change that reality. It's a complex problem with a complex set of causes and solutions. Clearly, we need to improve the number of faculty from different backgrounds. If you don't see it, you can't be it, you can't become it.\nThere is a piece of that which has to do with training Latino teachers in K-12, increasing representation in our faculty. We know it works — giving students early experiences, bringing them to Georgia Tech, like in  Project Engages , for example. And also, all the work that  CEISMIC  (Center for Education Integrating Science, Mathematics, and Computing) does. CEISMIC, by the way, started off in the College of Sciences, then became institute-wide.\nThat’s the kind of work that we know has an impact — showing up in high schools, training teachers, providing students with a very direct experience. If you haven't been exposed at home — in most cases, it’s having an opportunity to see someone like yourself. Those are the things that can make a difference.\nSame question, but let’s make it about faculty. What can and should be done to increase Hispanic and Latinx faculty in higher education?\nWe have experience with similar programs. We have a program called  Focus . Its goal is to bring college students from underrepresented communities, and engage them in a conversation with minority faculty, people like them who have done it, who are succeeding in engineering. And again, we know those interventions work. You just have to be intentional about that, but anything we can do to bring people to a place like Georgia Tech, to engage with peers to look at mentors, faculty members who've done it before you. We know those things work.\nIs there anything else you would want faculty and students to know about Hispanic Heritage Month and how it relates to Georgia Tech’s mission?\nWe're very proud of the many contributions of Hispanic and Latino faculty members in the history of Georgia Tech. We now have a small but incredibly influential group of faculty members at Georgia Tech who are making a difference. And I'm really, really proud of what they're doing. Not only that, but how many of them are doubling their efforts, no matter how busy they are with their own careers. They're finding time to reach out to connect with students, to motivate others to follow suit.\nI would also highlight the obvious, which is that we are at an institute that values diversity, that values different backgrounds to the point that they hired a guy like me to be president. I think that honestly goes beyond words — this is walking the talk. This is a university that values the contributions of people regardless of their background.\nIn fact, the last thing I'll say is that some people sometimes think about efforts of diversity as somehow, in a way, having a negative impact on the quality of Georgia Tech. And what I've always told people is that the more diverse Georgia Tech has become throughout the decades, the more prestigious Georgia Tech has become.\nIt’s up to you to decide whether there is a cause-and-effect relationship there. But we've never been more diverse than we are today. We've never had the same level of brand recognition and reputation, the same level of applications, the same level of research productivity. We are the living proof that a leading university can benefit tremendously from increased diversity.\nSeptember 15 to October 15 is  National Hispanic Heritage Month , which celebrates the contributions and influence of Hispanic and Latinx individuals in all aspects of American life – history, culture, and achievements.\nThis month, we’re asking Hispanic and Latinx faculty in the College of Sciences to share some of their early school day stories, the reasons they chose to study science, and their thoughts on the importance of representation in STEM classes and leadership in higher education.\nRead Q&As with Frances Rivera-Hernández, Facundo Fernández and Carlos Silva-Acuña\nabout early school days, why they chose to study science, and their perspectives on the importance of representation in classrooms, labs, and leadership in higher education.\nLearn more and get involved with Georgia Tech’s  Hispanic and Latinx Heritage Month celebrations .\nRelated reading: The School of Chemistry and Biochemistry at Georgia Tech is now an official member of the American Chemical Society’s  Bridge Program , which aims to boost the number of underrepresented minority M.S. and Ph.D. students in the discipline.  Learn more about that program here ; get involved with the  College of Sciences Racial Equity Taskforce ,  Faculty Diversity Council ,  Graduate Student Diversity Council , and  campus organizations for math and science students ;\nand read more community stories on heritage and representation  here ,  here ,  here ,  here ,  here , and  here .\nAdditional Images\nContact\nRenay San Miguel\nCommunications Officer II/Science Writer\nCollege of Sciences\n404-894-5209\nEmail\nrenay.san@cos.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}