{"text": "Global Engagement Takes a Detour | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGlobal Engagement Takes a Detour\nInternational mobility of students is frozen because of Covid-19 travel restrictions, but there is still extreme interest in global education.\nFacebook\nTwitter\nEmail\nOIE hosted an end-of-semester event on Tech Green for all living learning communities. (Photo courtesy of OIE)\nNov 16, 2020\n— Atlanta, GA\nInternational engagement is a big part of the Georgia Tech student experience, with more than 50 percent of undergraduates studying abroad or having international internships before graduating. So when international travel was halted last spring because of the coronavirus pandemic, the Office of International Education (OIE) had to alter its itinerary.\n“Since March we have had to cancel programs involving international travel because of Covid-19 travel restrictions,” said Lorie Páulez, director of Education Abroad in OIE. “But just because students aren’t going abroad doesn’t mean that interest in study abroad or international education has declined. International mobility of students is frozen, but there is still extreme interest.”\nPáulez and her colleagues, facing travel restrictions abroad and new health and safety procedures at home, had to find new ways for students to explore global engagement. This year they held a virtual Study Abroad Fair using Gatherly, a video chat platform created by Georgia Tech students through CREATE-X.\n“I don’t want a generation of students to graduate with no global engagement. That is so important to Tech,” Páulez said. “We’re rolling out a new program called Global at Home. It will be cohort-based, like a study abroad program, with global learning outcomes as a key component. Right now this is in lieu of study abroad.”\nStudy abroad program directors in the School of Modern Languages have proposed Spanish language cohorts with virtual cultural and industry visits. The College of Design, which usually takes students to Europe, has pivoted to a US-based program. They will take students on Amtrak along the East Coast, studying the European influence on architectural styles in Washington, DC, Boston, New York, St. Augustine, and Miami.\nFor students pursuing the International Plan degree designation, the committee governing the designation is being as flexible as possible with student requirements, while preserving the integrity of the program.\nGlobal Education on Campus\nThe 21st annual International Education Week is Nov. 16 – 20, with multiple\nevents on campus\nincluding a scavenger hunt on Wednesday, Nov. 18 at 5:30 p.m. The hunt, using the Scavify app, will be in person, outdoors, open to Georgia Tech students, and following Covid-19 safety precautions. Questions will test students’ knowledge on trivia related to global themes and Sustainable Development Goal (SDG) on campus.\nAs part of International Education Week, students from the Global Leadership Living Learning Community will compete in an online SDG showcase where they will present a solution geared to advance a particular SDG in a community they have selected around the world. There also will be an event with President Cabrera called “Charla con Cabrera” (or Chat with Cabrera). Students will ask the president questions during the 30-minute event, which will be shown virtually with a limited number of in-person participants. Participants may\nregister to watch online\nvia BlueJeans.\n“Through our living learning communities we continue to have in-person events weekly,” said Allison Noffsinger, associate director of On-Campus Internationalization in OIE. “We have done everything we can to get students together in a safe way because they are really benefiting from personal interaction. They’re craving it.”\nIn August Noffsinger and her colleagues taped numbers on the classroom floor to indicate physical distancing. Between events they spray the area and use sanitizer to wipe surfaces.\n“We’re trying to give the students normalcy,” Noffsinger said. “We usually take the students in buses all over Atlanta and sometimes out of state. We can’t do that now, but there are other things we can do.”\nNoffsinger and her OIE colleagues recently took students from the Global Leadership Living Learning Community walking on the Atlanta BeltLine with a list of places of interest along the path.\n“It’s a lot more work to plan events now because of safety concerns, but we’re carrying on,” she said.\nCreativity and Resilience\nOIE begins recruiting a year in advance for international programs.\n“It’s a long process before we get them out the door,” said Páulez. “It has been challenging to have virtual events. But we have been able to reach a lot of students and talk to them about opportunities. We’re currently reviewing program proposals for summer 2021.”\nPrograms are being proposed with Covid-19 in mind, addressing the concerns created by the pandemic. For students who can’t travel, OIE is exploring virtual opportunities.\n“We’re looking for different ways to get students engaged, Páulez said. “We have continued our recruiting. I hope we can get back to full mobility. We’re preparing for when that happens because students are ready to go.”\nOIE has also been supporting international students. OIE’s International Student and Scholar Services has been collaborating with Education Abroad to help international students who are stuck at home because of visa issues. Students who were planning to do an international internship can still register for the Global Internship course and continue with their academic progression.\nBecause of travel restrictions, many of Tech’s international first-years were not able to get their visas to enter the US. But they were able to start their time at Georgia Tech at the Georgia Tech-Lorraine and Georgia Tech-Shenzhen campuses.\n“That was a great way to welcome students who would have had to sit out for a semester,” Páulez said, acknowledging the unorthodox start.\n“I have been touched and impressed by the entire Georgia Tech community and the efforts put forth to help students find ways to meet their goals personally and academically and not get delayed at graduation,” Páulez said. “The creativity and resilience shined through in ways that I would not have imagined under normal circumstances. I am encouraged by the fact that people are working hard to accomplish goals in the face of this crisis, which has made everything more difficult — studying, delivering classes, and being an administrator. I have been very impressed by everyone’s ability to get things done with all of the challenges we’re facing.”\nAdditional Images\nRelated links\nOffice of International Education\nInternatiional Education Week Events\nContact\nVictor Rogers\nInstitute Communications\nEmail\nvictor.rogers@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}