{"text": "Study of Fossilized Shells Finds Little Evidence of Icebergs’ Influence on Ice Age Ocean Circulation | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nStudy of Fossilized Shells Finds Little Evidence of Icebergs’ Influence on Ice Age Ocean Circulation\nScientists have thought that large iceberg surges disrupted a key ocean circulation pattern during the last North American ice age, but a new study found little evidence of a disruption during some of the major iceberg surges.\nFacebook\nTwitter\nEmail\nThe research team analyzed the fossilized shells of bottom dwelling single-celled organisms (foraminifera) for specific oxygen and carbon isotope ratios. Credit: Jean Lynch-Stieglitz.\nJan 22, 2014\n— Atlanta, GA\nDuring the last North American ice age, large numbers of icebergs calved from the North American ice sheet and plunged into the North Atlantic Ocean. Scientists have thought that these iceberg surges disrupted a key ocean circulation pattern, but a new study found little evidence of a disruption during some of the major iceberg surges. Understanding the controls on and the stability of this ocean circulation system could help scientists better assess this system’s vulnerability to future climate change. These major iceberg surges are known as Heinrich events. While the study found evidence that some Heinrich events had a major impact on the system of ocean currents that transfer heat from the Southern to the Northern Hemisphere (Atlantic Meridional Overturning Circulation, or AMOC), the study found little evidence of major changes to the AMOC for two of the Heinrich Events that occurred earlier, at the height of the last ice age, at about 24,000 and 31,000 years ago.\n“That’s surprising, you would expect to see disruption for all of the Heinrich events,” said Jean\nLynch-Stieglitz , a professor in the School of Earth and Atmospheric Sciences at the Georgia Institute of Technology in Atlanta, and the study’s lead author. “We just didn’t see any indication that anything out of the ordinary was going on during those previous Heinrich events.” The study was published January 12 in the journal\nNature Geoscience\nand was supported by the National Science Foundation (NSF). One of the paper’s co-authors, L. Gene Henry, was an undergraduate at Georgia Tech during the research project.\nThe study’s findings suggest that the broader climate changes seen at the time of the Heinrich events — changes in precipitation at lower latitudes, for example — may not be linked in a direct, simple way to the AMOC.\nTo examine the impact of Heinrich events on this ocean circulation, the researchers travelled to the Florida Straits, where they took sediment cores from the ocean floor. They analyzed the fossilized shells of a bottom dwelling single celled organisms ( foraminifera ) for specific oxygen and carbon isotope ratios. These isotopes provide valuable information about the properties of the seawater in the Florida Straits at the time when these small shells were formed over the past 35,000 years.\n“Surprisingly, it’s been very, very difficult to get good records of the past variability of the overturning circulation on these time scales,” Lynch-Stieglitz said.\nPrevious studies have examined the influence of Heinrich events on the AMOC, but the results have been conflicting. Most of the previous studies examined carbon isotopes in deep water\nforaminifera . Lynch-Stieglitz’s team used a new approach to the problem by examining the upper part of the overturning circulation. The research team also used computer models to show the sensitivity of the seawater properties at these shallower depths to changes in ocean circulation. “Understanding the controls on and the stability of this circulation system will ultimately help scientists to better assess the AMOC’s vulnerability to future climate change,” Lynch-Stieglitz said. This research is supported by the National Science Foundation (NSF) under award number OCE-0096472, OCE-0648258, and OCE-1102743. Any conclusions or opinions are those of the authors and do not necessarily represent the official views of the NSF. CITATION : Jean Lynch-Stieglitz, et al., \"Muted change in Atlantic overturning circulation over some glacial-aged Heinrich Events,\" ( Nature Geoscience , January 2014). ( http://dx.doi.org/10.1038/NGEO2045 ). Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA @GTResearchNews Media Relations Contacts:\nBrett Israel (404-385-1933) ( brett.israel@comm.gatech.edu )( @btiatl ) or John Toon (404-894-6986) ( jtoon@gatech.edu ) Writer:\nBrett Israel\nAdditional Images\nContact\nBrett Israel brett.israel@comm.gatech.edu 404-385-1933 @btiatl\nEmail\nbrett.israel@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}