{"text": "My Grandfather’s Pen | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMy Grandfather’s Pen\nI hate goodbyes. This is the last time I will address you all as provost of Georgia Tech. There are so many good memories.\nFacebook\nTwitter\nEmail\nBraulio Muñiz, the grandfather of Georgia Tech Provost Rafael L. Bras\nSep 23, 2020\n— Atlanta, GA\nI hate goodbyes. This is the last time I will address you all as provost of Georgia Tech. There are so many good memories. There is such a sense of satisfaction, but at the same time, such a sense of emptiness at the prospect of leaving. I have struggled trying to decide what to write, how to thank so many dear friends and colleagues. Finally, I decided to go back almost 20 years and largely repeat a piece I wrote for another difficult goodbye.\n“Braulio Muñiz was born in 1898, the year of the Spanish-American War. I guess that made this native of Aguadilla, Puerto Rico, a Spanish citizen for a brief instant of time. He joined the U.S. Army at the beginning of World War I. He never saw action because not until the Korean War were Puerto Ricans ‘trusted’ to go to the front — blatant discrimination. With an eighth grade education, he set out to create opportunities. For every two dollars he made, he would save one, send one home, and spend one. No, I have not made an arithmetic error – he managed to make another dollar somehow. Three wars later, he retired in his early 50s with the rank of major.\nI was 2 when my grandfather retired, and for the next 15 years, I became the one boy in his gentler and kinder army. Between trips to the Officers Club beach, the old fortresses of San Juan, and the army base exchange store he taught me a lot. The lessons I learned are the usual suspects, but I learned them by observing him. I learned the value of simplicity and of humility. I learned generosity and how to always (try to) be a gentleman. I learned to always respect those who came before me. I learned patience. I learned the difference between being true to principles and values — and stubbornness. I learned the meaning of honor and keeping my word. I learned about loyalty. I also learned what it means to work very hard.”\nOver the past 10 years as provost, I have tried to act like my grandfather taught me. I know I did not succeed all the time, but I tried hard, even when temptation and provocation made it difficult. Many things will be said, good and bad, false and true. What cannot be denied is that Georgia Tech is now a world-class university and that, together, we have changed the landscape of higher education. It has been 10 wonderful years, and although they have ended less than ideally, in the midst of a pandemic that leaves me without the opportunity to personally express my gratitude and say goodbye to all of you who helped me throughout these years, I would do it all again without hesitation.\n“My grandfather loved to write. I remember his deliberate, slow, and shaky block lettering, filling page after page of poems. They were not literary masterpieces. All were direct, simple statements of emotions and feelings — windows to his life and character. Unfortunately, I do not know where most of those many notebooks of poems are now. But I did inherit two things from him: the joy of writing and his old Parker fountain pen. Many of my most personal newsletter blogs, including this one, have been first written with that pen. The pen and I thank you all for being such a good audience. It’s been fun.”\n— Rafael L. Bras\nAdditional Images\nContact\nSusie Ivy, Director\nInstitute Research and Provost Communications\nEmail\nsusie.ivy@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}