{"text": "Exploring the Role of Gender in Scholarly Authorship Disputes | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nExploring the Role of Gender in Scholarly Authorship Disputes\nThe study, co-authored by Cassidy Sugimoto of the School of Public Policy, raises important issues about the role of gender in scientific research and knowledge production.\nFacebook\nTwitter\nEmail\nCassidy Sugimoto, Tom and Marie Patton Chair in the School of Public Policy.\nSep 02, 2021\n— Atlanta, GA\nA new paper co-authored by Georgia Tech’s Cassidy Sugimoto found that women  — as compared to their male counterparts — receive less credit for the work they put into academic publications, more frequently experience disagreements over authorship, and often end up losing out on opportunities for future collaboration as a result.\nThe paper, published September 1 in\nScience Advances ,\ndescribes the first large-scale examination of gender in authorship disagreements. The findings are drawn from an analysis of 5,575 survey responses from researchers in the natural sciences, medicine, engineering, social sciences, and professional fields.\nAccording to the study, women were significantly more likely than men to report disagreements about who was named on a paper and in the order of authorship. The researchers found this to be particularly true in natural sciences and engineering, where women researchers reported significantly higher rates of disagreement than their colleagues in other disciplines.\n“Authorship is central for the attribution of credit in science,” said\nSugimoto , Tom and Marie Patton Chair in the\nSchool of Public Policy . “This study demonstrates that women do not receive the credit they deserve and that their scientific labor is often devalued. Furthermore, it suggests gendered differences in how research teams allocate credit, suggesting that there are cultural dimensions to the distribution of authorship that should be addressed.”\nIn academic publishing, the inclusion and ordering of names on a journal article is an important marker of productivity and prestige. The first author is typically a junior scholar who is leading the research, whereas the last author is typically a senior author providing funding and supervision for the project.\nAccording to Sugimoto and her co-authors, men and women approach authorship decisions differently, with women more often initiating collaborative authorship discussions early in a project. In contrast, men tend to discuss it at the end, if at all.\nThe disputes that arise from authorship disagreements often result in retribution, the study states. Men were more likely to say they had “engaged in undermining the work of colleagues” following such a dispute. At the same time, women researchers reported that authorship disputes often resulted in fewer opportunities for future collaboration on research projects. Due to limitations of the survey, however, it was unclear whether the respondents were shut out of future collaborations or chose to avoid future work with colleagues with whom they had experienced such a dispute.\nEither way, fewer opportunities for future collaboration are a troubling outcome, Sugimoto said.\n“The isolation of women from scientific teams has strong consequences,” Sugimoto said. “Evidence suggests that sociodemographic diversity leads to innovation and that there are homophilic effects in research, that is, that people tend to study items that relate to their lived experiences. Given this, the chilling effect on collaboration will lead to a constraint on the knowledge produced.”\nThe authors call for standardization in authorship decisions and for universities to provide pathways for researchers to communicate authorship concerns. For instance, Sugimoto said, some senior researchers have begun posting authorship statements for team members as a starting point for discussions.\n“Senior colleagues should discuss authorship openly in their teams at the initiation and throughout the scientific process,” Sugimoto said. “They should signal that they are willing to listen to concerns about equitable attribution of credit and make changes accordingly.”\nOf course, such changes are unlikely to happen overnight.\n“This is a massive shift in scientific culture, where we give greater voice to all members of a lab,” said Sugimoto.\nIn the meantime, Sugimoto suggests junior researchers should speak up.\n“They should advocate for themselves and their peers and seek and build collaborations with greater transparency and equity,” said Sugimoto.\nSugimoto co-authored the paper, “The Gendered Nature of Authorship,” with Chaoqun Ni of the University of Wisconsin-Madison, Elise Smith of the University of Texas Medical Branch, Haimiao Yuan of the University of Iowa, and Vincent Larivière of the University of Montreal.\nIt appears in the September edition of\nScience Advances.\nLarivière received funding from the Canada Research Chairs program (950-231768). The paper was made available for open access thanks to the University of Wisconsin Information School’s Sarah M. Pritchard Faculty Support Fund.\nThe School of Public Policy is a unit of the\nIvan Allen College of Liberal Arts.\nAbout Georgia Tech\nThe Georgia Institute of Technology, or Georgia Tech, is a top 10 public research university developing leaders who advance technology and improve the human condition. The Institute offers business, computing, design, engineering, liberal arts, and sciences degrees. Its nearly 40,000 students, representing 50 states and 149 countries, study at the main campus in Atlanta, at campuses in France and China, and through distance and online learning. As a leading technological university, Georgia Tech is an engine of economic development for Georgia, the Southeast, and the nation, conducting more than $1 billion in research annually for government, industry, and society.\nAdditional Images\nContact\nMichael Pearson\nmichael.pearson@iac.gatech.edu\nEmail\nmichael.pearson@iac.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}