{"text": "New Solar Car Concept Shines at Electronics, Cars Shows | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNew Solar Car Concept Shines at Electronics, Cars Shows\nFord Motor Company, in collaboration with Georgia Tech, debuted a new solar car concept earlier this month at the 2014 International CES in Las Vegas.\nFacebook\nTwitter\nEmail\nThe C-MAX Solar Energi Concept is a first-of-its-kind sun-powered vehicle with the potential to deliver the best of what a plug-in hybrid offers – without depending on the electric grid for fuel. Credit: Ford.\nJan 15, 2014\n— Atlanta, GA\nFord Motor Company, in collaboration with Georgia Tech, debuted a new solar car concept earlier this month at the 2014 International CES in Las Vegas. The C-MAX Solar Energi Concept is a first-of-its-kind hybrid electric vehicle with the potential to free drivers of their dependence on the electric grid. Instead of recharging its battery from an electrical outlet, C-MAX Solar Energi Concept harnesses the power of the sun by parking under a special concentrator that acts like a magnifying glass, directing intensified rays from the sun onto solar panels on the parked vehicle’s roof below. The result is a car that takes a day’s worth of sunlight to deliver the same performance as Ford’s conventional C-MAX Energi plug-in hybrid, which gets combined miles per gallon gasoline equivalent (MPGe), with EPA-estimated 108 city/92 highway/100 combined MPGe. “Ford didn’t just want to build an electric car, but a plug-in hybrid electric car that actually uses green electricity,” said Bert Bras, a professor in the George W. Woodruff School of Mechanical Engineering at the Georgia Institute of Technology in Atlanta. “Just putting photovoltaic cells onto a car is not going to do it, so they reached out to us to help progress the concentrator idea.” The car is continuing its media tour this week at the North American International Auto Show in Detroit. The concept car is a Ford-led collaborative project with Georgia Tech and San Jose, Calif.-based SunPower Corp. Ford and SunPower co-developed the solar panel-based roof specifically for C-MAX Solar Energi Concept. Because of the time that would be needed for conventional solar panels to absorb enough energy to fully charge the vehicle, Ford turned to Prof. Bras’ Sustainable Design and Manufacturing lab at Georgia Tech for ways to amplify the sun light to make a solar-powered hybrid feasible for daily use. His lab helped develop a car port type solar concentrator that uses lenses similar to what lighthouses use to amplify a small light. Special Fresnel lenses in the car-port direct sunlight to the solar panels on the vehicle’s roof, so the concentrator acts “like a magnifying glass, but it’s squished,” Bras said. Grooves in the thin glass reflect the sunlight down to the car, boosting sunlight’s impact by a factor of eight. The patent-pending system tracks the sun as it moves from east to west, drawing enough power from the sun daily to equal an 8 kilowatt hour battery charge. The car's self-parking features can automatically move the car to keep the sunlight focused on the rooftop panels. Bras’s lab modeled the size and dimensions of the concentrator needed to get to 8 kWh per day. That charge is possible in the concept car, but much work remains before this off-the-grid car can hit the streets. “There is more work to do, but the basic principle, can you charge a car with 8 kilowatt hours per day using pure sunlight? Yes, you can,” Bras said. “The next step will be to test it in practical situations.” By using renewable power, Ford estimates that the C-MAX Solar Energi Concept will reduce the annual greenhouse gas emissions (GHG) from a typical car owner by four metric tons. Internal Ford data suggests the sun could power up to 75 percent of all trips made by an average driver in a solar hybrid vehicle. This could be especially important in places where the electric grid is underdeveloped, unreliable, expensive and dirty. “We like to do these concepts that push the boundaries, like Ford does also,” Bras said. “They want to boost sustainability and get off of the electricity power grid. That’s what we’re really after.” Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contacts:\nBrett Israel (404-385-1933) ( brett.israel@comm.gatech.edu ) or John Toon (404-894-6986) ( jtoon@gatech.edu ) Writer:\nBrett Israel\nAdditional Images\nContact\nBrett Israel 404-385-1933 brett.israel@comm.gatech.edu\nEmail\nbrett.israel@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}