{"text": "Common Probiotic Bacteria Could Help Boost Protection Against Influenza | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nCommon Probiotic Bacteria Could Help Boost Protection Against Influenza\nA newly funded research project might one day lead to the development of a pill or capsule able to boost the effectiveness of traditional vaccines against influenza\nFacebook\nTwitter\nEmail\nThis illustration depicts a 3D computer-generated rendering of a whole influenza (flu) virus, rendered in semi-transparent blue, atop a black background. The transparent area in the center of the image, revealed the viral ribonucleoproteins (RNPs) inside. (Credit: CDC/ Douglas Jordan)\nSep 06, 2023\nResearchers at the Georgia Institute of Technology (Georgia Tech) have received funding to study the concept of using modified strains of probiotic bacteria – that are already part of the human gut microbiome – to stimulate the formation of antibodies against the flu virus in the body’s mucosal membranes. Respiratory viruses like influenza infect the body through mucosal membranes, and the proof-of-concept project will help evaluate whether snippets of influenza proteins – tiny fragments of the virus – could be added to two common bacterial strains to create the antibody response. Antibodies in the mucosal membranes might then complement those created by traditional intramuscular injections to head off flu infection.\nThe research, supported by the\nAir Force Research Laboratory\n(AFRL), will study whether or not the harmless bacteria can be successfully modified to carry snippets of a viral coat protein that could stimulate the desired response in mucosal membranes lining the gut. Beyond reducing influenza infection in the general population, improved protection against the flu could have a significant impact on the U.S. military, which wants to provide the best possible protection for its warfighters to reduce possible impacts on readiness and training from influenza outbreaks.\nAt Georgia Tech, the project is a collaboration between researchers at the Georgia Tech Research Institute (GTRI) and the Georgia Tech\nSchool of Biological Sciences . All of the research at Georgia Tech will be done using BSL-2 facilities designed for this type of study. The award does not include research on animals or humans.\n“Ultimately, this could one day make vaccination programs much more effective,” said Michael Farrell, a GTRI principal research scientist. “This isn’t going to be a replacement for flu vaccines as they currently exist, but it could act as an adjuvant – something that’s done in addition to vaccination to increase the overall immune response. To benefit from it, you might take a pill like you do with probiotics now.”\nUsing Common Probiotic Bacteria as Vehicles\nThe project will focus on two common probiotic bacteria:\nEscherichia coli\n– a gram-negative bacterium better known as\nE. coli\n– and\nLactococcus lactis , a gram-positive bacterium found in cheese, buttermilk, and other dairy food items. The researchers will attempt to coax the bacteria to express the influenza virus’ Hemagglutinin (HA) receptor protein on their outer cell surface. There, the protein would stimulate an antibody response in the gut mucosal membrane as it passes through the body’s gastrointestinal tract.\n“We’re using some well-established probiotic bacteria that have been utilized for dozens of years, are well vetted and safe for humans,” said\nBrian Hammer , an associate professor in the School of Biological Sciences who specializes in bacterial genetics. “Ultimately, the idea is to use these bacteria as a chassis to create living vaccines, since the body already tolerates them both well.”\nResearchers at AFRL and Georgia Tech envision that a single pill or capsule would carry the bacteria into the gastrointestinal tract to provide the necessary antibody stimulation. The bacteria would be modified so they could not reproduce, preventing them from becoming part of the body’s gut microbiome – a diverse collection of bacteria that live in the body and help carry out specific functions, including metabolizing food and modulating the immune system.\n“We know the human microbiome is intimately involved in human health and disease, influencing processes in ways that have both positive and negative outcomes for us,” said Richard Agans, senior research biological scientist at the U.S. Air Force School of Aerospace Medicine (USAFSAM). “Recently, we have started to better understand how the microbiome communicates with our bodies and how we can identify, target, and promote the beneficial aspects. Currently, we are working to determine how to utilize these microbial communities to better protect our warfighters as well as the general public.”\nOvercoming Challenges of Manipulating Bacteria\nHammer’s lab specializes in manipulating proteins of organisms such as bacteria and viruses to create novel fusions. Among the techniques available is the new CRISPR-Cas, the gene-editing technology that was the subject of a Nobel Prize in 2020, but other more traditional techniques may also be used to get the influenza surface protein where the researchers want it to be.\nAmong the challenges ahead is that adding a new component to bacterial organisms can be difficult.\n“In general, bacteria have evolved with the genetic components they need to survive,” Farrell explained. “If you add something else, they may just kick it out. It’s very hard to find a neutral location in the bacterial genome where we can stably add new functionality. This is especially true for this effort, in which there will be no cointroduction of antimicrobial resistance markers.”\nIn addition, the probiotic bacteria strains that are widely used in research as model organisms, or “lab rats,” are adapted to living in laboratory conditions. This project, however, will use natural commensal strains that co-exist in humans. That approach may make it even more challenging to add the appropriate material for expressing the viral proteins on the bacteria cell surfaces, Hammer said.\n“We used to perceive that genes could be shuffled around in the bacteria without much effect on them, but we’re learning now that location really matters,” he said. “One of the concerns is that tools that work on the ‘lab rat’ versions of these bacteria will not be as readily accepted by these commensals.”\nAs part of the project, the researchers will have to show that the addition of the protein doesn’t cause instability in the bacteria, and that the modified bacteria generate the correct response when exposed to human immune cells in culture.\nProof of Concept Could Lead to Broader Vaccine Therapies\nBeyond its importance to the military, influenza was chosen to study this adjuvant approach because a number of vaccines exist for this virus, and they have been well studied over the years. If this approach works with influenza, the combination of pill and injection might be useful for vaccines against other respiratory viruses.\n“If this is ultimately successful, it could be the first foray into showing that these vehicles, these probiotics, could potentially be scaled up for lots of different therapeutic uses,” said Hammer. “By customizing the cargo, this approach could be rapidly adapted to address new and emerging threats that may arise in the future.”\nProject Provides Student Opportunity\nThe two-year project life was chosen because of the expected difficulty – and because another of its goals is to train a master’s degree student in the bacterial modification techniques being utilized.\nThe Georgia Tech researchers have chosen an underrepresented minority student who holds an undergraduate degree in biology from Kennesaw State University and has worked in a commercial DNA laboratory. Katrina Lancaster will begin work on this project during fall semester, collaborating with both Hammer and Farrell – and the students and other researchers in their labs.\n“This student will have excellent opportunities, not only to learn the skills in the lab and take the coursework, but also to develop a rich network of connections, both in the School of Biological Sciences and at GTRI, that will be helpful in moving forward and advancing their career,” Hammer said. “It’s a really beautiful combination of components for this project.”\nThe project is funded through the AFRL’s Minority Leaders Research Collaboration Program (ML-RCP).\n“Partnering with academic institutions, such as GTRI, presents great opportunities for our team to interact and work with top minds in these fields to develop better outcomes for everyone,” Agans said. “We are especially grateful for the opportunity to mentor and provide opportunities for underrepresented students with STEM aspirations. We are excited to work with GTRI in this endeavor and envision this being just the first step.”\nUSAFSAM is part of the Air Force Research Laboratory’s 711th Human Performance Wing.\nWriter: John Toon (john.toon@gtri.gatech.edu)\nGTRI Communications\nGeorgia Tech Research Institute\nAtlanta, Georgia\nThis story first appeared in the\nGTRI newsroom .\nAdditional Images\nContact\nJess Hunt-Ralston\nDirector of Communications\nCollege of Sciences at Georgia Tech\nEmail\njess@cos.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}