{"text": "Advanced Technology Development Center to host $100K FinTech Hack @ ATDC | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nAdvanced Technology Development Center to host $100K FinTech Hack @ ATDC\nHackathon seeks those drawn tackling challenges, problem solving, or the idea of creating the next great unicorn in financial technology (FinTech).\nFacebook\nTwitter\nEmail\nThe Advanced Technology Development Center (ATDC) at Georgia Tech is hosting its second-ever FinTech Hack @ ATDC competition from Feb. 10 through Feb. 12. Participating teams will compete be for cash, gadgets, and professional-services prizes valued at approximately $100,000. The grand prize winning team will receive a prize package valued at approximately $79,000, which includes $12,000 cash.\nJan 25, 2017\n— Atlanta, GA\nThe Advanced Technology Development Center (ATDC) at Georgia Tech is hosting its second-ever\nFinTech Hack @ ATDC\ncompetition from Feb. 10 through Feb. 12.\nThe competition is sponsored by Atlanta-based Worldpay US — the global payments technology and services company and creator of ATDC’s FinTech Program — and Columbus, Georgia-based TSYS — a leading global payment solutions provider. ( REGISTER HERE )\nParticipating teams will compete for cash, gadgets, and professional-services prizes valued at approximately $100,000. The grand prize winning team will receive a prize package valued at approximately $79,000, which includes $12,000 cash.\nA program of the Georgia Institute of Technology, ATDC is the state’s technology incubator. This year’s theme centers on the Internet of Things, specifically, wearable financial technology (FinTech). The competition is designed to bring together entrepreneurs, developers, designers, and innovators who thrive on tackling challenges, solving problems, and working in teams to create the next big disruptive FinTech idea.\n“Georgia is the nation’s payments processing capital, and we have a deep pool of talented people who have innovative ideas,” said Michelangelo Ho, ATDC’s FinTech catalyst and head of the incubator’s FinTech Program. “Bringing them together in this competition and in partnership with two FinTech industry leaders, Worldpay US and TSYS, will create an environment for some truly dynamic ideation and potentially innovative startups.”\nThe competition, which will be held at the Centergy building in Atlanta Technology Square, is an extension of ATDC’s FinTech Program, which was launched in 2015 via a $1 million gift and executive mentorship from Worldpay US to Georgia Tech. The idea behind the initiative is to foster high-tech innovation and to attract and retain talent in Georgia and its “Transaction Alley,” which processes more than 70 percent of all U.S. payment transactions.\n“Enabling payments disruptors to disrupt has always been at the core of our values as a business and the ATDC FinTech Program, and the hackathon is a unique opportunity for developers to experience firsthand the breadth, depth, and simplicity of our\nsingle integration technology ,” said Worldpay US Vice President of Innovation and Design Joe Kleinwaechter. “Worldpay could not be more excited to return to the FinTech Hack as a sponsor, and we’re sure the Internet of Things solutions this year’s competitors create will be boldly breakthrough.”\nThe team winning the grand prize will receive the critical post-hack engagement, mentoring, and support from the ATDC, Worldpay US, TSYS and others to create, build, and launch viable startup companies.\nParticipants will decide which ideas to tackle using sponsors’ APIs. They can work on their own projects or work on challenges presented to them by the hackathon sponsors.\n“We're thrilled to support the ATDC as a sponsor of the FinTech Hack. We believe our platform will align perfectly with the kind of unique thinking and innovation we’ll see over the course of the weekend,” said Scott Carter, TSYS’ group executive of Digital Innovation. “At TSYS, we put people at the center of payments and look forward to connecting with like-minded industry peers.”\nATDC will post updates and more information in the coming weeks on\natdc.org ,\nFacebook , and\nTwitter , but here are some key dates to remember:\nJan. 27: Challenges announced\nFeb. 8:  API video tutorials released\nFeb. 10-12: FinTech Hack @ ATDC\nAbout ATDC:\nThe Advanced Technology Development Center (ATDC) is one of the longest running and largest university-based startup incubators in the country. Founded in 1980, ATDC has graduated more than 160 companies from its ATDC Signature program. To date, those companies have attracted roughly $2 billion in investments. The ATDC Financial Technology (FinTech) Program powered by Worldpay US was established in 2015 to attract and accelerate entrepreneurs and startups in that sector from across the state. ATDC, which also has programs in Savannah, Athens, and Augusta, is a unit of the Enterprise Innovation Institute, the chief economic development arm of the Georgia Institute of Technology. For additional information about ATDC and the ATDC FinTech Program, visit\natdc.org .\nAbout Worldpay\nWorldpay is a leading payments company with global reach. It provides an extensive range of technology-led payment products and services to more than 400,000 customers, enabling their businesses to grow and prosper. The company manages the increasing complexity of the payments landscape for its customers, allowing them to accept the widest range of payment types around the world. Using Worldpay’s network and technology, the company processes payments from geographies that cover 99 percent of global GDP, across 146 countries and 126 currencies. It helps its customers to accept more than 300 different payment types. For more information, visit worldpay.com.\nAbout TSYS\nTSYS unlocks opportunities in payments for payment providers, businesses, and consumers. Headquartered in Columbus, Georgia, the company operates in more than 80 countries with local offices across the Americas, Europe/Middle East/Africa, and the Asia-Pacific region. The company provides seamless, secure, and innovative solutions across the payments spectrum — from issuer processing and merchant acquiring to prepaid program management — delivered through partnership and expertise. For more, visit us at\ntsys.com .\nAdditional Images\nRelated links\nATDC\nATDC FinTech Program\nWorldpay US\nTSYS\nContact\nFor media inquiries, contact:\nLaura Diamond\n404.894.6016\nlaura.diamond@gatech.edu\nFor information about ATDC FinTech, contact:\nMichelangelo Ho\n404.894.3575\nmichelangelo@atdc.org\nEmail\nperalte.paul@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}