{"text": "Morzine Medical to help military on the battlefield | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMorzine Medical to help military on the battlefield\nThe Doak Table is a portable field surgical table has been tested and used worldwide\nFacebook\nTwitter\nEmail\nMark W. Trimble, managing principal of Morzine Medical, stands next to the Doak Table folded. The tables are used in surgical procedures out on the battlefield by the U.S. Army and Navy and can be put together in less than a minute.Photo Credit: Morzine Medical\nOct 20, 2014\n— Atlanta, GA\nThe Doak Table was created in a Baltimore garage in 2006 by a tinkering retiree equally at home in a boardroom or a machine shop. Today, the portable field surgical table has been tested and used worldwide by U.S. Army and Navy far forward surgical teams. And, along with his two partners, the Marietta entrepreneur who saw its potential and formed a company in 2013 to buy the rights to commercialize it has inked his biggest deal yet: a seven-figure contract with the U.S. military. “We’ve gone from a garage in Baltimore to this substantial order,” said Mark W. Trimble, managing principal of Morzine Medical. “This is a game-changer for Morzine.  It is also an acknowledgement that the Doak Table is the benchmark for a mobile, lightweight and compact operating platform.” By year’s end, the Atlanta-based company he runs projects construction of 70 of these lightweight, but sturdy surgical tables designed to be used in non-traditional medical care settings, such as the battlefield or in the aftermath of a catastrophic event.  The Doak Table — named for the inventor’s father, a military surgeon — will be used as the standard operating table for all the far forward surgical teams in one branch of the military.  Trimble believes that it is only a matter of time before the other branches adopt the Doak Table as well. These surgical teams are formed to stabilize and resuscitate soldiers with life- or limb-threatening injuries — wounds so severe they need immediate treatment and can’t wait to be brought to a military hospital.  “They don’t have the luxury of time, so the critical issue we sought to address was, ‘how do we get the care closer to where they are,’” said Trimble, a Georgia Tech graduate (bachelor’s in economics, 1989, and a master’s in management, 1992). The Doak Table, which weighs between 41 and 45 pounds, can open from its folded dimensions of 41”-x-12”-x-15” to full use in less than one minute. That’s quite a differentiator for the no-assembly-required Doak Table, compared with competitors’ models that can take up to 30 minutes to put together. With no loose pieces to put together and a design that can hold up to 600 pounds, the Doak Table allows surgeons to focus on saving lives without worrying about one of their most important tools: a stable platform with all the functionality of a standard operating table found inside hospitals. “Having an operating table that could make a genuine difference in helping save soldiers’ lives was critically important to us,” Trimble said. In 2012, the\nJournal of Trauma and Acute Care Surgery\npublished a study that found over a 10-year period, roughly a quarter of U.S. servicemen and women killed in action — 1,000 soldiers — died from wounds that they might have survived with implementation of more advanced battlefield care and protocols. Morzine is a member company of the Advanced Technology Development Center (ATDC), an incubator of business startups at Georgia Tech’s Enterprise Innovation Institute (EI 2 ). EI 2 , through its various programs, is charged with spurring economic development across the state and helping entrepreneurial startups such as Morzine grow and thrive. ATDC, Trimble said, helped prepare his company to be able to meet the military’s goals and objectives. “With Georgia Tech’s help, we’re in a position to supply the U.S. military with Doak Tables and in sufficient quantities to allow it to be the standard operating table in far forward surgical hospitals.” Indeed, the Georgia Manufacturing Extension Partnership (GaMEP), another EI 2  arm that focuses on strengthening the state’s manufacturing sector, helped Morzine find an aerospace machine company — headquartered in Cobb County — that could build the tables to the exact required specifications. Bill Ritsch, GaMEP’s North Metro Atlanta region manager, connected Morzine with a short list of companies across the state that met its needs, helping to get rapid, scaled production faster. “They accelerated the process because we were able to tap into their knowledge,” Trimble said, adding Ritsch’s help also made it easier for the company to get face time with manufacturers that might otherwise be leery of a startup. Ritsch said the process of helping a startup with a production need find a manufacturing partner in-state was seamless. “It’s awesome whenever we can do that,” Ritsch said. “That’s the whole goal.” Another important principle for Morzine was that all of the parts used to manufacture the operating tables be made in America. What’s more, aside from a small number of parts made in Maryland and South Carolina, the entire table is fabricated and assembled in Georgia.\nAdditional Images\nContact\nLaura Diamond  Georgia Tech Media Relations 404-894-6016\nEmail\nlaura.diamond@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}