{"text": "GTRC Introduces Contract Continuum | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGTRC Introduces Contract Continuum\nResearch. It’s what’s at the heart of Georgia Tech, and the Georgia Tech Research Corporation (GTRC) sustains that heartbeat by serving as the contracting entity for the Institute’s externally funded research projects.\nFacebook\nTwitter\nEmail\nThe Contract Continuum recently introduced by GTRC’s Office of Industry Engagement is designed to simplify the process of research collaboration between industry and Georgia Tech.\nDec 09, 2013\n— Atlanta, GA\nResearch. It’s what’s at the heart of Georgia Tech, and the Georgia Tech Research Corporation (GTRC) sustains that heartbeat by serving as the contracting entity for the Institute’s externally funded research projects. Below, GTRC’s Vice President of Research Jilda Garton talks about the Contract Continuum, a mechanism introduced by GTRC’s recently established Office of Industry Engagement to make it easier for industry and university researchers to engage at any point in the R&D process — from early-stage research to product launch.\nTell us about the Office of Industry Engagement.   It was created by merging the functions of technology licensing, industry contracting, and international collaborations. Organized into three offices: Innovation Commercialization; Industry Collaborations and Affiliated Licenses; and International Contracts and Technology Transfer, Industry Engagement allows for better alignment of contract administration activities and intellectual property expertise. This synergy increases the efficiency of the negotiation process and expedites the time to contract. Could you explain the Contract Continuum?   The Contract Continuum is a collection of four research contracts: Basic Research, Applied Research, Demonstration, and Specialized Testing. These contracts simplify collaboration between Tech and industry — at all R&D stages — streamlining the contracting process for industry and for our researchers by providing appropriate terms and conditions upfront based upon the research needed. So, working with the principal investigator to determine the type of research to be performed as well as the facilities to be used, a contracting officer determines which of the four contracts in the Continuum is appropriate. In some cases, all four agreement types may be necessary; it just depends on the relationship with the sponsor and the outcome desired. What makes the Contract Continuum attractive to industry?\nOur established terms and conditions for intellectual property definitively address needs that industry has expressed about: having access to the intellectual property generated from the research; excluding competitors from access to that intellectual property — in the particular field of use — on a fair and reasonable basis; and incurring a financial risk that is reasonable. Additionally, our agreements align with industry’s R&D process. Why should faculty be excited about the Contract Continuum?\nIt was designed to provide our researchers the greatest amount of flexibility in both the type of research that can be performed and the facilities that can be used for research. It allows the principal investigators to pursue transformative research that may not have otherwise taken place. While our industry partners are assured of intellectual property exclusivity, at the same time, we’ve preserved our opportunities for entrepreneurship in other fields of use. This is how, for instance, we have seen results from jet engine research lead to advances with cardiac devices. Since the Contract Continuum was introduced in March, what benefits have you seen?\nWe’ve been able to efficiently finalize negotiations that, in the past, would have been protracted or not have materialized. In several recent negotiations, for example, Tech was able to quickly develop a coordinated agreement, allowing the sponsor and our researchers to engage in projects across different schools and GTRI — funded by different business units of the sponsor, and throughout the research spectrum — all without the need for legal review on a project-by-project basis. What do faculty need to understand about efficiently using the Contract Continuum?\nEven with its increased flexibility and transparency, the Continuum must still operate within the framework of Institute policies, state laws, and federal regulations. So, it’s extremely important for researchers to work with their contracting officer early in the proposal process. Industry Engagement offers informational courses for various stakeholders in the research process and will visit any school, department, or lab to provide an overview.\nAdditional Images\nRelated links\nIndustry Engagement\nContact\nBrigitte Espinet Institute Communications\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}