{"text": "humanTech Symposium Identifies Opportunities, Challenges for Humanities at Technological Universities | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nhumanTech Symposium Identifies Opportunities, Challenges for Humanities at Technological Universities\nPaula M. Krebs, executive director of the Modern Language Association, spoke along with other humanities scholars.\nFacebook\nTwitter\nEmail\nPaula M. Krebs, foreground, executive director of the Modern Languages Association, answers a question during the humanTech symposium on humanistic perspectives at technological universities at the Renaissance Hotel Midtown on April 19, 2019. Anna Stenport, chair of the School of Modern Languages, background, and Richard Utz, chair of the School of Literature, Media, and Communication, foreground, listen.\nApr 24, 2019\n— Atlanta, GA\nBy Michael Pearson\nHumanities scholars found both inspiration and shared challenges at the School of Literature, Media, and Communication’s (LMC) humanTech symposium, held April 19–20, 2019.\nThe\nsymposium\nwas meant to focus the discussion about what it means to be a humanist at a technologically oriented university such as the Georgia Institute of Technology, said\nRichard Utz , chair and professor in\nLMC .\n“While our participants had work experience at large research institutions, small engineering oriented colleges, and traditional universities with strong science and technology sectors, it became clear very quickly that we didn’t need to switch codes to understand our most important opportunities. They were the same,“ he said. “Terms like innovation, interdisciplinarity, partnership, integration, and collaboration, were front and center among all presentations and responses.”\nPresentations and discussions also identified similar challenges, including funding disparities between the humanities and the STEM fields and a traditional view from both humanities and STEM-based scholars that each group is part of a separate academic world.\nDespite such challenges, Paula M. Krebs, executive director of the Modern Language Association, noted during her opening address to the symposium how many tech firms and even the Columbia University Medical School, which offers a program in “narrative medicine,” are embracing the skills provided by a humanities education and applying them to technical and scientific disciplines.\n“If those graduates are better doctors for studying the humanities, what would a better engineer who is fully engaged in the humanities look like?” Krebs asked.\nAs it happens, they might look something like many Georgia Tech students, who study or intern abroad at much higher levels than the national average and half of whom voluntarily choose to study a foreign language, compared to 8 percent nationally.\nThe\nIvan Allen College of Liberal Arts , LMC, and the School of Modern Languages also are leading in the fields of language and cultural studies, as Krebs noted.\n“Georgia Tech itself is a leader in connecting language and education with career possibilities at the undergraduate and graduate levels,” she said. “The graduate program in\nGlobal Media and Cultures , for example, is the kind of program that makes clear the career value of language study.”\nThat degree, a joint offering of\nLMC\nand Modern Languages, and also the Master of Science in\nApplied Language and Intercultural Studies\nin the School of Modern Languages, are both meant to give students rigorous training in communication and global leadership, preparing them for careers in international business, non-profits, media, social justice, and education.\nOther initiatives are under way at Georgia Tech to help prepare humanities students for interdisciplinary careers in a changing workforce.\nLMC and Modern Languages also each have post-doctoral programs for recent humanities graduates. LMC’s Brittain Fellows program seeks Ph.D. graduates with an interest in “digital pedagogy and the cultural studies of science and technology,” while LMC’s Global Languages, Cultures, and Technologies program seeks to foster collaboration across languages, technologies, and global cultures.\nBoth schools, and faculty from across Ivan Allen College, also are actively engaged in a number of Vertically Integrated Research (VIP) research projects, meant to give undergraduate students the opportunity to participate in meaningful, often interdisciplinary, research projects.\nSuch program are the product of a spirit of “radical interdisciplinarity” among humanities scholars at Georgia Tech that has allowed such programs to flourish, said\nAnna Stenport , professor and chair in the School of Modern Languages\n“I am very happy and proud to be able to say that there is no crisis of the humanities at the Georgia Institute of Technology,” she told the symposium.\nFor Utz, the symposium was just the beginning.\n“This symposium can only be a first step toward future additional conversations, and the School of Literature, Media, and Communication, together with our partners, will take a lead role in continuing what we started this year,” he said.\nAnother humanities-related symposium occurred April 25-27.\nThe Atlanta Global Studies Symposium  focused on global, regional, and international studies and the United Nation’s Sustainable Development Goals. Discussion centered on collaboration among institutions of higher education, the public and the community, and the K-12 sector in the Atlanta region and beyond through education, research, and outreach.\nAdditional Images\nRelated links\nIsolation to Integration: Finding multidisciplinary collaboration for humanitie…\nContact\nMichael Pearson\nmichael.pearson@iac.gatech.edu\n404.894.2290\nEmail\nmichael.pearson@iac.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}