{"text": "The Latest in Campus Construction | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nThe Latest in Campus Construction\nThe progress of campus construction keeps a steady pace year-round. Below is a status update of campus projects.\nFacebook\nTwitter\nEmail\nPhase I of Science Square, which includes the Science Square Labs building, the apartment community, and a new parking deck, are all on schedule to be completed in March 2024.\nPhoto courtesy of Aerial Innovations Southeast.&nbsp;\nAug 28, 2023\nThe progress of campus construction projects keeps a steady pace year-round. Whether it is site preparations, interior renovations, infrastructure improvements, or large, philanthropy-driven facilities projects, the Georgia Tech built environment continuously evolves to support the needs of a growing and vibrant campus community.\nAs these construction projects move forward, the planning arm of the Planning, Design, and Construction department has been working for the past year with a cadre of consultants to plan for the future of the Georgia Tech campus and is close to finalizing a Comprehensive Campus Plan (CCP). This living document will inform how campus space can be utilized to support the growing and changing campus community for the next 10 years and beyond.\n“We are excited for the upcoming reveal of the Campus Comprehensive Plan,” said Vice President of Infrastructure and Sustainability Maria Cimilluca. “Our team has worked collaboratively to create a thorough framework for future development. The Campus Comprehensive Plan is in its final stages, and we look forward to sharing it with the campus community in September.” Visit the CCP\nwebsite\nto learn more.\nBelow is an update on some of the current construction projects on campus.\nSoon to Wrap Up\nNational Pan-Hellenic Council – Divine Nine Plaza\nThe Divine Nine are the nine historically Black fraternities and sororities that comprise the National Pan-Hellenic Council. Construction is underway for a plaza area with nine distinct circular gathering spaces with seating, landscaping, and permeable pavers. Located adjacent to the John Lewis Student Center parking deck, the plaza will include an 820-square-foot amphitheater. Barring weather delays, the site should be available to enjoy in October. View the construction\nwebcam\nhere.\nGeorgia Tech Veterans Walk of Honor\nThis tribute project, located outside the Veterans Resource Center, will honor all Georgia Tech alumni, students, and staff who have served in the United States armed forces. The walkway leading to the Veterans Resource Center will feature granite inlays and mounted wall plaques recognizing the six branches of the military. Each inlay will include a portion of Morse code representing the individual branch’s slogan or motto. Adjacent elevated signage will display the core values of military service: honor, courage, commitment, respect, duty, valor, service, and integrity. An upper plaza reflection area includes an American flag overlooking Griffin Track and McCamish Pavilion, with the city skyline in the distance. The project is scheduled for completion in late 2023.\nLibrary Interactive Media Zone\nLocated on the Grove Level of the Price Gilbert Memorial Library, this project features a 40-foot curved landscape screen and 10 interactive tablet stations allowing users to view three modes of content: digital exhibit, pop-up lecture, and hero mode. The digital exhibit will feature pre-planned animations and live data. The pop-up lecture will allow faculty and visiting experts to hold short-form, impromptu lessons, and the hero mode will facilitate digital signage about activities and events on campus. The project is currently under construction, with completion slated for late September or early October.\nRead more here .\nIn Progress\nD.M. Smith Building Renewal\nRenovations will include several upgrades to the building’s infrastructure, including strengthening compliance with the Americans With Disabilities Act by creating a permanent wheelchair access feature and adding an elevator. New mechanical, electrical, and plumbing systems will increase comfort, as well as the building’s energy efficiency. A virtual lab and hoteling space will be created for members of the School of Public Policy. All proposed changes will respect the historical character of the building, and renovations will be completed by mid-2025.\nEast Campus Streetscape\nRenovation of sidewalks and roadways on the east side of campus is underway to improve pedestrian and micro-mobility (lightweight, single-person vehicles such as bicycles, scooters, and skateboards) access while supporting the Institute’s safety, connectivity, and carbon neutrality goals. The heavy volume of campus traffic in this area requires careful attention to safety and accessibility. Improvements to sidewalks, bicycle infrastructure, and lighting will align with paving, new curbing, and reconfigured access to the parking deck for alternative-mode routes. All updates will cohesively coordinate with the campus bus systems. A phased construction approach is planned, with phase one underway on Fourth Street, Brittain Drive, and areas adjacent to Peters Parking Deck. Phases two and three will address Techwood Drive in 2024.\nProgressive Workplace Pilots\nProgressive Workplaces are defined by Georgia Tech as solutions to align space with the working styles of specific campus offices or departments resulting in a carefully curated combination of individual and group work, meeting, and collaboration spaces. The intent of these flexible and progressive designed environments is to foster engagement, innovation and improve space utilization and satisfaction. Currently, multiple pilot projects are under construction across campus.\nOne pilot includes the offices of the General Counsel and Internal Auditing, two distinct departments, each with about 90 employees. Their space in the 760 Spring St. building in Tech Square was recently renovated from a traditional configuration of assigned, enclosed, individual offices accommodating about 42 employees. The renovated space now offers a flexible, progressive workspace that accommodates 90 employees within the same amount of square footage as their original space.\nUsing the latest in scheduling technology, the workplace pilots offer reservable space in either private offices or open desk areas with the flexible amenities of both open and enclosed collaboration and meeting spaces. Each space houses a multipurpose hub, allowing for impromptu gatherings and encouraging employee interaction. These pilots will be measured through qualitative satisfaction surveys, and the collected data will inform future strategic space planning projects throughout the campus community.\nScience Square\nAn 18-acre biomedical research and technology community is under construction just off North Avenue near Northside Drive. Phase one includes Science Square Labs, a 13-story lab and office tower that will feature clean rooms, labs, and research space, as well as affordable housing and ground-floor retail space. Phase one is scheduled to be completed by March 2024. BioSpark Labs, located in Science Square, has completed phase two construction of 10 private labs, one shared lab, cell culture and bacterial procedure rooms, and shared equipment areas. The labs are fully furnished and available for lease. This development will expand biotech and life science research and help revitalize and nurture new opportunities on Atlanta's west side. Learn more about\nScience Square\nand\nBioSpark Labs .\nTech Square Phase 3\nPhase three of Tech Square will include about 415,000 square feet of academic and research space within two high-rise towers. The 14-story Scheller Tower will house the MBA and Executive Education programs for the Scheller College of Business and is named in recognition of the generous philanthropic commitment of Roberta and Ernest Scheller Jr., IM 1952, HON Ph.D. 2013. The 18-story George Tower, named to recognize Penny and Bill George, IE 1964, HON Ph.D. 2008, for their integral support for the facility will be the new home for the H. Milton Stewart School of Industrial and Systems Engineering. A large plaza and retail space are planned for the street level. Site fencing will be installed soon, and construction is slated to begin in September. The projected occupancy date is early 2026.\nRead more here .\nComing Soon\nAerospace Engineering Aircraft Hangar\nThe Aircraft Hangar facility is in the North Avenue Research Area next to the Techway building complex. This project will primarily focus on creating a facility to design, assemble, and house small aircraft for research in the Daniel Guggenheim School of Aerospace Engineering. The facility will be approximately 10,000 square feet and feature a high bay with a mezzanine level. Site work will begin in late fall, with an expected completion date of early 2025.\nFerst Drive Realignment and Cycle Track\nThis project will address the realignment of Ferst Drive at Regents Drive, which will allow the elimination of the traffic signal and enable connectivity to the planned bicycle infrastructure southwest of campus. A cycle track will be installed along Ferst Drive, providing improved safety and separation between bicycles and buses at the bus stops. This project is in the design phase, with completion slated for fall of 2024.\nOn the Horizon\nStudent-Athlete Performance Center\nThe 100,000-square-foot facility will be built in the footprint of the current Edge Center in the northeast corner of Bobby Dodd Stadium. The Center will house strength and conditioning space, nutrition areas, sports medicine offices, ticket sales, dining, and academic support space. It will also include state-of-the art sport science and analytics and provide balcony views of Midtown Atlanta. The project is in the design approval stage, with an estimated completion date of early 2026.\nNew Residence Hall\nThe first new residence hall on campus since 2005, this project is currently in the design phase. This new facility for first-year students will be on the west side of campus along Northside Drive between Eighth and Ninth streets. The 191,000-square-foot building will contain approximately 860 beds with rooms configured for double -occupancy with the flexibility for students to customize, or rearrange, the in-room furniture layout. Each bedroom will have individualized climate control. Student support areas will include collaborative learning spaces, community lounges, and group kitchens. Completion is slated for August 2026.\nRead more here.\nAdditional Images\nContact\nCatherine Brim\nCommunications Officer II\nInstitute Communications | Infrastructure and Sustainability\nEmail\ncathy.brim@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}