{"text": "Keysight Technologies coming to Technology Square | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nKeysight Technologies coming to Technology Square\nKeysight Technologies joins Georgia Tech's innovation ecosystem\nFacebook\nTwitter\nEmail\nGeorgia Tech's Technology Square is home to a growing innovation ecosystem of startup companies, innovation centers from established companies and research from Institute students, faculty and staff.\nMay 18, 2016\n— Atlanta, GA\nGov. Nathan Deal today announced that Keysight Technologies, a leading provider of electronic design and test software, equipment, and services, will expand the company’s presence by opening an operation in Atlanta. This project will create more than 200 software engineering jobs and represents an investment of $13.9 million. “Georgia’s workforce is among the best in the country. Their talents and skills, paired with Georgia’s existing technology infrastructure, offer valuable resources for innovative and growing high-tech companies,” said Deal. \"Keysight Technologies’ decision to establish a presence in Atlanta speaks to Georgia's status as a thriving hub for the technology industry. The strength of our higher education system and Keysight’s partnership with Georgia Tech further bolster this status.\" Keysight produces electronic measurement instruments and systems, and related software and services that are used in the design, development, manufacture, installation, deployment and operation of electronics equipment. “We are excited by the opportunities and innovation that our new software development center will generate,” said Keysight president and CEO Ron Nersesian. “Georgia Tech has one of the best engineering programs in the country, and its students bring with them skills and capabilities that will be a great asset to Keysight. We believe that the education, inquisitiveness and enthusiasm of this new team, under Keysight leadership, will incubate ideas and solutions that will fuel a wide range of next generation technology innovations.” The company, a byproduct of Agilent Technologies, is headquartered in Santa Rosa, Calif., with major U.S. sites in California and Colorado, as well as other locations around the world. Keysight will be looking to hire software engineers and managers in Atlanta. \"I am excited that Keysight Technologies will be one of the first companies to call the high-performance computing center at Georgia Tech home. This is another victory for the City and Invest Atlanta in attracting more companies and establishing Atlanta as one of the fastest growing innovation centers in the United States,” said Mayor Kasim Reed. “Over the past several years, Midtown has been a growing epicenter of innovation for not only Atlanta, but for the entire Southeastern region, and we are confident that trend will only continue.\" Keysight has had a long-standing relationship with the Georgia Institute of Technology. Keysight CEO Ron Nersesian serves on Georgia Tech President G. P. “Bud” Peterson’s advisory board, and Georgia Tech was a leading factor in Keysight’s decision to establish an operation in Georgia. “One of the most attractive aspects of the innovation neighborhood we have created in Tech Square is not just the number of startups, but also the many Fortune 500 companies opening a presence there. Keysight Technologies is a perfect example - Keysight’s legacy includes Hewlett-Packard, and most recently Agilent Technologies, and they want access to the technologies and talent at Georgia Tech,” said Peterson. “Georgia Tech, in partnership with the Governor’s Office, the Georgia Department of Economic Development, the Atlanta Mayor’s Office, and the Metro Atlanta Chamber, is pleased to welcome innovative companies like Keysight to Tech Square, creating jobs and growing Georgia’s economy.” “Keysight’s expansion to metro Atlanta is a win-win for the electronics leader and our region's workforce,” said Metro Atlanta Chamber President and CEO Hala Moddelmog. “As the sixth fastest growing market for technology talent, our region is well positioned to provide Keysight with the skilled professionals needed to fill the more than 200 jobs that it's adding to our economy.” Georgia Department of Economic Development (GDEcD) project manager Ashley Morris represented the Global Commerce division throughout this project in partnership with the City of Atlanta, Invest Atlanta, Georgia Tech, the Metro Atlanta Chamber and Georgia Power. “Georgia’s education system – from its leading pre-k programs to its nationally ranked colleges, universities, and institutes – develops the talent required to fill jobs at every level,” said GDEcD Commissioner Chris Carr. “Keysight’s decision to bring their newest operation to Georgia is a testament to the academic foundation that’s here, and we are excited to see them continue to drive innovation with Georgia’s best and brightest.”\nAdditional Images\nContact\nMedia Contact: Lance Wallace,\nlance.wallace@comm.gatech.edu , 404-660-2928 Economic Development Contact: Greg King,  greg.king@gatech.edu\nEmail\nlance.wallace@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}