{"text": "Applications now open for the 2020 Georgia Innovative Economic Development Internship Program | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nApplications now open for the 2020 Georgia Innovative Economic Development Internship Program\nGeorgia Tech graduate students can further their research and earn $6K in 10-week, paid summer internship.\nFacebook\nTwitter\nEmail\nThe 2019 Georgia Innovative Economic Development Internship Cohort. From left: Jan Youtie, director of the Science, Technology, and Innovation Policy program at Georgia Tech; Ebney Ayaj Rana, a master's student at Georgia State University; Karl Grindal and Daniel S. Schiff, Ph.D. candidates in Tech's School of Public Policy, and Alfie Meeks, director of Tech's Center for Enonomic Development Research. (Photo by: Matthew Hummel)\nJan 29, 2020\n— Atlanta, GA\nThe Science, Technology, and Innovation Policy (STIP) program at Georgia Tech is now accepting applications for the 2020 Georgia Innovative Economic Development Internship Program. (Apply here:  stip.gatech.edu/apply/ ).\nThe 10-week, paid internship allows students of any University System of Georgia (USG) school in master’s and Ph.D. programs to further develop and pursue research that connects it to science, technology, and innovation to economic development. At the end of the internship, students will present their findings to economic development and innovation groups.\nApplications will be accepted through Feb. 28, 2020. The internship is open to any graduate student who has completed the first year of a two-year master’s program or enrolled in a doctoral program at a public university in the USG.\nThose accepted into the 2020 cohort will be notified by the end of March 2020. Interns will receive a $6,000 stipend. Interns from previous cohorts have pursued research projects in a variety of disciplines, ranging from industrial engineering to digital media. (Acceptance is not based on students’ academic concentration.)\n“They will develop their research and work collaboratively with economic development and policy experts, and see first-hand how their ideas and findings can help shape economic development policies and, in turn, have the potential for real-world impact,” said  Jan Youtie , STIP program director.\nSTIP, a globally recognized program, conducts research-based policy analyses and reports of innovation policy, science, and technology for organizations and governments in the United States and globally.\nStudent interns from the 2019 cohort said the experience was a bridge to new opportunities and new audiences to discuss their research findings.\n“It really helped me push forth with my research and data collection and analysis, and since then, we’ve had a publication accepted for an artificial intelligence (AI). In March of 2020, I’ll be presenting on AI to a non-profit organization and an audience of about 250 people,” said  Daniel S. Schiff , a Ph.D. candidate in Tech’s School of Public Policy.\nSchiff’s research looks at AI policy strategies and related ethics codes/guidelines being developed by corporations, governments, and other organizations. He said it was a welcome challenge to marry the societal implications of AI technology with economic development.\n“With the support the STIP team and some of that brainstorming, I was definitely able to convey the project in a way that still discussed the social and ethical issues of artificial intelligence, but in a way that was also relevant to economic development.”\nEbney Ayaj Rana , a student pursuing a master’s degree in public policy at Georgia State University’s Andrew Young School of Policy Studies, said his work as a 2019 intern helped him learn how to effectively present and explain his findings to a wide-ranging group of economic development and public policy leaders and experts.\nRana’s research focuses on how high-tech entrepreneurship among immigrants is growing in the state of Georgia compared with the United States overall, and how fiscal policies and economic development incentives can be mobilized even more for the betterment and fostering of immigrant-owned enterprises in the state of Georgia.\nHis  findings  show immigrants have higher rates of high-tech entrepreneurship but Georgia economic development policies aren’t as robust to support and encourage that growth, compared with other states including New York and Virginia.\n“Being a STIP intern was really an intellectual, exciting experience,” Rana said. “Unlike conventional internship programs, here you will need to complete a research project by doing rigorous research over that two-month period. The whole process of initiating the research in the summer and finally sharing your findings with the economic development group was really an exciting experience for me.”\nAdditional Images\nRelated links\nInternship Apply\nContact\nFor media inquiries, contact:\nPéralte C. Paul\n404.316.1210\nperalte.paul@comm.gatech.edu\nFor inquiries about STIP, contact:\nDoreen Kincaid\ndoreen.kincaid@innovate.gatech.edu\nEmail\nperalte.paul@comm.gatech.edu\nAdditional information\nAbout the Science, Technology, and Innovation Policy program\nThe Science, Technology, and Innovation Policy program at Georgia Tech is an internationally recognized offering of the Georgia Institute of Technology that offers in-depth and critical research-based analyses of innovation policy, science, and technology to organizations and governments around the world. It is part of the Economic Development Lab at the Enterprise Innovation Institute (EI 2 ), Tech’s economic development arm. Along with EI 2 , it is supported by the Georgia Tech School of Public Policy. Visit  stip.gatech.edu  to learn more.\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}