{"text": "Georgia Tech Dedicates the Most Sustainable Building of Its Kind in the Southeast | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Dedicates the Most Sustainable Building of Its Kind in the Southeast\nThe Kendeda Building goes beyond sustainability to be a regenerative building that gives back more than it takes from the environment.\nFacebook\nTwitter\nEmail\nThe Kendeda Building for Innovative Sustainable Design features a large \"front porch\" shaded by some of the hundreds of solar panels that generate electricity for the building. (Photo: Justin Chan Photography)\nOct 24, 2019\n— Atlanta, GA\nThe Georgia Institute of Technology dedicated a new building Oct. 24 that rewrites the rules for sustainability in the Southeast.\nIn fact,\nThe Kendeda Building for Innovative Sustainable Design\nisn’t really sustainable at all; more accurately, the newest building on the Atlanta campus is regenerative. And it has reimagined from the ground up what a campus building can be.\n“The time for doing less harm is gone,” said Shan Arora, director of The Kendeda Building. “We need to have buildings that provide more than they take.”\nThat broad guiding principle has produced a building that will, each year, generate more on-site electricity than it consumes and collect and harvest more water than it uses. During construction, the building diverted more waste from landfills than it sent to them.\n“The Kendeda Building is an incredible and beautiful example of sustainable design, integration with nature, human inclusion and well-being. It is the most sustainable building of its kind in the Southeast,” said Georgia Tech President Ángel Cabrera. “Thanks to our partnership with the Kendeda Fund, it will inspire architects, civil engineers, business and policy leaders for generations to come.”\nIn 2015,\nThe Kendeda Fund\ncommitted $25 million for Georgia Tech to design and\nbuild a living building on campus in an effort prove a regenerative building was practical even in the Southeast’s heat and humidity . An additional $5 million will support programming activities once the building is certified.\nThe Kendeda Building is the first academic and research building in the Southeast designed to be\ncertified as a living building by the International Living Future Institute . Over the next 12 months, it will have to prove its bona fides to earn Living Building Challenge 3.1 certification, delivering on its promise to be self-sufficient, healthy, and beautiful while connecting people to light, air, food, nature, and community.\n“The dedication of The Kendeda Building represents the culmination of many years of planning and partnership. We are humbled to see the vision come to life, and we hope it can be a model for change across the Southeast,” said Dena Kimball, executive director of The Kendeda Fund. “But the official opening of the building is the starting point, not the finish line. Now the real work begins, as Georgia Tech embraces the goals of the Living Building Challenge and demonstrates what’s required to operate a building that gives more than it takes and creates a positive impact on the human and natural systems that surround it.”\nOne of the first steps in that effort is getting the on-site water treatment system certified by state environmental regulators. It will be the first rainwater-to-drinking-water system in a commercial building in this part of the country. Arora said that means the project is breaking more new ground for the Georgia Environmental Protection Division.\n“We are teaching and learning together, the regulator and the regulated,” he said.\nThe Kendeda Building will host several events in the fall and then open fully in the spring for classes, when it becomes a living, learning laboratory for education and research.\n“Really, the best is yet to come. Our goal is to host as many large and required courses from across campus to give our students access to a building that actually teaches us all something,” said Michael Gamble, associate professor and director of Graduate Studies in the School of Architecture. “It’s not just for those students interested in sustainability as a career. For example, next semester, calculus will be taught in The Kendeda Building.”\nGamble helped lead efforts to embed the concepts of the Living Building Challenge more broadly in the Georgia Tech curriculum , including a series of pilot projects that helped explore the challenge’s requirements. Gamble also led a series of architecture design studios focused on mass timber technology like that used in the building.\n“The pilot project program should be a part of every capital project on campus — we’ve learned more and made more connections than we ever thought we would,” Gamble said.\nLikewise, Arora said the project team — general contractor Skanska and architects Lord Aeck Sargent and The Miller Hull Partnership — found new sources of materials and created ways of working that now will ripple out to other projects.\n“Once you learn how to build and operate a living building, you can’t unlearn it,” Arora said. “Through this process, we’re creating the local supply chain, the workforce, and the best practices for other buildings in the region to use living building elements.”\nAdditional Images\nRelated links\nFacebook Live: Tour The Kendeda Building\nKendeda Building for Innovative Sustainable Design\nThe Kendeda Fund\nInternational Living Future Institute\nLiving Building Chronicle Blog\nContact\nJoshua Stewart\n404.894.6016\nEmail\njstewart@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}