{"text": "Triboelectric Nanogenerators Boost Mass Spectrometry Performance | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nTriboelectric Nanogenerators Boost Mass Spectrometry Performance\nResearchers have harnessed triboelectric nanogenerators to improve the sensitivity of mass spectrometers.\nFacebook\nTwitter\nEmail\nAnyin Li, a postdoctoral fellow in the Georgia Tech School of Chemistry and Biochemistry, demonstrates the use of a sliding triboelectric nanogenerator to produce electrical charges for the mass spectrometer device shown next to him. (Credit: Rob Felt, Georgia Tech)\nFeb 27, 2017\n— Atlanta, GA\nTriboelectric nanogenerators (TENG) convert mechanical energy harvested from the environment to electricity for powering small devices such as sensors or for recharging consumer electronics. Now, researchers have harnessed these devices to improve the charging of molecules in a way that dramatically boosts the sensitivity of a widely-used chemical analysis technique.\nResearchers at the Georgia Institute of Technology have shown that replacing conventional power supplies with\nTENG devices\nfor charging the molecules being analyzed can boost the sensitivity of mass spectrometers to unprecedented levels. The improvement also allows identification to be done with smaller sample volumes, potentially conserving precious biomolecules or chemical mixtures that may be available only in minute quantities.\nThough the mechanism by which the enhancement takes place requires more study, the researchers believe the unique aspects of the TENG output – oscillating high voltage and controlled current – allow improvements in the ionization process, increasing the voltage applied without damaging samples or the instrument. The research, which was supported by the National Science Foundation, NASA Astrobiology Program and the Department of Energy, is reported February 27 in the journal\nNature Nanotechnology .\n“Our discovery is basically a new and very controlled way of putting charge onto molecules,” said\nFacundo Fernández , a professor in Georgia Tech’s\nSchool of Chemistry and Biochemistry\nwho uses mass spectrometry to study everything from small drug molecules to large proteins. \"We know exactly how much charge we produce using these nanogenerators, allowing us to reach sensitivity levels that are unheard-of – at the zeptomole scale. We can measure down to literally hundreds of molecules without tagging.”\nFernández and his research team worked with\nZhong Lin Wang , a pioneer in developing the TENG technology. Wang, a Regents professor in Georgia Tech’s\nSchool of Materials Science and Engineering , said the TENGs provide consistent charging levels that produce quantized ion pulses of adjustable duration, polarity and frequency.\n“The key here is that the total charge delivered in each cycle is entirely controlled and constant regardless of the speed at which the TENG is triggered,” said Wang, who holds the Hightower Chair in the School of Materials Science and Engineering. “This is a new direction for the triboelectric nanogenerators and opens a door for using the technology in the design of future instrumentation and equipment. This research demonstrates another practical impact of TENG technology.”\nMass spectrometry measures the mass-to-charge ratio of ions to identify and quantify molecules in both simple and complex mixtures. The technology is used across a broad range of scientific fields and applications, with molecules ranging from small drug compounds on up to large biomolecules. Mass spectrometry is used in biomedicine, food science, homeland security, systems biology, drug discovery and other areas.\nBut in conventional electrospray mass spec techniques, as much as 99 percent of the sample can be wasted during ionization, said Fernández, who holds the Vasser Woolley Foundation Chair in Bioanalytical Chemistry. That’s largely because in conventional systems, the mass analysis process is pulsed or scanned, while the ionization of samples is continuous. The new TENG pulsed power source allows scientists to time the ionization to match what’s happening inside the mass spectrometer, specifically within a component known as the mass analyzer.\nBeyond improved sensitivity and the ability to analyze very small sample quantities, the new technique also allows ion deposition on surfaces, even non-conducting ones. That’s because the oscillating ionization produces a sequence of alternating positive and negative charges, producing a net neutral surface, Fernández said.\nMass spectrometers require large amounts of power for creating the vacuum essential to measuring the mass-to-charge ratio of each molecule. While it’s possible that future TENG devices could power an entire miniature mass spectrometer, the TENG devices are now used just to ionize samples.\n“The nanogenerators could eliminate a big chunk of the mass spectrometer system because they wouldn’t need a more powerful device for making the ions,” Fernández said. “This could be particularly applicable to conditions that are extreme and harsh, such as on a battlefield or in space, where you would need a very robust and self-contained unit.”\nTriboelectric nanogenerators, developed by Wang in 2012, use a combination of the triboelectric effect and electrostatic induction to generate small amounts of electrical power from mechanical motion such as rotation, sliding or vibration. The triboelectric effect takes advantage of the fact that certain materials become electrically charged after they come into moving contact with a surface made from a different material. Wang and his research team have developed TENGs with four different working modes, including a rotating disc that may be ideal for high throughput mass spectrometry experiments. This paper is the first publication about an application of TENG to an advanced instrument.\nWang’s team has measured voltage levels at the mass spec ionizer of between 6,000 and 8,000 volts. Standard ionizers normally operate at less than 1,500 volts. The technology has been used with both electrospray ionization and plasma discharge ionization, with the flexibility of generating single polarity or alternating polarity ion pulses.\n“Because the voltage from these nanogenerators is high, we believe that the size of the sample droplets can be much smaller than with the conventional way of making ions,” Fernández said. “That increases the ion generation efficiency. We are operating in a completely different electrospray regime, and it could completely change the way this technology is used.”\nThe TENG technology could be retrofitted to existing mass spectrometers, as Fernández has already done in his lab. With publication of the journal article, he hopes other labs will start exploring use of the TENG devices in mass spectrometry and other areas. “I see potential not only in analytical chemistry, but also in synthesis, electrochemistry and other areas that require a controlled way of producing electrical charges,” Fernández said.\nThe research was initiated by postdoctoral fellows in the two laboratory groups, Anyin Li and Yunlong Zi. “This project really shows how innovation can happen at the boundaries between different disciplines when scientists are free to pursue new ideas,” Fernández added.\nThis work was jointly supported by NSF and the NASA Astrobiology Program, under the NSF Center for Chemical Evolution, CHE-1504217. Research was also supported by the U.S. Department of Energy, Office of Energy Sciences (Award DE-FG02-07ER46394), and the National Science Foundation (DMR-1505319). Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the sponsors.\nCITATION : Anyin Li, Yunlong Zi, Hengyu Guo, Zhong Lin Wang, Facundo M. Fernández, “Triboelectric Nanogenerators for Sensitive Nano-Coulomb Molecular Mass Spectrometry,” (Nature Nanotechnology, 2016).\nhttp://dx.doi.org/10.1038/nnano.2017.17\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact s: John Toon (404-894-6986) (jtoon@gatech.edu) or Ben Brumfield (404-385-1933) (ben.brumfield@comm.gatech.edu).\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}