{"text": "Bacterial Conversations in Cystic Fibrosis | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nBacterial Conversations in Cystic Fibrosis\nGeorgia tech researchers obtain benchmark data for the impact of spatial arrangement in bacterial signaling in a cystic fibrosis model.\nFacebook\nTwitter\nEmail\nMay 31, 2018\n— Atlanta, GA\n“A large part of my research is thinking about how bacteria communicate,” says\nSophie Darch . The postdoctoral researcher works with School of Biological Sciences Professor\nMarvin Whiteley , studying the social lives of bacteria.\nDarch observes the conversations of bacteria, which take place via molecules they release into the environment and are sensed by other bacteria. In Darch’s experiments, completed messages are marked by the red-to-green change in the color of the bacterium sensing the molecule.\nBy sending and receiving extracellular signals, bacteria sense their neighbors. When enough bacteria are in the conversation, things happen. Sometimes it leads to changes in virulence or ability to establish an infection. The phenomenon is called quorum sensing.\nYet little is known about how quorum sensing proceeds during infection “Much of what is known about quorum sensing,” Darch says, “comes from studies of large populations of bacteria in an environment that does not compare with the natural infection site.” In infections, for example, bacteria are often found in small, dense clusters, called aggregates. “It’s really important for us as scientists to think about what bacterial growth looks like in an infection,” Darch says.\nIn a paper in the\nProceedings of the National Academy of Sciences USA , Darch, Whiteley, and colleagues describe for the first time how close bacteria need to be to “talk” with each other in an environment similar to an infection. Their findings could reveal new ways to disrupt bacterial signaling and provide other targets to treat infections.\nThe work was supported by the National Institutes of Health, the Cystic Fibrosis Foundation, Human Frontiers Science, and the Welch Foundation.\nCystic Fibrosis Model\nThe study uses an environment similar to the chronic infection of the cystic fibrosis (CF) lung.\nCF is a genetic disease that causes buildup of sticky mucus in the lung. The viscous setting CF creates makes the organ prime real estate for disease-causing bacteria. Among the most prevalent of these in the CF lung is\nPseudomonas aeruginosa.\nP. aeruginosa\ninfections pose a huge problem because they are resistant to many antibiotics and are difficult to treat. Often\nP. aeruginosa\ninfection is what causes death among patients with CF.\nThe team used a synthetic CF sputum media (SCFM2), based on the makeup of lung secretions from patients. In nutritional content and physical form, the medium is similar to sputum from the lung. Importantly,\nP. aeruginosa\nforms aggregates in SCFM2 that are similar in size to those observed in CF lung tissue.\n3-D Printed Bacteria\nTo begin to answer the question “How close do you have to be to talk to your neighbor?” the team collaborated with\nJason Shear\nat the University of Texas, Austin. The\nShear Lab\nhad developed a micro-3D-printing platform that could be used to engineer the growth of bacteria to mimic infections.\nBacteria are not uniformly distributed in infections. “Instead we see bacterial aggregates that vary in size and can be separated by large distances,” Whiteley says. “We needed an experimental method to engineer these types of infection landscapes in the lab.”\nUsing Shear’s micro-3D-printing platform, the team printed bacterial aggregates of exact positions and sizes.\nA typical experiment starts by enclosing one producer cell in a picoliter-sized trap, using micro-3D-printing. After multiple cell divisions, the population fills the volume of the trap. Then SCFM2-containing aggregates of responder cells are overlaid the porous trap.\nThey observe the one-way flow of signals from aggregates in a trap (producers) to aggregates outside receiving signals (responders). They could see the response of completed conversations by responders changing color from red to green.\nImplications for Cystic Fibrosis\n“We found that bacterial aggregates slightly larger than those in CF lung – containing about 2,000 cells – were not large enough to signal to other aggregates,” Darch says.\nPrior to this study, it was thought that bacterial signaling could occur over extended distances. However, in the CF lung, small populations of bacteria are scattered across a large volume and separated by large distances. Aggregates are unlikely to “talk” to each other.\nIt took aggregates containing at least 5,000 cells to successfully send signals to neighbors as far away as 176 micrometers. “These aggregates are around five times the size of the average aggregate observed in CF lung tissue” Darch says “From these data, communication is likely confined within an individual aggregate rather than being a population-wide phenomenon”.\nAmong CF patients who are at least 20 years old,\n80% are infected with P. aeruginosa . “Infection with\nP. aeruginosa\nremains a significant clinical problem in immunocompromised patients, particularly those with CF,” Darch says. “Understanding better how bacteria communicate has the potential to find ways of disrupting the communication and potentially diminishing bacterial virulence.”\n“The study provides benchmark data for how quorum sensing might proceed in an environment similar to the CF lung,” says\nWhiteley, who is a member of the Parker H. Petit Institute for Bioengineering and Bioscience . “In different settings, where\nP. aeruginosa\nand other bacteria exist as aggregates of different sizes, communication may look different. Future studies will involve experimental and modeling work to further examine the spatial parameters of quorum sensing in CF and other infections, such as a chronic wound.”\nFigure Caption\n(Left) Rendered confocal laser-scanning micrograph of a micro-3D-printed trap (red)  surrounded by\nP. aeruginosa\naggregates responding to quorum-sensing signals (green) in a synthetic CF sputum media (SCFM2).\n(Right) Rendered confocal laser-scanning micrograph of responding (green) and non-responding (red)  P. aeruginosa\naggregates formed in a synthetic CF sputum media (SCFM2).\nAdditional Images\nContact\nA. Maureen Rouhi, Ph.D.\nDirector of Communications\nCollege of Sciences\nEmail\nmaureen.rouhi@cos.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}