{"text": "Balancing Parenthood and the Pursuit of a Ph.D. | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nBalancing Parenthood and the Pursuit of a Ph.D.\nMidori Wasielewski dreamed of earning her Ph.D. ever since she was a child. Friday, she’ll share that moment with her husband, family and young daughter.\nFacebook\nTwitter\nEmail\nMidori Wasielewski with her husband, Andrew, and their daughter following her dissertation defense.\nDec 13, 2022\n— Atlanta, GA\nDefending a 120-page dissertation on immunology and biomaterials may be a daunting task for most on its own, but in the final year of her biomedical engineering Ph.D. program, Midori Wasielewski’s mornings began when her daughter woke up and ended in the late hours of the evening, with a full day’s work at the lab in between.\nWhile the challenges of being a new mom and the interruption of a pandemic may have presented obstacles, Wasielewski never wavered on her path to graduation. Reflecting on a piece of advice that stuck with her throughout her time on campus, she chose actor and author Sean Patrick Flanery’s message to “do something today that your future self will thank you for.”\nWhen her daughter was born in 2021, Wasielewski knew that the hard work was not only for her future self but also for her growing family. “Even though it was extremely hard working around the clock and not getting a lot of sleep, I was very driven to complete the program at that point and also to set a good example for my baby,” she said.\nUnlike her research in engineering a DNA-based biomaterial to aid doctors and clinicians in identifying patients at high risk for autoimmune diseases, raising a child is not an exact science. Along with the support of her husband, Andrew, there is a place on campus that will forever hold a special place in Wasielewski’s heart —  the Children’s Campus at Georgia Tech .\n“None of this could have happened without the Children's Campus. I was very lucky that they opened their doors to me and my daughter. Without day care being a five-minute walk from my lab, this would not have happened. Georgia Tech was awesome in supporting me as a mom and as a Ph.D. student,” she said.\nWasielewski arrived at Tech in 2017 alongside her advisor\nShuichi Takayama , whose lab she joined after earning her master’s in macromolecular engineering at the University of Michigan. Having become a father while earning his Ph.D., Takayama — professor, GRA Eminent Scholar, and Price Gilbert Jr. Chair in the\nWallace H. Coulter Department of Biomedical Engineering\n— served as an inspiration to Wasielewski as she navigated the early days of parenthood.\n“When I was exhausted and delirious, I would just think to myself, ‘Tomorrow, I’ll be thankful if I just write for 30 minutes or if I just plan this experiment.’ When I did sit down and do that, it usually turned into one or two hours. All those small efforts built into this huge thing, and looking back, I can't believe I actually finished,” she said.\nThe only thing that could keep Wasielewski away from her research was Covid-19. Out of the lab for two months, she dealt with the uncertainty by pouring all of her efforts into her dissertation, which has now been successfully defended after a full-on sprint to the finish line.\n“One of the affirmations you learn during pregnancy and as a mom is that you can do anything for five minutes or for a short amount of time, and I applied that to me,” she said. “It was a period of sacrifice — completely unsustainable — but we knew we could do this.”\nNext, Wasielewski intends to pursue research and development opportunities in the biotech industry, but not before taking some well-earned time off to spend with her family.\nAdditional Images\nRelated links\nGeorgia Tech Commencement\nFall 2022 Commencement Speakers\nMission Accomplished: An Army Veteran’s Path to Commencement at Georgia Tech\nBalancing Parenthood and the Pursuit of a Ph.D.\nWhat Not to Wear: Commencement Edition…and Other Tips For Your Graduation Day\nCommencement Wishes\nBeth Quay: Taking Care of Unfinished Business\nReflection Speakers Highlight Tech Community\nContact\nSteven Gagliano - Communications Officer\nInstitute Communications\nEmail\nSteven.gagliano@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}