{"text": "Georgia Tech Purchasing Helps Ensure Responsible Stewardship | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Purchasing Helps Ensure Responsible Stewardship\nAt Georgia Tech, just about everyone, from research faculty to student employees, at some point needs to make a purchase using Georgia Tech funds.\nFacebook\nTwitter\nEmail\nMay 03, 2022\n— Atlanta, GA\nAt Georgia Tech, just about everyone, from research faculty to student employees, at some point needs to make a purchase using Georgia Tech funds. While the funding sources may vary (that’s a story for another day), as a state agency Georgia Tech must follow state procurement rules, including obtaining and documenting approvals to make purchases. It is an integral part of being responsible stewards of taxpayer resources. But if you spend any time reading about these rules and regulations, you quickly learn to appreciate the complexity of seemingly simple purchases.\nTo help us understand the basics of making a purchase at Georgia Tech, I had the opportunity to interview Ajay Patel, who was recently appointed interim senior director of Business Services at Georgia Tech.\nCan you give us an overview of what the Purchasing department is responsible for at Georgia Tech?\nWe are responsible for the actual processing of a purchase as well as payment to the supplier – both via PCard and purchase orders generated through Workday. This applies to all purchases with the exception of capital and public works as well as subawards and subagreements. Those are handled respectively by Infrastructure and Sustainability and the Office of Sponsored Programs. On average, our department issues more than 100,000 purchase orders a year and that number continues to grow.\nWho establishes the rules and regulations for making purchases?\nSince we are a state entity, the Georgia Department of Administrative Services grants Georgia Tech the authority to make purchases on behalf of the state. In addition, since Georgia Tech receives significant funding from the federal government, we often must comply with\nboth\nstate and federal procurement rules. It can get quite complicated, especially when new rules and regulations become part of the process.\nI’d like to emphasize that these aren’t “guidelines,” these are state or federal laws. All higher education institutes that receive federal funding must comply with federal rules. In addition, all University System of Georgia (USG) schools must also comply with state rules, which are often more restrictive than federal rules. To help ensure compliance, there are established purchasing requirements that every USG institution must follow.\nCan you walk us through the steps necessary to make a purchase of goods and services?\nThere are generally two ways to authorize and pay for goods and services. One is the State of Georgia PCard, which is used primarily for smaller dollar amount purchases, and the other is a purchase order (PO) issued via Workday Financials. Both require documentation for compliance verification.\nBy issuing a PO, Georgia Tech is assuring the vendor that the appropriate authorization, or approval, has been issued and Georgia Tech is financially committed to paying the vendor in return for the goods and services specified on that PO. It’s essentially a contract. Plus, the State Accounting Office policy requires that a PO must be issued in most cases before a vendor is paid.\nWhat does the process look like to issue a PO? How long does it take?\nIt begins with issuing a purchase requisition. After it is approved by the approving department in Workday, it is then routed to Purchasing for review and approval. Once approved, the purchase requisition becomes a PO.\nIn approximately 80% of scenarios, Purchasing has automated the approval process of the purchase requisition, and this has really helped speed up the process for issuing a PO. On average, automated approvals of a requisition take three business days. A great example of this would be purchasing office supplies from the Staples catalogue.\nFor the remaining 20% of requisitions, Purchasing will review them for compliance with state and federal procurement rules. Once all requirements are met, a PO is issued and sent directly to the vendor. The time for Purchasing to review can vary depending on the complexity of the purchase and the steps required.\nWhat happens if a complete purchase order is not issued and a purchase is made or work begins?\nAt that point, there is no PO and it is an unauthorized purchase, which is by far one of our biggest issues in Purchasing. This opens the door for discrepancy between what the supplier provides and what was expected, and it creates a noncompliant purchase, which is against the established rules and laws. Not only does this greatly delay payment of invoices, but it can cause the potential for no payment to the vendor. In some extreme cases, the person who made the unauthorized purchase can be personally liable for the cost of the unauthorized purchase.\nWhat are the new procedural changes that will help ensure compliant purchases and streamline processing of purchases and payments?\nWe strive to be good business partners with our internal constituents and our external vendors, but we also recognized the need to implement stricter protocols. Beginning this calendar year, Georgia Tech Purchasing implemented the Unauthorized Purchase Form to further support policy (i.e. prior approval required) and ensure regulatory compliance as well as the appropriate processing of payment. It states that any unauthorized purchase will require a completed and signed\nUnauthorized Purchase Form\nattached to the requisition before a PO can be issued. The following additional approvals are required:\nPurchase amounts less than $25,000 – Chair/Director signature approval required.\nPurchase amounts equal to or greater than $25,000 – VP/Dean signature approval required.\nAll applicable procurement requirements (such as EVerify, Certificate of Insurance, bidding, etc.) are required for purchases\nprior\nto payment, which has always been the case.\nAnd as a reminder, if a purchase does not comply with state purchasing rules and requirements, the person authorizing the purchase may be personally financially liable for the purchase. Again, this has been policy all along. I encourage employees to visit the Policy Library to\nlearn more about unallowed procurements .\nAre there exceptions, such as emergency purchases? What do those procedures look like?\nGeorgia policy does allow for emergencies – one of the few cases where is it acceptable to authorize work without a PO. These are typically issues that directly affect health and safety. The state clearly says that loss of funding or lack of planning does not constitute an emergency.  There is a form that must be submitted to the Department of Administrative Services within five business days of the purchase.\nWhat advice would you give the campus community when making purchases?\nPlan ahead and work with your business officer if you need help navigating the process. If you know that you will need to order certain goods or secure services, do not wait until the last minute. The procurement process can be complicated and require some time depending on the nature of your purchase. People are often surprised by this – that’s when we see people working around the process and the consequences that follow.\nHow do I learn more about the purchasing process at Georgia Tech?\nNew and existing employees should visit the\ncourse catalog , which features a variety of training related to procurement and other financial activities. Questions can also be submitted through\nServiceNow .\nAdditional Images\nContact\nRachael Pocklington\nInstitute Communications\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}