{"text": "Warming Impedes a Coral Defense, but Hungry Fish Enhance It | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nWarming Impedes a Coral Defense, but Hungry Fish Enhance It\nCorals exude defenses against bacteria associated with bleaching, but warming disadvantages the defense. Conservation offers limited hope.\nFacebook\nTwitter\nEmail\nAt a lively reef where fishing is banned, corals thrive, and fish eat seaweed that would otherwise vastly outcompete and endanger the corals. Fisheries regulations appear to protect reefs and may buy some insurance against mass coral death in ocean warming events. But even protected reefs die off if their waters get too hot too long. Credit: Georgia Tech / Hay lab\nOct 02, 2019\n— Atlanta, GA\nCorals create potions that fight bacterial attackers, but warming appears to tip the scales against the potions as they battle a bacterium common in coral bleaching,\naccording to a new study . Reef conservation may offer hope: A particular potion, gathered from reefs protected against seaweed overgrowth, proved more robust.\nThe protected Pacific reefs were populated by diverse corals and shimmered with colorful fish, said researchers who snorkeled off of Fiji to collect samples for the study. Oceanic ecologists from the Georgia Institute of Technology compared coral potions from these reefs, where fishing was prohibited, with those from heavily fished reefs, where seaweed inundated corals because few fish were left to eat it.\nThe medicated solutions, or potions, may contain a multitude of chemicals, and the researchers did not analyze their makeup. This is a possible next step, but here the researchers simply wanted to establish if the potions offered any real defense against pathogens and how warming and overfishing might weaken it.\nConservation matters\n“I thought I probably wouldn’t see antibiotic effects from these washes. I was surprised to see such strong effects, and I was surprised to see that reef protections made a difference,” said the study’s first author, Deanna Beatty.\n“There is a lot of argument now about whether local management can help in the face of global stresses – whether what a Fijian village does matters when people in London and Los Angeles burn fossil fuels to drive to work,” said Mark Hay, the study’s principal investigator,  Regents Professor and Harry and Linda Teasley Chair in Georgia Tech’s School of Biological Sciences .\n“Our work indicates that local management provides a degree of insurance against global stresses, but there are likely higher temperatures that render the insurance ineffective.”\n[Ready for graduate school?  Here's how to apply to Georgia Tech. ]\nAdding heat\nThe researchers collected three coral species along with seawater surrounding each species at protected reefs and at overfished reefs. In their Georgia Tech lab, they tested their solutions against the pathogen  Vibrio coralliilyticu s   at 24 degrees Celsius (75.2 Fahrenheit), an everyday Fijian water temperature, and at 28 degrees (82.4 F), common during ocean heating events.\n“We chose  Vibrio  because it commonly infects corals, and it’s associated with coral bleaching in these warming events. It’s related to other bleaching pathogens and could serve as a model for them as well,” Hay said.\n“We chose 24 C and 28 C because they’re representative of the variations you see on Fijian reefs these days. Those are temperatures where the bacteria are more benign or more virulent,” Beatty said.\nThe data showed that warming disadvantaged all potions against  Vibrio  and conservation aided a potion from a key coral species. The team, which included coauthor Kim Ritchie from the University of South Carolina Beaufort, published its study\nin the journal  Science Advances  on Oct. 2 . The research was funded by the National Institutes of Health’s Fogarty International Center, the National Science Foundation, and the Simons Foundation.\nDeeper dive into the experiment\nSeaweed hedges\nThe unprotected reefs’ shabby appearance portended their effects on the one potion associated with a key coral species.\n“When you swim out of the no-fishing area and into the overfished area, you hit a hedge of seaweed. You have about 4 to 16% corals and 50 to 90% seaweed there. On the protected reef, you have less than 3% seaweed and about 60% corals,” Hay said.\nHay has researched marine ecology for over four decades and has seen this before, when coral reefs died off closer to home.\n“Thirty years ago, when Caribbean reefs were vanishing, I saw overfishing as a big deal there, when seaweed took over,” he said, adding that global warming has become an overriding factor. “In the Pacific, many reefs that were not overfished have been wiped out in warming events. It just got too hot for too long.”\nDistilling potion\nThe potions are products of the corals and associated microbes, which comprise a biological team called a  holobiont .\nTo arrive at potions focused on chemical effects, the researchers agitated the coral holobionts and ocean water then freeze-dried and irradiated the resulting liquid to destroy remnants of life that could have augmented chemical action. Some viruses may have withstood sterilization, but it would have weakened any effect they may have had, if there were any.\nThen the researchers tested the potions on  Vibrio .\n“All of the solutions’ defenses were compromised to varying extents at elevated temperatures where we see corals getting sick in the ocean,” Hay said.\nBut reef protection benefited the potion taken from the species  Acropora millepora .\n“The beneficial effect in the solution tested in the lab was better when  Acropora  came from protected areas, and this difference became more pronounced at 28 degrees Celsius,” said Beatty, who finished her Ph.D. with Hay and is now a postdoctoral researcher at the University of California, Davis.\nAcropora  architecture\nOf the three species with potions that were tested,  Acropora millepora  may be a special one.\nIt is part of a genus – larger taxonomic category – containing about 150 of the roughly 600 species in Pacific reefs, and  Acropora  are core builders of reef structures. They grow higher as sea level rises, helping maintain healthy positions for whole reefs.\n“ Acropora  are big and branching and make lots of crevices where fish live. The  evolution of lots of reef fish parallels the evolution of  Acropora  in particular,” Hay said.\nIf fish can hang on, they may buy  Acropora  more time, and coral reefs perhaps, too.\nAlso READ:  When Coral Species Vanish, Their Absence Can Imperil Surviving Corals\nThese researchers coauthored the study: Deanna Beatty, Jinu Valayil, Cody Clements, and Frank Stewart of Georgia Tech. The research was funded by the National Institutes of Health (grant 2 U19 TW007401-10), the National Science Foundation (grant OCE 717 0929119), the Simons Foundation (grant 346253), and the Teasley Endowment. Any findings, conclusions, or recommendations are those of the authors and not necessarily of the sponsors.  DOI:  https://doi.org/10.1126/sciadv.aay1048\nWriter & Media Representative : Ben Brumfield (404-272-2780), email:  ben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nAdditional Images\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}