{"text": "First Large-Scale Study of Covid-Era Birth Data Finds Significant Drop in Premature Cesarean, Induced Deliveries | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nFirst Large-Scale Study of Covid-Era Birth Data Finds Significant Drop in Premature Cesarean, Induced Deliveries\nPublished April 6 in the journal Pediatrics, the study by School of Economics Assistant Professor Daniel Dench is the first to examine pandemic-era birth data at scale.\nFacebook\nTwitter\nEmail\nApr 06, 2022\n— Atlanta, GA\nPremature births from cesarean (C-sections) and induced deliveries fell by 6.5% during the first month of the Covid-19 pandemic and remained consistently lower throughout — a likely result of fewer prenatal visits due to efforts to slow the spread of the virus, according to new research from\nGeorgia Tech's School of Economics.\nPublished April 6 in the journal Pediatrics,\nthe study\nis the first to examine pandemic-era birth data at scale. The research raises questions about medical interventions in pregnancy and whether some decisions by doctors may result in unnecessary preterm deliveries, according to Assistant Professor\nDaniel Dench , the paper's lead author.\n\"While much more research needs to be done, including understanding how these changes affected fetal deaths and how doctors triaged patient care by risk category during the pandemic, these are significant findings that should spark discussion in the medical community,\" Dench said.\nNotable Findings\nIn effect, the study begins to answer a question that never could have been resolved in a traditional experiment: What would happen to the rate of premature C-sections and induced deliveries if women didn’t see doctors as often, especially in person, during pregnancy?\nSuch an experiment would be unethical, of course. But stay-at-home orders had a side effect of reducing prenatal care visits by more than a third, according to one\nanalysis . That gave Dench and his colleagues — Theodore Joyce at Baruch College and Dr. Howard Minkoff at Maimonides Medical Center — an opportunity to evaluate the impacts, after all.\nThe researchers examined records of nearly 39 million U.S. births from 2010 to 2020. They used the data from the National Center for Health Statistics to forecast expected premature births — defined as babies born before 37 weeks of pregnancy — from March to December 2020. Then they compared the predictions to the actual numbers.\nDench and his co-authors found that in March 2020 — when the World Health Organization declared Covid-19 a pandemic, sparking business closures and stay-at-home orders around the country — preterm births from C-sections or induced deliveries immediately fell from the forecasted number by 0.4 percentage points. From March 2020 to December 2020, the number remained on average 0.35 percentage points below the predicted values. That translates to 350 fewer preterm C-sections and induced deliveries per 100,000 live births, or 10,000 fewer overall.\nBefore the pandemic, the number of preterm C-sections and induced deliveries had been rising. Spontaneous preterm births — those that were not induced or cesarean — also fell by a small percentage in the first months of the pandemic, but much less than births involving those two factors. The number of full-term cesarean and induced deliveries increased.\nThe Big Picture\nDench and his co-authors were the first researchers to look at this data on a large scale.\n\"If you look at 1,000 births in a single hospital, or even at 30,000 births across a hospital system, you wouldn't be able to see the drop as clearly,\" said Dench. \"The drop we detected is a huge change, but you might miss it in a small sample.\"\nThe researchers also corrected for seasonality — for example, preterm births are higher on average in February than in March — which helped them get a clearer picture of the data.\nThe research comes with caveats. Up to half of all preterm C-sections and induced deliveries are due to a ruptured membrane, which is a spontaneous cause. But in the data Dench and his team used, it’s impossible to distinguish these C-sections from the ones caused by doctors’ interventions. So, Dench and co-authors are seeking more detailed data to get a clearer picture of preterm deliveries.\nStill, these findings are significant because the causes for preterm births are not always known.\n\"However, we know for certain that doctors' interventions cause preterm delivery, and for good reason most of the time,\" Dench said. \"So, when I saw the change in preterm births, I thought, if anything changed preterm delivery, it probably had to be some change in how doctors were treating patients.\"\nWhat's Next?\nThe researchers' findings raise a critical question: Was the pre-pandemic level of doctor intervention necessary?\n\"It's really about, how does this affect fetal health?\" said Dench. \"Did doctors miss some false positives — did they just not deliver the babies that would have survived anyway? Or did they miss some babies that would die in the womb without intervention?\"\nDench plans to use fetal death records from March 2020 to December 2020 to answer this question. If he finds no change in fetal deaths at the same time as the drop in preterm births, that could point to \"false positives\" in doctor intervention that can be avoided in the future. Learning which pregnancies required care during the pandemic and which ones didn’t could help doctors avoid unnecessary interventions in the future.\n\"This is just the start of what I think will be an important line of research,\" Dench said.\nThe article, “U.S. Preterm Birth Rate and Covid-19,” was published online in\nPediatrics\non April 6, 2022: It is available at\nhttps://doi.org/10.1542/peds.2021-055495 .\nAdditional Images\nContact\nDi Minardi\ndi.minardi@gatech.edu\nEmail\ndminardi3@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}