{"text": "Research Next Project Team Promotes Collaboration With HBCUs | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nResearch Next Project Team Promotes Collaboration With HBCUs\nFor Georgia Tech, striving toward inclusivity starts with a simple but crucial goal: building deep, lasting research partnerships.\nFacebook\nTwitter\nEmail\nJun 22, 2023\nWorkforce diversity in science and technology is widely seen as necessary for continued innovation. For Georgia Tech, striving toward inclusivity starts with a simple but crucial goal: building deep, lasting research partnerships.\nResearch Next , a planning initiative for Georgia Tech’s research enterprise, was launched by Executive Vice President for Research Chaouki T. Abdallah in 2020 and co-chaired by Tim Lieuwen and Mark Whorton. As part of Phase 3, project teams worked throughout the past year to implement its goals.\nOne Research Next project team has paved the way for inclusive research collaborations to thrive at Georgia Tech and beyond. The team was charged with identifying opportunities and developing support systems to facilitate research collaborations between Georgia Tech and HBCUs (historically Black colleges and universities) and MSIs (minority-serving institutions).\nSince kicking off in March 2022, the project team solidified new research partnerships, developed a digital networking tool to connect Georgia Tech and HBCU researchers, and created and hired a full-time position at Tech for ongoing engagement with HBCUs and MSIs. The group was co-led by\nGeorge White , senior director for strategic partnerships in the Office of the Vice President for Interdisciplinary Research and principal research engineer at Georgia Tech, and Thomas Martin, chief scientist for the Electro-Optical Systems Laboratory at the Georgia Tech Research Institute (GTRI).\n“The goal of our work is not only to support collaborative research with HBCUs and MSIs, but also to strengthen the pipeline of top graduates who will enhance diversity in our state and nation’s workforce,” White said. “One of the first key steps was to hear from the groups we were charged to work with.”\nDefining the Challenge\nThe team began by leveraging GTRI’s longstanding work and connections with HBCUs, which include federally funded collaborative research projects and workforce development initiatives. The group invited representatives from the\nTougaloo College Research and Development Foundation\n(TCRDF), a consortium of HBCUs whose mission is to advance research collaborations between HBCUs and the Department of Defense. Members of TCRDF educated the project team about challenges HBCUs face in obtaining federally sponsored research.\n“GTRI has been fortunate to collaborate with TCRDF in support of the U.S. Army’s Combat Capabilities Development Command (CCDC) Aviation & Missile Center’s mission to accelerate research collaborations with HBCUs and MSIs and enrich the workforce with a pipeline of talented graduates,” Martin said.\nThroughout the year, the project team hosted seminars with HBCUs where they highlighted research activities at the Institute and discussed how HBCUs could participate in areas of mutual research interests. The team also joined TCRDF’s open virtual meeting hours every week to talk about research engagement opportunities at Georgia Tech.\nIn addition, they recommended that Georgia Tech create a dedicated, permanent position to facilitate ongoing engagement with HBCUs. Taiesha Smith, the first senior program manager for\nGeorgia Tech’s HBCU/MSI Research Collaboration Initiative , will lead outreach efforts to increase and foster enduring research collaborations.\n“I'm excited to be the connective tissue between Georgia Tech, HBCUs, and MSIs in building sustainable and mutually beneficial relationships that lead to successful research collaboration,” Smith said. “I aim to accomplish this goal through a commitment to understanding the needs of HBCUs and MSIs, communicating their value to all stakeholders, and supporting them in making appropriate connections across Georgia Tech and beyond.”\nSteps Forward\nThe project team led the development of a software tool,\nCollabNext , that facilitates research interaction and collaborations between HBCUs and Georgia Tech. Using the tool, researchers can find partners at HBCUs based on specific disciplines and areas of interest. The tool is currently in beta version and has expanded to include Clark Atlanta University, Morehouse College, Texas Southern University, Fisk University, and the Atlanta University Center (AUC) Data Science Initiative. A\nwebsite\nhosts the tool and provides information about the initiative.\nThe team also is planning a forum that will bring together researchers from Georgia Tech and several HBCUs/MSIs, as well as government officials and industry leaders from top STEM companies. A major goal of the event will be for participants to develop white papers to better position HBCUs and MSIs to compete for large federal funding opportunities. The multi-day event will be organized by the Office of the Vice President for Interdisciplinary Research and is set to take place in November.\nAdditional steps taken to establish and solidify research partnerships :\nSubmitted a joint proposal for an NSF Regional Innovation Engine with TCRDF and seven HBCU/MSI partner institutions.\nSubmitted a joint NSF proposal with the AUC Data Science Initiative, Morehouse College, and TCRDF to establish the inaugural research collaboration forum at Georgia Tech.\nLaunched the Biomedical Data Science Summer Research Program.\nPrepared a memorandum of understanding (pending) to establish a semiconductor research initiative with HBCU/MSIs.\nModified an agreement with Ford Motor Company to allow HBCU/MSI institutions to participate in sponsored research projects in collaboration with Georgia Tech.\nParticipated in the 2022\nNational HBCU Week , hosted by the executive director for White House Initiatives on HBCUs. Georgia Tech will participate again in 2023 to introduce CollabNext and present best practices for engaging in collaborative research.\nSubmitted proposals to the Department of Energy’s Hydrogen Hub (with Battelle Memorial Institute) and Direct Air Capture Hub (with Southern States Energy Board) to develop a collaborative research and community engagement consortium made up of HBCUs and MSIs.\nGeorgia Tech will serve as an unbiased science convener for the HBCUs/MSIs, which will receive the majority of funding and engagement. This work is in partnership with Tech’s Serve-Learn-Sustain.\n“This Research Next project provided the opportunity not only to coordinate efforts across Georgia Tech to enhance research collaborations with HBCUs and MSIs, but also to position Georgia Tech as thought leaders in this initiative,“ said Martin.\nTeam co-leader George White attended Hampton University, a prominent HBCU, and saw firsthand some of the resource challenges that the institutions face when trying to secure federally sponsored research. The initiative’s mission continues to be important for him personally.\n“Our work with HBCUs supports Georgia Tech’s strategic plan by increasing accessibility and improving the human condition,” he said. “With the vast resources we have here, it is important to work together to find solutions to these pressing challenges.”\nVisit\nhbcumsi.research.gatech.edu\nto learn more about the initiative.\nWe would like to hear from you about any research collaboration with an HBCU or MSI. Please use the following link to complete the Share Research Collaboration form.\nhttps://hbcumsi.research.gatech.edu/collabnext-tool\nAdditional Images\nContact\nCatherine Barzler, Senior Research Writer/Editor\nInstitute Communications\ncatherine.barzler@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}