{"text": "Renovated Student Center Name to Honor John Lewis | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nRenovated Student Center Name to Honor John Lewis\nThe Board of Regents of the University System of Georgia has approved the naming in honor of the renowned civil and human rights leader and longtime U.S. representative from Georgia’s fifth congressional district\nFacebook\nTwitter\nEmail\nRep. John Lewis addresses graduates as the keynote speaker during Fall 2011 Commencement exercises.\nNov 09, 2021\n— Atlanta, GA\nThe Board of Regents of the University System of Georgia has approved the naming of Georgia Tech’s Student Center in honor of John Lewis, the renowned civil and human rights leader and longtime U.S. representative from Georgia’s fifth congressional district.\n“The John Lewis Student Center honors a great person, whose example of leadership will inspire Tech students, today and for generations,” President Ángel Cabrera said. “We are grateful for all Congressman Lewis did to support us during his 33 years representing our district. Very importantly, today’s announcement honors his accomplishments that began as a college student in Tennessee, well before he ran for elected office. John Lewis dedicated his life and even put himself at risk to fight for justice for all.”\nFrom 1987 until his death in 2020, the son of Alabama sharecroppers served in Congress representing the district in which the Tech campus is located. During that time, he was a frequent guest at the Institute — delivering the keynote address at Commencement in 1995 and 2011, imparting wisdom about leadership to students, providing internship opportunities to students, and accepting Georgia Tech’s Ivan Allen Jr. Prize for Social Courage in 2013.\nIn matters of policy, Lewis was a strong advocate for federal programs that are important to Tech students, including the Pell Grant and federal work-study programs, the National Science Foundation, the National Institutes of Health, and the Office of Science.\n“Georgia Tech sits in the heart of Georgia's Fifth Congressional District, which Congressman Lewis represented from the time he was first elected to Congress in 1986 until his passing in 2020,” said Board of Regents Chairman Sachin Shailendra. “He invested considerable time in service not only to its students but to the state, advocating for important federal legislation that benefitted Georgia and its people. He consistently supported the Institute and championed its students, and I cannot think of a more appropriate honor.”\nBeginning in the 1980s, he became a visible presence in Atlanta, where he served on the city council from 1981 to 1986. Even after his election to Congress, Lewis met with his constituents, made frequent public appearances, and participated in the city’s biggest events.\nAbove all else, John Lewis was a towering yet humble leader in the movements for equality and social justice that have reshaped the United States since the mid-20th century. From the Freedom Rides to the 1963 March on Washington, from serving as chairman of the Student Nonviolent Coordinating Committee to leading peaceful protesters across the Edmund Pettus Bridge in Selma, Alabama, and for decades of service in the halls of Congress, Lewis demonstrated quiet determination, courage, and constancy in all of his efforts to ensure that the American promise of justice and equality could become accessible to all citizens.\n“The John Lewis Student Center will be the home of our Student Government and many other student organizations,” Cabrera said. “I can’t think of a better name to inspire future generations of Georgia Tech student leaders than the man who, as a student leader himself, led our nation in its journey towards equality and civil rights.\n“This facility will also serve as a powerful reminder of our commitment to improve the human condition, to embrace collaboration and diversity, and to nurture well-being and act ethically. John Lewis stood for all of those things.”\nAn ongoing fundraising initiative will create a permanent endowment in memory of John Lewis to support student leadership development programs.\nSince the summer of 2020, the Student Center has been undergoing extensive renovations, which are scheduled for completion in Summer 2022. When it opens, the John Lewis Student Center will be part of the larger, newly constructed and reimagined Campus Center and will serve as the central gathering place for the Tech campus.\nAdditional Images\nContact\nBlair Meeks\nInstitute Communications\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}