{"text": "El Nino Swings More Violently in the Industrial Age, Hard Evidence Says | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nEl Nino Swings More Violently in the Industrial Age, Hard Evidence Says\nHard evidence now says: El Nino and the climate phenomenon that drives it have become more extreme in the industrial age.\nFacebook\nTwitter\nEmail\nEl Nino 1997 (l.), El Nino 2015 (r.) Credit: NOAA (National Oceanographic and Atmospheric Administration)\nNov 25, 2019\n— Atlanta, GA\nEl Ninos have been very intense in our times, which stands to worsen storms, drought, and coral bleaching in El Nino years. A  new study has found  compelling evidence in the Pacific Ocean that the stronger El Ninos are part of a climate pattern that is new, strange and appears unique to the industrial age.\nThis is the first known time that enough physical evidence spanning millennia has come together to allow researchers to say that definitively. The data show demonstrably that El Ninos, La Ninas, and the climate phenomenon that drives them have been swinging more broadly in the era of human-induced climate change.\n“What we’re seeing in the last 50 years is outside any natural variability. It leaps off the baseline. Actually, we even see this for the entire period of the industrial age,” said Kim Cobb, the study’s principal investigator and  Georgia Power Chair and ADVANCE Professor in the Georgia Institute of Technology’s School\nof Earth and Atmospheric Sciences. “There were three extremely strong El Nino-La Nina events in the 50-year period, but it wasn’t just these events. The entire pattern stuck out.”\nThe study’s first author Pam Grothe compared temperature-dependent chemical deposits from present-day corals with those of older coral records representing relevant sea surface temperatures from the past 7,000 years. With the help of collaborators from Georgia Tech and partner research institutions, Grothe identified patterns of in the  El Nino Southern Oscillation  (ENSO), swings of heating and cooling of equatorial Pacific waters that, every few years, spur El Ninos and La Ninas respectively.\nThe team found the industrial age ENSO swings to be 25% stronger than in the pre-industrial records. The researchers published their results  in the journal  Geophysical Review Letters  in October 2019. The work was funded by the National Science Foundation.\nHundreds of samples\nThe evidence had slumbered in and around shallow Pacific waters, where ENSO and El Ninos originate, until Cobb and her students plunged hollow drill bits into living coral colonies and fossil coral deposits to extract it. In more than 20 years of field expeditions, they collected cores that contained hundreds of records.\nThe corals’ recordings of sea surface temperatures proved to be astonishingly accurate when benchmarked. Coral records from 1981 to 2015 matched sea surface temperatures measured via satellite in the same period so exactly that, on a graph, the jagged lines of the coral record covered those of the satellite measurements, obscuring them from view.\n“When I present it to people, I always get asked, ‘Where’s the temperature measurement?’ I tell them it’s there, but you can’t see it because the corals’ records of sea surface temperatures are that good,” said Grothe, a former graduate research assistant in Cobb’s lab and now an  associate professor at the University of Mary Washington .\n[Ready for graduate school?  Here's how to apply to Georgia Tech. ]\nFirst red flag?\nIn 2018, enough coral data had amassed to distinguish ENSO’s recent activity from its natural preindustrial patterns.\nTo stress-test the data, Grothe left out chunks to see if the industrial age ENSO signal still stuck out. She removed the record-setting  1997/1998 El Nino -La Nina and examined industrial age windows of time between 30 and 100 years long.\nThe signal held in all windows, but the data needed the 97/98 event to be statistically significant. This could mean that changes in the ENSO activities have just now reached a threshold that makes them detectable.\nWhat is El Nino?\nEvery two to seven years in spring, an El Nino is born when the warm phase of the ENSO swells into a long heat blob in the tropical Pacific, typically peaking in early winter. It blows through oceans and air around the world, ginning up deluges, winds, heat, or cold in unusual places.\nOnce El Nino passes, the cycle reverses into La Nina by the following fall, when airstreams push hot water westward and dredge up frigid water in the equatorial Pacific. This triggers a different set of global weather extremes.\nTropical Pacific corals record the hot-cold oscillations by absorbing less of an oxygen isotope (O 18 ) during ENSO’s hot phases, and progressively more of it during ENSO’s cool phases. As corals grow, they create layers of oxygen isotope records, chronicles of temperature history.\nWaves, repairs, contortions\nExtracting them is adventurous: A research diver guides a chest-high pneumatic drill under the ocean. Its pressure hose connects to a motor on the boat that powers the drill after the diver has taken off her fins and weighed herself down on the reef.\nShe carefully angles the bit down the axis of coral growth to get a core with layers that can be accurately counted back in time. On occasion, waves put her and her safety diver through washing machine cycles.\n“Doing this all underwater adds an extra level of difficulty, even from the simplest tasks like working with wrenches,” Grothe said. “But the drill slices through underwater corals like butter. Fossil corals are drilled on land, and the drill constantly seizes up and overheats.”\nBlowing models away\nThe physical proof taken from three islands that dot the heart of the ENSO zone has also thrown down scientific gauntlets, starkly challenging computer models of ENSO patterns and causes. A prime example: Previously unknown to science, the study showed that in a period from 3,000 to 5,000 years ago, the El Nino-La Nina oscillations were extremely mild.\n“Maybe there’s no good explanation for a cause. Maybe it just happened,” Cobb said. “Maybe El Nino can just enter a mode and get stuck in it for a millennium.”\nAlso Read:\nAdvanced life forms on other planets look much more likely after this study\nWriter & Media Representative : Ben Brumfield (404-272-2780)\nEmail:  ben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nThese researchers coauthored the study: Giovanni Liguori, Emanuele Di Lorenzo, Jean Lynch-Stieglitz, Hussein Sayani, Kayla Townsend, Melat Hagos, and Gemma O’Connor from Georgia Tech; Antonietta Capotondi from the NOAA Earth System Research Laboratory; Yanbin Lu and Lawrence Edwards from the University of Minnesota; Hai Cheng from the University of Minnesota and Xi’an Jiaotong University; John Southon and Guaciara Santos from the University of California, Irvine; Daniel Deocampo from Georgia State University; Tianran Chen from the Chinese Academy of Sciences; Diane M. Thompson from the University of Arizona; Jessica Conroy from the University of Illinois at Urbana-Champaign; Andrea Moore from the University of Mary Washington, and Lauren Toth from the U.S. Geological Survey. The research was funded by the National Science Foundation (awards 1502832, 1446343, 1029020, and 1349599), the National Science Foundation of China (award 41888101), NOAA’s Climate Program Office and the Department of Energy’s Office of Science, U.S. Geological Survey and National Science Foundation (award 1535007), and a Sigma Delta Epsilon-Graduate Women in Science fellowship. Any findings, conclusions, or recommendations are those of the authors and not necessarily shared by the funding agencies.\nAdditional Images\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}