{"text": "Making New Friends, Seeing Old Ones During Covid-19 | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMaking New Friends, Seeing Old Ones During Covid-19\nWhether you're trying to find new friends or spend time with old ones, there are ways to do so safely.\nFacebook\nTwitter\nEmail\nMar 09, 2021\n— Atlanta, GA\nAs we cross the midpoint of the semester, people across campus are looking for ways to stay connected and socialize safely. Whether you want to take advantage of increasingly warm weather or are simply trying to make new friends, opportunities abound.\nGetting Started Socializing\nIt can already be difficult to make friends in college, and that can be worsened by students feeling isolated during the pandemic.\n“Feeling shy or experiencing some level of social awkwardness is nothing to feel ashamed about, and for many students, the pandemic has amplified those feelings,” said Tiffiny Hughes-Troutman, director of the Center for Assessment, Referral, and Education (CARE). “Start by seeking out environments that suit you.”\nSome suggestions for how to do this include attending residence hall events for students who live on campus, as well as developing social media networks. Volunteering can also help students make friends while giving back to their local communities, and\npen pal networks\nare regaining popularity in light of the pandemic.\nIf you know someone is new to campus, or could use a connection, ask them to join you to do something outdoors. This, too, can be uncomfortable — but everyone needs a friend, especially these days.\nYou can also find student organizations across a wide variety of topics on\nEngage . Many organizations are operating fully online, while others have occasional in-person events as well. View a list of upcoming events from student organizations\nhere . Once you’ve found someone to hang out with, whether they’re a new friend or an old one, there are plenty of ways to have socially distanced “friend dates.”\nSporting Events\nSeveral Georgia Tech sports are in the middle of their spring seasons, and many of them are competing outdoors. Students can attend baseball, softball, track and field, and tennis events for free. The 8-3 baseball team is currently climbing after taking down the ACC’s top-seeded Louisville; their next home series runs March 12 – 14 against Pittsburgh.\nVolleyball also just started its 10-match spring season. The Yellow Jackets finished the fall semester ranked 17th in the country and look to continue their streak and lock in their first NCAA tournament berth since 2009. Both men’s and women’s basketball are also looking to continue their postseason runs, with the men playing in the quarterfinals of the ACC Tournament on Thursday. View the full schedule of sports at\nramblinwreck.com .\nAtlanta’s Outdoor Spaces\nAtlanta also boasts several outdoor areas for people to enjoy the weather away from others. On campus, Tech Green, Burger Bowl Field, and the new EcoCommons are some of the many places to hang out. Off campus, places such as the BeltLine and Piedmont Park are easily within driving or biking distance. If you’re looking for a little more adventure, visit one of the Atlanta area’s many\nhiking trails .\nGeorgia Tech Arts Skyline Series\nFor those missing live performances, Georgia Tech Arts is here to help. From March 26 to May 18, there are 25 performances scheduled for the outdoor stage being built on the W21 parking lot at the intersection of Ferst Drive and State Street, ranging from the Atlanta Ballet to student musicians. Tickets are on sale now; click\nhere\nto learn more and view the full event schedule.\n“There are so many ways to socialize safely. Strong social connections and friendships support mental well-being, improve sleep, and strengthen our immune systems,” Hughes-Troutman said. Learn more about how to stay safe while socializing\nhere .\nView more events taking place on or around Georgia Tech's upcoming well-being days.\nAdditional Images\nContact\nGrace Wyner\nInstitute Communications\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}