{"text": "Georgia Tech Names New Executive Vice President for Research | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Names New Executive Vice President for Research\nGeorgia Tech has named Chaouki Abdallah as executive vice president for research.\nFacebook\nTwitter\nEmail\nChaouki T. Abdallah will be Georgia Tech's new executive vice president for research. (Credit: University of New Mexico)\nJun 28, 2018\n— Atlanta, GA\nThe Georgia Institute of Technology has named Chaouki T. Abdallah, currently provost and executive vice president for academic affairs at the University of New Mexico, to be its new executive vice president for research (EVPR). The EVPR directs Georgia Tech’s $824 million research program and is part of the Institute’s four-member executive leadership team.\nAbdallah, who is a Georgia Tech alumnus with master’s and Ph.D. degrees in electrical engineering, conducts research and teaches courses in the general area of systems theory with focus on control and communications systems. He will move into the EVPR role in mid-August, succeeding Stephen E. Cross, who is stepping down after serving as Georgia Tech’s first EVPR for the past eight years.\n“Dr. Abdallah has a proven track record as an administrator, scholar and researcher, along with experience collaborating with industry, government and community partners,” said Georgia Tech President G.P. “Bud” Peterson. “As a Tech alumnus who has remained engaged with the Institute, he brings a unique perspective. We’re looking forward to working with him to enhance Georgia Tech’s basic and applied research and maximize economic impact.”\nBeyond his service as provost and executive vice president for academic affairs, Abdallah is a professor in the Electrical and Computer Engineering (ECE) Department at the University of New Mexico. He has also served there as acting president, interim president and president, and was the first recipient of the New Mexico ECE department’s Lawton-Ellis Award for combined excellence in teaching, research and student/community involvement. He has received research funding from the National Science Foundation, the Air Force Office of Scientific Research, the U.S. Naval Research Laboratory, other national laboratories and various companies.\n“After an academic career of 30 years at the University of New Mexico, I am very excited to be joining one of the premier institutions of higher learning in the world,” said Abdallah. “I look forward to contributing to President Peterson's cabinet, to advocate for and lead the research enterprise at Georgia Tech, and to help ‘create the next’ in research.”\nAbdallah is married to Catherine Cooper, a logistics expert who earned her bachelor’s degree in industrial and systems engineering from Georgia Tech. Their twin sons, Carter and Calvin, are incoming Georgia Tech first-year students. Abdallah is fluent in English, French, and Arabic, and serves on Georgia Tech’s ECE Advisory Board. Abdallah is a senior member of IEEE and a recipient of the IEEE Millennium medal.\nChristopher Jones, associate vice president for research, has agreed to serve as interim EVPR until Abdallah’s arrival.\nCross plans to step down June 30 to return to his research faculty position in the Georgia Tech Research Institute (GTRI). In welcoming Abdallah, Peterson thanked Cross for his many accomplishments in leading the research program. In addition to dramatic growth in research volume, Cross led the formation of Georgia Tech’s system of 11 interdisciplinary research institutes (IRIs) to coordinate research in areas of specific interest to industrial companies.\n“I want to take this opportunity to thank Steve Cross, who has served us well as Georgia Tech’s first EVPR,” said Peterson. “I am personally grateful for his leadership in the development of our 25-year strategic plan, ‘Designing the Future.’ In his EVPR role, he has worked to enhance Georgia Tech’s research impact by bringing together GTRI, the Enterprise Innovation Institute, IRIs and other Institute research, encouraging collaboration, making it easier for government, business, and industry to partner with us, and building innovation neighborhoods around the campus.”\nAbdallah’s selection resulted from a national search led by Georgia Tech Provost Rafael L. Bras, who holds the K. Harrison Brown Family Chair.\nOverview of Georgia Tech research\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : John Toon (404-894-6986) (jtoon@gatech.edu)\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}