{"text": "Climbing Stairs Just Got Easier with Energy-Recycling Steps | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nClimbing Stairs Just Got Easier with Energy-Recycling Steps\nEnergy-recycling stairs developed to store a user’s energy during descent and return energy to the climber during ascent.\nFacebook\nTwitter\nEmail\nWhen going up, the stairs give people a boost by releasing stored energy, making it 37 percent easier on the knee than using conventional stairs.\nJul 12, 2017\n— Atlanta, GA\nResearchers at Georgia Tech and Emory University have created a device that makes walking up and down stairs easier.\nThey’ve built energy-recycling stairs\nthat store a user’s energy during descent and return energy to the user during ascent.\nThe spring-loaded stairs compress when someone comes down the stairs, saving energy otherwise dissipated through impact and braking forces at the ankle by 26 percent. When going up, the stairs give people a boost by releasing the stored energy, making it 37 percent easier on the knee than using conventional stairs. The low-power device can be placed on existing staircases and doesn’t have to be permanently installed.\nEach stair is tethered by springs and equipped with pressure sensors. When a person walks downstairs, each step slowly sinks until it locks into place and is level with the next step, storing energy generated by the user. It stays that way until someone walks upstairs. When a person ascending the stairs steps on the sensor on the next tread up, the latch on the lower step releases. The stored energy in the spring is also released, lifting up the back leg.\nThe paper is currently published in the journal Public Library of Science PLOS ONE. The authors say the initial idea was to use energy-recycling prosthetic shoes to help people going up stairs.\n“Unlike normal walking where each heel-strike dissipates energy that can be potentially restored, stair ascent is actually very energy efficient; most energy you put in goes into potential energy to lift you up,” said\nKaren Liu , an associate professor in Georgia Tech’s\nSchool of Interactive Computing . “But then I realized that going downstairs is quite wasteful. You dissipate energy to stop yourself from falling, and I thought it would be great if we could store the energy wasted during descent and return it to the user during ascent.”\nLiu is a co-author of the paper with colleague\nLena Ting , a professor of biomedical engineering in the\nWallace H. Coulter Department of Biomedical Engineering at Emory and Georgia Tech .\nWalking down stairs is like tapping the breaks of your car while revving the engine,\" said Ting. \"Your legs use a lot of energy bracing each steop to avoid falling too fast. Our stairs store that energy rather than wasting it.\"\nThe researchers didn’t expect, prior to designing the device, that the stairs would actually ease the impact of going downstairs.\n“The spring in the stairs, instead of the ankle, acts as a cushion and brake,” said\nYun Seong Song , who built the device as a postdoctoral researcher at Georgia Tech. He’s currently an assistant professor at Missouri University of Science and Technology. “The gentle downward movement alleviates work by the trailing ankle, which is what keeps you balanced and prevents you from falling too fast on normal stairs.”\nLiu initially got the idea for the project when she attended a conference and saw an ankle brace that stored and released energy. Her 72-year-old mother has no problems walking but has difficulty climbing steps, and Liu knew she wouldn’t wear special sneakers just for stairs. So she decided to make smart stairs that act like the shoe.\n“Current solutions for people who need help aren’t very affordable. Elevators and stair-lifts are often impractical to install at home,” Liu said. “Low-cost, easily installed assistive stairs could be a way to allow people to retain their ability to use stairs and not move out of their homes.”\n“Maintaining mobility is very much a use-it-or-lose-it thing. It’s important to keep people walking and independent through injury and aging to maximize quality of life,” said Ting.\nThe researchers think the temporary stairs could also be helpful for those recovering from surgery or pregnant women — people who only need help for short periods of time and don’t need to permanently alter their homes.\nThe researchers are looking for partners to extend the project, which currently runs on a staircase with only two steps and can be used by just one person at a time. It was supported by the National Science Foundation (EFRI-1137229).\nThe paper, \" Stair negotiation made easier using novel interactive energy-recycling assistive stairs ,\" was published on July 12.\nAny opinions, findings and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the National Science Foundation.\nAdditional Images\nRelated links\nKaren Liu: Women of Robotics\nLena Ting: Dancing Toward Better Rehab\nLena Ting: The New Stairs, in Her Own Words\nContact\nJason Maderer\nNational Media Relations\nmaderer@gatech.edu\n404-660-2926\nEmail\nmaderer@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}