{"text": "How to Talk to Someone Who Doesn’t Share Your Views | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nHow to Talk to Someone Who Doesn’t Share Your Views\nSuggestions for having a civil discussion on sensitive issues.\nFacebook\nTwitter\nEmail\nDec 14, 2023\nAs families and friends gather during the holidays, conversations can turn to world events and politics. In a flash, what started as a pleasant chat devolves into a shouting match with Uncle Bob. Does it have to end this way? Or can we remain civil while disagreeing?\n“Neuroscience helps us to understand why we might get worked up during tense conversations,” said Tiffiny Hughes-Troutman, professor of the practice in the School of Psychology. “When one is working through sensitive and serious issues internally, emotions may run high.”\nHughes-Troutman said if a disagreement feels like a threat cognitively, a person’s body can go into fight-or-flight mode, which takes control over rational thinking. In physiological terms, fight-or-flight may present as a fast heart rate, anxiety, increased perspiration, and other signs of stress.\n“The ‘fight’ contributes to intensified conflict and can show up when we come across too aggressively or shout,” she said. “The ‘flight’ can lead us to withdraw or become disengaged from the discussion, and depending on the circumstance, this withdrawal can escalate the situation.”\nHughes-Troutman said it is possible to manage our emotions and enter productive and respectful discussions. She suggests employing the following strategies to facilitate the conversation:\nFocus on the breath.\nBreath control helps us to concentrate on slow, deep breathing, calms our heart rate, and facilitates a state of presence and focus on the conversation. Breathing techniques such as diaphragmatic breathing can reverse the stress response.\nAcknowledge your emotions and feelings.\nBoth emotions and feelings are activated during difficult discussions. Emotions are physiological responses that originate as sensations in the body whereas feelings are influenced by our emotions and are generated from mental thoughts. Developing emotional awareness limits reactivity and promotes thoughtfulness and compassion.\nDon’t rush the discussion.\nRecognizing the significance of psychological safety, it is important to devote enough time to have a thoughtful, productive discussion and to have such discussions in spaces where all parties feel comfortable.\nTake a break, if needed.\nTaking a break is not only an action, but also an effective communication skill that may result in a slower pace and more time for thoughtful reflection. The momentum to finish a conversation can feel compelling, but the better approach may be to say, “I am feeling upset; can we take a 15-minute break?”\nEven under the best circumstances, the question remains\n—\ncan we overcome our differences?\nSonia Alvarez-Robinson, associate vice president for Strategy and Organizational Effectiveness, uses a technique called polarity management for guidance. “Managing polarities does not look for a right or wrong answer, a winner or loser, or even to make the polarities go away. Rather, it is a way to draw out the best parts of the differing viewpoints so that those involved can coexist in healthy and productive ways.\nAlvarez-Robinson, who has a doctorate in human and organizational behavior, said if the differing viewpoints are ongoing\n— and unlikely to change — and the people involved are interdependent, like a family or a work team, then the differences may not be solvable, but they can be managed.\n“In my 30 years of helping organizations improve performance and achieve their strategic goals, I have learned the only way for differences to be leveraged as a strength is by effectively managing polarities,” she said. “Diversity of thought does make human dynamics challenging, but it also can make an organization great.”\nRelated links\nTips for Managing Stress\nContact\nVictor Rogers\nInstitute Communications\nAdditional information\nCampus Resources:\nReach out for help. Students experiencing a mental health crisis that requires immediate attention may speak with a counselor at any time 24 hours a day, seven days a week. During regular business hours, students who are not actively in crisis but would like to schedule a counseling appointment may call\n404.894.2575\nor visit the Center for Mental Health Care and Resources located on the second floor, Suite 238, of the Smithgall Student Services Building, 353 Ferst Drive. After business hours, please call\n404.894.2575\nand select the option to speak to the after-hours counselor.\nStaff can contact the Employee Assistance Program 24 hour a day, seven days a week at 844.243.4440, or via the\nAcentra website  using company code: USGCares.\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}