{"text": "Researchers Use Machine Learning To More Quickly Analyze Key Capacitor Materials | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nResearchers Use Machine Learning To More Quickly Analyze Key Capacitor Materials\nResearchers at Georgia Institute of Technology are using machine learning to ultimately find ways to build more capable capacitors.\nFacebook\nTwitter\nEmail\nRampi Ramprasad, a professor in the School of Materials Science and Engineering, holds an aluminum-based capacitor. (Credit: Allison Carter)\nMar 04, 2019\n— Atlanta, GA\nCapacitors, given their high energy output and recharging speed, could play a major role in powering the machines of the future, from electric cars to cell phones.\nBut the biggest hurdle for these energy storage devices is that they store much less energy than a battery of similar size.\nResearchers at Georgia Institute of Technology are tackling that problem in a novel way, using machine learning to ultimately find ways to build more capable capacitors.\nThe method, which was described in February 18 in the journal npj Computational Materials and sponsored by the U.S. Office of Naval Research, involves teaching a computer to analyze at an atomic level two materials that make up some capacitors: aluminum and polyethylene.\nThe researchers focused on finding a way to more quickly analyze the electronic structure of those materials, looking for features that could affect performance.\n“The electronics industry wants to know the electronic properties and structure of all of the materials they use to produce devices, including capacitors,” said Rampi Ramprasad, a professor in the School of Materials Science and Engineering.\nTake a material like polyethylene: it is a very good insulator with a large band gap—an energy range forbidden to electrical charge carriers. But if it has a defect, unwanted charge carriers are allowed into the band gap, reducing efficiency, he said.\n“In order to understand where the defects are and what role they play, we need to compute the entire atomic structure, something that so far has been extremely difficult,” said Ramprasad, who holds the Michael E. Tennenbaum Family Chair and is the Georgia Research Alliance Eminent Scholar in Energy Sustainability. “The current method of analyzing those materials using quantum mechanics is so slow that it limits how much analysis can be performed at any given time.”\nRamprasad and his colleagues, who specialize in using machine learning to help develop new materials, used a sample of data created from a quantum mechanics analysis of aluminum and polyethylene as an input to teach a powerful computer how to simulate that analysis.\nAnalyzing the electronic structure of a material with quantum mechanics involves solving the Kohn-Sham equation of density functional theory, which generates data on wave functions and energy levels. That data is then used to compute the total potential energy of the system and atomic forces.\nUsing the new machine learning method produces similar results eight orders of magnitude faster than using the conventional technique based on quantum mechanics.\n“This unprecedented speedup in computational capability will allow us to design electronic materials that are superior to what is currently out there,” Ramprasad said. “Basically we can say, ‘Here are defects with this material that will really diminish the efficiency of its electronic structure.’ And once we can address such aspects efficiently, we can better design electronic devices.”\nWhile the study focused on aluminum and polyethylene, machine learning could be used to analyze the electronic structure of a wide range materials. Beyond analyzing electronic structure, other aspects of material structure now analyzed by quantum mechanics could also be hastened by the machine learning approach, Ramprasad said.\n“In part we selected aluminum and polyethylene because they are components of a capacitor, but it also allowed us to demonstrate that you can use this method for vastly different materials, such as metals that are conductors and polymers that are insulators,” Ramprasad said.\nThe faster processing allowed by the machine learning method would also enable researchers to more quickly simulate how modifications to a material will impact its electronic structure, potentially revealing new ways to improve its efficiency.\nThis research was supported by the Office of Naval Research under grant No. N0014-17-1-2656. The content is the responsibility of the authors and does not necessarily represent the official views of the sponsoring agency.\nCITATION:\nAnand Chandrasekaran, Deepak Kamal, Rohit Batra, Chiho Kim, Lihua Chen and Rampi Ramprasad, “Solving the electronic structure problem with machine learning,” (Computational Materials, 2019). http://dx.doi.org/10.1038/s41524-019-0162-7\nAdditional Images\nContact\nJohn Toon\nResearch News\nEmail\njohn.toon@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}