{"text": "Cabrera Delivers Institute Address | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nCabrera Delivers Institute Address\nAnother Record Year for Georgia Tech\nFacebook\nTwitter\nEmail\nSep 02, 2022\n— Atlanta, GA\nPresident Ángel Cabrera delivered the annual Institute Address on Thursday, Sept. 1, to an audience in the Clough Undergraduate Learning Commons and to another 550 viewers on YouTube.\nHe talked about the Institute as a high return on investment for academic degrees, a research powerhouse, and a driver of growth. He said that work done over the past decade to strengthen the student experience has paid off.\n“Our six-year graduation rates, an industry standard, are now among the country’s best.” They are also key to a strong return on investment for students. Because of the Institute’s graduation rates, relatively low tuition, and great career outcomes, independent ratings of student ROI consistently place Tech near the top in the nation.\n“I am delighted that over the last three years not only haven’t we increased tuition, but, thanks to state investments, enrollment growth, and fiscal prudence, we have been able to reduce it.”\nWith these outcomes, demand for a Georgia Tech education is at an all-time high. Amid a national decline in college enrollment, this year Tech broke a new record with more than 50,000 students applying for first-year admission.\n“This year we just welcomed nearly 3,700 new first-year students. With another 1,400 students transferring in from other universities, this is our\nlargest incoming class ever . Add to this the continuing expansion of our online graduate programs, and our overall enrollment now sits at more than 46,000 students. That is the largest number of students we have ever served,” he said.\nOn the research side, Cabrera said faculty have continued to deliver impressive growth in research awards and expenditures.\n“In the latest\nHigher Education Research and Development Survey , Georgia Tech was one of only 21 universities in the country with research expenditures exceeding $1 billion — and the only one among them without a medical school. Since 2020, new research awards have kept growing, reaching nearly $1.3 billion this past fiscal year.”\nMore resources, Cabrera said, mean more scientific breakthroughs and technological advances, deeper influence on the thinking and decisions of policymakers and business leaders, and more innovative solutions to complex human problems. “They also allow us to attract some of the best researchers in the world and provide them with the facilities and equipment they need. In the innovation business, talent and ideas breed talent and ideas.”\nCabrera spent time this summer traveling through Europe and seeing firsthand the impact Georgia Tech has in other parts of the world. After returning to the U.S., he hit the road for the Georgia Summer Tour, visiting eight towns and attending more than 20 events. At each stop, he met current and incoming students and their families, as well as friends and alumni. He also visited with local lawmakers and businesses leaders to learn how Georgia Tech can support their local economies and drive innovation.\nAccording to the annual report produced by the University of Georgia for the Board of Regents, last year Georgia Tech had an immediate statewide impact of nearly $4.2 billion, the highest in the state and about 22% of all public universities in Georgia.\n“Nowhere is our impact more visible than right here in our neighborhood,” he said. “We are all very familiar with the work we’ve done with our affiliate organizations and other public and private organizations to transform our neighborhood into a thriving innovation hub appealing to both big companies and startups, and to a growing number of young professionals who choose to live here.”\nTech Square, West Midtown, and surrounding areas have become a destination for corporations like Microsoft, Google, Cisco, Micron, Airbnb, Norfolk Southern, Nike, and others who want to be close to the talent and research emerging from Georgia Tech. The announcements, one after another, show how this has become one of the hottest tech neighborhoods in America, and more work is underway.\n“We are planning a two-tower complex in the heart of the neighborhood that will house the Scheller College of Business, the H. Milton Stewart School of Industrial and Systems Engineering, GTRI, and several other programs in support of the startup ecosystem,” Cabrera said. “On the south side, construction is underway for our new biomedical innovation district —\nScience Square . It will become a global biomedical research and technology hub. Just like Tech Square, we want Science Square to be an example of how a research university can support innovation and help transform its city.”\nCabrera concluded by highlighting the new fundraising effort that launched this summer —\nTransforming Tomorrow: The Campaign for Georgia Tech . “This comprehensive campaign will raise more than $2 billion through various funding priorities centered around transforming lives, ideas, learning, our community, and our world. It will be the Institute’s biggest fundraising effort to date to support student access. More than one-quarter of the funds are expected to be earmarked toward student financial aid,” he said.\n“We are currently building a strong campaign steering committee and will be hitting the road this fall to share the campaign goals with alumni and friends around the nation and beyond.”\nThe address was followed by a question and answer session. The event was recorded and is available\nhere .\nAdditional Images\nRelated links\nScience Square\n2022 Enrollment\nTransforming Tomorrow: The Campaign for Georgia Tech\nContact\nVictor Rogers\nInstitute Communications\nEmail\nvictor.rogers@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}