{"text": "Yves Berthelot, Vice Provost for International Initiatives, to Retire | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nYves Berthelot, Vice Provost for International Initiatives, to Retire\nGeorgia Tech-Lorraine President Yves Berthelot will retire June 30, 2021, after 36 years of service to the Institute.\nFacebook\nTwitter\nEmail\nGeorgia Tech-Lorraine President Yves Berthelot will retire June 30, 2021, after 36 years of service to the Institute.\nFeb 01, 2021\n— Atlanta, GA\nYves Berthelot, vice provost for International Initiatives, Steven A. Denning Chair in Global Engagement, president of Georgia Tech-Lorraine (GTL), and professor in the George W. Woodruff School of Mechanical Engineering, has announced that he will retire June 30, 2021, after 36 years of service to Georgia Tech.\n“Yves has always championed the necessity of global cooperation in solving the great challenges of the 21 st  century,” said Steven McLaughlin, provost and executive vice president for Academic Affairs. “His leadership, diplomatic talent, and vision have been instrumental in the development of Georgia Tech’s international presence. We will miss him, and we wish him the very best in retirement.”\nBerthelot took the role of vice provost for International Initiatives in 2012, directing the Institute’s Global Positioning Strategy and significantly growing international activities in education, research, economic development, and alumni outreach in Europe, Asia, and Latin America.\nPrior to taking the role of vice provost for International Initiatives, Berthelot served as the president of GTL in Metz, France, a position he has held since 2005. Berthelot was instrumental in launching the undergraduate program at GTL, which resulted in significant growth in student enrollment. Each year, close to 700 undergraduate and graduate students study at the Lorraine campus. In 2006, GTL launched the\nUnité Mixte Internationale\n(UMI)\n2958 GT-CNRS , a unique international joint laboratory between Georgia Tech and the\nCentre National de la Recherche Scientifique\n(CNRS). Renamed International Research Laboratories (IRL) by CNRS in 2020, this international partnership fueled significant growth at GTL over the past several years. In 2014, the campus celebrated the launch of the Lafayette Institute, a $30 million facility that facilitates the commercialization of innovations in optoelectronics. Georgia Tech's international initiatives reached another milestone in 2016, when the Institute formalized its presence in China by establishing a campus in the high-tech city of Shenzhen.\nBerthelot was also closely involved in the inception and launch of France-Atlanta in 2010, an annual series of high-caliber events focused on innovation and designed to foster transatlantic cooperation and exchange. Over its 11 years of existence, France-Atlanta has grown into a multidisciplinary affair, with 3,000 scholars, artists, and visionaries exchanging ideas and exploring possible areas of cooperation at its events each year. France-Atlanta has led to lasting partnerships with local institutions, including a startup exchange program between the cities of Atlanta and Toulouse, the creation of an International Associated Library, and an education series that has reached nearly 5,000 students by bringing French-speaking professionals into metro Atlanta classrooms.\nA native of France, Berthelot first joined the faculty at Georgia Tech in 1985. Early in his career, his passions for music and engineering led him to combine those interests, specializing in acoustics, sound, and ultrasound throughout his academic career. He holds two patents and has received numerous awards for his research in laser ultrasonics.\nBerthelot will remain vice provost for International Initiatives while a search commences. Details on the search process and the leadership transition will be announced later this spring.\nAdditional Images\nContact\nSusie Ivy\nDirector of Organizational, Academic, and Research Communications\nInstitute Communications\nEmail\nsusie.ivy@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}