{"text": "Ivan Allen College of Liberal Arts and the College of Computing Launch New Ethics Center | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nIvan Allen College of Liberal Arts and the College of Computing Launch New Ethics Center\nThe new Center will advance ethics-in-technology-centered research, education, and engagement at the Georgia Institute of Technology.\nFacebook\nTwitter\nEmail\nOct 13, 2020\n— Atlanta, GA\nBuilding on years of experience in research and education in ethics and technology, the College of Computing and the Ivan Allen College of Liberal Arts have launched the Ethics, Technology, and Human Interaction Center (ETHIC x ).\nThe new Center — pronounced “ethics” — will advance ethics-in-technology-centered research, education, and engagement at the Georgia Institute of Technology in collaboration with communities, government, non-governmental organizations, and industry. The office of the Executive Vice President for Research provided significant funds over a three-year period to seed the Center.\n“We must foster Georgia Tech’s strengths in ethics, responsible research, and the development of emerging technologies in collaborative ways,” said Raheem Beyah, dean in the College of Engineering, who provided funding for the Center while vice president for interdisciplinary research. “ETHIC x\nwill provide the necessary environment to support this work and Georgia Tech’s mission to advance technology and improve the human condition.”\nThe Colleges already have in-depth research and education experience addressing technology-related ethics questions. For instance, the School of Public Policy founded the Center for Ethics and Technology more than 12 years ago to foster a critical inquiry culture and deliberation about technology-related ethical issues. Faculty in that Center research ethical issues in the design of emerging contact tracing technologies, design ethics, social justice theory, and criticism broadly, and their relationship to emerging technologies such as smart cities, self-driving cars, and smart assistants, and a platform for fostering reflection and self-correcting reasoning in teaching and deliberation. The College of Computing also has created thriving research and educational initiatives such as the Ethical AI professional development course and the Law, Policy, and Ethics Initiative for Machine Learning @ GATECH.\nThe new Center will build on those strengths and position the Georgia Institute of Technology to become the leader in framing ethical concerns in technology, including fairness, accountability, transparency, social justice, and technological change.\nAnticipating New Ethical Challenges\n“ETHIC x\nwill be a place for robust, multidisciplinary research and a place to engage in systematic ethical analyses,” said Kaye Husbands Fealing, dean of the Ivan Allen College of Liberal Arts. “It also will be a place for communities, corporations, governments, technologists, educators, and others to discuss and find solutions to complex ethical issues in science and technology.”\nThe Center will conduct research in ethics and emerging technologies, frame ethical questions, solutions in ethics and technology, and social justice and equity. Interdisciplinary and community-based research also will be emphasized.\nEducational initiatives will include investigating and designing curricula for ethics training that can be woven throughout students’ educational journeys and for employees at affiliated companies.\n”Responsibility is a core value of everything we do in the College of Computing at Georgia Tech. That means focusing on our communities and examining the impacts, both positive and negative, of our research and curricula,” said Charles Isbell, dean and John P. Imlay, Jr. chair of the College of Computing. “It means reaching across disciplines to collaborate with experts in other fields who can inform our own technological developments. We find solutions for tomorrow’s problems, which means we have to anticipate the new ethical challenges we will face. This Center will help us do that.”\nNew Center Builds on Deep Experience\nGeorgia Tech launched the School of Interactive Computing in anticipation of the need for interdisciplinary research in computer science, liberal arts, and more. Faculty members examine diverse ethical challenges, including misinformation, content moderation, free speech on social platforms, data privacy and security, virtual reality, wearable computing devices, and robo-ethics.\nFaculty and students throughout the Ivan Allen College of Liberal Arts engage in interdisciplinary research collaborations on ethics and emerging technologies, including in areas such as engineering, the environment, bioethics, responsible innovation, research ethics, the\nethical  and political dimensions of design and technology, and more.\n“In the Ivan Allen College, careful consideration of the impacts of technology on people, and of people on technology, is a central part of our curriculum and values,” said Justin Biddle, an associate professor in the School of Public Policy, director of the Center for Ethics and Technology, and a member of the new Center’s leadership team. “With innovation today often outpacing our ability to understand its consequences, and widespread questions regarding the relations between technology, equity, and social justice, this kind of thinking is more important than ever.”\nFaculty in both Colleges also have initiated discussions on the social and ethical implications of emerging technologies across campus and beyond. These include the\nTechDebates on Emerging Technologies ,\nthe\nSparks Forum on Ethics and Engineering , the Machine Learning@GT Seminar Series, and the\nEthics and Technological Futures\nseries developed by Nassim Parvin and Susana Morris in the\nSchool of Literature, Media, and Communication . Ellen Zegura, a professor in the School of Computer Science, also leads a Mozilla grant aimed at embedding ethics in computer science classes through role play.\n'Where the Best of Sciences and Humanities Meet'\nDeven Desai, associate professor and area coordinator for Law and Ethics at Scheller College of Business, also will assume a key leadership role at ETHIC x . He said the new Center will “build and deepen technology-related ethics scholarship and research across Georgia Tech.\n“Scheller College’s focus on law and ethics is part of how we train future business leaders, the people who take innovation and bring it to market,” said Desai, who is also associate director for Law, Policy, and Ethics for Machine Learning at GA Tech (ML@GATECH), an interdisciplinary research center.\n“ETHIC x\nwill be a place where the best of science and humanities meet to challenge and push to find the unasked, important questions. In that friction and fun, the best questions about the problems we face and the best answer about how to solve them so that everyone can benefit will come out,” he said.\nOther members of the new Center’s key leadership team include Jason Borenstein, director of graduate research ethics programs in the School of Public Policy; Betsy DiSalvo, director of the human-centered computing Ph.D. program and associate professor in the School of Interactive Computing; Michael Hoffmann, a professor in the School of Public Policy; and Nassim Parvin, an associate professor in the School of Literature, Media, and Communication.\nFor more information about ETHIC x , contact Husbands Fealing at\ndean@iac.gatech.edu\nor Howard at\nah260@gatech.edu .\nAdditional Images\nContact\nMichael Pearson\nmichael.pearson@iac.gatech.edu\nDavid Mitchell\ndavid.mitchell@cc.gatech.edu\nEmail\nmichael.pearson@iac.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}