{"text": "Bernard F. Schutz Elected as Fellow of the Royal Society | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nBernard F. Schutz Elected as Fellow of the Royal Society\nSchutz is honored for seminal contributions to relativistic astrophysics, including the analytical foundation in gravitational wave detection. The Center for Relativistic Astrophysics member helped spark Tech’s CRA, as well as the Max Planck Institute.\nFacebook\nTwitter\nEmail\nMay 07, 2021\n— Atlanta, GA\nA\nSchool of Physics\nadjunct professor who served as a founding director of the\nMax Planck Institute for Gravitational Physics (Albert Einstein Institute - AEI) , helped spark the creation of the\nCenter for Relativistic Astrophysics\n(CRA) at Georgia Tech, and laid the analytical foundation in the search for gravitational waves is now the recipient of top honors from the world's oldest independent scientific academy.\nBernard F. Schutz , also a professor in the\nSchool of Physics and Astronomy at Cardiff University , has been elected as a Fellow to the\nRoyal Society , the United Kingdom’s national academy of sciences. Schutz joins a number of distinguished individuals in his scientific discipline — Isaac Newton, Albert Einstein, and Michael Faraday, to name a few — as a Royal Society Fellow.\nSchutz is honored and elected for seminal contributions to relativistic astrophysics, including driving the field for gravitational waves detection — ripples in time and space caused by violent and energetic celestial events, such as colliding black holes — research that helped lead to\ntheir direct detection in 2015 . Georgia Tech played a direct and pivotal role in the analysis of the observed signal, and gravitational wave confirmations earned the\n2017 Nobel Prize in Physics .\n“My general reaction is one of pleasure and humility,” Schutz shares with the College of Sciences. “It is wonderful to be recognized for work that started 35 years ago and still continues, and it is humbling to be joining an academy that has such a distinguished membership.”\n“It is a great honor to have professor Schutz as adjunct faculty to the CRA,” says Laura Cadonati, School of Physics professor, CRA director, and past deputy spokesperson for the Laser Interferometer Gravitational-Wave Observatory (LIGO). “His vision and advocacy have brought LIGO and gravitational waves to Georgia Tech, and made it possible for Georgia Tech to play a role in the discovery of gravitational waves and the exploration of the mysteries of the universe with this new messenger.”\nHonoring a groundbreaking career in astrophysics research\nSchutz says he feels the same way he did when, in 2019, he was elected to the\nU.S. National Academy of Sciences . With his election to the Royal Society, Schutz is now one of the few full members of both of these two leading scientific academies, “a privileged position enabled by my having dual citizenship in the two nations.”\nEvery year, a maximum of 52 fellows may be elected to the Royal Society. Fellows are elected for life through a peer review process based on their excellence in science.\nIn Schutz’s case, his election stems from his 1980s work that laid the analytical foundation for data interpretation of gravitational waves. He accomplished this despite the fact that gravitational waves were still in the realm of theory at the time, and that the detectors needed to find them weren’t yet invented.\nSchutz’s research then helped with what “the big detectors like LIGO and Virgo (then just proposals on the drawing board) would gather 30 years later,”\nnotes the Max Planck Institute (AEI) . “He showed how to use gravitational waves to measure distances across the Universe, and how to go from that to measuring the expansion rate of the Universe, one of the most fundamental numbers in all astronomy. He then showed how to extract the very weak expected signals from the data, developing methods used to this day. This work continued when Schutz came to Potsdam, where his department brought into the field a good fraction of the data analysts and supercomputer simulation specialists working in the gravitational-wave science today.”\nIn 2015, LIGO scientists would use Schutz’s work in what would become that 2017 Nobel Prize-winning research for the first observation of gravitational waves — a collaborative effort that involved a team of School of Physics researchers in the CRA at Georgia Tech, who joined hundreds of other scientists around the world in assisting LIGO in gathering and analyzing data.\nCadonati credits Schutz for helping to grow the CRA. “In the years preceding discovery, he advocated for stronger ties between the gravitational wave community and the astronomy community, which seeded multi-messenger astrophysics as we know it,” Cadonati notes, referring to astronomical observation that uses signals delivered by different “messengers” such as electromagnetic radiation, gravitational waves, neutrinos, and cosmic rays. “I think it is fair to say professor Schutz is one of the founding fathers of multi-messenger astronomy — and the CRA is now part of that vision.”\nInvesting in the future of relativistic — and multi-messenger — astrophysics\nSchutz put Georgia Tech on that path in 2011, when he made his first trip to the Institute to seek out more LIGO partners. Cadonati, along with former Georgia Tech Physics colleagues\nPablo Laguna\nand\nDeirdre Shoemaker , recall that during a chat over lunch, Schutz urged then-College of Sciences dean\nPaul Houston , now an emeritus professor in the\nSchool of Chemistry and Biochemistry , to invest in multi-messenger astrophysics.\n“It was a time when we needed to get more universities involved in the LIGO project so that we could be at full strength when the data started to come in again,” Schutz explains. “In particular, the numerical simulations of black holes that Pablo Laguna and Deirdre Shoemaker were performing at the time were providing essential input to our ability to interpret signals when we eventually began to detect them — starting, of course, in 2015.”\nUnder Cadonati’s leadership, Schutz adds, “the CRA will continue to play a very important role in that collaboration. Seeing this gives me a lot of pleasure.”\nSchutz’s career, spanning five decades, has seen him working with some of the most notable names in science. When he received his Ph.D. in 1971 from the California Institute of Technology, his supervisor was future Nobel Prize-winning physicist Kip Thorne. He then moved on to Cambridge University, where he worked with the late Stephen Hawking.\nSchutz started at University College Cardiff, now Cardiff University, in 1974. It was there that Schutz developed the theories that would later become the standard search tools for finding signs of gravitational waves within data.\nIn 1995, Schutz moved to Germany to join Jürgen Ehlers as one of two founding directors of the Max Planck Institute for Gravitational Physics (Albert Einstein Institute - AEI), which stands as the largest research institute in the world devoted to gravitational science, covering the entire spectrum of gravitational physics, “from the giant dimensions of the Universe to the tiny scales of strings.”\nRetiring from that post in 2014, he returned to Cardiff University as a professor in Physics and Astronomy and as the first director of the University’s Data Innovation Research Institute.\nIn addition to his election to the Royal Society and the U.S. National Academy of Sciences, Schutz is a Fellow of the\nAmerican Physical Society , the\nInstitute of Physics , and the\nLearned Society of Wales , and has most recently been awarded the Eddington Medal from the\nRoyal Astronomical Society , and the 2020 Isaacson Prize in Gravitational Wave Science from the American Physical Society.\nAdditional Images\nRelated links\nProfessor Bernard Schutz elected Fellow of the Royal Society\nCenter for Relativistic Astrophysics\nContact\nRenay San Miguel\nCommunications Officer II/Science Writer\nCollege of Sciences\n404-894-5209\nJess Hunt-Ralston\nDirector of Communications\nCollege of Sciences\nGeorgia Institute of Technology\nEmail\nrenay.san@cos.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}