{"text": "Georgia Tech Continues to Lead Among Universities Nationwide in Engineering and Computing Programs; Reports Record Month in Research Awards | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Continues to Lead Among Universities Nationwide in Engineering and Computing Programs; Reports Record Month in Research Awards\nAll of Tech’s engineering programs remained in the top five in the 2021 U.S. News undergraduate rankings\nFacebook\nTwitter\nEmail\nTech Tower\nSep 14, 2020\n— Atlanta, GA\nTwelve of Georgia Tech’s academic programs rank among the best in the country, according to the recently released\nU.S. News & World Report\n2021 “Best Colleges” undergraduate rankings, with three programs — civil engineering, cybersecurity, and industrial and systems engineering — ranking No. 1.\nAll of Tech’s engineering programs remained in the top five for universities offering the discipline, with the H. Milton Stewart School of Industrial and Systems Engineering and the undergraduate civil engineering program at the top. Tech’s undergraduate programs in aerospace, biomedical, chemical, and mechanical engineering were all ranked No. 2 in their respective fields. Electrical, environmental, and materials engineering each ranked No. 4, and computer engineering ranked No. 5.\nThe College of Engineering remains ranked No. 4 for best undergraduate engineering disciplines overall.\nNew this year was the ranking for computer science programs. Georgia Tech’s cybersecurity program ranked No. 1, and software engineering ranked No. 2 among national universities. The computer science program ranked No. 5 overall in a tie with California Institute of Technology, Cornell, Princeton, University of Illinois Urbana-Champaign and the University of Washington.\n“Thanks to our outstanding students, faculty, and staff, leaders in higher education continue to recognize Georgia Tech as one of the leading public research universities in the U.S.,\" said Ángel Cabrera, president of Georgia Tech. “I am also delighted the Institute is listed among the nation's most innovative schools — a fitting recognition of our efforts to enrich the student experience and expand access to working professionals through our innovative online graduate programs.”\nThe Scheller College of Business climbed three spots this year to No. 19 in a tie with the University of Illinois Urbana-Champaign; University of Maryland, College Park; University of Minnesota Twin Cities; and the University of Washington. Three of Scheller’s specialty programs ranked in the top five, with both management information systems and business analytics at No. 3, and quantitative analysis at No. 4.\nThis is the 36 th\nyear that\nU.S. News\nhas released their Best College rankings. Georgia Tech was among 1,452 U.S. bachelor's degree-granting institutions ranked on 17 indicators, including student-faculty ratio, the average federal loan debt of graduates, tuition and financial aid policies, student body demographics, and campus life.\nOverall, Georgia Tech ranked No. 8 in the best public university category, along with the University of California, Irvine and the University of California San Diego. Tech ranked No. 35 among top national universities, which includes public and private institutions, in a tie with Boston College; University of California, Irvine; and University of California San Diego.\nOther highlights for the Institute this year included being ranked No. 3 for Co-op/Internship Programs, No. 4 for Most Innovative national university, No. 11 for Undergraduate Research/Creative Projects, and tying for No. 15 in Best for Veterans (University of California, Irvine and University of California San Diego).\nTech Reports Record Amount in Research Awards\nGeorgia Tech is also making major strides in its research activities. Tech’s academic colleges recently recorded a total of $53.3 million in research and sponsored activities for July 2020, making it the highest month of award dollars in 10 years. The amount is an increase of $16.6 million from the same period in 2019. The total number of awards increased from 210 in July 2019 to 285 in July 2020 in academic units. The College of Engineering received 111 awards in July 2020. The College of Design notably had 45 more awards than in July 2019.\nAdditional Images\nRelated links\nGeorgia Tech Rankings\nContact\nDenise Ward\nInstitute Communications\nEmail\ndenise.ward@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}