{"text": "Scurrying Roaches Help Researchers Steady Staggering Robots | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nScurrying Roaches Help Researchers Steady Staggering Robots\nResearchers have leveraged cockroaches' scurrying skills for a cleverly simple method to assess and improve locomotion in robots.\nFacebook\nTwitter\nEmail\nThe robot used in this experiment was a Minotaur brand machine with legs. Georgia Tech / Neveln\nAug 22, 2019\n— Atlanta, GA\nEw, a cockroach! But it zips off before the swatter appears. Now, researchers have leveraged the bug’s superb scurrying skills to create a cleverly simple method to assess and improve locomotion in robots.\nNormally, tedious modeling of mechanics, electronics, and information science is required to understand how insects’ or robots’ moving parts coordinate smoothly to take them places. But  in a new study , biomechanics researchers at the Georgia Institute of Technology boiled down the sprints of cockroaches to handy principles and equations they then used to make a test robot amble about better.\nThe method told the researchers about how each leg operates on its own, how they all come together as a whole, and the harmony or lack thereof in how they do it. Despite bugs’ and bots’ utterly divergent motion dynamics, the new method worked for both and should work for other robots and animals, too.\nThe biological robot, the roach, was the far superior runner with neurological signals guiding six impeccably evolved legs. The mechanical robot, a consumer model, had four stubby legs and no nervous system but relied instead for locomotion control on coarse physical forces traveling through its chassis as crude signals to roughly coordinate its clunky gait.\n“The robot was much bulkier and could hardly sense its environment. The cockroach had many senses and can adapt better to rough terrain. Bumps as high as its hips wouldn’t slow it down at all,” said  Izaak Neveln , the study’s first author, who was a postdoctoral researcher in the  lab of Simon Sponberg at Georgia Tech during the study.\nAdvanced simplicity\nThe method, or “measure,” as the study calls it, transcended these huge differences, which pervade animal-inspired robotics.\n“The measure is general (universal) in the sense that it can be used regardless of whether the signals are neural spiking patterns,  kinematics , voltages or forces and does not depend on the particular relationship between the signals,” the study’s authors wrote.\nNo matter how a bug or a bot functions, the measure’s mathematical inputs and outputs are always in the same units. The measure will not always eliminate the need for modeling, but it stands to shorten and guide modeling and avert anguishing missteps.\nThe authors  published the study in the journal  Nature Communications  in August 2019. The research was funded by the National Science Foundation.  Sponberg is an assistant professor  in Georgia Tech’s School of Physics and in the School of Biological Sciences.\nCentralization vs. decentralization\nOften a bot or an animal sends many walking signals through a central system to harmonize locomotion, but not all signals are centralized. Even in humans, though locomotion strongly depends on signals from the central nervous system, some neural signals are confined to regions of the body; they are localized signals.\nSome insects appear to move with little centralization -- such as stick bugs, also known as walking sticks, whose legs prod about nearly independently. Stick bugs are  wonky runners .\n“The idea has been that the stick bugs have the more localized control of motion, whereas a  cockroach goes very fast  and needs to maintain stability, and its motion control is probably more centralized, more clocklike,” Neveln said.\nStrong centralization of signals generally coordinates locomotion better. Centralized signals could be code traveling through an elaborate robot’s wiring, a cockroach’s central neurons synching its legs, or the clunky robot's chassis tilting away from a leg thumping the ground thus putting weight onto an opposing leg.\nRoboticists need to see through the differences and figure out the interplay of a locomotor’s local and central signals.\n[Ready for graduate school?  Here's how to apply to Georgia Tech. ]\nCool physics\nThe new “measure” does this by focusing on an overarching phenomenon in the walking legs, which  can be seen as pendula  moving back and forth. For great locomotion, they need to synch up in what is called phase-coupling oscillations.\nA fun, easy experiment illustrates this physics principle. If a few, say six, metronomes – ticking rhythm pendula that piano teachers use -- are swinging out of sync, and you place them all on a platform that freely sways along with the metronomes’ swings,  the swings will sync up in unison .\nThe  phases, or directions, of their oscillations  are coupling with each other by centralizing their composite mechanical impulses through the platform. This particular example of phase-coupling is mechanical, but it can also be computational or neurological -- like in the roach.\nIts legs would be analogous to the swinging metronomes, and central neuromuscular activity analogous to the free-swaying platform. In the roach, not all six legs swing in the same direction.\n“Their synchronization is not uniform. Three legs are synchronized in phase with each other -- the front and back legs of one side with the middle leg of the other side -- and those three are synchronized out of phase with the other three,” Neveln said. “It’s an alternating tripod gait. One tripod of three legs alternates with the other tripod of three legs.”\nUseless pogoing\nAnd just like pendula, each leg’s swings can be graphed as a wave. All the legs’ waves can be averaged into an overall roach scurry wave and then developed into more useful math that relates centralization with decentralization and factors like  entropy  that can throw locomotion control off.\nThe resulting principles and math benefited the clunky robot, which has strong decentralized signals in its leg motors that react to leg contact with the ground, and centralized control weaker than that of the stick bug. The researchers graphed out the robot's movements, too, but they didn't result in the neatly synced group of waves that the cockroach had produced.\nThe researchers turned with the principles and math to the clunky robot, which initially was out of sorts -- bucking or hopping uselessly like a pogo stick. Then the scientists strengthened centralized control by re-weighting its chassis to make it move more coherently.\n“The metronomes on the platform are mechanical coupling, and our robot coordinates control that way,” Neveln said. “You can change the mechanical coupling of the robot by repositioning its weights. We were able to predict the changes this would make by using the measure we developed from the cockroach.”\nCockroach surprises\nThe researchers also wired up specific roach muscles and neurons to observe their syncopations with the scurry waves. Seventeen cockroaches took 2,982 strides to inform the principles and math, and the bugs also sprung surprises on the researchers.\nOne stuck out: The scientists had thought signaling centralized more when the roach sped up, but instead, both central and local signaling strengthened, perhaps doubling down on the message: Run!\nGeorgia Tech’s Amoolya Tiramulai coauthored the paper. The National Science Foundation funded the research (grant # NSF CAREER MPS/PoLS 1554790). Any findings, conclusions, and recommendations are those of the authors and not necessarily of the NSF.\nWriter & Media Representative : Ben Brumfield (404-660-1408), email:  ben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nAdditional Images\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}