{"text": "Using Smartphones and Laptops to Simulate Deadly Heart Arrhythmias | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nUsing Smartphones and Laptops to Simulate Deadly Heart Arrhythmias\nResearchers are using smartphones and laptop computers to model heart arrhythmias.\nFacebook\nTwitter\nEmail\nFlavio Fenton, a professor in the School of Physics at the Georgia Institute of Technology, examines cardiac and fluid flow simulations created on a system that uses graphics processing chips designed for gaming applications and software that runs on ordinary web browsers. (Photo: Allison Carter, Georgia Tech)\nMar 27, 2019\n— Atlanta, GA\nModeling the complex electrical waves that cause heart arrhythmias could provide the key to understanding and treating a major cause of death in the world. Until now, however, real-time modeling of those deadly waveforms within millions of interacting heart cells required especially powerful computer clusters – even supercomputers.\nUsing graphics processing chips designed for gaming applications and software that runs on ordinary web browsers, researchers have moved this modeling of the deadly spiral wave heart arrhythmias to less costly computers, and even to high-end smartphones. That could put the real-time 3D modeling into the hands of clinicians who may one day use the system to diagnose and treat these abnormal heart rhythms. The new tools could also help researchers study new drugs that must be evaluated for their potential to cause heart arrhythmias.\nBeyond cardiac issues, which can require solving billions of equations, the tools could also be applied to other physical systems, such as fluid flow and crystal growth. The research, which has been supported by the National Science Foundation and National Institutes of Health, is reported March 27 in the journal\nScience Advances . The new simulation tools rely on Web Graphics Library (WebGL 2.0) and can run on most common operating systems, independent of the operating system.\n“Models that might have been accessible to only a handful of researchers in the world will now be available to many more groups,” said\nFlavio Fenton , a professor in the\nSchool of Physics\nat the Georgia Institute of Technology. “This also opens the door to many other areas of research where people have equations that can be run in parallel. Anybody can have access to these solutions, which run simulations as much as thousands of times faster than standard CPUs.”\nFenton and collaborators at Georgia Tech and Rochester Institute of Technology have been studying harmful heart rhythm patterns to understand them – and potentially to design control strategies that go beyond existing treatments, which use drugs, implantable devices and tissue ablation to halt the arrhythmias. Ultimately, the researchers envision doctors using the simulations on tablet computers.\n“Being able to do real-time simulations in three dimensions could open the door to clinical applications where we could actually obtain patient geometries and solve these equations in the cells that are packed into the heart,” said Elizabeth Cherry, a professor of mathematics at Rochester Institute of Technology and one of the project researchers. “We could see applications in the clinic that could individualize treatments on the basis of their specific heart geometries. We could actually test possible therapies to see what would work for each patient.”\nKey to what they have done are graphics processing units (GPUs), which were developed to help computers display graphics and video. Their development and application have now taken off with the growth of the computer gaming industry, which needs fast parallel processing. High-end smartphones have as many as 900 GPU cores, while high-end graphics cards for laptop or desktop computers may have more than 5,000. Each core can process simulation data, providing a massively parallel computing system.\n“Over the past several years, GPUs have become really powerful,” Fenton said. “Each one has multiple processors, so you can run problems in parallel like a supercomputer does. As many as 40 or 50 differential equations must be calculated for each cell, and we need to understand how millions of cells interact. I was surprised that even a cellphone may have enough GPU cores to run these simulations.”\nHarnessing GPU power is not all the researchers have done. Software for the GPUs varies by manufacturer and chip type. To allow the simulations to run on any GPU, Research Scientist Abouzar Kaboudian developed a versatile programming library that enabled him and his team of collaborators to develop programs in WebGL that run through web browsers such as Chrome and Firefox. Through a browser, the tools can run the simulations on a variety of computers, tablets and phones – without the need to install any new programs on them.\n“If you have access to the Internet and a modern web browser like Firefox or Chrome, you can just go to a web link and the simulation will start running on the graphics card of your computer,” said Kaboudian. “Any problem that can be parallelized can run on the library that we have created. It will accelerate simulations on any computer by several hundred times.”\nWhile the original goal was to simulate heart arrhythmias, the tools can be useful with other simulations such as chemical reactions, fluid flow, crystal growth and geophysical forces.\n“Oscillating forces can reduce the lifespan of civil engineering structures such as petroleum platforms and underwater pipelines,” Kaboudian said. “To understand these forces, you have to understand fluid flow around the structures and how to control the oscillations. With this program, you can see the effects of changes to modify your design strategy in real time.”\nThe researchers have developed ten different models based on their WebGL programming, and are planning to make the tools available to other researchers who want to use them. They are planning future enhancements, such as the ability to run the simulations on more than one GPU card to achieve even higher computational speeds.\nThough high-end graphics cards can range in cost up to thousands of dollars, even those that cost only a few hundred dollars can provide computational power that would be only possible on supercomputers that would normally cost several hundred thousand dollars, Kaboudian said. In this way, they may provide real savings compared to operating large computer clusters or supercomputers. And that could make simulations available to more researchers.\n“Being able to run these simulations on GPU cards greatly lowers the cost compared to a traditional supercomputer,” Cherry noted. “Even the GPUs of high-end cellphones can run these simulations. That will expand access by moving these simulations onto smaller local devices that researchers are familiar with and can afford.”\nThis research was supported by the National Science Foundation’s Computer and Network Systems under grants CNS-1446675 and CNS-1446312 and by the National Institute of Health’s National Heart Lung and Blood Institute under grant 1R01HL143450-01. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the sponsoring agencies.\nCITATION : Abouzar Kaboudian, Elizabeth M. Cherry, Flavio H. Fenton, “Real-time interactive simulations of large-scale systems on personal computers and cell phones: Toward patient-specific heart modeling and other applications,” (Science Advances, 2019).\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact:\nJohn Toon (404-894-6986) (jtoon@gatech.edu)\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}