{"text": "Qcells Expansion Puts Focus on Georgia Tech’s iWorks Program | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nQcells Expansion Puts Focus on Georgia Tech’s iWorks Program\nOffering connects employers and community leaders with resources to drive economic development success\nFacebook\nTwitter\nEmail\nLisa Nash is Qcells' senior director of human resources; environmental, health, and safety; and general affairs.\nJan 27, 2023\n— Atlanta, GA\nThe good news: Northwest Georgia is slated to get a big economic development boost following a major announcement and planned company expansion that promises to create 3,500 new jobs. The challenge: In this still-tight job market, where’s a company to start?\nWhen the company in question is Dalton-based solar-panel manufacturer  Qcells , which has a 1,000-employee Dalton expansion set to begin manufacturing in August and a second expansion bringing 2,500 employees to Bartow County in 2024, a logical place to start is Georgia Tech’s  Enterprise Innovation Institute .\nSpecifically:  iWorks .\nThe organization – technically named Igniting Workforce Opportunities and Reinforcing Knowledge and Skills – operates in Northwest Georgia and launched in 2017 out of former Gov. Nathan Deal’s High Demand Career Initiative (HDCI). That initiative brought together the University System of Georgia, Technical College System of Georgia, K-12 school systems in Georgia, and the private sector to help fill workforce gaps in high demand fields like advanced manufacturing in the northwest part of the state.\n“We see ourselves in a facilitator role making connections,” said Leigh Hopkins, the iWorks project manager and senior project manager for  Center for Economic Development Research  (CEDR).\niWorks is a program of CEDR, which is housed in the Enterprise Innovation Institute, Georgia Tech’s comprehensive economic development unit. iWorks is able to connect the dots in Northwest Georgia because CEDR has been working on projects including strategic plans and workforce development there since 2012. For example, iWorks recently sponsored a job fair, where 106 people found employment, including several who went to work at Qcells.\n“We also had a webinar in November called After the Ribbon Cutting, that addressed what happens after these big announcements like the one from Qcells are made,” Hopkins said. “How is the community supposed to find people to fill the jobs that are coming?”\nIt’s an important topic for the region of about 700,000 people, and just one reason the iWorks board includes representatives from local manufacturers such as Qcells, economic and workforce developers, technical college representatives, and others, who work in concert to help deliver a growing and educated workforce to the region. One key to ensuring that new industry and new expansions can be successful.\n“iWorks is a trusted partner and conduit in helping our member companies and organizations work together to address common issues,” said Candice McKie, CEDR project manager. “We have the ability to have all of the key players in one room to discuss some of the same shared workforce challenges, and to be able to relay that information to the development authorities, the chambers, and the school systems, instead of having to go to those groups individually.”\nLisa Nash, the senior director of human resources; environmental, health, and safety; and general affairs at Qcells, echoed McKie’s sentiments.\n“Being a part of iWorks puts at my fingertips the tools that I need to understand the region,” Nash said, explaining why she is so committed to the organization’s mission. “As an HR professional in this labor market, I have to understand what everyone else is doing. I need to know what other company is expanding, what other company is maybe not doing so well, what's going to impact our labor market, and what's happening from a wage perspective.”\niWorks gives her a place to learn all of that in one monthly meeting.\n“iWorks understands the industry and they understand this region, and the needs of the business leaders in order to be successful,” Nash said. “Being a part of iWorks gives me a bird's eye view of what I need or what countermeasures I need to put in place to be prepared for obstacles or challenges.”\nWhile iWorks is many things, it isn’t a problem solver, she said. “They give you the ideas and the connections for you to solve your problems, for you to be able to come up with resources, they connect you with so many resources.”\nSome of those resources are the webinars iWorks has facilitated. In addition to After the Ribbon Cutting, the organization as focused on topics such as affordable housing, another key component of a successful workforce, and nontraditional hiring, which includes successful second-chance programs for people who have been released from prison.\n“What we hear from manufacturers is that they're beating their heads against the wall trying to find employees,” said Hopkins. “We’ve found that people who come from a second chance background, people who are really targeted with employment opportunities, are much more successful and the employers are better able to retain them than folks who just fill out an application.”\niWorks also puts together tours of manufacturing facilities, including Qcells, for area high school students, who may not know what they want to do after graduation. “Just getting exposure to industry has been very helpful for the students,” says Hopkins.\nOther programs include Be Pro Be Proud, an initiative led by the Cherokee County Office of Economic Development that introduces high school students to a variety of industries through a hands-on mobile lab. iWorks sponsored the mobile workshop’s visits to 10 high schools across the region. “We had a total of 963 students visit the mobile workshop, and 86% of those signed up to receive information and career opportunities that are related to their industry of interest,” said McKie.\niWorks is also working to help expand Project Purpose, a summer program that connects high school students to companies in the area.\nThe goal of all these programs is to help local companies and those that are moving into the region find the well-trained workforce they need. And while the work just got 3,500 times harder, the iWorks board is excited about the expansion of Qcells.\n“It’s important for our board to stay flexible and fluid,” said John Zegers, co-chair of the iWorks board and Northwest Georgia regional manager for the Enterprise Innovation Institute’s  Georgia Manufacturing Extension Partnership . “That flexibility allows us to move where the need is and where the trends go. I think the makeup of our board is perfect for that, because we're all on the front lines, we know what's going on, and we'll be able to keep our group relevant for what's needed out there.”\nDespite her extremely busy schedule as the Dalton expansion barrels toward August, Nash says she isn’t about to give up her seat on iWorks’ board.\n“iWorks is committed to connecting education and the workforce so that we have a sustainable workforce for the future of manufacturing,” she said. “They're starting younger and younger getting these kids interested in industry. I think iWorks does a really good job of balancing the current workforce and the future workforce.”\nLearn more about the science of solar power and ways Georgia Tech researchers are helping build clean energy infrastructure in the state in  $2.3B Qcells Solar Power Investment Holds Major Potential for Georgia .\nAdditional Images\nContact\nKaren Kirkpatrick\n404.894.6352\nkaren.kirkpatrick@innovate.gatech.edu\nEmail\nkaren.kirkpatrick@innovate.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}