{"text": "Using Nature’s Roadmap for Geotechnical Engineering | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nUsing Nature’s Roadmap for Geotechnical Engineering\nNSF to establish multi-university center to explore nature and engineering.\nFacebook\nTwitter\nEmail\nAug 11, 2015\n— Atlanta, GA\nWhat can nature teach us about the way we engineer soil to strengthen the foundations of our buildings and infrastructure? What can we learn from ants and other burrowing insects to improve the efficiency of our underground tunneling efforts and make those tunnels safer? An $18.5 million investment from the National Science Foundation (NSF) will help researchers at the School of Civil and Environmental Engineering (CEE) at Georgia Tech — along with colleagues at Arizona State, New Mexico State, and the University of California, Davis — tap into the lessons nature teaches us and, potentially, revolutionize geotechnical engineering in the process. “That’s what’s exciting about this project,” said David Frost, who will lead Georgia Tech’s efforts as part of the new Center for Bio-mediated and Bio-inspired Geotechnics (CBBG). “It’s not about little tweaks that just make systems that we currently have a little better. There really is the opportunity to come up with transformational approaches and ideas for what we do.” “In billions of years of evolution, nature has come up with some very elegant solutions to the problems we want to solve,” said Edward Kavazanjian, a professor at Arizona State University and director of the Center. “By employing or mimicking these natural processes, we should be able to devise some of our own elegant solutions.” Ideas could come from trees or ants or microbes that help stabilize soil, Frost said. And the discoveries researchers make could mean significant improvements in how we clean up environmental contamination, harden structures against natural and man-made disasters, make infrastructure construction more efficient, or improve the effectiveness of natural resource recovery operations. “The opportunity to come back and dramatically change how we design, for example, foundations of buildings exists if we look at how nature builds foundations for some of its structures,” Frost said. “Let’s go back and learn how nature has done it and see what new ideas emerge that could perhaps lead to a whole new generation of foundation systems, not just from the structural point of view, but also in terms of being sustainable,” Frost said. “We’re looking for ways to manage the heat of structures better. We’re looking for ways to build ecology-friendly structures and systems. Who knows what we’re going to find?” The Center is one of the nation’s largest single investments in geotechnical engineering. The initial funding extends for five years with the possibility of an additional five years of support from NSF. Frost said the goal at that point would be for CBBG — what’s called an Engineering Research Center, or ERC, in NSF parlance — to be self-sustaining, and for something even greater to have happened after the NSF support period ends. “We’re not just developing technologies to push out there,” he said. “We’re really trying to build an entire new field. In five years, if you talk about working in ‘bio-geotechnics,’ people won’t look at you say, ‘So what is that?’” They’ll know, he said, that is the branch of geotechnical engineering focused on what nature inspires or guides us to do. Georgia Tech’s role in the Center will focus predominantly focus on the microstructure of the subsurface and building complex numerical models of what’s happening underground, areas where CEE researchers have significant expertise. The Tech influence in CBBG’s work stretches even further, however. The coordinator of UC Davis’ efforts earned his Ph.D. at Tech with Frost as his adviser. And one of the Center’s leaders at Arizona State did her doctoral work in environmental engineering at Tech. The potential for game-changing results out of CBBG’s work has already attracted more than a dozen companies as “industrial affiliates” to lend support to the research. Scientists from another 15 universities from the around the world also have expressed an interest in collaborating with the Center on research and educational programs. “ERCs are recognized as being one of the marks of research excellence,” Frost said. “It is a real feather in the cap of the institution. I think it’s particularly exciting that civil engineering at Georgia Tech is at the heart of this very exciting new center.” Learn more about the new Center in the\nnews release from Arizona State University\nand on the\nproject’s website .\nRelated links\nSee a video about the Center\nSchool of Civil and Environmental Engineering\nContact\nJoshua Stewart School of Civil and Environmental Engineering 404-385-3171\nEmail\njoshua.stewart@ce.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}