{"text": "Home for the Holidays: Know the Travel Risks Before You Go | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nHome for the Holidays: Know the Travel Risks Before You Go\nResearchers have developed a tool that shows the risk someone with Covid-19 will be present at gatherings from 10 to 5,000 people anywhere in the U.S.\nFacebook\nTwitter\nEmail\nIllustration: Jessie Brandon\nNov 18, 2020\n— Atlanta, GA\nAs Covid-19 outbreaks surge in several states, the choice to see family this holiday season gets more complicated by the day. Thankfully, there’s a tool — developed by Georgia Tech faculty, scientists, GIS specialists, and graduate students — that can help estimate the potential risk of exposure involved with a trip home for a turkey dinner.\nJoshua S. Weitz , Patton Distinguished Professor in the\nSchool of Biological Sciences , and\nClio Andris , assistant professor in the Schools of  City and Regional Planning  and  Interactive Computing , created the “ Covid-19 Event Risk Assessment Planning Tool .”\nThey launched the tool in July, and since then it has generated more than 2 million unique visitors, been featured in national and international media, and spurred the development of related sites in Spanish and Italian. A multi-authored scientific article describing the tool was published in\nNature Human Behaviour\non Nov. 9.\n“We are starting to see the traffic ramp up again as people plan for the holidays,” Andris said.\nA Useful Spatial Tool\nThe tool breaks down the risk of attending events, no matter the size, based on county-level Covid-19 case reports in the U.S. and parts of Europe. Users can select the county they are interested in and the size of the event they wish to attend.\nWeitz, the founding director of Tech’s Quantitative Biosciences Graduate Program, and an ardent Atlanta United fan, was having trouble deciding whether or not to go to a home game when Mercedes-Benz Stadium in Atlanta reopened after the Covid-19 lockdown.\nHe developed a statistical model based on the odds of encountering one infected individual amongst many. Weitz quickly realized that the model would also be useful in the form of an interactive map.\n“I reached out to Clio, given her expertise in spatial visualization and analysis,” he said.\n“Clio and I were already collaborating on modeling Covid-19 epidemic spread in Georgia. I knew she would be an ideal partner, particularly given the strong visualization background of her team of\nMaster of Science in Geographic Information Science and Technology\nstudents.”\nAndris’\nFriendly Cities Lab\nworks on a number of Covid-19 projects meant to assist cities and the people that live in them.\n“At that point in the summer, and even now, the Covid-19 case rates change based on location,” she said. “Early on, people only had national-level data, and we wanted to drill down to the county level. This allows people to decide whether to attend an event based on the risk level in their locality.”\nWhile the interactive tool works well for large-scale events, users can also select smaller event sizes like 10 or 15 people — the size of many family gatherings during the holidays.\nWhat Comes Next?\nThe Friendly Cities Lab plans to analyze GPS trace movement data from\nSafeGraph\nover the Thanksgiving holiday from 2019.\nThey’ll gain insight into the network backbone and compare the data to 2020. Andris said the lab should be able to show risk assessment tool users how Covid-19 may spread throughout late November and visualize predictions about December travel.\nCreating a model with that kind of predictive power can get tricky when not properly interpreted. Andris stressed that accurate predictions require collaboration with experts on epidemic dynamics — like Weitz — and that it takes some circulation time before large spreading events register as a major outbreak.\n“We might not see and understand the impacts of Thanksgiving travel until January, and by then we’ll be settled in for the impacts of December travel as well,” she said.\n“Think of our research and the risk assessment tool like a weather map. We aren’t telling you to get your umbrella or to stay inside, but we are telling you that outside it is raining.\"\nThe Friendly Cities Lab and Covid-19\nDuring the first wave of the pandemic the Friendly Cities Lab mapped out ICU beds, ventilators, and hospital capacity for the state of Georgia. These maps were shared with the Georgia Municipal Association.\n“It allowed the municipalities to put the pandemic into context for their specific counties,” Andris said.\nThe lab also did a number of\nmobility studies . These studies analyzed how people moved around during the early stages of the pandemic. They identified which jobs led to high mobility, such as manufacturing and agriculture. In counties with a greater incidence of high mobility jobs, employees were more likely to interact with people outside their households, and possibly spread the virus.\nAnother useful tool the lab built for cities is the\nExcess Deaths Associated with Covid-19: County Level Map . It calculates the number of excess deaths in 2020 per county.\n“In a small county, knowing that there are ‘26 excess deaths’ requires context,” Andris said. “For example, if that is 50 percent more deaths than we can typically expect in a year in that location, it points to an extreme detriment to the community and potential strains on both health care systems and the death care industry.”\nIn October, Andris received a fellowship from the Geospatial Software Institute (GSI) Conceptualization Project. The fellowship is for tackling Covid-19 challenges using geospatial software and advanced capabilities in cyberinfrastructure and data science. Her fellowship involves a Covid-19 tracing project with emergency management services in the New York City Fire Department.\nAdditional Images\nRelated links\nCovid-19 Event Risk Assessment Planning Tool\nContact\nZoe Kafkes\n404.894.2354\nEmail\nzoe.kafkes@design.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}