{"text": "Microneedle patch for measles vaccination could be a global game changer | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMicroneedle patch for measles vaccination could be a global game changer\nThe microneedle patch could make it easier to vaccinate people against measles and other vaccine-preventable diseases.\nFacebook\nTwitter\nEmail\nThe 100 microneedle patches (white) in the foreground could replace everything in the background: the 100 needles and syringes, 10 ten-dose vials of measles vaccine with diluent, a biohazards box for sharps waste disposal, and a refrigerator for cold chain storage. (Photo: Gary Meek)\nApr 27, 2015\n— Atlanta, GA\nA new microneedle patch being developed by the Georgia Institute of Technology and the Centers for Disease Control and Prevention (CDC) could make it easier to vaccinate people against measles and other vaccine-preventable diseases. The microneedle patch is designed to be administered by minimally trained workers and to simplify storage, distribution, and disposal compared with conventional vaccines. The microneedle patch under development measures about a square centimeter and is administered with the press of a thumb. The underside of the patch is lined with 100 solid, conical microneedles made of polymer, sugar, and vaccine that are a fraction of a millimeter long. When the patch is applied, the microneedles press into the upper layers of the skin; they dissolve within a few minutes, releasing the vaccine. The patch can then be discarded. “Each day, 400 children are killed by measles complications worldwide. With no needles, syringes, sterile water or sharps disposals needed, the microneedle patch offers great hope of a new tool to reach the world’s children faster, even in the most remote areas,” said James Goodson, Ph.D., epidemiologist from the CDC’s Global Immunization Division. “This advancement would be a major boost in our efforts to eliminate this disease, with more vaccines administered and more lives saved at less cost.” Getting the measles vaccine to remote areas is expected to be easier because the patch is more stable at varying temperatures than the currently available vaccines and takes up less space than the standard vaccine. Because microneedles dissolve in the skin, there is no disposal of needles, reducing the risk of accidental needlesticks. The measles patch is expected be manufactured at a cost comparable to the currently available needle and syringe vaccine. Twenty million people are affected by measles each year. Unfortunately, global coverage with the measles vaccine has been stagnant for the last few years at around 85 percent, which is well below the coverage of up to 95 percent needed to interrupt transmission of the disease. Because measles is vaccine-preventable and the measles virus survives only in human hosts, the world’s health officials are aiming for measles elimination. Having a simple patch administered by minimally trained vaccinators could help increase vaccination coverage and achieve the goal of measles elimination. Georgia Tech and CDC’s Global Immunization Division and Division of Viral Diseases recently completed a study that showed the new microneedle patch produces a strong immune response in an animal model. No adverse effects or health issues were noted during the study. These findings have cleared the way for developing proposals for human clinical trials, which could begin as early as 2017. “We think this collaboration with CDC is an excellent example of how advances in engineering can be used to address important public health problems,” said Mark Prausnitz, a Regents Professor in the School of Chemical & Biomolecular Engineering at Georgia Tech. Prausnitz served as one of the principal investigators on the study. World Immunization Week, celebrated in the last week of April each year, aims to promote the use of vaccines to protect people of all ages against disease. This year’s campaign focuses on closing the immunization gap and reaching equity in immunization levels as outlined in the Global Vaccine Action Plan (GVAP). The plan, endorsed by the 194 member states of the World Health Assembly in May 2012, is the framework to prevent millions of deaths by 2020 through universal access to vaccines for people in all communities. The GVAP aims to: strengthen routine immunization to meet vaccination coverage targets;  accelerate control of vaccine-preventable diseases with polio eradication as the first milestone;  eliminate measles and rubella;  introduce new and improved vaccines; and  spur research and development for the next generation of vaccines and technologies. Microneedle technology could move the GVAP forward by leading to improved protection against other diseases, including polio, influenza, rotavirus, rubella, tuberculosis and others. CDC is also collaborating with Georgia Tech to see if microneedles could be used to administer inactivated polio vaccine. Additional research is studying microneedle-administration of the influenza, rotavirus and tuberculosis vaccines. To watch a video about microneedle technology please visit\nhttp://youtu.be/wVEF1ckaYEY . About Georgia Tech The Georgia Institute of Technology is a leading research university committed to improving the human condition through advanced science and technology. Ranked as the #7 best U.S. public university, Georgia Tech provides a focused, technologically based education to more than 21,500 undergraduate and graduate students. As a leading technological university, Georgia Tech has more than 100 centers focused on interdisciplinary research that consistently contribute vital research and innovation to government, industry, and business. For more information, please visit\nwww.gatech.edu . John Toon\njtoon@gatech.edu\n404-894-6986 About the CDC\nCDC works 24/7 saving lives and protecting people from health threats to have a more secure nation. Whether these threats are chronic or acute, manmade or natural, human error or deliberate attack, global or domestic, CDC is the U.S. health protection agency. CDC’s Global Immunization Division (GID) is involved in one of the most effective of all global public health missions – vaccination against deadly diseases – which saves the lives of 2 to 3 million people every year. GID works closely with a wide variety of partners to protect global citizens against contagious and life-threatening vaccine-preventable diseases. CDC News Media Branch,\nmedia@cdc.gov (404) 639-3286\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}