{"text": "Two Yellow Jackets Named Churchill Scholars | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nTwo Yellow Jackets Named Churchill Scholars\nThe Churchill Scholarship selects 18 scholars annually for one year of master’s study at the University of Cambridge.\nFacebook\nTwitter\nEmail\nJan 22, 2024\nVelin Kojouharov, a mechanical engineering major, and Shea Rathburn, a 2023 civil engineering graduate, have received a prestigious\nChurchill Scholarship .\nThe Churchill Scholarship selects 18 scholars annually for one year of master’s study at the University of Cambridge. Kojouharov received the Churchill Scholarship for science, mathematics, and engineering, and Rathbun received the Kanders Churchill Scholarship for science policy. Churchill Scholars are selected on the basis of academic and research achievement.\nAbout the Scholars\nVelin Kojouharov\nAt the University of Cambridge, Kojouharov will pursue a Master of Philosophy in biological sciences. His long-term goal is to “design biologically inspired robots that can move in complex and dangerous environments.”\nHis research at Cambridge will focus on the net-winged midge larvae, an insect that lives in fast-flowing streams of the Alps. “By working with both zoologists and engineers, I hope to design a robot, inspired by the larvae, that can crawl around in similar conditions,” he said.\nThe potential application of this robot includes environmental monitoring and search and rescue in fast-flooding or extreme weather conditions.\nKojouharov expressed his gratitude to Daniel Goldman, Dunn Family Professor in the School of Physics, for his research guidance over the last three years. “He has encouraged me to ask bigger, more interesting research questions.” He also thanked Ph.D. student and mentor Tianyu Wang.\nAs a Tech student, Kojouharov also received the Stamps President’s Scholarship, Goldwater Scholarship, Astronaut Scholarship, and the ThinkSwiss Research Scholarship.\nShea Rathbun\nRathbun plans to pursue a master of philosophy in public policy at the University of Cambridge, and she’s looking forward to studying in the U.K. to see firsthand how it has worked toward accomplishing the United Nations Sustainable Development Goals. She also hopes to learn how those practices can be applied in the U.S. Her long-term goal is to “combine engineering and policy to make cities around the world sustainable, equitable, and resilient.”\nRathbun acknowledged the contributions of her mentors, Jennifer Hirsch, senior director of the Center for Sustainable Communities Research and Education, and James Tsai, professor in the School of Civil and Environmental Engineering, in advancing her undergraduate research. Her mentors helped shape her perspective on transportation equity and equitable city planning during her time at Georgia Tech.\nAt Tech, she also received the Alex G. and Faye Spanos Scholarship and funding from the Joe S. Mundy Global Learning Endowment.\nFellowship Planning\nGeorgia Tech's pre-graduate and pre-professional advising team\naids students in the process of applying for prestigious awards such as the Churchill Scholarship. Awards are available for students as early as their second year. Fellowship advisors work with students each step of the way, identifying opportunities, reading drafts of essays, and arranging mock interviews.\nKaren Mura,\nprestigious fellowships advisor , worked closely with both of this year's Churchill Scholars as they applied for this and other awards.\n\"Shea and Venny are remarkable students with significant real-world experience that prepares them well to make a global impact throughout their professional life,\" she said. \"I have enjoyed engaging with them as they plan their next steps and noting their personal growth along the way.\"\nScholarships help Georgia Tech attract top students and propel them to prestigious fellowships and recognitions. Learn how your gift to Georgia Tech makes scholarships possible at  transformingtomorrow.gatech.edu .\nRelated links\nGeorgia Tech Prestigious Fellowships Advising\nContact\nKaren Mura\nPrestigious Fellowships\nWritten by\nSara Franc\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}