{"text": "NFL “1ST and Future” Super Bowl Event Presented by Arrow Electronics Features New Crowdsourced Competition on Punt Play Rules | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNFL “1ST and Future” Super Bowl Event\nPresented by Arrow Electronics\nFeatures New Crowdsourced Competition on Punt Play Rules\nThe deadline to submit applications is January 9, 2019. For more information on the submission process, selection criteria and official rules, visit www.nfl.com/1standfuture.\nFacebook\nTwitter\nEmail\nDec 04, 2018\n— Atlanta, GA\nThe National Football League (NFL) and Arrow Electronics (NYSE:ARW) today announced the launch of  1 st  and Future , the NFL’s annual Super Bowl competition designed to spur innovation in athlete safety and performance.  1 st  and Future  will be presented by Arrow Electronics and hosted at Georgia Institute of Technology (Georgia Tech) at the Ferst Center for the Arts in Atlanta, Georgia on February 2, 2019, the day before Super Bowl LIII.\nThis year’s event will feature two categories of competition. The first category, the NFL Punt Analytics Competition, is new this year and will give applicants access to exclusive NFL data sets to inform creative submissions about rule changes designed to reduce player injury during punt plays. This challenge will utilize the crowdsourced data science platform Kaggle. Up to four of the best submissions will be awarded $20,000 each. The winning teams will be invited to present their submission in Atlanta, where they will compete to win Super Bowl tickets.\n“Leveraging available data to analyze the game is an increasingly essential way to improve our rules and look to make the game safer,” said Jeff Miller, NFL Executive Vice President of Health and Safety Initiatives. “This is a groundbreaking new effort to ask the public to analyze our rules and make recommendations. We are excited to tap into the innovative thinking of data scientists and entrepreneurs.”\nThe second category, Innovations to Advance Athlete Health and Safety Competition, invites all types of submissions for innovative product concepts that could improve player health and safety and will be managed by Georgia Tech’s Advanced Technology Development Center (ATDC). Up to five startups will be selected as finalists and will have the chance to present their innovations on stage in Atlanta. One grand prize winner will be awarded $50,000 and two tickets to Super Bowl LIII. The second-place winner will receive $20,000 and two tickets to Super Bowl LIII.\nFinalists for both categories will present to a panel of judges and an exclusive audience including NFL team owners and executives, and representatives from the Atlanta Super Bowl Host Committee, Arrow Electronics and Georgia Tech.\n\"We are seeing technology reach a threshold that opens up a whole new class of opportunities to improve the health and performance of athletes,” said Victor Gao, chief marketing officer of Arrow Electronics. “Innovation begins with a single idea, and we are proud to support  1 st and Future  that draws upon the ingenuity of entrepreneurs to enhance the quality of life for not only professionals in the stadium but also aspiring young athletes at home.”\n“Georgia Tech is proud to host the NFL’s  1 st and Future  startup competition,” said Georgia Tech President G.P. “Bud” Peterson. “This event will tap into the robust startup culture and entrepreneurial spirit for which the Institute is well known. An embodiment of those traits, our Advanced Technology Development Center (ATDC), is located on campus in Tech Square, one of the nation’s most exciting entrepreneurial ecosystems. Yellow Jacket fans love our sports teams, and the opportunity to partner with the NFL to advance collaborative innovation in athletics, particularly around safety and performance, is one we wholeheartedly endorse.”\nAbout the NFL’s Health and Safety Initiatives\nThe NFL is committed to advancing progress in the diagnosis, prevention and treatment of sports-related injuries. As part of the NFL’s ongoing health and safety efforts, in September 2016, Commissioner Goodell launched  Play Smart. Play Safe . — a league-wide health and safety initiative. At the heart of the initiative is a pledge of $100 million in support for independent medical research and engineering advancements and a commitment to look at anything and everything to protect our players and make our game safer, including enhancements to medical protocols and improvements to how our game is taught and played. For more information about the NFL’s health and safety efforts, please visit  www.PlaySmartPlaySafe.com .\nAbout Arrow Electronics\nArrow Electronics guides innovation forward for over 150,000 of the world’s leading manufacturers of technology used in homes, business and daily life. With 2017 sales of $26.6 billion, Arrow aggregates electronics and enterprise computing solutions for customers and suppliers in industrial and commercial markets. The company maintains a network of more than 345 locations serving over 80 countries. Learn more at FiveYearsOut.com.\nAbout the Georgia Institute of Technology\nThe Georgia Institute of Technology, also known as Georgia Tech, is one of the nation’s leading research universities. Georgia Tech provides a focused, technologically based education to more than 32,000 undergraduate and graduate students. Georgia Tech has many nationally recognized programs, all top-ranked by peers and publications alike, and is ranked in the nation’s top 10 public universities by U.S. News and World Report. As a leading technological university, Georgia Tech has more than 100 centers focused on interdisciplinary research that consistently contribute vital research and innovation to American government, industry, and business.\nAbout the Advanced Technology Development Center\nThe Advanced Technology Development Center (ATDC), a program of the Georgia Institute of Technology, is the state of Georgia’s technology startup incubator. Founded in 1980 by the Georgia General Assembly which funds it each year, ATDC’s mission is to work with entrepreneurs in Georgia to help them learn, launch, scale, and succeed in the creation of viable, disruptive technology companies. Since its founding, ATDC has grown to become one of the longest running and most successful university-affiliated incubators in the United States, with its graduate startup companies raising $3 billion in investment financing and generating more than $12 billion in revenue in the state of Georgia. To learn more, visit  atdc.org .\nAdditional Images\nRelated links\nATDC\n1st and Future\nPlay Smart. Play Safe.\nArrow Five Years Out\nContact\nLaura Diamond\nNational Media Relations\nInstitute Communications\nGeorgia Institute of Technology\n404-894-6016 (office)\n404-660-2927 (mobile)\nEmail\nlaura.diamond@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}