{"text": "Foes Can Become Friends on the Coral Reef | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nFoes Can Become Friends on the Coral Reef\nOn the coral reef, knowing who’s your friend and who's your enemy can sometimes be a little complicated.\nFacebook\nTwitter\nEmail\nA crown-of-thorns sea star eating a coral from the genus Acropora, which is a preferred meal for the organism. The photos were taken in the non-protected fishing area on Votua Reef, on the Coral Coast of the Fiji Islands. (Credit: Cody Clements, Georgia Tech)\nAug 25, 2015\n— Atlanta, GA\nOn the coral reef, knowing who’s your friend and who's your enemy can sometimes be a little complicated. Take seaweed, for instance. Normally it's the enemy of coral, secreting toxic chemicals, blocking the sunlight, and damaging coral with its rough surfaces. But when hordes of hungry crown-of-thorns sea stars invade the reef, everything changes, reports a study published August 25 in the journal\nProceedings of the Royal Society B . Seaweeds appear to protect coral from the marauding sea stars, giving new meaning to the proverb: “The enemy of my enemy is my friend.” The findings demonstrate the complexity of interactions between species in ecosystems, and provide information that could be useful for managing endangered coral reefs. “On the reefs that we study, seaweeds reduce coral growth by both chemical and mechanical means,” said\nMark Hay , a professor in the\nSchool of Biology\nat the Georgia Institute of Technology and the paper’s senior author. “But we found that seaweeds can benefit corals by reducing predation by the crown-of-thorns sea stars. Corals surrounded by seaweeds were virtually immune to attack by the sea stars, essentially converting the seaweeds from enemies to friends.” The research was supported by the National Science Foundation, the National Institutes of Health and the Teasley endowment at Georgia Tech. Crown-of-thorns sea stars ( Acanthaster planci ) are a major problem in the Pacific, where populations of the organisms rise and fall in cycles. On the Great Barrier Reef, for example, coral cover has declined by more than 50 percent over 25 years, and the voracious spine-covered creatures – which can travel as much as 80 meters per day – get much of the blame. “You don’t have to see the crown-of-thorns to know they have been on the reef,” said Cody Clements, a Georgia Tech graduate student in Hay’s lab and paper’s first author. “You can see where they have been because they leave trails of bleached white coral. All they leave behind are the coral skeletons.” The sea stars climb onto favored corals, invert their stomachs out through their mouths, and digest away the corals’ living tissues – leaving white skeletons like a trail of bread crumbs that allowed Clements to not only see where the creatures had been, but also to track them to hiding places in the rocks. During a two-year study in a marine protected area off the coast of the Fiji Islands, Clements used both observations and field experiments to examine the role of sea stars and seaweeds in the health of coral. “Marine protected areas where we work are often surrounded by areas of coral reef that are degraded and have lots of seaweeds,” said Clements. “If seaweed is increasing in prevalence in these degraded areas, it’s likely that these predators will move into protected areas with more coral and less seaweed. That could compromise conservation efforts in these relatively small marine protected areas established to protect coral.” Clements first assessed the impact of seaweeds by comparing the growth of corals surrounded by varying levels of seaweed cover. To accurately measure growth, he established test colonies of the coral Montipora hispida attached to the necks of plastic soft drink bottles. Matching bottle caps were nailed into seabed rock, allowing colonies to be unscrewed from their anchorages to be accurately weighed, then returned. He placed varying amounts of the seaweed\nSargassum polycystum\nadjacent to each test colony. “The seaweed had a negative effect on the growth of the coral, and the more seaweed that was present, the greater the impact I observed,” he said. To study the relationship between sea star attacks and seaweed cover, Clements used photographs to assess the amount of sea star damage to different coral colonies outside the marine protected area, and related the damage to the amount of seaweed on corals in the attacked areas. Coral colonies that had been attacked had, on average, just eight percent seaweed coverage, while nearby colonies of the same species that had not been attacked averaged 55 percent coverage of seaweeds. To more directly assess the protective role of the seaweed, Clements conducted an experiment. He fabricated ten cages in which he placed two Montipora coral colonies, one surrounded by varying levels of seaweed – between two and eight fronds – and the other lacking adjacent seaweeds. Into each cage he placed a sea star, then observed how much of each coral would be eaten. “At the highest densities of seaweed, the sea stars were completely deterred,” Clements said. “They wouldn’t eat the coral surrounded by the seaweeds.” Coral surrounded by lower densities of seaweed were sometimes eaten, while the corals without seaweed protection were always consumed by the sea stars. Researchers aren’t sure if the protective effects of the seaweed are mechanical or chemical – or perhaps both. But when Clements repeated the experiment with plastic aquarium seaweed instead of real seaweed, he found that it also had protective effects, suggesting the seaweed may be simply physical impediments making the coral difficult for the sea stars to find or consume. Finally, Clements examined sea star feeding when the predator was given a choice between an unprotected coral it doesn’t normally consume ( Porites cylindra ) and Montipora – a favored prey – that had been surrounded by Sargussum. The sea stars didn’t eat the Montipora, and would wait as long as ten days before finally consuming the Porites. “If you’ve got a choice between ice cream and broccoli, you’re going to choose ice cream – unless broccoli is the only thing you can get,” he said. The varying relationship between coral and seaweed illustrates the kind of complexity scientists have to understand when studying species-diverse ecosystems such as coral reefs, Clements noted. “In a scenario that didn’t involve the crown-of-thorns sea stars, interactions with the seaweed would have been negative for the coral,” he noted. “But when you add the crown-of-thorns into the equation, it can be beneficial for the coral to be associated with the seaweed. Even if it suffers reduced growth, that’s better than being eaten.” Information from research like this can help scientists protect corals, which are essential to the survival of reef ecosystems. “We are interested not only in how direct interactions between species play out, but also how these indirect interactions come into the picture and influence the wider community,” said Clements. “When it comes to coral reefs, that is very important because these interactions can affect the trajectory of an entire community of organisms.” This research was supported by the National Science Foundation under grant OCE- 0929119, by the Fogarty International Center of the National Institutes of Health under grants U01-TW007401 and U19TW007401, and by the Teasley Endowment to Georgia Tech. The content is solely the responsibility of the authors and does not necessarily represent the official views of the National Science Foundation or the National Institutes of Health. CITATION : Cody S. Clements and Mark E. Hay, “Competitors as accomplices: Seaweed competitors hide corals from predatory sea stars,” (Proceedings of the Royal Society B, 2015). Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contact : John Toon (404-894-6986) ( jtoon@gatech.edu ) Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}