{"text": "Georgia Tech Creates Cybersecurity Master’s Degree Online for Less Than $10,000 | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Creates Cybersecurity Master’s Degree Online for Less Than $10,000\nNew online master's in cybersecurity will cost less than $10,000.\nFacebook\nTwitter\nEmail\nGeorgia Tech will begin offering an online master of science degree in cybersecurity beginning in January 2019.\nAug 08, 2018\n— Atlanta, GA\nThe Georgia Institute of Technology has announced a new online cybersecurity master’s degree that will be offered for less than $10,000 and delivered in collaboration with\nedX . The\nOnline Master of Science in Cybersecurity\n(OMS Cybersecurity) is designed to address a severe global workforce shortage in the field. According to the 2017 Global Information Security Workforce Study, the shortage is expected to reach 1.8 million people by 2022.\nGeorgia Tech is the only nationally ranked Top 10 university to offer such a program at a tuition rate intended to increase higher education accessibility and affordability. The degree has existed on campus since 2002 and costs $20,000 for in-state students and $40,000 for those out-of-state. Applications for spring 2019 are open now until October 1, 2018.\nThe OMS Cybersecurity program will launch January 7, 2019 with 250 students and will scale over time to meet demand and student needs. The program is designed to serve working professionals who can study part-time and earn the degree within two to three years. It is richly technical and offers the same three interdisciplinary tracks available on campus beginning with information security and followed by policy and energy systems in fall 2019.\n“Georgia Tech’s OMS Cybersecurity degree pairs world-class computer science, engineering, and public policy instruction with Georgia Tech Research Institute’s legacy of applied research in areas related to military, government, and law enforcement,” said Rafael L. Bras, provost and executive vice president for Academic Affairs and K. Harrison Brown Family Chair.  \"As demand continues to grow, Georgia Tech is proud to deliver innovative, affordable, top quality education in high-demand areas, like cybersecurity, to learners around the nation and world.”\nOMS Cybersecurity is Georgia Tech’s third at-scale online degree program. It will follow the same model as the groundbreaking\nonline Master of Science in Computer Science\n(OMSCS) program, which launched in 2014 on Udacity with support from AT&T and has enrolled approximately 10,000 students overall for the $6,800 degree. The Institute followed on that success in 2017 by launching the\nOnline Master of Science in Analytics\non edX with support from AT&T and Accenture, which currently has 706 students in its second semester and costs less than $10,000.\n“We are excited to strengthen our partnership with Georgia Tech by now offering two top-ranked online master’s degrees in high-demand fields to learners all over the world,” said Anant Agarwal, edX CEO and MIT professor. “The new OMS Cybersecurity follows on the success of the stacked OMS Analytics on edX, which offers learners the option to start with a MicroMasters program on edX that can count toward their full master’s degree. This collaboration with Georgia Tech is the latest milestone in creating stackable, affordable, and accessible online master’s degrees in subjects that address today’s global skill gaps.”\nOMS Cybersecurity is built on the proven success of the on-campus Master of Science in Cybersecurity, which was started as a master’s degree in information security in 2002 by Mustaque Ahamad, associate director, Institute for Information Security & Privacy, professor, School of Computer Science, and co-founder and chief scientist at Pindrop, a cybersecurity company. Because of the interdisciplinary nature of the cybersecurity field, the program was broadened to include tracks in energy systems and policy.\n“The on-campus program has a long history as a world-class master’s degree in information security,” said Ahamad. “Graduates from this degree have gone on to become top leaders in the field.”\n\"Cybersecurity is a global problem,” said Milton Mueller, professor at Georgia Tech’s School of Public Policy, “The OMS format not only extends Georgia Tech's reach to American professionals in cybersecurity, but also makes it possible for working professionals anywhere in the world to avail themselves of Tech's educational resources and expertise.\"\nThe U.S. will have 265,000 more cybersecurity jobs than skilled workers by 2022, as projected by the ISC Center for Cyber Safety and Education. Cybersecurity job postings continue to surge, having increased by 71 percent between 2012 and 2017. Job postings specifying a master’s degree have grown by 73 percent during the same period, based on data provided in the 2017 Burning Glass/Labor Insights Report. The report also cites the Washington D.C. metro area as ranking first in the country for cybersecurity employment opportunities with 44,244 job postings.\n\"As chief information security officers work to protect organizations from malicious cyber threats, they have difficulty finding trained people to staff their team. The cybersecurity workforce pipeline is a critical component to the future of our nation’s economic and national security posture. CISOs are excited to hear about Georgia Tech’s degree providing enhanced training and teaching multi-faceted skills for employment in the cybersecurity job market,” said Patrick Gaul, executive director of the National Technology Security Coalition.\nOMS Cybersecurity is an interdisciplinary collaboration between Georgia Tech’s School of Computer Science in the College of Computing, the School of Public Policy in the Ivan Allen College of Liberal Arts, and the School of Electrical and Computer Engineering in the College of Engineering.\n\"The OMS Cybersecurity degree offers the same comprehensive, rigorous curriculum as the on-campus program,\" said Raheem Beyah, faculty lead for the program, Motorola Foundation Professor and associate chair for Strategic Initiatives and Innovation in the School of Electrical and Computer Engineering, and co-founder of Fortiphyd Logic, Inc., an industrial control cybersecurity company. “Courses are taught by leaders in the field of cybersecurity research who are sought after by industry and government entities for their knowledge and expertise.\"\nCourses for the program will be designed and produced for online delivery by\nGeorgia Tech Professional Education\n(GTPE), the Institute’s lifelong learning arm that has provided professional education for more than 40 years.\n“OMS Cybersecurity is designed for working professionals aiming to develop deep expertise in cybersecurity without interrupting their careers,” said Nelson C. Baker, dean of GTPE. “With this degree, we’re able to offer them the opportunity to build careers in a rapidly growing field while delivering cybersecurity experts to industry to address extreme workforce shortages.”\nAdditional details on the Georgia Tech OMS Cybersecurity program can be found at\nomscybersecurity.gatech.edu .\nAdditional Images\nRelated links\nOMS Cybersecurity\nContact\nlance.wallace@comm.gatech.edu\nEmail\nlance.wallace@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}