{"text": "Astrobiology Rising at Georgia Tech | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nAstrobiology Rising at Georgia Tech\nThe growing visibility of researchers interested in astrobiology is helping Georgia Tech emerge as a powerhouse in the field.\nFacebook\nTwitter\nEmail\nNov 01, 2017\n— Atlanta, GA\nIn the Ford Environmental Science and Technology Building, the office of Martha Grover is three doors from that of Jennifer Glass. Both are Georgia Tech scientists doing research related to astrobiology — life in the cosmos — but until last year they hardly talked to each other as researchers with common interests.\n“We are all so busy,” says  Grover , a professor in the School of Chemical and Biomolecular Engineering, a scientific collaborator at the  NSF/NASA Center for Chemical Evolution (CCE) , and a member of the  Center for Space Technology and Research (C-STAR) .\nNow, Grover,  Glass , and others at Tech are members of a growing community that’s coalescing astrobiology activities across campus. In a public debut of sorts, six members of  Georgia Tech Astrobiology , as the community calls itself, participated in  the 2017 Dragon Con , the premier pop-culture convention on science fiction and fantasy. They wowed the audience, not by fiction or fantasy or over-the-top costumes, but by progress in answering fundamental questions — How did life begin? Where else could life exist? All happening right next door to the meeting venue, at Georgia Tech.\nThe growing visibility of researchers interested in astrobiology is helping Georgia Tech emerge as a powerhouse in the field. At minimum, says  Kenneth Knoespel , a historian of science and professor in the Ivan Allen College of Liberal Arts, “it affirms the importance of this community at Georgia Tech and the importance of astrobiology as a new configuration of disciplines that brings together the natural and human sciences.”\nTEEMING WITH TALENT\n“Georgia Tech is clearly recognized as a hub for astrobiology and maybe the one that’s growing the most quickly,” says  Edward Goolish , the deputy director of the  NASA Astrobiology Institute  (NAI), one of the six elements of the NASA Astrobiology Program. People at Georgia Tech, Goolish adds, “have been generous with their time and have contributed in important ways when NASA has reached out to the science community for input.”\nThe community includes physicists, chemists, biologists, Earth and planetary scientists, and engineers, as well as historians of science and writers. The scientists are figuring out how life emerged and evolved to the biosphere we know, inventing instruments to detect life outside Earth, and searching for other habitable places in the universe. The science historians and writers are witnessing science in the making and perhaps gathering fodder for the next volume of science fiction.\nBroadly defined, astrobiology is the study of life in the cosmos. Its central questions are “What is the origin of life?” and “Does life exist beyond Earth?” Humans have asked these questions since  time immemorial . That they are still around attests to the difficulty of discovering and assembling the pieces of a formidable puzzle: the emergence of a biosphere on a planet.\nHow formidable? According to  Eric Smith , a theoretician in the  NASA Astrobiology Institute’s team at Georgia Tech  (NAI-GT), understanding the nature of the transition from a planet without a biosphere to one with a biosphere should be central to origins-of-life inquiries. However, he says, “a lot of the language to enable that understanding doesn’t exist yet.”\nTHREE PILLARS\nAt Georgia Tech, research teams are working across the breadth of questions central to astrobiology. Their activities are exemplified by three specialized research groups: CCE, NAI-GT, and C-STAR.\nCCE is building a community in origin-of-life research, said its director,  Nicholas V. Hud ,  at a symposium organized by Georgia Tech Astrobiology last month . In finding answers, CCE takes two approaches, Hud explained. “Bottom up,” it starts with geology and chemistry and understanding the  formation  of the first polymers of life, which is a major focus of Hud’s. “Top down,” it starts with biology, genetics, and looking back in time at persistent, conserved molecular motifs, as exemplified by  the work of Loren Williams on ribosomes .\nLike digging a tunnel underground from opposite ends and meeting somewhere in between, the two approaches are converging on the coevolution of the biopolymers of life. Chemistry and biology are telling us the same thing, say Hud and Williams, both professors in the School of Chemistry and Biochemistry (SoCB) and members of the Parker H. Petit Institute for Bioengineering and Bioscience (IBB).\nAt NAI-GT, “we  start  at the level of the cell,” says  Frank Rosenzweig , the School of Biological Sciences (SoBS) professor who leads the NASA group. “Once you have all this biochemistry wrapped in a cell, what happens then? How do they become associated as multicellular organisms? How do they engage in biochemistries that change the environment? We need to understand the interaction between the evolution of life and the evolution of its abiotic surrounding to have a chance of recognizing life elsewhere.\n“Although life on Earth manifests in different forms, all are governed by laws of growth, inheritance, and variability,” says Rosenzweig, also a member of IBB. NAI-GT aims to “illuminate and interpret these laws via laboratory-based evolution experiments with microbial populations.” An example is the  exploration of the origin of multicellularity by experimentally evolving yeast , as described in the September symposium by  Will Ratcliff , an  assistant professor  in SoBS.\nFor C-STAR-affiliated faculty, habitability is one key question. What events and conditions in the abiotic sphere yield environments that support life? The NASA-supported work of  Jennifer Glass  and  Chris Reinhard , in the School of Earth and Atmospheric Sciences (EAS), exemplify the search for answers in this realm.\nWhat signals should we monitor in search of life elsewhere in the universe? What tools do we need to probe for signs of life from the comfort of Earth? What hazards should we prepare for if humans were to go to other worlds?\nIn EAS, C-STAR members and planetary scientists  Carol Paty ,  Britney Schmidt , and  James Wray  are co-investigators of NASA-funded projects to answer these questions. So is C-STAR member  Paul Steffes , in the School of Electrical and  Computer Engineering , as well as C-STAR Director  Thomas Orlando  and C-STAR member  Amanda Stockton , in SoCB.\nWHAT’S NEXT\nWith the talent on campus, Georgia Tech is becoming well known in the field of astrobiology. At the  2017 Astrobiology Scientific Conference , in Mesa, Ariz., last April, the Georgia Tech “posse” numbered about 30 faculty and students. Last summer, attendees of  AbGradCon (Astrobiology Graduate Conference) 2017  selected Georgia Tech to host the  2018 event . This popular meeting for students is funded primarily by the  NASA Astrobiology Institute .\nThe astrobiology community at Georgia Tech is “healthy,” Smith says. “The people in strategic positions have good priorities in the sophistication and intellectual integrity they are trying to support.”\nThe community — now 85 strong and growing — is raring to make its presence felt. It has an ambitious schedule for the 2017 - 18 school year, spearheaded by the September symposium.\nLed by Grover as principal investigator, and with contributions from Glass, Knoespel, Paty, Reinhard, Rosenzweig, Schmidt, Williams, and others —  Rebecca Burnett , Ivan Allen College of Liberal Arts;  Glenn Lightsey , School of Aerospace Engineering and C-STAR; and  Christopher Parsons , CCE — their proposal for seven projects received funding from the Georgia Tech  Strategic Plan Advisory Group (SPAG)  and the Colleges of Engineering, Liberal Arts, and Sciences.\nThe projects aim to showcase the quality and variety of astrobiology projects at Tech, highlight the social impact of these projects, and strengthen the sense of community among faculty and students. The goals will be achieved through formal gatherings, educational innovations, and public outreach.\n“As I see it, the point of research universities is to tackle the really important, really deep, and really challenging questions — the ones at the edge of, or even beyond, our reach; the ones that present not just the possibility but the likelihood of failure,” said College of Sciences Dean and  Sutherland Chair  Paul M. Goldbart at the September symposium. “It’s our duty as administrators to do everything we can to support this kind of truly adventurous research.”\nWhat the astrobiology community is doing not only is exciting, Goldbart said. But also, “it could hardly fit better with the dreams of the College of Sciences and of Georgia Tech.”\nGeorgia Tech Researchers Working Toward the Goals of NASA’s Astrobiology Program Planetary Science and Technology through Analog Research (P-STAR)\nJennifer Glass, School of Earth and Atmospheric Sciences\nBritney Schmidt, School of Earth and Atmospheric Sciences\nAmanda Stockton, School of Chemistry and Biochemistry Planetary Instrument Concepts for the Advancement of Solar System Observations (PICASSO)\nAmanda Stockton Exobiology: Early Evolution of Life and the Biosphere\nFrank Rosenzweig, School of Biological Sciences Exobiology: Evolution of Advanced Life\nWilliam Ratcliff, School of Biological Sciences Exobiology: Prebiotic Evolution\nLoren Williams, School of Chemistry and Biochemistry Exobiology: Methane and Iron Metabolisms in Ancient Oceans\nJennifer Glass School of Earth and Atmospheric Sciences Faculty Affiliated with NASA Astrobiology Institute (NAI)\nJennifer Glass, Chris Reinhard, and Yuanzhi Tang, with University of California, Riverside, team\nJames Wray, with SETI Institute team\nNAI Team at Georgia Tech School of Biological Sciences\nPhillip Gerrish                    William Ratcliff\nKennda Lynch                   Frank Rosenzweig\nNASA Postdoctoral Program Fellows\nBradley Burcar with Nicholas Hud\nPeter Conlin with William Ratcliff\nMoran Frenkel-Pinter with Loren Williams\nKazumi Ozaki with Chris Reinhard\nNicholas Speller with Amanda Stockton 2018 AbGradCon Organizers\nMarcus Bray                    Justin Lawrence\nBradley Burcar                 Adriana Lozoya\nAnthony Burnetti              Kennda Lynch\nHeather Chilton               Santiago Mestre Fos\nChase Chivers                 Marshall Seaton\nDedra Eichstedt               Micah Schaible\nZachary Duca                  Elizabeth Spiers\nJennifer Farrar                 Scot Sutton\nNicholas Kovacs              Nadia Szeinbaum\nGeorge Tan, Conference Chair  Note: This list is not meant to be comprehensive; it represents information that was available as of October 2017.\nPHOTO CAPTIONS\nGeorgia Tech at AbSciCon 2017.  This photo shows only some of the Georgia Tech researchers who attended. From left: Cesar Menor-Salvan, Nick Hud, Justin Lawrence, Jacob Buffo, Frank Rosenzweig, Amanda Stockton, Britney Schmidt, Kennda Lynch, Gavin Mendez, George Tan, Jennifer Glass, Zachary Duca, Nadia Szeinbaum, Aaron McKee, Chloe Stanton, and Marcus Bray (Courtesy of Jennifer Glass)\nGeorgia Tech Astrobiology at 2017 Dragon Con.  From left: Amanda Stockton, Loren Williams, Kenneth Knoespel, Lisa Yaszek, Chris Reinhard, and Britney Schmidt (Photo by Renay San Miguel)\nOrganizers and Speakers: “Life in the Cosmos”\nTop, from left: Rebecca Burnett, Carol Paty, Kennda Lynch, Jennifer Glass, Martha Grover, Gongjie Li, and Amanda Stockton\nBottom, from left: Thomas Orlando, Paul Steffes, Frank Rosenzweig, Nicholas Hud, Loren Williams, and William Ratcliff (Photos by Maureen Rouhi)\nAdditional Images\nRelated links\nLife in the Cosmos: Past, Present, and Future\nNick Hud’s Take on a Grand Challenge of Science\nLooking for the Origin of Life Inside a 4 Billion-Old Molecular Machine\nWas the Primordial Soup a Hearty Pre-Protein Stew?\nNASA Chooses Georgia Tech For New Solar System Research Project\nContact\nA. Maureen Rouhi, Ph.D.\nDirector of Communications\nCollege of Sciences\nEmail\nmaureen.rouhi@cos.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}