{"text": "Taking Shape: The Kendeda Building for Innovative Sustainable Design | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nTaking Shape: The Kendeda Building for Innovative Sustainable Design\nThe earth is finally beginning to make way for The Kendeda Building for Innovative Sustainable Design.\nFacebook\nTwitter\nEmail\nThis perspective demonstrates how the Living Building's \"porch\" integrates the building with the Eco-Commons to the west.\nImage courtesy of The Miller Hull Partnership in collaboration with Lord Aeck Sargent.\nApr 18, 2018\n— Atlanta, GA\nThe earth is finally beginning to make way for The Kendeda Building for Innovative Sustainable Design. Earlier this year, what used to be a parking lot at the corner of Ferst Drive and State Street began its transformation to bigger and better things; once completed, The Kendeda Building is expected to become the most environmentally advanced education and research facility in the Southeast.\n“Seeing the fencing go up and the grading equipment roll in was a major milestone,” said John DuConge, senior project manager for Facilities Management. “Given the very unique requirements of The Kendeda Building, we knew we would spend a considerable amount of time on the front end designing and planning this project with our project partners: Lord Aeck Sargent and their team of consultants.”\nDuConge added that the building is expected to come together rather quickly, with the goal of substantial completion by May 2019. Move-in activities along with the operational ramp-up is expected to commence that summer in preparation for the start of fall semester classes in August.\nSite work is scheduled through April to prepare for constructing the basement level, which includes the project’s 45,000-gallon cistern — a key element of the net-positive water requirement. After the foundation is set later this spring, the steel and wood structures will be put in place, giving the building its framework. Other visible installations will include the more than 900 photovoltaic panels that will be installed later this fall and winter.\nMore Than Just Construction\nBut designing and constructing the building is really only one aspect of achieving Living Building Challenge 3.1 full certification. Operating and maintaining the building are critical factors, too. So, selecting the appropriate occupants to properly steward the Challenge principles and abide by the strict building operating requirements is equally important.\n“The Kendeda Building will be one of only a few Living Building Challenge-certified facilities that will serve such a large group of occupants on a daily basis,” said Michael Gamble, director of Graduate Studies and associate professor for the School of Architecture. “Everyone in the building, including students, staff, and faculty, is responsible for complementing and upholding the basic building principles in how we learn and teach.”\nOne of The Kendeda Building’s featured programs includes the\nGlobal Change Program, which officially launched in March . This new initiative aims to coordinate and grow educational and research activities focused on providing solutions and creating economic opportunities at the intersection of global change, climate change, and energy. The program will be directed by Kim Cobb, ADVANCE professor and Georgia Power Chair in the School of Earth and Atmospheric Sciences. Early program activities will focus on curriculum design for undergraduates, including creation of an “Energy and Climate” minor and a climate solutions lab.\nGamble further explained that the College of Sciences will take the lead on utilizing the class labs for several core courses (including general ecology), which serve a broad cohort of students. As such, the instructors are refining their teaching methodologies in the labs to accommodate water and energy use requirements.\nAlong with the College of Sciences, courses from a number of colleges will also be offered in the building including English 1101 and 1102, advanced energy modeling, and vertically integrated projects. In addition, capstone teams will also have space in The Kendeda Building.\nAs the instructional programming is being developed for when the building opens in Summer 2019, several learning opportunities are already taking place. Last year, the Academic and Research Council announced a campuswide call for proposals for research, teaching, and community-based pilot ventures connected to The Kendeda Building and the Living Building Challenge. Currently, six interdisciplinary research projects are underway:\nWorkflows and Data Modeling in Support of the Material Sourcing Requirement of the Living Building Challenge - School of Architecture and Digital Design Lab.\nLiving Building Equity Champions\n- Office of Institute Diversity.\nBiologically Inspired Sustainable Building Design Challenges for Middle School Engineers: Expanding the Educational Reach of the Living Building at Georgia Tech - CEISMC and Center for Biologically Inspired Design.\nDocumenting the Effects of the Living Building on Biological Diversity and Succession - School of Biological Sciences.\nPilot Project Proposal for Living Building Monitoring Systems\n- Brooks Byers Institute for Sustainable Systems and School of Earth and Atmospheric Sciences.\nLiving Building Community Crowdsourcing: Developing an Interactive Augmented Reality Viewer to Capture Community Feedback - School of Civil and Environmental Engineering.\nAs these inaugural pilot projects conclude later this year, the Academic and Research Council is working to organize a second round of pilot programs focused on energy. The goal will be to support faculty- and student-led teams in developing innovative and creative solutions that could help address strict energy requirements such as the Living Building Challenge’s net-positive energy standard.\nFor more information, visit\nLivingBuilding.gatech.edu\nand\nlivingbuilding.kendedafund.org .\nAdditional Images\nRelated links\nThe Kendeda Building for Innovative Sustainable Design\nLiving Building Chronicle\nContact\nRachael Pocklington\nInstitute Communications\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}