{"text": "Valdosta Traffic Calming and Connectivity Project Selected as Finalist for World Smart Cities Awards | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nValdosta Traffic Calming and Connectivity Project Selected as Finalist for World Smart Cities Awards\nGeorgia Smart Communities Challenge funding supports smart traffic management system implementation.\nFacebook\nTwitter\nEmail\nNov 11, 2021\n— Valdosta, GA\nThe City of Valdosta’s  “Traffic Monitoring and Communication System to Improve Safety, Connectivity, and Efficiency”  project, funded by the Partnership for Inclusive Innovation’s Georgia Smart Communities Challenge in 2020, has been selected as a finalist for a 2021  World Smart Cities Award  in the Mobility Category.\nThe Partnership is a public-private organization charged with positioning the state of Georgia as the tech capital of the East Coast. Launched in 2020, it is supported with funding from the State, private industry, strategic partners, and the Georgia Institute of Technology, which also provides administrative oversight.\nIn 2020, Valdosta officials deployed its Georgia Smart Communities Challenge grant, along with community research support, to pilot a smart traffic management system designed to connect all 128 city traffic signals. The effort also included systems enhancements at traffic signals and the traffic control operations center, and the installation of communications responders in 10 fire trucks.\n“We are so proud of our city engineering department staff who have worked diligently over the past year to advance our Traffic Management Center capabilities with deployment of the TravelSafely application and signal pre-emption for fire vehicles,” said Valdosta Mayor Scott James Matheson. “This was an incredible the opportunity for the city to partner with Valdosta State University and Georgia Tech to provide hands-on experience to students, too.”\nThe systems enhancements allowed the city to test new signal timings from a recent study. They also allowed officials to implement an Emergency Vehicle Signal Pre-Emption protocol via installed equipment on the firetrucks. Additionally, the city implemented a smart phone application, TravelSafely, which notifies users of upcoming signal changes, approaching emergency vehicles, and other traffic safety measures.\nValdosta hosted community outreach and training workshops about these new smart traffic systems to encourage residents to utilize the available technology. During the pilot implementation phase, the city evaluated the effects of the new system on its traffic operations and the behavior of the traveling public by comparing before and after patterns and travel times.\n“This project is transforming Valdosta into a smart and connected city. We are committed to creating and sustaining a smart, effective traffic control system which will result in improved traffic flow, road safety, and reduction in the number of traffic accidents,” said Valdosta City Manager Mark Barber.\nGeorgia Tech and Valdosta State researchers actively participated in all engineering and research aspects, including data collection, and methods for statistical data analysis. The research team includes Baabak Ashuri, a professor in Georgia Tech’s School of Civil and Environmental Engineering and students Heung Jin Oh and Shiqin Zeng. It also includes Valdosta State professors Barry Hojjatie and Jia Lu, and student David Yoo. The team developed models related to studies of other emergency vehicles and school buses in the city’s connected vehicle system. Leveraging this project, Valdosta State began a new concentration within its School of Engineering focused on traffic management.\n\"As an undergraduate student, this project was a great opportunity for me to experience real-life work, meet new people, and work with a wonderful team, including faculty and fellow interns,” said David Yoo, a Valdosta State junior and a project intern. “I am extremely grateful for my first valuable internship experience, and I am confident that this experience will help me take a big step forward to my next goals.\"\nTo be named a finalist for such an internationally acclaimed and highly competitive award is an indication of the variety of smart community focused projects being deployed and the level of innovation and impact occurring statewide, said Debra Lam, the Partnership’s executive director.\n“Our work in Valdosta underscores our mission to promote innovation and serve as a conduit for helping to implement great ideas across the state for real impact,” Lam said. “The successes that we’re seeing in Valdosta serve as a blueprint for other cities in Georgia that are facing similar challenges. We’re extremely proud of the results we’ve seen in Valdosta and honored that this work is resonating around the world.”\nWorld Smart Cities Award finalists are selected by the Smart City Expo World Congress, a leading international summit on cities and smart urban solutions. Award winners will be announced During the Smart City Expo’s three-day summit scheduled for Nov. 16-18, 2021. The City of Atlanta won the award in this same category in 2018 for its North Avenue Smart Corridor Project.\nEntries came from 46 countries, and Valdosta was the only U.S. representative in the Mobility Category and one of five American entries in the group of 34 finalists.\nTo register to stream the Smart City Expo World Congress, including the awards ceremony, please visit:  https://www.tomorrow.city/a/scewcdigital2021 .\nContact\nWriter and media relations contact: Péralte C. Paul peralte.paul@comm.gatech.edu 404.316.1210\nEmail\nperalte.paul@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}