{"text": "Jennifer Howe Named Vice President for Development | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nJennifer Howe Named Vice President for Development\nJennifer Howe has been named Georgia Tech’s next vice president for Development, effective August 15.\nFacebook\nTwitter\nEmail\nJen Howe\nJun 27, 2022\n— Atlanta, GA\nJennifer Howe, vice president of Advancement at the University of Dayton, has been named Georgia Tech’s next vice president for Development, effective August 15.\nHowe comes to Tech with more than 25 years of experience in university development, advancement, and alumni relations, including campaign planning, stewardship, major and principal gifts, corporate and foundation relations, athletics capital needs, and planned giving. She has served in her current role as the chief advancement officer at the University of Dayton since 2016, where she has led a team of 86 advancement professionals, served on the President’s Cabinet, and worked with the university’s board of trustees.\n“We are excited to welcome Jennifer Howe as Tech’s new vice president for Development,” said Ángel Cabrera, president of Georgia Tech. “Jen brings extensive experience in all aspects of higher education fundraising and development and is a proven leader and collaborator. I very much look forward to working with her as we fully realize “Transforming Tomorrow: The Campaign for Georgia Tech.”\nDuring her tenure at the University of Dayton, Howe guided significant investment in staffing, resources, and infrastructure. Under her leadership, the team realized notable gains in principal and major gifts as well as the launch of new fundraising and engagement initiatives in student philanthropy, parent support, peer-to-peer ambassadors, Diversity, Equity, and Inclusion/affinity-based groups, and digital/virtual lifelong learning. Before joining the University of Dayton, Howe served at Vanderbilt University for 15 years, where she helped lead a $1.93 billion fundraising campaign. She began her fundraising career serving in a development director role at Emory University. Howe is a Georgia native. She was born in Gwinnett County and spent much of her childhood and adolescence in the Atlanta area. She holds a bachelor’s degree in English from James Madison University.\nIn the role of vice president for Development at Georgia Tech, Howe will guide the Institute’s Development enterprise, which includes more than 100 staff members, provide strategic oversight of Tech’s newly launched comprehensive campaign, “Transforming Tomorrow: The Campaign for Georgia Tech,” and serve as an active member of President Cabrera’s executive team, providing support to the president as well as senior leaders across the Institute in implementing fundraising initiatives in alignment with the Institute’s strategic plan.\n“Georgia Tech is one of America’s great research universities, and I am thrilled to join at such an exciting time in Tech’s history,” said Howe. “Education is a driver of change and opportunity, and philanthropy can make life-changing outcomes possible. I am energized by imagining what Georgia Tech is poised to accomplish through its commitment to community and country; innovative learning; scholarship and research; diversity, equity, and inclusion; and leadership and service.”\nHowe assumes the role of vice president following the retirement of Barrett Carson, who served Georgia Tech for 25 years. Jim Hall, associate vice president for Development — Athletics, has served as interim vice president for Development since January.\n“I am incredibly grateful to Jim Hall for his extraordinary leadership during this transition, which included the successful soft launch of our new campaign,” said Cabrera. “Because of Jim’s leadership, we are positioned very well to realize historic advancements as we work to transform lives, ideas, learning, our community, and our world.”\nAdditional Images\nContact\nSusie Ivy\nEmail\nsusie.ivy@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}