{"text": "$25 Million Award Will Support Nuclear Nonproliferation R&D, Education | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\n$25 Million Award Will Support Nuclear Nonproliferation R&D, Education\nA new consortium has been awarded $25 million to develop new technologies and educational program to support nuclear nonproliferation.\nFacebook\nTwitter\nEmail\nAssociate Professor Anna Erickson shown with the subcritical graphite pile used to teach radiation physics concepts at Georgia Tech. (Photo: Rob Felt, Georgia Tech)\nFeb 06, 2019\n— Atlanta, GA\nA consortium of 12 universities and 10 national laboratories led by the Georgia Institute of Technology has been awarded $25 million from the U.S. Department of Energy’s\nNational Nuclear Security Administration\n(NNSA) to develop new technologies and educational programs to support the agency’s nuclear science, security and nonproliferation goals.\nThe award will provide $5 million per year across a five-year period to link basic research at universities with the capabilities of national laboratories through the Consortium for Enabling Technologies and Innovation (ETI). The effort will focus on three core disciplines: computer and engineering science research through machine learning and high performance computing, advanced manufacturing and nuclear detection technologies.\n“We will be developing new enabling technologies to address not only the current challenges, but also those we might anticipate in the future,” said\nAnna Erickson , the consortium’s principal investigator and an associate professor in Georgia Tech’s\nWoodruff School of Mechanical Engineering . “Beyond these technologies, we will create the next cohort of students and researchers able to join the national laboratories to implement cutting-edge technologies to help the NNSA achieve its goals.”\nAmong the potential research topics are understanding how advanced manufacturing might produce nuclear reactor components and fuel assemblies, machine learning to predict and uncover new phenomena affecting proliferation, and novel instrumentation to leverage cutting-edge capabilities in microelectronics, solid state technologies and other areas to detect radioactive materials.\n“Machine learning and additive manufacturing are being actively used and pursued by leading private organizations, but they are not well utilized in our field today,” she explained. “We need to get away from conventional thinking and cultivate new technologies that take advantage of developments outside traditional nuclear engineering.”\nThe NNSA and the national laboratories are responsible for the nation’s nuclear stockpile, and also for preventing the spread of nuclear weapons and materials worldwide. That challenge is growing as new technologies – including additive manufacturing, also known as 3D printing – makes possible manufacturing that in the past could only be done in a limited number of facilities.\n“We need to look at securing the technologies of the future,” Erickson said.\nThe technologies of the future will require people to use them. The ETI Consortium will be developing new coursework and pathways to national laboratory internships designed to attract the best students and give them a broad education that goes beyond traditional nuclear engineering. The courses will be taught by the participating universities, and potentially also through online platforms.\n“We want to educate students who have a good understanding of new technologies in general,” Erickson said. “We will encourage them to challenge the world and see the world differently. Over the next five years, our goals are to create something that will have a lasting effect on this industry.”\nThe consortium’s education goal is to transfer more than 40 graduate students and 20 undergraduate students to the national laboratories over the next five years. As part of that strategy, it will provide approximately 70 internships, and establish eight faculty-student laboratory visit fellowships.\nConsistent with the vision of broadening the technology base, only a quarter of the faculty involved in the ETI Consortium will be traditional nuclear engineers. “People will come from all kinds of disciplines, from materials science to chemistry, advanced manufacturing and computer science. We are taking people with very diverse backgrounds and asking them to work together to create a new vision.”\nIn addition to Georgia Tech, the consortium will include the University of Wisconsin and The Ohio State University as leads of thrust areas, as well as the Massachusetts Institute of Technology, University of Michigan, University of Hawaii, Colorado School of Mines, Texas A&M University, University of North Carolina at Chapel Hill, Washington State University, Duke University and University of Texas at Austin.\nThe national laboratory partners will include Brookhaven National Laboratory, Los Alamos National Laboratory, Lawrence Livermore National Laboratory, Lawrence Berkeley National Laboratory, Idaho National Laboratory, Oak Ridge National Laboratory, Princeton Plasma Physics Laboratory, Sandia National Laboratory, Argonne National Laboratory and Pacific Northwest National Laboratory.\n“These grants will foster development of concepts and technologies that keep the United States at the forefront of nuclear monitoring and verification capabilities and allow us to nurture tomorrow’s nonproliferation experts,” said Brent K. Park, NNSA’s Deputy Administrator for Defense Nuclear Nonproliferation.\nAt Georgia Tech, the effort will also include Steven Biegalski, professor in the Woodruff School of Mechanical Engineering and chair of the Nuclear and Radiological Engineering and Medical Physics Program; Tim Lieuwen, executive director of the Strategic Energy Institute and a professor in the School of Aerospace Engineering; Amit Jariwala, senior academic professional in the School of Mechanical Engineering; Bernard Kippelen, the Joseph M. Pettit Professor and director of the Center for Organic Photonics and Electronics, and Chris Summers, professor emeritus and director of the Phosphor Technology Center of Excellence.\nSuccess with the five-year ETI Consortium could help change the way students see the field of nuclear engineering and how the U.S. population views nuclear power and other components of the industry.\n“We want people to think about nuclear engineering in a different light,” said Erickson. “Nuclear engineering has been very specific to a narrow discipline, but we are trying to show the community that we are much more. We want to create the next-generation thinker, and there is nothing traditional about this effort.”\nThe NNSA also announced the Consortium for Monitoring, Technology & Verification, a partnership of 14 universities led by the University of Michigan that is also funded for $25 million over five years. That organization seeks to improve U.S. capabilities to monitor the nuclear fuel cycle. “Its nonproliferation focus will be nuclear and particle physics, signals and source terms, and the physics of monitoring nuclear materials,” the NNSA announcement said.\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : John Toon (404-894-6986) (jtoon@gatech.edu).\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}