{"text": "Tech ‘Trailblazers’ to Receive Ivan Allen Jr. Prize | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nTech ‘Trailblazers’ to Receive Ivan Allen Jr. Prize\nFord Greene, Ralph Long Jr., and Lawrence Williams, Georgia Tech’s first Black students, and Ronald Yancey, Tech’s first Black graduate, will receive the 2022 Ivan Allen Jr. Prize for Social Courage.\nFacebook\nTwitter\nEmail\nClockwise (from top left): Ford C. Greene, Ralph A. Long Jr., Ronald L. Yancey, and Lawrence M. Williams.\nJan 19, 2022\n— Atlanta, GA\nFord Greene, Ralph Long Jr., and Lawrence Williams, Georgia Tech’s first Black students, and Ronald Yancey, Tech’s first Black graduate, will receive the 2022 Ivan Allen Jr. Prize for Social Courage.\nThe likenesses of the four men are permanently enshrined in campus sculptures, but now, decades after breaking the color barrier at Georgia Tech, they will join the ranks of past awardees that include Jimmy and Rosalynn Carter, John Lewis, Andrew Young, and other pathbreaking leaders.\n“The Ivan Allen Jr. Prize recognizes exemplary, courageous leaders — those who, like Mayor Allen, take on personal risks in an effort to improve the lives of others,” said Georgia Tech President Ángel Cabrera. “With great determination, Ford Greene, Ralph Long Jr., Lawrence Williams, and Ronald Yancey withstood hazards and adversity of every kind to prove to the world that Black students had the right to study at Georgia Tech, paving the way for the thousands of Black Yellow Jackets who have earned their degrees here since.”\nGreene, Long, and Williams, dubbed the “three pioneers” in the Harrison Square sculpture that depicts them on their first day at Tech, began classes in the fall of 1961. And, although their arrival didn’t elicit violence as it had at other southern universities, it was not easy. They often felt isolated and unwelcome, and they were acutely aware that many around them assumed they wouldn’t be able to succeed here. As Ronald Yancey, who entered Tech a year later, recalled, “It was a lonely and difficult time. ‘Glares and stares’ is the best way I can put it.”\nBut they persevered. Greene studied chemical engineering at Georgia Tech. He completed his bachelor’s degree in mathematics and computer science at Morgan State University and worked in telecommunications and information technology systems. He died in 2020 at the age of 76. After attending Tech, Long completed his bachelor’s degree at Clark College (now Clark Atlanta University) in mathematics and physics, and was the first Black systems engineer for the Large Systems Group in the southeastern U.S. at IBM Atlanta. Williams served honorably in the Air Force during the Vietnam War, earning several distinctions and honors. A week after graduating, Yancey began a successful career with the U.S. Department of Defense.\n“We rarely award the Ivan Allen Jr. Prize to our own students and alumni, but we were long overdue in bestowing it to these four pioneers,” Cabrera said. “We are honored to celebrate the legacies of four brave young men who helped make Georgia Tech — and, by extension, our society — fairer and better for all. Their personal sacrifice, their determination, and their belief that a better reality was possible made a lasting and transformative impact on the Institute that’s still visible more than 60 years after they first set foot on campus.”\nThe Ivan Allen Jr. Prize for Social Courage was established in 2010 to honor Tech alumnus and former Atlanta Mayor Ivan Allen Jr. Funded in perpetuity by a grant from the Wilbur and Hilda Glenn Family Foundation, the prize includes a $100,000 stipend for recipients. The inaugural prize was awarded in March 2011.\nAdditional details about the timing of this year’s award presentation will be announced soon. To learn more about the prize, visit\nivanallenprize.gatech.edu . View highlights from the 2019 Trailblazers unveiling event\nhere .\n—written by Stacy Braukman\nAdditional Images\nContact\nAyana Isles\nInstitute Communications\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}