{"text": "Georgia Tech Earns STARS Silver Rating for Its Campuswide Contributions to Sustainability | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Earns STARS Silver Rating for Its Campuswide Contributions to Sustainability\nGeorgia Tech recently achieved a STARS silver rating by the Association for the Advancement of Sustainability in Higher Education (AASHE).\nFacebook\nTwitter\nEmail\nJul 02, 2021\n— Atlanta, GA\nGeorgia Tech recently achieved a STARS silver rating by the Association for the Advancement of Sustainability in Higher Education (AASHE). STARS stands for Sustainability Tracking, Assessment, and Rating System and is awarded based upon measured success in five key areas of sustainability in higher education – Academics, Engagement, Operations, Planning and Administration, and Innovation and Leadership. The rating system helps benchmark achievements and identify opportunities where faculty, administrators, staff, and students can be effective change agents.\n“The STARS report represents the cumulative work of sustainability performance and leadership across Georgia Tech’s academics, research, engagement, and business operations,” said Anne Rogers, project lead and associate director of Campus Sustainability. “Our silver rating is an important milestone as we continue to demonstrate strategic leadership in sustainability and alignment with the Institute’s strategic plan.”\nSustainability is a common theme throughout the strategic plan, which demonstrates a shared commitment to being thoughtful stewards of our resources – social, environmental, and economic. It is one of many ways Georgia Tech will\nlead by example\nin how we deliver on our educational and research mission. STARS will help inform and guide decisions on where to invest resources to achieve our sustainability goals.\nGeorgia Tech’s recent silver rating is the result of a 22-month effort, led by the Office of Campus Sustainability in partnership with Serve-Learn-Sustain, Facilities Analytics and Communications, and Institute Research Planning, to compile more than 1,300 unique information or data inputs about our sustainability-related actions. More than 150 people were engaged across 100 departments, demonstrating how sustainability is truly interwoven throughout Georgia Tech's operations, research, and educational functions.\nSummary of results from the STARS report:\nAcademics\nThe Academics category includes both curriculum and research offerings. Georgia Tech scored with 89% of academic departments offering courses in sustainability and 73% of departments conducting research related to sustainability.\nEngagement\nEngagement includes both campus and public outreach. Georgia Tech has a robust student programming portfolio of sustainability groups and numerous activities centered around gardening, farming, urban agriculture, and wilderness programs. These exist alongside opportunities for students to learn life skills through sustainable employment practices, workshops, conferences, speaker series, and cultural arts events. Staff professional development and training also contributes, with such efforts as the Sustainable Facilities Forum produced each year by Facilities employees. The forum highlights innovative projects and practices Georgia Tech uses to maintain its built environment.\nOperations\nMeasuring sustainability within Operations involves energy usage, food and dining, procurement, commuting modes, fleet, waste, and water. Data in these categories is easily trackable and used regularly by the Institute to make operational decisions. Report data includes the following:\n12% reduction in total source energy consumption per unit of floor area from a baseline from fiscal year 2010.\n41.44% of total annual food and beverage expenditures are on plant-based foods.\n62.43% of expenditures are on cleaning and janitorial products that are third-party certified.\n29.75% of materials are diverted from the landfill by recycling, composting, donating, or reselling.\n25% of campus fleet vehicles are electric.\nPlanning and Administration\nSustainability within Planning and Administration includes the categories of diversity/affordability, investment/finance, and work/well-being. Georgia Tech’s graduation rate for low-income students is 84%. Work/Well-being ratings range from employees receiving a living wage to educational resources related to healthy eating, stress relief, and mental health.\nInnovation and Leadership\nThe Innovation and Leadership categories in which Georgia Tech scores high include sustainability standards such as:\nBicycle-friendly campus status.\nAvailability of a campus food bank.\nGreen cleaning practices.\nGrounds certification.\n“The Institute’s strategic plan clearly outlines that Georgia Tech be a leader in sustainability. STARS is one framework to measure and track continuous improvement, and to motivate us to achieve more,” Rogers added.\nThe STARS silver rating will help define the future actions and resources needed to achieve even higher ratings in the years to come. The goal is to revisit this rating system every two years. To read the full report,\nclick here .\nAdditional Images\nContact\nAnne Rogers\nAssociate Director\nCampus Sustainability\nAdditional information\nThe Association for the Advancement of Sustainability in Higher Education (AASHE) is a national organization founded in 2005. Its mission is to inspire higher education to lead the way in promoting and supporting sustainability initiatives. AASHE helps to ensure that current and future leaders are informed, equipped, and motivated to solve sustainability challenges by ensuring the institutions they attend are committed to this goal. Georgia Tech is an active member of AASHE. Current students, faculty, and staff can register to receive member benefits such as discounts on network events and access to the Campus Resource Hub with case studies and educational resources. Visit\nwww.aashe.org .\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}