{"text": "Gift to Tech Awarded to CDAC/WST Menstrual Product Program | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGift to Tech Awarded to CDAC/WST Menstrual Product Program\nThe CDAC/WST Menstrual Product Program, a pilot program offering free menstrual products to campus, is the 2019 Gift to Tech winner.\nFacebook\nTwitter\nEmail\nSticker created for WST/CDAC Menstrual Product Program\nApr 16, 2019\n— Atlanta, GA\nThe CDAC/WST Menstrual Product Program, a pilot program offering free menstrual products to campus, is the 2019 Gift to Tech winner. The project will receive approximately $30,000 for programmatic support.\nGift to Tech funds come from over 6,000\nStudent Alumni Association\n(SAA) members, with $5 of every yearly membership contribution going toward Gift to Tech. The Georgia Tech student body chooses the top three project submissions, and the SAA members select the final Gift to Tech project winner. Gift to Tech is facilitated by the\nGeorgia Tech Student Foundation.\nThe Center for the Study of Women, Science, and Technology (WST) is partnering with students involved in the Cultural Diversity and Affairs Committee (CDAC) of the Student Government Association (SGA) to establish the program.\n“We were all very excited when we found out we won,” said Carol Colatrella, professor and associate dean for graduate studies, Ivan Allen College of Liberal Arts and co-director of WST. “It really was a collaborative effort between WST and CDAC. The CDAC students were the intellectual architects of this project, with WST graduate partners leading the publicity.”\nThe program began to take shape when Niveda Shanmugam, William Harrer, and Alex Casado, co-chairs of CDAC and vice president of Student Life, heard from people who menstruate saying that they had trouble affording menstrual hygiene products. The three said they realized the problem was rooted in unfair gender inequality, so they decided to make a difference in this space. In turn, they led the development of the strategy, funding, execution, and logistics for the initiative to provide sustainable, biodegradable, easily accessible, and free menstrual products for the campus community.\nIn creating a plan, the organizers worked with a number of campus departments including Health Initiatives on a survey to gauge the need; Facilities Management regarding advice on installations, refilling, and inventory; and with Student Life and building managers to determine where to place the dispensers of menstrual products and how many are needed. CDAC identified certain buildings as likely locations for the dispensers — the Scheller College of Business, the Clough Undergraduate Learning Commons, Klaus Computing Building, the Student Center, and the Instructional Center.\nCDAC also established a relationship with Aunt Flow, an organization that provides tampons and pads that are organic cotton, biodegradable, comfortable, and free for students on campuses across the country.\nThe Gift to Tech funds will cover most, if not all, of the overhead costs of the program for one year.\n“At the end of this one year, we hope to have data to reflect the success of this pilot, community support, and momentum with this initiative so we can work with facilities, administration, and building managers across campus to see if we can add these products as a line item on the yearly budget,” said Shanmugam. “This is the process in most other universities that have a similar program in place, so we aim to accomplish the same at Georgia Tech!”\nAside from refining the logistical details, the organizers also hope to inspire other colleges across the Southeast as well as Tech’s peer universities to provide the same support to their students.\n“We would love to serve as collaborators or mentors to such efforts, and hope to receive constructive feedback to have this program reach its full potential,” Shanmugam said.\nGetting the Word Out\nWST graduate partners Katherine Bennett, Danielle Schechter, and Monica Marks collaborated with CDAC leaders Shanmugam, Harrer, and Casado to design and distribute publicity materials to help create awareness of the program among students voting on the Gift to Tech nominees.\n“We integrated data and graphics from the Free the Tampons Foundation and tailored this information from the national campaign to fit the Menstrual Product Program that CDAC initiated specifically for the Tech campus,” said Bennett, who led the design team. “I worked closely with Niveda, Alex, and William to make sure that the language and graphics on our posters, flyers, monitor images, and stickers represented CDAC’s vision to bring free and sustainable menstrual products to gender-inclusive restrooms at Tech. I’m happy that our designs are truly collaborative, with equal involvement from both partners in the project,” Bennett said.\nMembers of WST and CDAC used the publicity materials to reach student voters through the use of social media, physical locations around campus, and tabling events before and on Giving Day.\nThe Gift to Tech award will be presented during a ceremony on Tuesday, April 16, at 11 a.m. in the Student Center’s Peachtree Room.\nPrevious Gift to Tech winners are: The LGBTQIA Resource Center, Tech Ends Suicide Together, Excel at Georgia Tech, Student Mental Health, Klemis Kitchen, GT Band, Dean Dull Endowment, and the Office of Solid Waste and Recycling.\nAdditional Images\nContact\nVictor Rogers\nInstitute Communications\nEmail\nvictor.rogers@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}