{"text": "Laughing Gas May Have Helped Warm Early Earth and Given Breath to Life | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nLaughing Gas May Have Helped Warm Early Earth and Given Breath to Life\nAn eon ago, the sun was stingy with heat, but Earth stayed warm; maybe laughing gas in the atmosphere helped out. Here's how.\nFacebook\nTwitter\nEmail\nAncient tiger eye BIF (banded iron formation) rock with varying layers that include iron that fell out of ancient oceans. An eon ago, oceans appear to have been full of ferrous iron, which would have facilitated production of N2O (laughing gas). Credit: Georgia Tech / Allison Carter\nAug 22, 2018\n— Atlanta, GA\nMore than an eon ago, the sun shone dimmer than it does today, but the Earth stayed warm due to a strong greenhouse gas effect, geoscience theory holds. Astronomer Carl Sagan coined this “ the Faint Young Sun Paradox ,” and for decades, researchers have searched for the right balance of atmospheric gases that could have kept early Earth cozy.\nA  new study  led by the Georgia Institute of Technology suggests that nitrous oxide, known for its use as the dental sedative  laughing gas , may have played a significant role.\nThe research team carried out experiments and atmospheric computer modeling that in detail substantiated an existing hypothesis about the presence of nitrous oxide (N 2 O), a powerful greenhouse gas, in the ancient atmosphere. Established research has already pointed to high levels of carbon dioxide and methane, but they may not have been plentiful enough to sufficiently keep the globe warm without the help of N 2 O.\nJennifer Glass,  an assistant professor at Georgia Tech , and Chloe Stanton, formerly an undergraduate research assistant in the Glass lab at Georgia Tech, published  the study in the journal  Geobiology  on Wednesday, August 22, 2018. Their work was funded by the NASA Astrobiology Institute. Stanton is now a graduate research assistant at the Pennsylvania State University.\nNo ‘boring billion’\nThe study focused on the middle of the  Proterozoic Eon , over a billion years ago. The proliferation of complex life was still a few hundred million years out, and the pace of our planet’s evolution probably appeared deceptively slow.\n“People in our field often refer to this middle chapter in Earth’s history roughly 1.8 to 0.8 billion years ago as the ‘boring billion’ because we classically think of it as a very stable period,” said Stanton, the study’s first author. “But there were many important processes affecting ocean and atmospheric chemistry during this time.”\nChemistry in mid-Proterozoic ocean was heavily influenced by abundant soluble  ferrous iron  (Fe 2+ ) in oxygen-free deep waters.\nAncient iron key\n“The ocean chemistry was completely different back then,” said Glass, the study’s principal investigator. “Today’s oceans are well-oxygenated, so iron rapidly rusts and drops out of solution. Oxygen was low in Proterozoic oceans, so they were filled with ferrous iron, which is highly reactive.”\nIn lab experiments, Stanton found that Fe 2+  in seawater reacts rapidly with nitrogen molecules, especially nitric oxide, to yield nitrous oxide in a process called chemodenitrification. This nitrous oxide (N 2 O) can then bubble up into the atmosphere.\nWhen Stanton plugged the higher fluxes of nitrous oxide into the atmospheric model, the results showed that nitrous oxide could have reached ten times today’s levels if mid-Proterozoic oxygen concentrations were 10 percent of those today. This higher nitrous oxide would have provided an extra boost of global warming under the Faint Young Sun.\nBreathing laughing gas\nNitrous oxide could have also been what some ancient life breathed.\nEven today, some microbes can breathe nitrous oxide when oxygen is low. There are many similarities between the enzymes that microbes use to breathe nitric and nitrous oxides and enzymes used to breathe oxygen. Previous studies have suggested that the latter evolved from the former two.\nThe Georgia Tech model provides a plentiful source of nitrous oxide in ancient iron-rich seas for this evolutionary scenario. And prior to the Proterozoic, when oxygen was extremely low, early aquatic microbes could have already been breathing nitrous oxide.\n“It’s quite possible that life was breathing laughing gas long before it began breathing oxygen,” Glass said. “Chemodenitrification might have supplied microbes with a steady source of it.”\nAlso READ:\nCold Suns, Warm Exoplanets, and Methane Blankets\nLike this article?  Subscribe to our email newsletter\nThe paper was co-authored by Chris Reinhard of Georgia Tech, James Kasting of the Pennsylvania State University, Nathaniel Ostrom and Joshua Haslun of Michigan State University, and Timothy Lyons of the University of California Riverside. The research was funded by grant NNA15BB03A from the NASA Astrobiology Institute. Findings, opinions, and conclusions are those of the authors and not necessarily of the NASA Astrobiology Program.\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia relations assistance : Ben Brumfield (404) 660-1408, ben.brumfield@comm.gatech.edu\nWriter:  Ben Brumfield\nAdditional Images\nEmail\nben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}