{"text": "Hollister Lab Develops 3D Printing for Soft Tissue Engineering | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nHollister Lab Develops 3D Printing for Soft Tissue Engineering\nResearchers use architected auxetics to achieve 300 times more flexibility in new 3D printing design.\nFacebook\nTwitter\nEmail\nResearch scientist JeongHun Park\nNov 30, 2023\nThere are young children celebrating the holidays this year with their families, thanks to the 3D-printed medical devices created in the lab of  Georgia Tech researcher Scott Hollister . For more than 10 years, Hollister and his collaborators have developed lifesaving, patient-specific airway splints for babies with rare birth defects.\nThese personalized Airway Support Devices are made of a biocompatible polyester called polycaprolactone (PCL), which has the advantage of being approved by the Food and Drug Administration. Researchers use selective laser sintering to heat the powdered polyester, which binds together as a solid structure. Devices made of PCL have a great safety record when implanted into patients.\nUnfortunately, PCL has the disadvantage of having relatively stiff and linear mechanical properties, which means this promising biomaterial has yet to be applied functionally to some other critical biomedical needs, such as soft tissue engineering. How do you make a firm thermoplastic into something flexible, and possibly capable of growing with the patient? Hollister’s lab has figured out how.\n“3D auxetic design,” said Jeong Hun Park, a research scientist in Hollister’s lab who led the team’s recent study demonstrating the successful  3D printing of PCL for soft tissue engineering . An auxetic material, unlike typical common elastics, has a negative Poisson’s ratio. That means if you stretch an auxetic material longitudinally it will also expand in the lateral direction, whereas most materials will get thinner laterally (because they have a positive Poisson’s ratio).\nSo, an auxetic structure can expand in both directions, which is useful when considering biomedical applications for humans, whose bodies and parts can change in size and shape over time and comprise many different textures and densities. Hollister’s team set out to give usually firm PCL some new auxetic properties.\n“Although the mechanical properties and behavior of the 3D structure depend on the inherent properties of the base material — in this case, PCL — it can also be significantly tuned through internal architecture design,” explained Park.\nPark guided the design of 3D-printed structures made up of tiny struts, arranged at right angles — imagine the bones of very tiny skyscrapers. The team began by creating cube-shaped structures first, to test the auxetic design’s flexibility, strength, and permeability.\nFlexible Behavior\nBasically, an auxetic material is a network structure designed by assembling unit cells. These unit cells consist of struts and their intersecting joints, which are an important aspect of an auxetic device’s behavior. The rotation of those intersecting joints within the network, under compression or extension, causes negative Poisson’s behavior. It also enables advanced performance for a printed device, including impact energy absorption, indentation resistance, and high flexibility.\n“When you look at the numbers, based on Jeong Hun’s work, the new structure is about 300 times more flexible than the typical solid structure we make out of PCL in our lab,” said Hollister, professor in the Wallace H. Coulter Department of Biomedical Engineering at Georgia Tech and Emory University, where he also holds the Patsy and Alan Dorris Chair in Pediatric Technology and serves as the department’s associate chair for translational research.\nThe combination of flexibility and strength in a device is particularly important here, Park said, because the ultimate goal of the research is to “apply this structure to develop a breast reconstruction implant that has comparable biomechanical properties to native breast tissue. Currently, we don’t have a biodegradable breast implantation option in the clinical setting.”\nHe explained that these biodegradable breast reconstruction implants serve as a kind of scaffold. The idea is, the biocompatible material (PCL) eventually degrades and is absorbed into the body, while maintaining similar mechanical properties to native breast tissue.\n“We expect that native tissue will be first infiltrated into the pores of the biodegradable implant,” Park said. “Tissue volume will then increase within the implant as it degrades and eventually the device itself is replaced with the tissue after complete degradation of the implant.”\nExpanding the Cellular Network\nEssentially, the 3D-printed breast implant is designed to provide reconstructive support while also facilitating the growth of new tissue.\nThe space between those tiny struts makes all the difference for the larger device, giving it a softness and pliability that would have been impossible otherwise. Those spaces eventually can be filled with hydrogel that will help foster cell and tissue growth.\nThe team’s architected auxetics also include the design of inner voids and spaces inside the struts, creating a kind of microporosity that enables the mass transport of oxygen, nutrients, and metabolites to nurture the expansion and growth of a cellular network.\nPark is working with Emory surgeon  Angela Cheng  in submitting a grant for further research and testing of the breast implant. And the team already is adapting the technology for other applications. One of the collaborators in this research, for example, is  Mike Davis , whose lab at Emory is focused on cardiac regeneration.\n“Because of the great flexibility, they’re using it to reconstruct infarcted or necrotic myocardial tissue,” Hollister said.\nAnd Park has developed an auxetic version of the pediatric tracheal splint. “The advantage there is, with this design, it can expand in two directions,” he said. “So, as young patients grow, the new device will grow with them.”\nVideo Demonstration of Auxetic Compression\nAdditional Images\nContact\nWriter:\nJerry Grillo\nEmail\njerry.grillo@ibb.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}