{"text": "Medicaid ‘Unwinding’ Could Lead to Eviction Crisis, New School of Public Policy Research Suggests | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMedicaid ‘Unwinding’ Could Lead to Eviction Crisis, New School of Public Policy Research Suggests\nThe study examined Tennessee's 23005 trimming of its Medicaid rolls and the impact on evictions.\nFacebook\nTwitter\nEmail\nEvictions substantially rose in Tennessee compared to other Southern states after the 2005 removal of 190,000 people from Medicaid there, School of Public Policy Assistant Professor Ashley C. Bradford found in a new study published in\nHealth Affairs . The study offers insights into what might happen after current efforts to return to normal Medicaid operations nationally following the Covid-19 public health emergency.\nFeb 16, 2024\nThe United States may be in for a significant wave of evictions in a year or so, the unintended consequence of work to trim Medicaid rolls expanded during the Covid-19 public health emergency, according to new research from Georgia Tech’s\nSchool of Public Policy .\nThe\nstudy ,\nauthored\nby Assistant Professor Ashley C. Bradford and recently published in\nHealth Affairs,\nfound that evictions in Tennessee rose 24.5 percent between 2005 and 2009 relative to other Southern states following the state’s 2005 decision to remove approximately 190,000 people from its Medicaid rolls.\nMore than\n16.4 million people\nnationwide — 86 times the Tennessee figure from 2005 — have already been taken off Medicaid as states react to a federal law requiring them to return to normal operations after years of expanded eligibility meant to blunt the impact of the pandemic, according to\nKFF Health News.\nAs many as 24 million people could eventually lose access to Medicaid, according to the outlet.\nHowever,\nBradford\nwarns that many aspects of health care administration and the housing market have changed since 2005, so it’s hard to say whether that 24.5% figure in her paper will cleanly translate to the economic and policy environment of 2025. The populations involved in Tennessee’s downsizing and the\ncurrent national rollbacks\nare also different, adding more uncertainty.\n“I think it’s safe to say that we will see disruptions in housing, but we are not going to be able to see exactly how large those disruptions will be for a few years,” Bradford said.\nhttps://youtu.be/V7YkDwvWgzA?si=FwPKLP24paa6i4_A\nT ransformed Health Care and Housing Landscapes May Shift Impact\nAmong other things, where Tennessee’s 2005 Medicaid changes primarily affected working-age childless adults, the researchers say that the current Medicaid rollback is expected to disproportionately affect immigrants and people with disabilities — populations whose budgets are often more sensitive to economic shocks like the loss of health insurance.\nOn the other hand, according to the researchers, the Affordable Care Act could also reduce financial shocks and evictions for some families. The program first offered health insurance plans — including low- and zero-premium options — in 2013, well after the period Bradford\nand her co-authors\nstudied in Tennessee.\nAnother group expected to be affected, older adults, may be somewhat sheltered from evictions due to savings or Social Security income, according to Bradford and her co-authors, Mir M. Ali of the University of Maryland, College Park and Johanna Catherin Maclean of George Mason University.\nThe Link Between Medicaid Loss and Evictions\nSo, what precisely is the connection between loss of Medicaid and eviction?\nIn the Tennessee case, the loss of health coverage — which persisted for most families removed from Medicaid in Tennessee in 2005 — would likely have added more financial stress to already strapped budgets. It also may have led to a higher incidence of preventable health issues or the undertreatment of existing chronic health conditions that could have made it harder for people to keep working, according to the researchers. Either situation could be financially devastating, potentially resulting in eventual eviction.\nEvictions, in turn, often force people into housing located in areas with fewer employment opportunities and higher crime, further elevating the financial stress on vulnerable populations, leading to a cycle that can lock people — especially those affected by health issues or substance misuse — into nearly inescapable poverty, according to the study authors.\n“We know evictions are extraordinarily damaging to families and individuals and can cause generational impacts. So we really need to be able to intervene and help vulnerable people before they get into a cycle where they cannot get out of it on their own,” Bradford said.\nBradford said one policy that could help would be a strong, temporary eviction moratorium similar to the one imposed nationally by the U.S. Centers for Disease Control and Prevention in response to the Covid-19 pandemic in 2021. Policymakers could also consider financial assistance to those being removed from the Medicaid rolls to help them stay on their feet during the transition, she said.\nMethodology and Limitations\nTo reach their conclusions in the recent paper, Bradford and her co-authors used data from the Eviction Lab at Princeton University. They examined county-level eviction data from Tennessee and compared it to those of Alabama, Florida, Georgia, Kentucky, Louisiana, Maryland, Mississippi, North Carolina, Oklahoma, South Carolina, Texas, Virginia, Washington, D.C., and West Virginia.\nAfter controlling for variables such as whether political factors could have led to weakened rental protection laws, they found that the average annual eviction filings per Tennessee county increased by 27.6% as compared to counties in the other states in the U.S. Census Bureau’s South region. Eventual evictions increased by the slightly smaller 24.5% figure.\nThat works out to about 1,000 more annual evictions per Tennessee County than in other Southern states during the same period.\nThe study does have some limitations in addition to how much has changed since 2005, Bradford notes. She said the database has some gaps, lacks individual-level data, and does not track eviction notices or evictions overturned on appeal, although the latter is believed to be rare.\nProbing Impact of Substance Abuse, Psychiatric Care Access, on Evictions\nBradford’s earlier research has examined the impact of evictions from other angles. In a\n2019 paper\npublished in\nHealth Services Research , she also found that a 1% increase in the eviction rate is associated with an up to 0.596% chance of substance-related deaths for the average U.S. county.\nIn a\n2023 study\npublished in the\nJournal of Policy Analysis and Management\nwith co-author Johanna Catherin Maclean, Bradford found that having ten additional psychiatric treatment centers in a county was associated with 2.1% fewer evictions.\nThe researchers hypothesized that increased access to psychiatric care improved the management of mental health disorders, which can lead to higher rates of employment and lower rates of activities likely to lead to eviction — such as nuisance behaviors or criminal activity.\nIt was one of the first papers to make a plausible link explaining the relationship between mental health treatment access and eviction, according to the researchers.\nBradford’s most recent paper, “TennCare Disenrollment Led to Increased Eviction Filings and Evictions in Tennessee Relative to Other Southern States,” was published on Feb. 5, 2024, in\nHealth Affairs . It is available at\nhttps://doi.org/10.1377/hlthaff.2023.00973 .\nThe School of Public Policy is a unit of the Ivan Allen College of Liberal Arts.\nContact\nMichael Pearson\nIvan Allen College of Liberal Arts\nEmail\nmichael.pearson@iac.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}