{"text": "Georgia Tech Receives $2.2M in Toyota Research Institute Robotics Funding | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Receives $2.2M in Toyota Research Institute Robotics Funding\nGeorgia Tech researchers will collaborate with TRI on two research projects: the first to advance autonomous vehicle testing and the second,\nto improve the way robots assist older adults with daily living tasks.\nFacebook\nTwitter\nEmail\nGeorgia Tech is building on its AutoRally platform to further self-driving vehicle research. (Photo credit: Rob Felt, Georgia Tech)\nMar 08, 2021\n— Atlanta, GA\nThe Georgia Institute of Technology is one of 16 academic institutions selected for\nToyota Research Institute’s (TRI)\ncollaborative research program.\nFounded in 2015 and now in its second wave of investment with top universities, TRI will invest more than $75 million over the next five years. The university partners will focus on breakthroughs around tough technological challenges in key research priority areas of automated driving, robotics, and machine-assisted cognition.\n“Georgia Tech is honored to work closely with TRI to advance robotics in key fields. It’s an exciting start to what we hope will be a longer-term collaboration,” said\nSeth Hutchinson , executive director of Georgia Tech’s\nInstitute for Robotics and Intelligent Machines\nand professor and KUKA Chair for Robotics in the\nSchool of Interactive Computing .\n\"This new phase of university research is about pushing even further and doing so with a broader, more diverse set of stakeholders. To get to the best ideas, collaboration is critical. And we sought out universities like Georgia Tech that share our vision of using AI for human amplification and societal good. The funded projects will contribute to two TRI focus areas: automated driving and home robotics,\" said Eric Krotkov, TRI chief science officer.\nThe two Georgia Tech projects total $2.2M over the next three years. Under the agreement, each team will be paired with TRI researchers, who will serve as co-investigators.\nAn Outdoor MiniCity to Test Autonomous Driving\nThe first research project aims to make it easier for universities to test autonomous vehicles, building on Georgia Tech’s\nAutoRally\nplatform. Georgia Tech researchers use this small-scale autonomous dirt track to test aggressive driving. The car can control turns and calculate for on-course obstacles at speeds approaching 20 miles per hour. The software and simulation environment could help make future self-driving cars safer under similar hazardous road conditions. Georgia Tech researchers will build on this platform to develop a scale-model MiniCity environment to develop and test autonomy algorithms.\nCurrent autonomous vehicle testing is done by industry using full-size vehicles on city streets – an expensive proposition not viable for the broader academic research community.\n“There’s a barrier to entry for the science in the field,” said principal investigator\nJames Rehg , a professor in the\nSchool of Interactive Computing . “Our platform uses a one-fifth scale vehicle, freeing us to do research at lower cost and without taking any risks – we can crash our car and it’s inexpensive to repair and nobody gets hurt.”\nThe autonomous cars will navigate the MiniCity and avoid hazards while obeying speed and traffic rules. Sensors will enable the cars to sense obstacles and make decisions on how fast to drive or how to steer. “We are addressing the issue of reproducibility of autonomous driving in a test environment,” Rehg said.\nMassachusetts Institute of Technology (MIT), one of TRI’s three original funded universities, is leading the research project. MIT operates an indoor autonomous driving track that simulates paved city streets. With Georgia Tech’s outdoor track, researchers can then see how autonomous cars perform over gravel, dirt, and other more realistic driving conditions.\nAccording to Rehg, autonomy testing presents unique challenges. “There’s a reason you get a driver’s test — you have to understand the variety of situations that can arise in driving and the rules, and you must understand how the context can change and make all the right decisions for safety.”\nWith the MiniCity, Rehg and fellow investigator Evangelos Theodorou, an associate professor in the Daniel Guggenheim School of Aerospace Engineering, hope to develop a standardized testbed and protocol for testing and then invite academic teams to compete and measure the driving performance of their vehicles.\nHuman-assist Robots to Help People Age in Place\nGeorgia Tech’s other TRI research project involves robotics that can assist older adults. It reflects Toyota and TRI’s priority to help older adults age in place.\n“It’s really a powerful thing to have independence and be able to do things for yourself,” said the project’s principal investigator,\nCharlie Kemp , associate professor in the\nWallace H. Coulter Department of Biomedical Engineering\nand adjunct associate professor in the\nSchool of Interactive Computing . Kemp also is a co-founder and the chief technology officer of Hello Robot Inc., a company that has commercialized robotic assistance technologies initially developed in his lab.\nLooking at the aging issue, Kemp and co-PI Hutchinson will examine how to take advantage of complementary characteristics that can lead to better physical collaboration between an individual and a robot.\n“We are asking, ‘How can an individual and a particular robot best work together?’ ‘How do we individualize the robot to the person to give them a better quality of life?’” Kemp said.\nThey plan to take a modeling approach initially using physics simulations and, later, conducting studies with young able-bodied participants, healthy older adults, and older adults with impairments.\nThe researchers will use sensing technology – including pressure sensors on beds that pinpoint a person’s body position and movement, as well as capacitive sensors that help the robot to better perceive a person’s body position up close. Such information can help with activities like dressing.\n“It’s a very intimate interaction between the robot and the human,” Hutchinson said.\nBoth investigators share TRI’s view that robotics that can assist older adults with daily living could make a major impact in the well-being of an increasingly graying population. In fact, during the next three decades, the global population over the age of 65 is projected to more than double. Japan, headquarters for Toyota, has the highest proportion of older citizens of any country in the world, with one in four people over 65.\n“We have talked about robots helping older adults for decades and we’re still not there,” said Kemp. “There’s a real opportunity to help people. As I get older, I’d love for this technology to be there for me and for my loved ones. While we still have a long way to go, the research can get us closer,” he added.\nHutchinson acknowledged that it will take time before people see robotic assistive technologies in hospitals or people’s homes, but the potential is there.\n“What is most exciting about the TRI project is it has the potential to show up in people’s homes because TRI is invested in getting it there. And that means our research could really make an impact on a broad scale instead of only touching research journals or elite practitioners in the field,” he said.\nRobotics Success Takes a Village\nThe investigators agree that Georgia Tech’s multidisciplinary focus within robotics is a strength that will serve them well in their work with TRI, and especially in the future when autonomy goes mainstream.\n“If you think about what it’s going to take for autonomous vehicles to really exist in the world on a large scale and deliver passengers in high volumes, it’s going to require all those things – engineering, science policy, law, and ethics – all those disciplines coming together,” said Rehg.\nKemp agreed, noting that since founding his\nHealthcare Robotics Lab\nin 2007, he’s attracted students from across engineering disciplines — from mechanical and computing to electrical, aerospace, and biomedical.\n“It's definitely something that's distinctive about Georgia Tech — it's a real strength,” he said.\nCharlie Kemp owns equity in Hello Robot and is an inventor of Georgia Tech intellectual property (IP) licensed by Hello Robot. Consequently, he benefits from increases in the value of Hello Robot and receives royalties via Georgia Tech for sales made by Hello Robot. The terms of this arrangement have been reviewed and approved by Georgia Tech in accordance with its conflict-of-interest policies.\nAdditional Images\nContact\nAnne Wainscott-Sargent\nResearch News\n(404-435-5784)\nEmail\nasargent7@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}