{"text": "Student Engagement and Well-Being Establishes New Division of Arts, Belonging, and Community | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nStudent Engagement and Well-Being Establishes New Division of Arts, Belonging, and Community\nStudent Engagement and Well-Being Establishes New Division of Arts, Belonging, and Community.\nFacebook\nTwitter\nEmail\nAug 03, 2023\nStudent Engagement and Well-Being\n(SEWB) will launch a third division on Aug. 15. It will integrate existing departments and programs, as well as establish new ones in the coming year.\nThe units comprising the new division will share a mission of actively engaging students through a wide array of strategies, from arts, activities, and intercultural dialogue to social events and student organizations. The goal is to promote and sustain a sense of belonging and community for all students across all identities — in particular, those who come from historically marginalized or underserved communities.\nLuoluo Hong, vice president for Student Engagement and Well-Being, spent nearly two years examining the student experience at Georgia Tech and getting a sense of the organizational culture and student priorities. “The need to build community and connection and promote belonging for all students emerged as dominant, urgent areas of work in which we could be more effective,\" she said.\nThrough surveys, focus groups, listening sessions, informal feedback, and other data from students, the importance of establishing and experiencing meaningful connections is well-documented and compelling. This conclusion is supported by the findings of a recent\nU.S. Surgeon General's report , which cited loneliness as a significant public health crisis.\n“Whether students live on or off campus, whether they are undergraduate or graduate students, international or U.S. citizens, or hail from rural or urban communities, and regardless of their backgrounds or identities, they all have a common need — to have their humanity affirmed, to feel like they have a place at Georgia Tech, and to know that they matter to the Yellow Jacket community,” Hong said.\nKnown as Arts, Belonging, and Community,\nthe new division will contribute to three of the focus areas in the Institute's strategic plan ( Connect Globally ,\nCultivate Well-Being , and\nExpand Access ), and\nto one of the four goals ( Community and Connection ) of the Cultivate Well-Being Roadmap for students.\nExisting units from Student Life that will call this new division their administrative home are the Office of the Arts, the LGBTQIA Resource Center, the Veterans’ Resource Center, and the Women's Resource Center.\nIn addition, Student and Campus Events Centers, which includes the newly renovated John Lewis Student Center, will also join the division.\nThese existing departments will be joined by two new programs during the upcoming academic year. Black Culture, Innovation, and Technology will launch in the fall and be located on the first floor of the Smithgall Student Services Building. A national search for the inaugural director will be launched later this month, and an advisory board comprised of students, staff, faculty, and alumni will convene this month to help guide the development and delivery of activities, programs, and services that facilitate access, retention, and graduation.\nThe second department,\nIntercultural Student Programs ,\nis scheduled to begin conducting educational and outreach programs no later than January 2024. This unit will provide advocacy, services, and support to students across the intersections of their identities, as well as build capacities for all students to effectively live, work, and lead in an increasingly diverse and global context. The mission will also be responsive to the findings from the American Association of Colleges and Universities, which indicate that\nemployers want college graduates to be better equipped to lead and work across difference\nand\ndemonstrate intercultural competencies . Current activities, programs, and services in what is now Student Diversity Programs in the Dean of Students Office will comprise the foundation of this new unit.\nPlans are also underway to create a new office of Commuter Student Engagement and office of Student Activities and Events\nas part of the new division. They will provide more programming, resources, and support to students who enroll fully online or live off campus, as well as ensure that advising, coaching, mentoring, and technical assistance are available to student organizations and leaders.\nKim Harrington will serve as the interim associate vice president of this new division until a national search is completed. Harrington currently serves SEWB as executive director and chief of staff. \"Helping to facilitate a strong campus community where our students feel that they belong and know that they matter is, and always been, my career goal,” she said. “I am excited to support, empower, and work with the talented team of professionals in Arts, Belonging, and Community as we launch this new division together.\"\nTo achieve the goals and priorities of the division, collaborations and partnerships will be established across Georgia Tech. “What we do really well at Georgia Tech is celebrate our achievements, which reflects our capacity to be ‘human doings.’ With Arts, Belonging, and Community, we want to also honor and hold up our ‘human beingness’ and center that,” Hong said.\nMore information about the Division of Arts, Belonging, and Community can be found at\nbelonging.gatech.edu .\nAdditional Images\nRelated links\nArts, Belonging, and Community\nStudent Engagement & Well-Being\nContact\nSara Warner\nStudent Engagement & Well-Being\nsara.warner@gatech.edu\nEmail\nsara.warner@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}