{"text": "Stem Cell Treatment May Restore Vision to Patients with Damaged Corneas | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nStem Cell Treatment May Restore Vision to Patients with Damaged Corneas\nA new cell sorting technique may help restore vision for persons with damaged corneas.\nFacebook\nTwitter\nEmail\nJames Lauderdale is an associate professor of cellular biology in UGA's Franklin College of Arts and Sciences (Credit: Nancy Evelyn).\nMar 10, 2017\n— Atlanta, GA\nResearchers working as part of the University of Georgia’s Regenerative Bioscience Center have developed a new way to identify and sort stem cells that may one day allow clinicians to restore vision to people with damaged corneas using the patient’s own eye tissue. They published their findings in\nBiophysical Journal .\nThe cornea is a transparent layer of tissue covering the front of the eye, and its health is maintained by a group of cells called limbal stem cells. But when these cells are damaged by trauma or disease, the cornea loses its ability to self-repair.\n“Damage to the limbus, which is where the clear part of the eye meets the white part of the eye, can cause the cornea to break down very rapidly,” said James Lauderdale, an associate professor of cellular biology in UGA’s Franklin College of Arts and Sciences and paper co-author. “The only way to repair the cornea right now is do a limbal cell transplant from donated tissue.”\nIn their study, researchers used a new type of highly sensitive atomic force microscopy, or AFM, to analyze eye cell cultures. Created by\nTodd Sulchek , an associate professor in the\nGeorge W. Woodruff School of Mechanical Engineering\nat Georgia Tech, the technique allowed researchers to probe and exert force on individual cells to learn more about the cell’s overall health and its ability to turn into different types of mature cells.\nThey found that limbal stem cells were softer and more pliable than other cells, meaning they could use this simple measure as a rapid and cost-effective way to identify cells from a patient’s own tissue that are suitable for transplantation.\n“Todd’s technology is unique in the tiniest and most sensitive detection to change,” said Lauderdale. “Just think about trying to gently dimple or prod the top of an individual cell without killing it; with conventional AFM it’s close to impossible.”\nBuilding on their findings related to cell softness, the research team also developed a microfluidic cell sorting device capable of filtering out specific cells from a tissue sample.\nWith this device, the team can collect the patient’s own tissue, sort and culture the cells and then place them back into the patient all in one day, said Lauderdale. It can take weeks to perform this task using conventional methods.\nThe researchers are quick to caution that more tests must be done before this technique is used in human patients, but it may one day serve as a viable treatment for the more than 1 million Americans that lose their vision to damaged corneas every year.\nThe group first started this research with the hope of helping children with aniridia, an inherited malformation of the eye that leads to breakdown of the cornea at an early age.\nBecause aniridia affects only one in 60,000 children, few organizations are willing to commit the resources necessary to combat the disease, Lauderdale said.\n“Our first goal in working with such a rare disease was to help this small population of children, because we feel a close connection to all of them,” said Lauderdale, who has worked with aniridia patients for many years. “However, at the end of the day this technology could help hundreds of thousands of people, like the military who are also interested in corneal damage, common in desert conditions.”\nSteven Stice, a Georgia Research Alliance Eminent Scholar who plays an important role in fostering cross-interdisciplinary collaboration as director of the RBC, initially brought the researchers together and encouraged a seed grant application through the center for Regenerative Engineering and Medicine, or REM, a joint collaboration between Emory University, Georgia Tech and UGA.\n“A culture is developing around seed funding that is all about interdisciplinary collaboration, sharing of resources, and coming together to make things happen,” said Stice. “Government funding agencies place a high premium on combining skills and disciplines. We can no longer afford to work in an isolated laboratory using a singular approach.”\nThe REM seed funding program is intended to stimulate new, unconventional collaborative research and requires equal partnership of faculty from two of the participating institutions.\n“We tend to get siloed experimentally,” said Lauderdale. “To a biologist like me, all cells are very different and all atomic force microscopes are the same. To an engineer like Todd it’s just the opposite.”\nThe study, “Cellular Stiffness as a Novel Stemness Marker in the Corneal Limbus,” is available at http://www.cell.com/biophysj/fulltext/S0006-3495(16)30771-8.\nFunding was provided by an NIH NIGMS Biotechnology Training Grant on Cell and Tissue Engineering, the Knights Templar Eye Foundation, the Center for Regenerative Engineering and Medicine, the Sharon Stewart Aniridia Research Trust and the NSF CMMI division.\n- Written by Charlene Betourney, University of Georgia\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contacts : John Toon (404-894-6986) (jtoon@gatech.edu) or Ben Brumfield (404-385-1933) (ben.brumfield@comm.gatech.edu).\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}