{"text": "“Bursting” Cells Gain the Brain’s Attention for Life-or-Death Decisions | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\n“Bursting” Cells Gain the Brain’s Attention for Life-or-Death Decisions\nResearchers have for the first time precisely manipulated the bursting activity of cells in the thalamus.\nFacebook\nTwitter\nEmail\nUsing optogenetics and other technology, researchers have for the first time precisely manipulated bursting activity of cells in the thalamus, tying it to the sense of touch. Shown are Georgia Tech graduate student Clarissa Whitmire and Georgia Tech professor Garrett Stanley.(Credit: Rob Felt, Georgia Tech)\nJan 14, 2016\n— Atlanta, GA\nAs you start across the street, out of the corner of your eye, you spot something moving toward you. Instantly, your brain shifts its focus to assess the potential threat, which you quickly determine to be a slow-moving bicycle – not a car – which will pass behind you as you complete your crossing. The brain’s ability to quickly focus on life-or-death, yes-or-no decisions, then immediately shift to detailed analytical processing, is believed to be the work of the thalamus, a small section of the midbrain through which most sensory inputs from the body flow. When cells in the thalamus detect something that requires urgent attention from the rest of the brain, they begin “bursting” – many cells firing off simultaneous signals to get the attention of the cortex. Once the threat passes, the cells quickly switch back to quieter activity. Using optogenetics and other technology, researchers have for the first time precisely manipulated this bursting activity of the thalamus, tying it to the sense of touch. The work, done in animal models, was reported January 14th in the journal\nCell Reports . The research is supported by the National Institutes of Health’s National Institute of Neurological Disorders and Stroke. “If you clap your hands once, that’s loud,” explained\nGarrett Stanley , a professor in the\nWallace H. Coulter Department of Biomedical Engineering\nat Georgia Tech and Emory University. “But if you clap your hands several times in a row, that’s louder. And if you and your friends all clap together and at the same time, that’s even stronger. That is what these cells do, and the idea is that this mechanism produces bursts synchronized across many cells to send out a very strong signal about a stimulus in the outside world.” Neuroscientists have long believed that such coordinated spikes of activity serve to focus the brain’s attention on issues requiring immediate attention. Stanley and graduate student Clarissa Whitmire – working with researchers Cornelius Schwarz and Christian Waiblinger from the University of Tübingen in Germany – used optogenetics techniques to study bursting activity in the thalamus of rats. Their findings could lead to a better understanding of how cells in this walnut-sized portion of the human brain perform a variety of sensory and motor control tasks, switching from one mode to another as needed. “Clarissa was able to get into the mechanism of synchronized thalamic bursting so we can manipulate it and look at it not only from within individual cells, but also across cells, recording from multiple cells simultaneously,” said Stanley, who has been studying the thalamus for more than a decade. “We can now begin to provide a coherent story about how information gets from the outside world to the brain machinery that’s in the cortex.” The researchers studied the connection between the rats’ whiskers and cells in their thalamus. By stimulating the whiskers in many different ways, they were able to induce signals – including bursting – in the thalamus. The researchers used light-sensitive proteins introduced into the thalamic cells – a technology known as optogenetics – to establish optical control of the bursting activity. “We were able to turn the bursting mechanism on or off at will,” explained Stanley, who is the Carol Ann and David D. Flanagan Professor in the Coulter Department. “This is really the first time we have been able to readily control this, turning the knob in one direction to eliminate the bursting activity and then turning it the other way to make the cells produce these bursts in rapid succession.” The control extended not just to turning the bursting on or off, but also allowed the researchers to create a continuum of cell activity. “Clarissa could make them act very ‘bursty’ and very synchronized, or she could turn the knob and move them very smoothly to the opposite end of the spectrum,” Stanley said. “There is a range of activity that people had speculated would be there, but nobody had actually done the experiments to show it existed.” The cellular bursting mechanism likely developed very early in mammalian evolution to help creatures survive threats posed by predators. The brain’s cortex is always busy with higher-level activity, and the thalamic bursting serves to let it know that critical outside activities need its urgent attention. Other sensory inputs such as vision can initiate bursting, but Stanley’s group chose to study sense of touch in this work. In rats, the whiskers are embedded in follicles that have specialized cells whose function is similar to that of human sensory cells. Thus, these whiskers serve many of the same “touch” functions as human fingers. “When you reach out with your hand and touch a surface, you are mechanically deforming the skin, stretching the sensors that are in the skin and sending signals to tell the brain about the surface you are touching,” Stanley noted. “In the rats, we moved the whiskers, recorded the activity, and identified the presence of a burst.” As a next step, Stanley and his research team plan to connect what they’ve learned about bursting activity of the thalamus to behavior in an effort to fully confirm the theory. “The next step is to take this to behavior and work with animals that are trained to detect and discriminate between different kinds of inputs,” he said. With the optogenetics and other advanced technology, researchers are beginning to see the big picture of how sensory inputs affect brain activity. “These thalamic cells are somewhere in between the outside world and the cognitive machinery of the brain, and they have a job that changes rapidly,” Stanley said. “In some cases, they are saying ‘yes’ or ‘no’ about something in the outside world, and in some cases they are discriminating between the final details of objects in the outside world.” This work was supported by US-German Collaborative Research in Computational Neuroscience grant (US: NSF CRCNS IOS-1131948; German: BMBF CRCNS 01GQ1113) and NIH National Institute of Neurological Disorders and Stroke grants R01NS048285 and R01NS085447. The content is solely the responsibility of the authors and does not necessarily represent the official views of the National Institutes of Health. CITATION : Clarissa Whitmire, Christian Waiblinger, Cornelius Schwarz, Garrett Stanley, “Information Coding Through Adaptive Gating of Synchronized Thalamic Bursting, (Cell Reports, 2016). Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contact : John Toon (404-894-6986) ( jtoon@gatech.edu ). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}