{"text": "Control System Helps Several Drones Team Up to Deliver Heavy Packages | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nControl System Helps Several Drones Team Up to Deliver Heavy Packages\nResearchers have developed a control system that will enable teams of drones to carry heavy packages.\nFacebook\nTwitter\nEmail\nResearchers have developed a modular solution for handling larger packages without the need for a complex fleet of drones of varying sizes. By allowing teams of small drones to collaboratively lift objects using an adaptive control algorithm, the strategy could allow a wide range of packages to be delivered using a combination of several standard-sized vehicles. (Credit: John Toon, Georgia Tech)\nMar 22, 2021\n— Atlanta, GA\nMany parcel delivery drones of the future are expected to handle packages weighing five pounds or less, a restriction that would allow small, standardized UAVs to handle a large percentage of the deliveries now done by ground vehicles. But will that relegate heavier packages to slower delivery by conventional trucks and vans?\nA research team at the Georgia Institute of Technology has developed a modular solution for handling larger packages without the need for a complex fleet of drones of varying sizes. By allowing teams of small drones to collaboratively lift objects using an adaptive control algorithm, the strategy could allow a wide range of packages to be delivered using a combination of several standard-sized vehicles.\nBeyond simplifying the drone fleet, the work could provide more robust drone operations and reduce the noise and safety concerns involved in operating large autonomous UAVs in populated areas. In addition to commercial package delivery, the system might also be used by the military to resupply small groups of soldiers in the field.\n“A delivery truck could carry a dozen drones in the back, and depending on how heavy a particular package is, it might use as many as six drones to carry the package,” said\nJonathan Rogers , the Lockheed Martin Associate Professor of Avionics Integration in Georgia Tech’s\nDaniel Guggenheim School of Aerospace Engineering . “That would allow flexibility in the weight of the packages that could be delivered and eliminate the need to build and maintain several different sizes of delivery drones.”\nThe research was supported, in part, by a National Science Foundation graduate student fellowship and by the Hives independent research and development program of the Georgia Tech Research Institute. A paper on the research has been submitted to the\nJournal of Aircraft .\nA centralized computer system developed by graduate student Kevin Webb would monitor each of the drones lifting a package, sharing information about their location and the thrust being provided by their motors. The control system would coordinate the issuance of commands for navigation and delivery of the package.\n“The idea is to make multi-UAV cooperative flight easy from the user perspective,” Rogers said. “We take care of the difficult issues using the onboard intelligence, rather than expecting a human to precisely measure the package weight, center of gravity, and drone relative positions. We want to make this easy enough so that a package delivery driver could operate the system consistently.”\nThe challenges of controlling a group of robots connected together to lift a package is more complex in many ways than controlling a swarm of robots that fly independently.\n“Most swarm work involves vehicles that are not connected, but flying in formations,” Rogers said. “In that case, the individual dynamics of a specific vehicle are not constrained by what the other vehicles are doing. For us, the challenge is that the vehicles are being pulled in different directions by what the other vehicles connected to the package are doing.”\nThe team of drones would autonomously connect to a docking structure attached to a package, using an infrared guidance system that eliminates the need for humans to attach the vehicles. That could come in handy for drones sent to retrieve packages that a customer is returning. By knowing how much thrust they are producing and the altitude they are maintaining, the drone teams could even estimate the weight of the package they’re picking up.\nWebb and Rogers have built a demonstration in which four small quadrotor drones work together to lift a box that’s 2 feet by 2 feet by 2 feet and weighs 12 pounds. The control algorithm isn’t limited to four vehicles and could manage “as many vehicles as you could put around the package,” Rogers said.\nFor the military, the modular cargo system could allow squads of soldiers at remote locations to be resupplied without the cost or risk of operating a large autonomous helicopter. A military UAV package retrieval team could be made up of individual vehicles carried by each soldier.\n“That would distribute a big lifting capability in smaller packages, which equates to small drones that could be used to team up,” Rogers said. “Putting small drones together would allow them to do bigger things than they could do individually.”\nBringing multiple vehicles together creates a more difficult control challenge, but Rogers argues the benefits are worth the complexity. “The idea of having multiple machines working together provides better scalability than building a larger device every time you have a larger task,” he said. “We think this is the right way to fill that gap.”\nUsing multiple drones to carry a heavy package could also allow more redundancy in the delivery system. Should one of the drones fail, the others should be able to pick up the load – an issue managed by the central control system. That part of the control strategy hasn’t yet been tested, but it is part of Rogers’ plan for future development of the system.\nMore research is also needed on the docking system that connects the drones to packages. The structures will have to be made strong and rigid enough to connect to and lift the packages, while being inexpensive enough to be disposable.\n“I think the major technologies are already here, and given an adequate investment, a system could be fielded within five years to deliver packages with multiple drones,” Rogers said. “It’s not a technical challenge as much as it is a regulatory issue and a question of societal acceptance.”\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contacts : John Toon (404-894-6986) (jtoon@gatech.edu) or Anne Wainscott-Sargent (404-435-5784) (asargent7@gatech.edu).\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}