{"text": "Holiday Reading Recommendations | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nHoliday Reading Recommendations\nWhat to read during winter break.\nFacebook\nTwitter\nEmail\nBook jackets for holiday reading recommendations\nDec 17, 2020\n— Atlanta, GA\nWinter break is a great time to find a comfortable chair and cozy up with a good book. So, what should you read?\nWe asked faculty members in the School of Literature, Media, and Communication (LMC) to suggest a favorite holiday-themed book. The recommendations range from classics like\nLittle Women\nto collections of gothic Christmas tales and science fiction Christmas stories.\nA Christmas Carol\nBy Charles Dickens, Calla Editions (1843)\n“My favorite Christmas story is\nA Christmas\nCarol, which Dickens published in 1843 and remains relevant for a Covid-19 Christmas. Since we’ve seen adaptations (with its central character played by Mister Magoo, Scrooge McDuck, Patrick Stewart, and George C. Scott), it’s hard to realize that Dickens wrote it after reading a government report on child labor during a period characterized as the Hungry Forties. Dickens concluded his story by having Scrooge give his clerk a turkey and a raise, a feel-good ending that doesn’t go far enough to solve the problems of Ignorance and Want that Dickens personifies.”\n— Carol Senf, professor and director of Undergraduate Studies, LMC\nLittle Women ( or\nMeg, Jo, Beth, and Amy)\nBy Louisa May Alcott, with illustrations by Frank Merrill, SeaWolf Press (1868-69)\n“Louisa May Alcott’s novel\nLittle Women\nopens at Christmas with the March sisters discussing presents. The novel explores 19th-century domestic ideologies of gender in ways that still resonate with audiences in describing how Marmee educates her four daughters (Meg, Jo, Beth, and Amy March) while their patriarch serves as a chaplain supporting the Union during the Civil War. Self-sacrifice, compassion, generosity, and the importance of respecting love over money are among the lessons the mother imparts to her girls. Greta Gerwig’s 2019 film reorders the narrative to emphasize the pleasures and costs of domesticity for the March women.”\n—Carol Colatrella, professor and associate dean for Graduate Studies, Ivan Allen College of Liberal Arts\nAt Chrighton Abbey and Other Horror Stories\nBy Mary Elizabeth Braddon, Westside Press (2002)\n“It was a tradition in the 19th-century to read stories as a family\n—\ngothic tales and ghost stories were particularly popular and often read at Christmastime. While\nA Christmas Carol\nby Charles Dickens is the most common example, I recommend a lesser-known collection by the Victorian fiction writer Mary Elizabeth Braddon. Her stories were highly popular in the period and often had sensational themes and mysterious plots.\nOf Chrighton Abbey\nis one of her gothic Christmas stories. It brings together a creepy cast of characters in a Christmas setting, and its central theme surrounds a family curse and ghostly warnings of a death before a wedding day. This collection of Braddon’s tales also provides examples of her other gothic and sensational tales, perfect for a read by the fire on a winter day. There is the creepy, but engaging ghost story, ‘The Cold Embrace,’ about a young artist haunted by the ghost of a former lover he betrayed, and a fabulous vampiric story called ‘The Good Lady Ducayne.’”\n— Narin Hassan, associate professor, LMC\nTyll\nBy Daniel Kehlmann, Pantheon Books (translation copyright 2020)\n“If you like historical fiction, and if you are in the mood to learn how human beings may have dealt with calamity, war, and pandemic 400 years ago, then Daniel Kehlmann’s\nTyll\nmight be a good pick. This novel, shortlisted for the Booker Prize in 2020, transports the reader back into one of the most tumultuous and bloody periods of pre-modern European history, the Thirty Years War (1618-1648) and into the life of the notorious trickster figure and vagrant folk hero Tyll Eulenspiegel. Tyll’s fable-like adventures in an apocalyptic world question authority and absolute truths in ways that will feel eerily familiar to contemporary readers. His survival skills resemble that of a superhero, but his weapons are a mélange of naivete and wit. Is anyone surprised that Netflix is in the process of adapting the novel into a TV series?”\n—Richard Utz, chair and professor, LMC\nThe Tailor of Gloucester\nby Beatrix Potter, F. Warne & Co. (2002), and\nA Child’s Christmas in Wales  by Dylan Thomas, Orion (1993) (This edition has the reviewer’s favorite illustrations.)\n“My mum grew up in London, so a lot of our Christmas books were the classic English ones. I still have a kind of nostalgic connection to Beatrix Potter’s\nThe Tailor of Gloucester\n—\neven though half of the words in it were utterly incomprehensible to me (“penn’orth” and “pipkin” and that sort of thing). It’s about a tailor who falls sick while trying to finish a coat for the mayor’s wedding on Christmas day. Traditionally you’d read it in a little miniature edition, which was part of the charm. An honorable mention for Dylan Thomas’s\nA Child’s Christmas in Wales , a kind of prose poem, which introduced to me the invaluable distinction between Useful Presents (terrible) and Useless Presents (great), a distinction my seven-year-old son has embraced enthusiastically.”\n— Aaron Santesso, professor, LMC\nLisa Yaszek, professor, LMC, recommended several science fiction Christmas tales:\n“ The Star ” by Arthur C. Clarke, Harcourt Brace (1950); “ The Wild Wood ” by Mildred Clingerman, Size 5 1/2 B Publishing (1957);\nA Lot Like Christmas: Stories\nby Connie Willis, Del Rey (2017), and\nChristmas on Mars , a 2008 film written and directed by Wayne Coyne, front man of the Flaming Lips.\n“At first it might seem surprising that there is a tradition of science fiction Christmas tales — after all, we often assume that science and religion are antithetical to one another, even in fiction. But who better to give us fresh perspectives on a story that has already been visited and revisited by artists for well over 2,000 years? Indeed, the two classic short stories I’m recommending for this holiday season deliver that fresh perspective in spades, even today. Arthur C. Clarke’s award-winning 1955 short story ‘The Star’ provides a surprising but deeply moving perspective on science, faith, and the celestial object that guided the wise men to Bethlehem. Two years later, Mildred Clingerman would offer a completely different but equally novel take on Christmas with ‘The Wild Wood,’ a 1957 short story that explores the terrifying sexed and gendered energies informing our most cherished holiday traditions. Taken together, these stories — both of which are available online for free in either print or audio form — will ensure that you never think about the winter holidays quite the same way again.\n“Of course, science fiction is a big tent, and for those of you who prefer humor and magic with your holiday stories, science fiction can provide that, too! Connie Willis is famous for both her humorous science fiction in general and her annual Christmas stories in particular. Her recent collection,\nA Lot Like Christmas: Stories,\nbrings those two together in a truly enchanting blend of sweetness and spice — a fantastic antidote to the challenges of 2020. And for a story that brings Clarke’s meditation on science, faith, and outer space up to date for this millennium, I recommend checking out Wayne Coyne’s 2008 independent film\nChristmas on Mars . It’s homemade, it’s surreal, and, in the end, it’s hauntingly beautiful. (Bonus points if you’re a Flaming Lips fan!) Copies of either would make excellent stocking stuffers for the science fiction fan in your life.”\nSome of these books are available by searching the Library’s online catalog:\nhttps://www.library.gatech.edu/\nYou can also search other libraries, using Tech’s interlibrary loan system:\nhttps://www.library.gatech.edu/borrow-other-libraries\nAdditional Images\nContact\nVictor Rogers\nInstitute Communications\nEmail\nvictor.rogers@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}