{"text": "Students Spend Summer Launching Startups | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nStudents Spend Summer Launching Startups\nStartup Summer is part of CREATE-X, a newly launched initiative to enhance and support entrepreneurship programs for undergraduate students.\nFacebook\nTwitter\nEmail\nAug 17, 2015\n— Atlanta, GA\nShiv Patel thought he invented a solution to a problem plaguing roommates. His original idea would help people split expenses on everything from pizza delivery to vacation homes.\nPatel is one of the teams picked for this year’s Startup Summer, a 12-week internship for Georgia Tech students and recent graduates who want to launch startups based on their own inventions and prototypes. The program teaches students to understand potential customers and the market so they can build a product or service that addresses a real and quantified need.\nThat approach showed Patel the faults in his idea. For it to work, he would need the ability to issue instant, virtual pre-paid debit cards. This would require the infrastructure and support of a bank, but most said the concept was too futuristic or too costly to set up.\nHe put aside his original concept and instead created\nMercez , a tool to help people when they’re travelling and shopping abroad. The company’s first product, TrueCost, helps people avoid foreign transaction fees, unfavorable exchange rates and miscellaneous fees by providing daily updates showing which of their credit cards provides the best deal on any given day.\n“I have motivation, but Startup Summer gives me the support and structure and honest advice I need,” said Patel, a computer science major. “Instead of letting me be discouraged when my first idea didn’t work, they helped me ask the questions I needed to find something else.”\nThat entrepreneurial confidence to try and try again is what Georgia Tech wants to instill in students, said Raghupathy Sivakumar, the Wayne J. Holman Chair in the School of Electrical and Computer Engineering and a Startup Summer instructor.\nThe confidence comes from the methodical steps students take in the program. They incorporate companies, perform customer discovery, build product iterations, determine pricing strategies, gain customer traction, take the product to market and deal with founder equity allocations.\nStartup Summer is part of CREATE-X, a newly launched initiative to enhance and support entrepreneurship programs for undergraduate students.\nGeorgia Tech alumnus Christopher W. Klaus provided significant funding for CREATE-X, and eight of the 10 Startup Summer teams accepted an investment from the fund. While 13 teams were accepted this year, three shut down operations after realizing there was not a market for their idea.\nAlumni and industry veterans served as mentors for the teams.\n“The networking has been unbelievable,” said Josh Lieberman, one of the founders of\nTEQ Charging . “So many in the Georgia Tech alumni network are offering their support and advice.”\nTEQ created a power strip to charge electric vehicles. The technology and design increases the efficiency – and lowers the cost – of current charge stations by sequentially charging vehicles, said Isaac Wittenstein, another co-founder. Installing this plug-in system throughout parking lots or decks allows drivers to charge when they need it.\nLieberman and Wittenstein, both mechanical engineering majors, ventured into the electric vehicle market during Startup Lab, a course within the CREATE-X program taught by Sivakumar, that exposes students to startups and teaches them how to develop a business model. They teamed up with the third TEQ co-founder, Dorrier Coleman, who worked on electric vehicles during Capstone Design. He graduated in May.\nTEQ recently earned second place in Atlan10, which ranked the most innovative young startups in Atlanta.\nAnother team,\nReplantable , is selling one of its products at Sevananda Natural Foods Mart in Atlanta’s Little Five Points.\nThe team created a soilless growing system using LED lights, which eliminates the need for direct exposure to sunlight. The system circulates water and has minerals making it possible for people to grow up to five pounds of fruits and vegetables a week, said Alex Weiss, one of the co-founders. The NanoFarm stands about 5-feet tall and takes up about as much space as a dining room chair.\nWeiss and Ruwan Subasinghe graduated from Tech in May and have been friends since freshman orientation in 2011.\nAt Sevananda they’re selling seedling pods that can be screwed onto one-gallon water jugs so people can start growing their own food. The NanoFarm should be available for purchase later this fall.\nUntil then, Replantable and the other nine teams will show off their startups at Demo Day, taking place at 5 p.m. Tuesday at the Historic Academy of Medicine.\nAdditional Images\nRelated links\nCREATE-X\nStartup Summer at Georgia Tech\nContact\nLaura Diamond\nGeorgia Tech Media Relations\n404-894-6016\nEmail\nlaura.diamond@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}