{"text": "Turbocharging Fuel Cells with a Multifunctional Catalyst | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nTurbocharging Fuel Cells with a Multifunctional Catalyst\nZero-emission cars and recyclable fuel are dreams powered by fuel cells, and this new catalyst brings the dream a little closer.\nFacebook\nTwitter\nEmail\nNissan is one automotive company investing in the development of fuel cell powered vehicles. Pictured here is a prototype that Nissan says is \"the world’s first Solid Oxide Fuel-Cell (SOFC)-powered prototype vehicle that runs on bio-ethanol electric power.\" Credit: Nissan Motor Corporation / press handout for editorial use only\nMar 14, 2018\n— Atlanta, GA\nPowering clean, efficient cars is just one way fuel cell technology could accelerate humanity into a sustainable energy future, but unfortunately, the technology has been a bit sluggish. Now,\nengineers may be able to essentially turbocharge fuel cells\nwith a new catalyst.\nThe sluggishness comes from a chemical bottleneck, the rate of processing oxygen, a key ingredient that helps fuel cells, which are related to batteries, produce electricity. The new catalyst, a nanotechnology material developed by engineers at the Georgia Institute of Technology, markedly speeds up oxygen processing and is\nthe subject of a new study .\nPartly to accommodate oxygen’s limitations, fuel cells usually require pure hydrogen fuel, which reacts with the oxygen taken in from the air, but the costs of producing the hydrogen have been prohibitive. The new catalyst is a potential game-changer.\n“It can easily convert chemical fuel into electricity with high efficiency,” said Meilin Liu, who led the study and is a\nRegents’ Professor in Georgia Tech’s School of Material Science and Engineering.   “It can let you use readily available fuels like methane or natural gas or just use hydrogen fuel much more efficiently,” Liu said.\nCatalyst 8 times as fast\nThe catalyst achieves the efficiency by rushing oxygen through a fuel cell’s system. “It’s more than eight times as fast as state-of-the-art materials doing the same thing now,” said Yu Chen, a postdoctoral research associate in Liu’s lab and the study’s first author.\nThere are a few types of fuel cells, but the researchers worked to improve solid oxide fuel cells, which are found in some prototypical fuel cell cars. The research insights could also aid in honing\nsupercapacitors\nand technology paired with solar panels, thus advancing sustainable energy beyond the new catalyst’s immediate potential to improve upon fuel cells.\nLiu and Chen published their study  in the March issue of the journal\nJoule . Their research was funded by the U.S. Department of Energy and by the Guangdong Innovative and Entrepreneurial Research Program. The fuel cell work from Liu’s lab has already attracted significant energy industry and automotive industry interest.\nNaturally sluggish oxygen\nThough they work differently from fuel cells and are much less efficient and clean, combustion engines make a useful metaphor to aid in understanding how fuel cells and the new catalyst work.\nIn a combustion engine, fuel from a tank and oxygen from the air come together to react in an explosion, producing energy that turns a crankshaft. Adding a turbocharger speeds the process up by mixing fuel and oxygen together more quickly and rushing them to combustion.\nCurrently, in\nfuel cells, hydrogen fuel from a tank and oxygen\nfrom the air also drive a process that produces energy, in this case, electricity. The two ingredients do come together in a reaction, but one very different from combustion, and much cleaner.\nOne end of the fuel cell, the anode, removes electrons from the hydrogen atoms in what’s called\noxidation\nand sends the electrons through an external circuit as electric current to the cathode on the other side. There, oxygen, which is notoriously electron hungry, sucks the electrons up in what’s called\nreduction , and that keeps the electricity flowing.\nThe hydrogen, now positively charged, and the oxygen, now negatively charged, meet up to form water, which is the fuel cell’s exhaust.\nIn that reaction chain, oxygen is the slow link in two ways: Oxygen’s reduction takes longer than hydrogen’s oxidation, and the reduced oxygen moves more slowly through the system to meet with hydrogen. Analogous to the turbocharger, the new catalyst pushes the oxygen forward.\nOxygen rush nanotech\nThe catalyst is applied as a sheer coating only about two dozen nanometers thick and is comprised of two connected nanotechnology solutions that break both oxygen bottlenecks.\nFirst, nanoparticles highly attractive to oxygen grab the O 2\nmolecule and let inflowing electrons quickly jump onto it, easily reducing it and tearing it into two separate oxygen ions (each one an O 2- ). Then a series of chemical gaps called\noxygen vacancies\nthat are built into the nanoparticles’ structures suck up the oxygen ions like chains of vacuum cleaners passing the ions hand to hand to the second phase of the catalyst.\nThe second phase is a coating that is full of oxygen vacancies that can pass the O 2-\neven more rapidly toward its final destination.\n“The oxygen goes down quickly through the channels and enters the fuel cell, where it meets with the ionized hydrogen or another electron donor like methane or natural gas.”\nThe ions meet to make water, which exits the fuel cell. In the case of methane fuel, pure CO 2\nis also emitted, which can be\ncaptured and recycled back into fuel .\nInteresting rare metals\nIn the first stage, there are two different flavors of nanoparticle at work. Both have cobalt, but one contains barium and the other praseodymium, a rare-earth metal that can be pricey in high quantities.\n“ Praseodymium\nis in such very small amounts that it doesn’t impact costs,” Liu said. “And the catalyst saves lots of money on fuel and on other things.”\nHigh operating temperatures in existing fuel cells require expensive protective casings and cooling materials. The researchers believe the catalyst could help lower the temperatures by reducing electrical resistance inherent in current fuel cell chemistry. That could, in turn, reduce overall material costs.\nProtective cathode coating\nThe second stage of the catalyst is a lattice that contains praseodymium and barium, as well as calcium and cobalt (PBCC). In addition to its catalytic function, the PBCC coating protects the cathode from degradation that can limit the lifetime of fuel cells and similar devices.\nThe underlying original cathode material, which contains the metals lanthanum,\nstrontium , cobalt, and iron ( LSCF ), has become an industry standard but comes with a caveat.\n“It’s very conductive, very good, but the problem is that strontium undergoes a diminishment called\nsegregation\nin the material,” Liu said. “One component of our catalyst, PBCC, acts as a coating and keeps the LSCF a lot more stable.”\nLSCF manufacturing is already well-established, and adding the catalyst coating to production could be likely reasonably achieved. Liu also is considering replacing the LSCF cathode completely with the new catalyst material, and his lab is developing a yet another catalyst to boost fuel oxidation reactions at the fuel cell’s anode.\nLike this article?  Get our email newsletter here.\nAlso\nREAD:\nNanogenerators boost mass spectrometry.\nCoauthors of the study were: Seonyoung Yoo, Yong Ding, Ruiqiang Yan, Kai Pei, Chong Qu, Lei Zhang, Ikwhang Cha, Bote Zhao, Ben deGlee, and Ryan Murphy of Georgia Tech; YongMan Choi from the SABIC Technology Center in Saudi Arabia; Yanxiang Zhang from the Harbin Institute of Technology in China; Huijun Chen, Yan Chen, Chenghao Yang and Jiang Liu from the South China University of Technology. The research was funded by the U.S. Department of Energy SECA Core Technology Program (grants FC FE0026106 and DE-FE0031201) and the Guangdong Innovative and Entrepreneurial Research Team Program (grant 2014ZT05N200). Any opinions or findings are those of the authors and not necessarily of the funding agencies.\nAdditional Images\nContact\nWriter & Media Representative : Ben Brumfield (404-660-1408)\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nEmail\nben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}