{"text": "When Coral Species Vanish, Their Absence Can Imperil Surviving Corals | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nWhen Coral Species Vanish, Their Absence Can Imperil Surviving Corals\nOff of Fiji, a Georgia Tech study elucidates a potential silent coral reef killer: Disappearing biodiversity appears to threaten the lives surviving corals.\nFacebook\nTwitter\nEmail\nTables with coral gardens painstakingly planted by Georgia Tech researcher Cody Clements. At bottom, the close up table shows Pocillopora corals developing a pattern of death where one individual started dying and then others fell like dominos. This table was a \"monoculture.\" It contained only one species and not a group of species. Tables with groups of species did better than monoculture tables in the same reef area off of Fiji in the Pacific. Credit: Georgia Tech / Cory Clements\nJan 30, 2019\n— Atlanta, GA\nWaves of annihilation have beaten coral reefs down to a fraction of what they were 40 years ago, and what’s left may be facing creeping death: The effective extinction of many coral species may be weakening reef systems thus siphoning life out of the corals that remain.\nIn the shallows off  Fiji ’s Pacific shores, two marine researchers from the Georgia Institute of Technology for  a new study  assembled groups of corals that were all of the same species, i.e. groups without species diversity. When Cody Clements snorkeled down for the first time to check on them, his eyes instantly told him what his data would later reveal.\n“One of the species had entire plots that got wiped out, and they were overgrown with algae,” Clements said. “Rows of corals had tissue that was brown – that was dead tissue. Other tissue had turned white and was in the process of dying.”\n36 ghastly plots\nClements, a postdoctoral researcher and the study’s first author, also assembled groups of corals with a mixture of species, i.e. biodiverse groups, for comparison. In total, there were 36 single-species plots, or monocultures. Twelve additional plots contained polycultures that mixed three species. (More details below.)\nBy the end of the 16-month experiment, monocultures had faired obviously worse. And the study had shown via the measurably healthier growth in polycultures that science can begin to quantify biodiversity’s contribution to coral survival as well as the effects of biodiversity’s disappearance.\n“This was a starter experiment to see if we would get an initial result, and we did,” said principal investigator Mark Hay, a  Regents Professor and Harry and Linda Teasley Chair in Georgia Tech’s School of Biological Sciences . “So much reef death over the years has reduced coral species variety and made reefs more homogenous, but science still doesn't understand enough about how coral biodiversity helps reefs survive. We want to know more.”\nThe results of the study appear  in the February issue of the journal  Nature ecology & evolution  and were made available online in January. The research was funded by the National Science Foundation, by the National Institutes of Health’s Fogarty International Center, and by the Teasley Endowment.\nThe study’s insights could aid ecologists restocking crumbling reefs with corals -- which are animals. Past replenishing efforts have often deployed patches of single species that have had trouble taking hold, and the researchers believe the study should encourage replanting using biodiverse patches.\n[Ready for graduate school?  Here's how to apply to Georgia Tech. ]\n40 years’ decimation\nThe decimation of corals Hay has witnessed in over four decades of undersea research underscores this study’s importance.\n“It’s shocking how quickly the Caribbean reefs crashed. In the 1970s and early 1980s, reefs consisted of about 60 percent live coral cover,” Hay said. “Coral cover declined dramatically through the 1990s and has remained low. It’s now at about 10 percent throughout the Caribbean.”\n“You used to find living diverse reefs with structurally complex coral stands the size of city blocks. Now, most Caribbean reefs look more like parking lots with a few sparse corals scattered around.”\n84 percent loss\nThe fact that the decimation in the Pacific is less grim is bitter irony. About half of living coral cover disappeared there between the early 1980s and early 2000s with declines accelerating since.\n“From 1992 to 2010, the  Great Barrier Reef , which is arguably the best-managed reef system on Earth, lost 84 percent,” Clements said. “All of this doesn’t include the  latest bleaching events  reported so widely in the media, and they killed huge swaths of reef in the Pacific.”\nThe  2016 bleaching  event also sacked reefs off of Fiji where the researchers ran their experiment. The coral deaths have been associated with extended periods of  ocean heating , which have become much more common in recent decades.\n10 times more species\nStill, there’s hope. Pacific reefs support ten times as many coral species as Caribbean reefs, and Clements’ and Hay’s new study suggests that this higher biodiversity may help make these reefs more robust than the Caribbean reefs. There, many species have joined the endangered list, or are “functionally extinct,” still present but in traces too small to have an ecological impact.\nThe Caribbean’s coral collapse may have been a warning shot on the dangers of species loss. Some coral species protect others from getting eaten or infected, for example.\n“A handful of species may be critical for the survival of many others, and we don’t yet know well enough which are most critical. If key species disappear, the consequences could be enormous,” said Hay, who believes he may have already witnessed this in the Caribbean. “The decline of key species may drive the decline of others and potentially create a death spiral.”\n864 abrasive animals\nOff Fiji’s shores, Clements transported by kayak, one by one, 48 concrete tables he had built on land. He dove them into place and mounted on top of them 864 jaggy corals in planters he had fashioned from the tops of plastic soda bottles.\n“I scratched a lot of skin off of my fingers screwing those corals onto the tables,” he said, laughing at the memory. “I drank enough saltwater through my snorkel doing it, too.”\nClements laid out 18 corals on each tabletop: Three groups of monocultures filled 36 tables (12 with species A, 12 with species B, 12 with species C). The remaining 12 tabletops held polycultures with balanced A-B-C mixtures. He collected data four months into the experiment and at 16 months.\nThe polycultures all looked great. Only one monoculture species,  Acropora   millepora , had nice growth at the 16-month mark, but that species is more susceptible to disease, bleaching, predators, and storms. It may have sprinted ahead in growth in the experiment, but long-term it would probably need the help of other species to cope with its own fragility.\n“Corals and humans both may do well on their own in good times,” Hay said. “But when disaster strikes, friends may become essential.”\nAlso read:\nSwapping cooties may help \"Nemo\" fish cohabitate with fish-killing anemones\nThe research was funded by the National Science Foundation (grant OCE 0929119), and the National Institutes of Health’s Fogarty International Center (grant 2 U19 TW007401-10), and the Teasley Endowment. Any findings, conclusions, and recommendations are those of the authors and not necessarily of the funding entities.\nMedia relations assistance : Ben Brumfield\n(404) 660-1408\nben.brumfield@comm.gatech.edu\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nWriter:  Ben Brumfield\nAdditional Images\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}