{"text": "Georgia Tech Professor and Team Create Tool to Reduce Burn Risk During Surgeries | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Professor and Team Create Tool to Reduce Burn Risk During Surgeries\nJackson Medical's GloShield device finds success in American hospitals\nFacebook\nTwitter\nEmail\nGloShield devices have flexible necks connected to caps that fit over the end of light cables surgical teams use. (Photo: Péralte C. Paul)\nDec 17, 2022\n— Atlanta, GA\nAny surgical procedure comes with a degree of risk for patients. But there’s also stress for the surgical team who must adhere to strict protocols and procedures to ensure positive safe patient surgical outcomes.\nAmong the worries: accidentally burning a patient or operating room staff or setting fire to the surgical table draping. Although rare, burns can happen from the heat generated by fiber optic light cables that illuminate endoscopes and camera cables surgeons use during operations to see what’s happening internally.\nJames Rains, a professor in Georgia Tech’s  Wallace H. Coulter Department of Biomedical Engineering , has developed a device to minimize that risk.\nRains is co-founder and CEO of  Jackson Medical , an Atlanta-based medical device company that launched in 2016. Its flagship product, GloShield, is a flexible, ceramic fitted heat shield that covers the end of the light cable, which can get as hot as 500 degrees Fahrenheit.\n“Whenever you want to look inside the body, you need to illuminate it. You need to provide a light source inside the body via a scope,” Rains said. The risk is present in the surgical field when equipment is assembled and disassembled, leading to a detached and exposed light cable.\nCurrent protocols call for someone on the surgical team to hold the cable or keep it from the patient’s skin or material can catch fire.  But those protocols aren’t always strictly followed as Rains and his team found when observing bladder and abdominal surgeries in metro Atlanta.\nThe Jackson Medical team’s observations and understanding of those risks was further underscored through interviews with more than 1,000 clinicians and practitioners across the country.\nThe GloShield device is designed with a flexible neck connected to a cap that fits snugly over the end of the light cable. The polymer used to create the devices remains cool to the touch. The cap flips up to allow the cable to reconnect to the scope when necessary.\n“Surgeries are complex, and there are so many decisions that need to be made and so many tasks that need to be addressed by the surgical team,” said  Kamil Makhnejia , another co-founder and who serves as the company’s chief operating officer. “There’s charting and taking care of the patient to ensure there’s proper equipment and specimen handoffs among team members during the entirety of the surgical procedure.”\nIt takes less than six seconds for the heat generated by a light cable to melt through a surgical drape or burn a patient, Makhnejia said, explaining that the device has been used in more than 100,000 surgeries to date.\n“It’s not a matter of if something is going to happen, but when,” Rains said, adding that even though the risks remain low, medical professionals want solutions that reduce as many of those risks as possible and establish peace of mind. “During a surgical procedure, while you’re trying to juggle so many different things — we want to provide a layer of safety so that clinicians can keep their focus on patient outcome.”\nThat is the right approach said Dr. Howard Herman, an Atlanta surgeon in otorhinolaryngology, a surgical subspeciality of the head and neck, who has used GloShield in his operations.\n“There are a lot of risks in surgery, and you try to minimize those risks,” said Herman, who has been a practicing surgeon for 29 years. “The beauty of this solution is that it mitigates the risk. To me, it should become part of the standard of care.”\nThe Jackson Medical team developed and refined the GloShield prototype at the  Global Center for Medical Innovation , a Georgia Tech affiliate, which helps startups in the medical device space through all stages of their lifecycle, ranging from prototype to commercialization.\nJackson Medical is also a portfolio company of the  Center for MedTech Excellence . A program of Georgia Tech’s  Enterprise Innovation Institute,  the center supports and addresses the unique needs of early-stage medical device technologies.\n“We often use the words disruption and innovation quite liberally, yet companies are far from both,” said Nakia Melecio, the Center for MedTech Excellence’s director. “When I think of the team at Jackson Medical, their technology is not only disruptive, but also a novel solution for most, if not all, surgeons to protect patients from burn injuries with a commonly used surgical tool.”\nAdditional Images\nContact\nPéralte C. Paul\nperalte.paul@comm.gathe.edu\n404.316.1210\nEmail\nperalte.paul@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}