{"text": "New Study Shows Hybrid Learning Led to Significant Reduction in Covid-19 Spread | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNew Study Shows Hybrid Learning Led to Significant Reduction in Covid-19 Spread\nAs communities continue a shift toward normalcy in the wake of the Covid-19 pandemic, Georgia Tech researchers have helped quantify the effectiveness of school closures on community spread reduction.\nFacebook\nTwitter\nEmail\nApr 27, 2022\n— Atlanta, GA\nAs communities continue a shift toward normalcy in the wake of the Covid-19 pandemic, researchers in Georgia Tech’s H. Milton Stewart School of Industrial and Systems Engineering have helped quantify the effectiveness of one of the most commonly-debated mitigation measures taken across the country.\nA new study published in  BMC Public Health  shows that hybrid learning utilizing alternating school days for children offers a significant reduction in community disease spread. Total closure in favor of remote learning, however, offers little additional advantage over that hybrid option.\nThis research will help decision-makers in the event of another Covid-19 outbreak or one from a similar infectious disease.\n“Early in the pandemic when school closures were becoming the norm, many debated the pros and cons of this measure,” said  Pinar Keskinocak , the William W. George Chair and Professor in ISyE and the principal investigator on the study. “Do we get enough benefit to offset the social costs and impacts on education? This research shows that there is a benefit in infection reduction, especially in the absence of effective pharmaceutical interventions, and most of the benefits can be attained with a hybrid approach.”\nThis study is particularly relevant for the early days of an infectious disease outbreak when policymakers face the difficult decision of enacting school closures in their respective districts. Using an agent-based simulation model of Covid-19 spread, researchers projected the impact of various school reopening strategies: complete closure, alternating school days where one cohort attended in person twice a week and another cohort on the opposite days, younger children only, and regular (i.e. all students return to in-person learning).\nResults showed that compared to schools reopening with regular attendance, the percentage of the population infected reduced by 13, 11, 9, and 6 percent with each respective strategy. The conclusions were that some level of closure – younger children only, alternating days, and completely remote – offers significant reduction in community-wide infections. The benefit of complete closure over a hybrid approach, however, was minimal.\nThe assumption in all cases was that individuals who contracted the virus would remain at home.\n“The additional benefit of complete school closure compared to hybrid was relatively small,” Keskinocak said. “The implementation of an alternating day model can be challenging but could have public health benefits early in the pandemic or during a new wave, providing social and learning benefits as well.”\nOther challenges remain that were not investigated in this particular research – costs on families in the event of school closures, learning tradeoffs, properly equipping students for virtual learning, and others. This is just one element of many for policymakers to consider, Keskinocak said.\nCITATION: Arden Baxter, Buse Eylul Oruc, John Asplund, Pinar Keskinocak, Nicoleta Serban.  Evaluating Scenarios for School Reopening under Covid-19 .  BMC Public Health . March 14, 2022.  https://doi.org/10.1186/s12889-022-12910-w\nAdditional Images\nContact\nDavid Mitchell\nCommunications Manager\ndavid.mitchell@isye.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}