{"text": "Georgia Tech Celebrates Opening of New Energy Project in Midtown Atlanta | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Celebrates Opening of New Energy Project in Midtown Atlanta\nGeorgia Tech partnered with Georgia Power to host the dedication of the Microgrid in Tech Square.\nFacebook\nTwitter\nEmail\nGeorgia Tech and Georgia Power partner to celebrate Microgrid ribbon cutting.\nJun 17, 2021\n— Atlanta, GA\nGeorgia Tech and Georgia Power celebrated the opening of a 1.4-megawatt microgrid in Tech Square with a ribbon-cutting on Wednesday, June 16. The microgrid is located at Spring and Fifth Streets in Atlanta. This project, made possible through a longstanding partnership between Georgia Power and Georgia Tech, will help power the larger local grid in Midtown, while minimizing environmental impact.\nMicrogrids are self-contained power systems, co-located with the facilities they serve, that include generation resources, storage systems, and energy management systems. The Tech Square Microgrid, which was approved by the Georgia Public Service Commission, is being used to evaluate how a microgrid can effectively integrate into and operate as part of the overall electrical grid. The facility will not only provide clean power to Midtown, but it will also serve as a living laboratory in which Georgia Tech, industry, and government researchers will work collaboratively to create the next generation of clean energy solutions.\n“Georgia Tech is committed to addressing the most consequential challenges of our time,” said Georgia Tech President Ángel Cabrera. “That involves advancing science and technology, developing leaders who can create and deploy new solutions, and leading by example with our own practices. This microgrid is a great illustration of the latter. In our partnership with Georgia Power and the Georgia Public Service Commission, we will be developing and adopting some of the most advanced, efficient, and responsible energy solutions available, in the hope we can serve as an example for others.”\nThe microgrid will provide Georgia Power with insight into how smart energy management systems, such as the one installed at the Coda data center, can interact with the grid to achieve optimal energy use. In addition, it will provide teaching and learning opportunities for Georgia Tech professors and students.\n“The Tech Square Microgrid is a proven innovative project that will help us better understand microgrids to help service our customers. It brings energy storage and data front and center for research. The microgrid’s distributed energy resources are vital to enhancing grid resiliency and bringing sustainable energy solutions to Georgia’s communities,” said Chris Womack, chairman, president, and CEO of Georgia Power. “Georgia Tech is one of the nation’s leading research institutions and has been an integral partner in allowing their students and teachers to learn how these systems will interact not only with our grid but also with the Coda building on the Georgia Tech campus. It’s by collectively working together through projects like this that we will build a brighter energy future for our state.”\nThe installation includes fuel cells, battery storage, diesel generators, and a natural gas generator, and it is adaptive to new and additional distributed energy resources. It is designed to also accommodate microturbines, solar panels, and electric vehicle chargers in the future. All components will be placed on a platform and obscured from view with 7-foot-high fencing and gate access along Williams Street. The co-branded (Georgia Tech and Georgia Power) fencing will have a mural designed and commissioned by Atlanta-based artist George F. Baker III, to be finished later this year.\nLearn more about Georgia Tech's Strategic Energy Institute at  research.gatech.edu/energy .\nAdditional Images\nContact\nAyana Isles\naisles3@gatech.edu\nInstitute Communications\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}