{"text": "Carbon-Neutral Energy Solutions Lab Unlocks the Potential of Clean Energy | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nCarbon-Neutral Energy Solutions Lab Unlocks the Potential of Clean Energy\nThe Carbon-Neutral Energy Solutions (CNES) Laboratory brings together a diverse mix of experts to solve some of the big technological problems in clean energy and partner with industry to bring these solutions to the market.\nFacebook\nTwitter\nEmail\nThe Carbon-Neutral Energy Solutions (CNES) Laboratory ribbon cutting and dedication ceremony was held on Oct. 17. The mission of CNES is to bring together a diverse mix of experts to solve some of the big technological problems in clean energy and partner with industry to bring these solutions to the market. Credit: Maxwell Guberman.\nOct 18, 2013\n— Atlanta, GA\nIn the past two years, the price of solar panels has dropped about 80 percent. Yet electricity from solar panels is still too expensive to compete with power from fossil fuels because the cost of all the other components and activities involved in installation— hardware, labor, permitting and inspection — hasn’t seen a comparable decline. This problem is among those being addressed at the recently-opened Carbon-Neutral Energy Solutions (CNES) Laboratory at the Georgia Institute of Technology. All these items involved in solar installations are collectively known as the “balance of systems” in industry terminology. In 2011, Georgia Tech and Georgia Tech Research Institute (GTRI) were awarded a Department of Energy grant to achieve extreme cost reduction in balance of systems. A handful of industry partners are collaborating with students and faculty. The goal is to slash the cost of solar to $1 per watt on a utility scale, which would make the price of solar power-generated electricity competitive with the cost of electricity from coal or fossil fuels. Step onto the roof of CNES and you’ll see that the building is a demonstration project of solar power. The roof is covered with a crystalline photovoltaic array that will generate 388,000 kilowatt-hours per year of electricity, helping offset the building’s energy needs. “The idea for CNES was to have a building bringing together people working on low carbon energy. Added on top of that was to make the building itself a demonstrator for low carbon,” said Tim Lieuwen, director of Georgia Tech’s Strategic Energy Institute. The building was funded by a grant from the National Institutes of Standards and Technology (NIST). The CNES ribbon cutting and dedication ceremony was held on Oct. 17. The lab is the latest addition to the North Avenue Research Area (NARA) complex, on the southwestern edge of campus. The mission of CNES is to bring together a diverse mix of experts to solve some of the big technological problems in clean energy and partner with industry to bring these solutions to the market. So far, solar research at CNES, with numerous projects, patents and industry partnerships, is a shining example of things to come. “Solar is one of the areas where Georgia Tech has really differentiated itself nationally,” Lieuwen said. \"Whether it’s converting solar energy directly into electricity, into heat, or into fuels, Georgia Tech is actively working in all of these facets of solar energy.” But solar research is just one area of expertise at CNES. The building also houses research on hydrocarbons, alternative fuels, including fuels derived from algae or using solar energy to split water, carbon capture and clean combustion, among other programs, which require large scale (high-bay) and intermediate scale (mid-bay) capabilities. “CNES is a hub for the applied energy research on campus,” said Kevin Caravati, a senior research scientist at (GTRI), which is leading the balance of systems work with researchers from the College of Architecture and the College of Engineering. The building itself is somewhat of a living lab with an innovative “no frills” design and net-zero carbon emissions. The 42,000-square-foot facility is intended to set a new standard for sustainable design for buildings of its type by optimizing passive energy technologies, reducing electricity loads and maximizing the use of renewable energy. The building’s office space has large windows to reduce the need for internal lighting. Crystalline photovoltaic panels are on the roof (140 kW), exterior building walls (49 kW) and atop the parking canopy (107 kW). Inside the high bay are two huge fans that circulate air in the building. The pavement in the parking lot is permeable to rainwater, and a bio-retention basin and cistern onsite help conserve water.  Inside the labs at CNES, the mission is to bring clean energy technologies to a 90-percent commercialization level. Then industries can license the technologies and bring them to the market. “We can take ideas at the design stage and push them all the way through the prototyping and testing stages.” Caravati said. “I think that’s a great win for all of us.” For example, the balance of systems project, led by GTRI Principal Investigator Joseph Goodman, started with more than 100 concept designs that researchers have narrowed to a “Final Four” that are moving to the patent application stage. Industry partners involved include The Rocky Mountain Institute, Intertek, Florida International University, Silicon Energy, and Georgia companies Radiance Solar, Suniva, and Jamestown Properties, developers of the Ponce City Market mixed-use development along the Atlanta Beltline. Research at CNES is not just focused on the energy sources of the future, but also on cleaning up pollution from the fossil fuels of the past and present. In the laboratory of Chris Jones, New-Vision Professor of Chemical and Biomolecular Engineering and the new Associate Vice President for Research at Georgia Tech, researchers are developing materials and technologies to efficiently and cheaply separate carbon dioxide from power plants’ emissions, or from ambient air, and lock away the greenhouse gas underground. “One of my favorite aspects of this building is that my students and post-doctoral researchers, who are working in our laboratory, are able to work alongside mechanical engineers, aerospace engineers and other people, cross-pollinating ideas and developing more effective collaborations,” Jones said. The building’s open floor plan encourages collaboration between faculty and students from a mix of disciplines including the College of Sciences, the College of Architecture, the George W. Woodruff School of Mechanical Engineering, the School of Aerospace Engineering and the School of Civil and Environmental Engineering. Industry experts regularly advise on projects. “We have a good mix of diverse thinking combined with industry expertise and faculty members from GTRI and Georgia Tech,” Caravati said. Jones agreed, saying, “This building has been a great advance for Georgia Tech in that it allows researchers in different programs on campus to be housed together working on strategic energy related issues.” The Carbon-Neutral Energy Solutions Lab was supported by the National Institutes of Standards and Technology (NIST). Any conclusions or opinions are those of the authors and do not necessarily represent the official views of the sponsoring agencies. Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contacts : Brett Israel (404-385-1933) ( brett.israel@comm.gatech.edu ) or John Toon (404-894-6986) ( jtoon@gatech.edu ) Writer : Brett Israel\nAdditional Images\nContact\nBrett Israel 404-385-1933 brett.israel@comm.gatech.edu\nEmail\nbrett.israel@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}