{"text": "Tech Square Innovation Week Coming to Midtown Atlanta in May | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nTech Square Innovation Week Coming to Midtown Atlanta in May\nWeeklong events from May 7-10 to shine spotlight on innovation ecosystem and feature open houses, tech summits, block party and 32nd annual ATDC Startup Showcase.\nFacebook\nTwitter\nEmail\nTechnology Square (Photo Credit: Raftermen Photography)\nApr 24, 2018\n— Atlanta, GA\nTechnology Square is abuzz with the activity of startups, corporate innovation, and disruptive research, as well as outstanding student talent from the Georgia Institute of Technology.\nFor one week in spring 2018 — May 7-10 — the Tech Square neighborhood and the components that make it one of the nation’s most successful ecosystems of ideation and disruption will be on display as part of Tech Square Innovation Week.\nThe Georgia Institute of Technology’s Advanced Technology Development Center (ATDC) and its Enterprise Innovation Institute are the hosts of Tech Square Innovation Week.\n“With this week, we and our partners really wanted to show all the various components that make Tech Square the vibrant innovation ecosystem that it is,” said Jen Bonnett, ATDC general manager.\n“Tech Square is a national model of economic development, ideation, and technology disruption. With Tech Square Innovation Week, this is the opportunity for visitors and event attendees to see how and why we’re succeeding and possibly join to continue that momentum.”\nThe week’s events include a “portfolio night” at Engage, the private startup accelerator and venture fund owned and operated by its 10 founding companies, the Georgia Tech Innovation Showcase of up-and-coming research ideas Georgia Tech students and faculty have developed, and the Atlanta Startup Battle at Tech Square Labs, with $100,000 at stake.\nTech Square Innovation Week also includes the Technology Association of Georgia’s FinTech South 2018, a two-day summit focused on the latest trends in the financial technology sector, and the ATDC RetailTech Summit, which will explore technological disruptions and opportunities in that sector.\nTech Square Innovation Week will culminate with the 2018 ATDC Startup Showcase on May 10 at the Georgia Tech Academy of Medicine and the Renaissance Atlanta Midtown Hotel.\nNow in its 32 nd  year, the ATDC Startup Showcase is Georgia’s largest spring startup confab. The event, which draws nearly 1,000 attendees,features more than 80of disruptive technology companies from the state of Georgia.\nAbout Tech Square Innovation Week:\nTech Square Innovation Week — May 7 through May 10, 2018 — is a weeklong celebration that highlights and celebrates different components that combined, make Technology Square in Atlanta’s Midtown neighborhood, a national economic development model that entrepreneurship, disruption, research, corporate partnerships and investment. For more information, please visit  techsquareinnovates.com .\nAbout the Advanced Technology Development Center:\nThe Advanced Technology Development Center (ATDC), a program of the Georgia Institute of Technology, is the state of Georgia’s technology startup incubator. Founded in 1980 by the Georgia General Assembly which funds it each year, ATDC’s mission is to work with entrepreneurs in Georgia to help them learn, launch, scale, and succeed in the creation of viable, disruptive technology companies. Since its founding, ATDC has grown to become one of the longest running and most successful university-affiliated incubators in the United States, with its graduate startup companies raising $3 billion in investment financing and generating more than $12 billion in revenue in the state of Georgia. To learn more, visit  atdc.org .\nAdditional Images\nRelated links\nTech Square Innovation Week\n2018 ATDC Startup Showcase\nContact\nPéralte C. Paul\n404.894.8727\nperalte.paul@gatech.comm.edu\nEmail\nperalte.paul@comm.gatech.edu\nAdditional information\nHere's the rundown of Tech Square Innovation Week events:\nMAY 5:   Day One Innovation Summit  (All Day) at The Garage at Tech Square - The Day One Challenge is open to students in accredited Georgia high schools and this year’s contest will focus on artificial intelligence.\nMAY 6:  Creative Hack  (4 p.m.- 5 p.m.) at The Garage at Tech Square - High school students from Frederick Douglass High School and Forrest Hill Academy will pitch their ideas integrating technology for financial management to help their peers in Southwest Atlanta. Students apply the design innovation model to present their creative ideas.\nMAY 7:   Tech Square Innovation Week Kick-Off Party  (5 p.m.) - in the ATDC Lobby.\nMAY 7 & 8:  FinTech South 2018  (All Day) at Mercedes-Benz Stadium - FinTech South 2018 is a global exchange of insights, innovations and trends fueling tomorrow's financial tech industry.\nMAY 8:  Atlanta Startup Battle  (6 p.m.) at Tech Square Labs - Atlanta Startup Battle is the freshest and most unique pitch competition in Atlanta. With 100+ ideas and 2 days of competition, the top participants develop their ideas with seasoned mentors and present to investor judges, real VCs from Atlanta and Silicon Valley, all in an effort to help Atlanta build, scale, and fund the next generation of outstanding tech companies.\nMAY 9:  Georgia Tech Innovation Showcase  (1 p.m.-3 p.m.) at Tech Square Research Building - See Georgia Tech’s best student teams, student startups, and research projects currently being commercialized at the Georgia Tech Innovation Showcase. Hosted by  ATDC  and its partners,  VentureLab , and  CREATE-X .\nMAY 9:  ATDC Retail Summit  (9 a.m. - 5 p.m.) at the Hodges Room in Centergy - A gathering of retail executives and innovators gather to discuss the future of retail and the technologies impacting it.\nMAY 9:  Engage Spring Portfolio Night  (4 p.m. - 7 p.m.) Engage will present its new portfolio of startups to investors and corporate executives at Invesco Global Headquarters, Two Peachtree Pointe, 1555 Peachtree St. NE.\nMAY 9:  ATDC Investor Dinner  (7 p.m.) at Community Smith - A gathering of local and out-of-town investors.\nMAY 10:  ATDC Startup Showcase  (11:30 a.m. - 5:30 p.m.) at Renaissance Hotel - The ATDC Startup Showcase is the premier Atlanta technology event where more than 800 investors, corporate partners, entrepreneurs, and researchers converge to discover the most promising and emerging technologies, network with each other, and forge new relationships and partnerships.\nMAY 10:  Tech  Square Block Party   (5:30 p.m.) at Centergy Courtyard - Food, games, drinks, & a live performance from a Georgia-based Grammy Award Winning Act.\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}