{"text": "Coffee Leads to Collaboration | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nCoffee Leads to Collaboration\nMeetings over coffee led two professors to collaborate on research.\nFacebook\nTwitter\nEmail\nResearchers Will Ratcliff (left) and Peter Yunker at Highland Bakery.\nAug 08, 2018\n— Atlanta, GA\nWhen Will Ratcliff and Peter Yunker first met for coffee they had no idea they would eventually collaborate on research that would be published in\nNature Communications\nand\nNature Physics .\nRatcliff, an assistant professor in the School of Biological Sciences, arrived at Tech in January 2014. Yunker, an assistant professor in the School of Physics, arrived in January of the following year.\n“I met with [Physics Professor] Dan Goldman and told him about my interests in biophysics,” said Yunker. “He told me there’s another young guy who just arrived. You should contact him.”\nYunker reached out to Ratcliff, and the two began meeting weekly for coffee in the basement of the College of Computing.\n“I think our conversations for a solid six months were just about friend stuff,” Ratcliff said. “We talked about science, but we weren’t actively pursuing projects. We were just hanging out and getting to know each other.”\nYunker said they discussed ideas about the evolution of multicellularity.\n“Will would talk a little about the biology of the evolution of multicellularity. And then we would pivot, and I would talk about the physics of multicellularity,” Yunker said.\nThough coming from different disciplines — biology and physics — Ratcliff and Yunker quickly recognized some common ground.\n“I would say, ‘There’s this thing in biology where this needs to happen,’ and he would say ‘there’s this thing in physics where this needs to happen,’” Ratcliff said. “It would blow my mind because it was a totally different way of thinking about the things that I was already thinking about. It was incredibly exciting because there were these parallels coming from such different places, and they were describing the same overlapping material. I think we both could tell there was a lot of cool stuff to be done.”\nThe harder part was figuring out where the overlap was concrete so they could actually conduct experiments or write models.\n“A lot of our conversations are brainstorming style,” Yunker said. “They’re less about knocking down ideas and more about: ‘Let’s get a lot of information out there so we can find where that concrete idea emerges.’”\nThe collaboration also eased the pressure of being a new faculty member.\n“It’s nice to work with other people who are at a similar level, to bounce ideas off each other, talk about critical review, and vent about frustrations,” Yunker said. “The whole time I’ve been here I have always heard Georgia Tech is very supportive of collaboration. I’ve heard of other places where that support isn’t there when you’re still at the assistant professor level. I haven’t worried at all about if there will be trouble down the line if we collaborate. Instead, I see it as we’re doing the best science, and that’s what Georgia Tech wants.”\nRatcliff said, “That’s one of Georgia Tech’s real strengths. People really appreciate our collaboration. I hear from people in both communities — biology and physics. They appreciate not just the research, but also the strengthening of the bridge between the departments and the sense of community it builds.”\nIn addition to their research collaborations, Ratcliff and Yunker co-advise a Ph.D. student and a postdoc.\nCollaboration Advice to New Faculty\nYunker and Ratcliff make collaboration look deceptively easy.\n“Collaboration takes effort. It takes sustained interaction,” Ratcliff said. “There’s got to be a reason to do that because as new professors we’re super busy trying to get everything off the ground: get your lab running, get grants, write papers, design classes, do service work. We’re spread really thin. So, to have sustained interactions that are needed for a good collaboration, you have to prioritize it and want to do it.”\nYunker added, “One of the best approaches when starting a new collaboration is to either let it grow or die on its own. If the idea isn’t there or if you just don’t mesh, then forcing it is going to be difficult for everyone.”\nRatcliff has advice for new faculty who are interested in collaborating.\n“It’s really exciting and valuable to have a close collaborator from a different discipline or with a  different skillset,” he said. “To get that, I suggest forming collaborations with other professors who are about your age. Key reasons are you’re both at the same stage in your careers. You’re equals. Also, a new professor is likely to have time to form new collaborations. Lastly, new professors have startup funds and a large degree of flexibility. This is great for trying things that are risky.”\nHe also suggests attending receptions for new faculty.\n“Talk to people outside of your discipline. Don’t spend\nall\nof your time at the mixer talking to your departmental colleagues,” Ratcliff said.\nDeveloping a good collaboration can be transformational.\n“Our collaboration has fundamentally reshaped the way I think about key problems in my field,” Ratcliff said. “I know how to think about the things I was trained to think about, but I had no idea how to think about things I wasn’t trained to think about.”\nYunker said, “Together we’re able to ask and answer more interesting questions. I was not versed at all on questions about evolutionary transitions and individuality. I wasn’t aware of all the open questions and problems there, and they’re fascinating. By coming together, we end up asking even more interesting questions and, hopefully, coming up with new approaches.”\nRatcliff said what made the collaboration work is that he and Yunker became friends.\n“We enjoy hanging out. I look forward to having coffee,” Ratcliff said. “We have these exciting scientific discussions where it was obvious that there’s something there, but we had to make the ideas touch down to reality.”\nAdditional Images\nRelated links\nCholera research\nEvolution of multicellularity\nContact\nVictor Rogers\nInstitute Communications\nEmail\nvictor.rogers@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}