{"text": "Cognitive Empowerment Program Opens Doors to First Members | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nCognitive Empowerment Program Opens Doors to First Members\nThe new Georgia Tech-Emory University Cognitive Empowerment Program provides new hope.\nFacebook\nTwitter\nEmail\nCognitive Empowerment Program participants Lyn Reagan and Steve Baltz with (left) CEP researcher Matt Doiron. (Credit: Rob Felt, Georgia Tech)\nApr 01, 2020\n— Atlanta, GA\nStepping off of the elevator on the first floor at 6 Executive Park in Atlanta, the first thing you notice about the space is its serenity. It’s light-filled, with lots of plants, a flowing water feature, and a neutral color palette – shades of soft blue, grey, beige, and sage green. It’s relaxed and welcoming, and that’s by design.\nThe center, which opened in January, is the home of the Cognitive Empowerment Program, a joint effort between Emory University’s Brain Health Center and the Georgia Institute of Technology to empower people living with mild cognitive impairment (MCI), a distinct decline in thinking. The condition is often a precursor of Alzheimer’s disease and impacts up to 20% of Americans over age 64, an age group that’s expected to double by the year 2050.\nTwice a week, people with MCI (called program members) and their care partners, usually spouses or adult children, visit Executive Park to participate in art and nutrition classes, physical therapy, gentle yoga, and brain exercises. There’s also a “tech bar” for help operating or troubleshooting mobile devices. The goal is to empower participants to take charge of their lives through education and independent living. Dr. Allan Levey, director of the Emory University Alzheimer’s Disease Research Center, says members and care partners have already praised the program.\n“By design, program benefits are wide-ranging and personalized, providing individuals with tools to take control over risk factors and behaviors that we hope will promote their cognition, emotional, physical, and spiritual well-being,” said Levey, who is also professor and chairman of Emory’s Department of Neurology. “The program also provides hope and the personal reward that they are contributing to the fight against Alzheimer’s disease.”\nSteve Baltz and his wife Lyn Reagan started the year-long program in January with the inaugural group. Baltz had a stroke in 2003, which affected “the memory part of his brain,” Reagan said. He recovered and continued working for the next 10 years. After retiring, Baltz became less active and more isolated at home. Then, his memory began to decline. He forgets whether he fed the dog and misplaces things.\nReagan says she and her husband are “incredibly grateful” for the program; it helps him to get out of the house and socialize. “He loves it. He just can’t wait to go.”\nBaltz, a retired physician, believes “this is an opportunity for us to give back [to the medical and research communities] because we’re right here at the forefront of MCI research.”\nAs members of the first group of participants, the Atlanta couple now serve as mentors to newer members and their care partners – couples like Fred and Marsha Rueff, who joined the program in February.\nDoctors diagnosed Fred with MCI six years ago, and over the past year, his memory has worsened. He has trouble with language and remembering names but is still excellent at problem-solving and math.\n“Fred’s great to take when you’re shopping sales because he can figure out the percentage off,” Marsha said.\nActivities at the Cognitive Empowerment Program help to keep Fred’s brain sharp. He enjoys yoga classes and maintains a daily journal of his activities. “This program has given us a whole new level of hope.”\nUnique Research Opportunity\nWhile the Cognitive Empowerment Program serves as therapy for members, it’s also a living laboratory, providing a unique research opportunity for Georgia Tech and Emory.\nThe program’s innovation accelerator, led by Georgia Tech’s Jennifer DuBose, advances research by breaking down barriers to collaboration. Researchers and students, some supported by\nannual seed grants , work in the heart of the Executive Park space where they can easily observe and interact with program members.\n“They can watch while people are having physical therapy and yoga and see them hanging out on the sofas. I didn’t want people to have a one-off experience with the members,” said DuBose, a principal research associate in the\nCollege of Design\nand associate director of\nSimTigrate Design Lab .\nDuBose often has lunch at the center with program participants and leads sessions where she works one-on-one with them. During one recent session, members placed emoticon stickers on printed “journey maps” from their homes to the center to express how their feelings changed over the course of the day. It’s a simple and effective way for researchers to learn about members’ anxieties, routines, and limitations related to memory loss.\nCraig Zimring, a professor in the School of Architecture and director of SimTigrate Design Lab, is directing the program’s built environment core, researching how design can improve cognition, mood, and functioning for people with MCI. His team worked alongside the Executive Park center’s architect to inform the space design and will develop solutions for other therapeutic and home settings.\nZimring also leads talks at the center on topics like how sound and light affects mood and sleep patterns. He shows how the facility’s advanced lighting system automatically adjusts throughout the day. Participants are engaged, asking questions and chiming in with their personal experiences.\nOutside of the center, Georgia Tech researchers are developing a tablet application for members and their care partners, which provides curated information about MCI.\n“We’re able to foster a continuum of care by providing useable and useful information even when members aren’t at the program facility,” said Beth Mynatt, executive director of the\nInstitute for People and Technology\nand co-director of the Cognitive Empowerment Program technology core.\nMynatt modeled the MCI application on her previous work on the\nMyPath\napplication for breast cancer patients.\nGari Clifford, professor of biomedical informatics at Emory, co-leads the technology core, directing sensing and analytics research to discover new patterns that best depict progress or decline in people with MCI. Drawing on expertise from Georgia Tech’s\nAware Home\nand\nHome Lab , technology core researchers are also creating\nsmart home technologies\nto monitor members’ activity, guide overall MCI care, and provide personalized support for everyday activities and concerns.\nThe Cognitive Empowerment Program will recruit a total of 90 participants in the first year, whom researchers will follow for one year. Program participants have already bonded with researchers, staff, and each other over a shared experience, carpooling to the center and forming friendships and support networks outside of the program.\n“We’re embedded in people’s lives,” DuBose said. “I’m hopeful that they’ll become engaged and trust us, and that they see themselves as collaborators in research.”\nEditor’s note : The Cognitive Empowerment Program suspended in-person programming on March 17 in light of the COVID-19 pandemic. The technology core research team immediately provided the MyCEP tablet application to support virtual programming by the therapeutic team. This rapid research initiative will explore how to support empowerment for people with MCI using online and interactive content. In-person programming will resume as soon as it’s safe for members.\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : John Toon (404-894-6986) (jtoon@gatech.edu).\nWriter : Alyson Powell Key\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}