{"text": "Coskun Lab Pioneering New Field of Research: Single Cell Spatial Metabolomics | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nCoskun Lab Pioneering New Field of Research: Single Cell Spatial Metabolomics\nBME researcher's immunometabolism approach pioneers single cell spatial metabolomics\nFacebook\nTwitter\nEmail\nDec 20, 2023\nAhmet Coskun and his collaborators plan to create a chemical atlas of all the immune cells in the human body, a 3D micromap to help clinicians navigate the complex role of the entire immune system in the presence of different diseases.\nIt’s the kind of massive undertaking that would result in vastly improved precision therapies for patients. And it’s the kind of journey that starts with a single cell. Coskun and team are off to a fast start with the introduction of a new integrative technique for profiling human tissue that enables researchers to capture the geography, structure, movement, and function of molecules in a 3D picture.\nThe researchers described their new approach, the Single Cell Spatially resolved Metabolic (scSpaMet) framework, in the journal  Nature Communications  on Dec. 13.   The study builds on a technique Coskun’s team developed and described in a 2021 article, “3D Spatially resolved Metabolomic profiling Framework,” published in  Science Advances .  In that work, the team introduced a technique that measures the activity of metabolites and proteins as part of a comprehensive profile of human tissue samples.\n“Earlier we couldn’t achieve single-cell resolution, but with this new approach, we can,” said Coskun,  Bernie Marcus Early Career Professor  in the Wallace H. Coulter Department of Biomedical Engineering at Georgia Tech and Emory University. “With this new approach, we can get spatial details of proteins and metabolites in single cells– no one else has yet reached this level of high subcellular resolution.”\nHe added, “We’re pioneering a new field of research with this work, single cell spatial metabolomics.”\nA Bigger, Better Molecular Picture\nHuman tissue is spatially crowded with all kinds of stuff, so investigators need tools that can see clearly into, through, and around that multilayered biological traffic – everything, all at once, in high-definition 3D. With scSpaMet, Coskun’s team can capture single cell details such as the naturally occurring lipids, proteins, as well as metabolites (with their multiple functions, including energy conversion and cell signaling). And other details, like those provided by researchers: Intracellular and surface markers are used to label and track cell activity and behavior.\nThe team broadened the scope of this study, extending its investigation beyond human tonsil tissue.\n“We showed the crucial role of immune cells in lung cancer for the study of lung cancer for the study of immunometabolism of T cells and macrophages as they interact with tumors,” Coskun said. “Then we created dynamic immune metabolic changes in tonsils as they go through germinal center reactions to give rise to the antibody-producing cells. Finally, we demonstrated the role of immune cells in the endometrium, a membrane in the uterus that might lead to conditions impacting a woman’s health.”\nThe wide-angled study required plenty of cross-country collaboration with other institutions, although Coskun’s lab guided the wide-angled study, integrating its expertise in bioimaging, chemistry, tissue biology, and artificial intelligence.\nCold Spring Harbor Laboratory  (New York) provided access to its endometrium tissue bank.  Oak Ridge National Laboratory  (Tennessee) provided data from its complex metabolic imaging instrumentation, to further demonstrate how single cell spatial metabolomics imaging can generate rich data.\nThe  University of California-Davis  provided kidney biospecimens as both fixed tissue and frozen embedded tissue, in two halves of the same sample, “so we could demonstrate the effect of tissue preparation on the sensitivity of our single cell spatial metabolomics pipeline,” Coskun said.\nThe team also included Thomas Hu and Mayar Allam, graduate researchers in Coskun’s lab, who guided the research as lead authors, and Walter Henderson, a research scientist who manages the  IEN/IMat Materials Characterization Facility  at Georgia Tech.\nConsidering the Whole Person's Biochemistry\nThe ability to generate single cell spatial metabolic profiling of individual patients can reveal a world of possibility and potential for clinicians who need to fully understand a patient’s biophysical makeup to contrive the best treatment options.\n“For example, it can provide mechanisms of how immune responses can be boosted by adding dietary molecules along with immunotherapies,” Coskun said. “It can also help adjust the dose of cell-based treatments, based on the body mass index of individual patients, whether they are obese or not.”\nCoskun believes this new arena of single cell metabolomics research his lab is developing will complement the field of single cell genomics, which has led to genomic medicine. His team’s comprehensive exploration and imaging of the geography of normal and unhealthy human tissues – of every single cell – can further explain cellular regulation in ways that were previously overlooked, due to the lack of technology.\nHe envisions a future in which a patient’s BMI, dietary habits, and exercise commitments, along with their single cell spatial metabolomic atlas of disease progression, will be analyzed all together to find optimum therapies that can work with biologics and metabolic boosting regimens, potentially increasing the survival of cancers, women’s diseases, and metabolic disorders.\n“We will have opportunities to talk about spatial single cell metabolomic medicine, to stratify patients and design next-generation combination therapies with an integrated view of genes and chemical activity roadmaps, for more efficient management of cancer and other diseases,” Coskun said.\nIn creating their scSpaMet framework, the researchers must integrate expensive machines that live in the worlds of nanotechnology and chemistry right now. The system will require clinical-friendly optimizations to be able to run single cell metabolic imaging measurements in healthcare settings. Coskun expects the cost and user-friendliness will be improved in the near future to reach the bedside.\n“When researchers achieved single cell sequencing, it was a revolutionary moment in medicine,” Coskun said. “Now, we believe single cell spatial metabolic profiling will push the medical practice into new heights.”\nThis research was supported by the Burroughs Wellcome Fund, and the Bernie Marcus Early Career Professorship, as well as the National Science Foundation (Grant ECCS-1542174), (Grant ECCS-2-25462), American Cancer Society, and National Institutes of Health grants (R21AG081715, R21AI173900, and R35GM151028)\nCitation:  Thomas Hu, Mayar Allam, Shuangyi Cai, Walter Henderson, Brian Yueh, Aybuke Garipcan, Anton V. Ievlev, Maryam Afkarian, Semir Beyaz, and Ahmet F. Coskun.  “Single-cell spatial metabolomics with cell-type specific protein profiling for tissue systems biology,”  Nature Communications  (Dec. 13, 2023)\nAdditional Media\nContact\nJerry Grillo\nEmail\njerry.grillo@ibb.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}