{"text": "Georgia Tech Hosts State Legislative Leaders at ATDC HealthTech Summit | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Hosts State Legislative Leaders at ATDC HealthTech Summit\nGeorgia's lieutenant governor, state senators see how ATDC leads startup innovation in health technology\nFacebook\nTwitter\nEmail\nATDC Assistant Director Jane McCracken (far left), explains how entrepreneurs use the incubator's design studio to make and refine product prototypes, as Georgia state Sens. Greg Kirk and Dean Burke and Lt. Gov. Geoff Duncan listen. (Photo: Péralte C. Paul)\nJan 25, 2019\n— Atlanta, GA\nWith health care a major focus at the state and national levels, the Georgia Institute of Technology welcomed Georgia Lt. Gov. Geoff Duncan and other state legislative leaders to campus for a health summit focused on how technology drives innovation, leads to better patient outcomes, and reduces costs.\nDuncan, joined by Georgia state Sens. Dean Burke, Greg Kirk, and Ben Watson, toured the Institute’s Advanced Technology Development Center (ATDC) to learn more about the incubator’s efforts to support health technology (HealthTech) innovation and meet startup leaders in its portfolio.\nBurke spearheaded the visit from the state government delegation.\nA program of the Enterprise Innovation Institute, Tech’s economic development arm, ATDC is the state of Georgia’s technology startup incubator. Created in 1980, ATDC has helped its companies generate more than $12 billion in revenue and raise in excess of $3 billion in investment capital.\n“One of my most ambitious goals is for Georgia to become the technology capital of the East Coast. Incubators like ATDC are critical to that vision,” Duncan, a Tech alum, said. “Georgia boasts the top talent coming out of our world-class university system, business-friendly environment, low cost of living, high quality of life, and emerging venture capital presence necessary to grow from the Silicon Valley of the South to the Tech Capital of the East Coast.”\nThe delegation received an overview of ATDC’s focused efforts to support HealthTech innovation and startups, including the July 2018  launch of the ATDC HealthTech Program .\nSupported with a financial gift from NASCO, the ATDC HealthTech Program focuses on helping entrepreneurs launch viable companies in that sector, Kirk Barnes, ATDC’s HealthTech catalyst explained to the delegation.\nRecently, ATDC entered into a  collaboration with Navicent Health ’s Center for Disruption & Innovation (CfDI) to support the development of new technologies, treatments, and care created by healthcare technology-oriented companies based in the state. The goal: to improve the health and lives of patients in central and south Georgia.\nIt’s a goal that resonated with Duncan.\n“It’s encouraging to see the system built around these ideas and to see these ideas commercialized,” the lieutenant governor said. “It’s not just about cutting costs, it’s about improving service and quality of care.\n“I’m appreciative of the impressive work being done at Georgia Tech and ATDC, and I look forward to working alongside them as lieutenant governor.”\nSince its launch, the ATDC HealthTech Program’s portfolio of companies has grown to 48 and includes a host of technologies ranging from digital health and medical devices to drug discovery tools and healthcare robotics.\nOne of those companies, Rimidi Inc., a provider of software and clinical analytics for chronic disease management,  raised more than $6.5 million  in its Series A-1 financing, which included an investment from Eli Lilly and Co.\nTee Faircloth, who helped spearhead the summit, is founder of Coordinated Care Inc. (CCI), an ATDC HealthTech company. CCI, one of the companies the delegation met, works with urban and rural hospitals to move patients back to their local hospitals for rehabilitation.\nFaircloth said such summits give state leaders valuable insight into how public support of programs such as ATDC and public-private partnerships such as the one with NASCO work.\n“With the incoming administration’s focus on rural healthcare, it’s great to see them embrace innovation as an agent of change so early on. This summit continues the dialogue of how we, as technology companies focused on bringing solutions and innovation to healthcare, can work with state and local leaders,” Faircloth said.\n“We want to find areas where we can work together in these public-private partnerships to leverage the resources of the Atlanta and Georgia ecosystems so that we really improve healthcare for all Georgians.”\nAdditional Images\nContact\nPéralte C. Paul\n404.894.8287\nperalte@atdc.org\nEmail\nperalte.paul@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}