{"text": "Georgia Tech Ranks Among Top Public Universities in Latest Undergraduate Rankings | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Ranks Among Top Public Universities in Latest Undergraduate Rankings\nU.S. News & World Report releases 2023 Best Colleges Rankings.\nFacebook\nTwitter\nEmail\nSep 12, 2022\n— Atlanta, GA\nThe Georgia Institute of Technology continues to rank among the top public universities in the nation, and its programs remain among the best in the country, according to the 2023  U.S. News & World Report  Best Colleges rankings.*\nIn the most recent report, released Sept. 12, for the fifth year in a row, all 10 of Georgia Tech’s engineering programs placed in the top 5 in the nation, with seven of those programs placing either first or second in their discipline. Georgia Tech was also named No. 5 overall in Best Undergraduate Computer Science programs. More than 66% of Georgia Tech’s undergraduate students are enrolled in either engineering or computing. Georgia Tech was also ranked among the top 20 Best Undergraduate Business programs in the country.\nOverall, Georgia Tech ranks No. 15 in the Best Public University category. Georgia Tech is ranked No. 44 among universities both public and private, sharing the spot with Brandeis University, Case Western Reserve University, Northeastern University, and Tulane University. Among the nation’s Most Innovative Universities, Georgia Tech ranks No. 8. In other categories highlighting academic excellence, Georgia Tech ranks No. 5 for Co-op/Internship Programs, and moved up to No. 16 for Senior Capstone Projects.\n“We are proud to see our programs in engineering, computing, and other disciplines among the best in the nation,” said Ángel Cabrera, president of Georgia Tech. “We also appreciate being listed again among the best public universities in the nation, even if this year we showed five spots lower than last. Our successful efforts to serve more students and lower costs penalize us in these rankings, which is unfortunate. At the same time, the rankings rightfully point out the need for us to do better in terms of social mobility. We have one of the best graduation rates in the nation for Pell students, but we serve far fewer Pell students than we should, and we need to keep working to change that.”\nDigging deeper into the numbers for the College of Computing, four of Tech’s computer science programs are ranked among the top 5 in the country, with game development at No. 3 and cybersecurity at No. 4. Georgia Tech’s artificial intelligence program ranks No. 6 among national universities. In holding its No. 5 overall computer science ranking, Georgia Tech is tied with Cornell University, Princeton University, and the University of Illinois Urbana-Champaign.\nIn maintaining its No. 4 overall ranking for Best Undergraduate Engineering Programs, two Schools at Tech earned No. 1 rankings. The Guggenheim School of Aerospace Engineering earned the No. 1 position for the first time, and the H. Milton Stewart School of Industrial and Systems Engineering earned that recognition for the 28th straight year.\nThe Scheller College of Business holds the No. 19 spot for Best Undergraduate Business Programs, in a tie with the University of Wisconsin Madison, the University of Minnesota-Twin Cities, and the University of Washington. Three of Scheller’s business programs ranked in the top 5, with quantitative analysis at No. 4 and both business analytics and management information systems at No. 3.\nGeorgia Tech’s rankings also moved up for Best Undergraduate Teaching, going from No. 58 to No. 41.\nThis is the season in which many college rankings are announced by organizations that follow higher education. Each of those ranking groups use different criteria to arrive at their evaluations. Here are some of this year’s other recent results:\nNo. 3 Public University, according to Niche.\nNo. 6 Best Value College in America, as ranked by Money.\nNo. 12 Public University, according to Forbes.\nNo. 8 for Return on Investment, as ranked by Payscale.com.\nFor additional ranking information please click\nhere .\n*Please note that this summary includes the latest rankings issued by U.S. News & World Report this year. Not all Georgia Tech Colleges, Schools, and subjects are ranked every year by this organization.\nAdditional Images\nContact\nAyana Isles\nMedia Relations Representative\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}