{"text": "The Pulse of the Community: Georgia Tech Reflects on Orlando | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nThe Pulse of the Community: Georgia Tech Reflects on Orlando\nOn June 15, the LGBTQIA Resource Center, Counseling Center, and Office of Student Diversity Programs hosted the “Stronger Together: Reflecting on Orlando” discussion for the Georgia Tech community to come together for reflection and healing.\nFacebook\nTwitter\nEmail\nDrew Adelman, diversity and inclusion coordinator in the Counseling Center, facilitated the discussion and opened by stating, “We hope that in this space, we don’t place blame, rush to action, or try to fix things. Instead, we hope this space is a place to reflect, process, and heal as a community. We are all affected disproportionately by this tragedy. It’s important to think about your own grieving process and the grieving processes of others.”\nJun 20, 2016\n— Atlanta, GA\nThe recent mass shooting at the Pulse nightclub in Orlando left many with feelings of grief, anger, and confusion. On June 15, the\nLGBTQIA Resource Center ,\nCounseling Center , and\nOffice of Student Diversity Programs\nhosted the “Stronger Together: Reflecting on Orlando” discussion for the Georgia Tech community to come together for reflection and healing. Drew Adelman, diversity and inclusion coordinator in the Counseling Center, facilitated the discussion and opened by stating, “We hope that in this space, we don’t place blame, rush to action, or try to fix things. Instead, we hope this space is a place to reflect, process, and heal as a community. We are all affected disproportionately by this tragedy. It’s important to think about your own grieving process and the grieving processes of others.”   More than 100 faculty, staff, and students shared their insights and heartfelt reactions to the tragedy during the reflection event.   “It is significant that this attack occurred during Pride month,” said Aby Parsons, director of the LGBTQIA Resource Center. “Orlando was one of the biggest tragedies to the LGBTQIA community, but it is certainly not the only tragedy. Students are still being cut off from their parents and loved ones, for instance. I would like to see Atlanta’s Pride Festival be a celebration\nand\nprotest this year. Our fight is not over after the recent ruling on same-sex marriage.” Denise Ocasio, assistant director of retention initiatives in OMED: Educational Services, commented on another aspect of the tragedy. “As a Puerto Rican-American and Floridian, there is a tremendous sense of sadness because this attack happened before the National Puerto Rican Day Parade, which honors the 5 million Puerto Rican-Americans living in the mainland United States. How many times have you gone to a bar or club to have fun with your closest friends?” asked Ocasio. “Then, to think of this safe space being ripped from you in a place that is designed to allow you to let your guard down; the mass shooting in Orlando affected me greatly.” According to the FBI, sexual orientation triggers 20.8 percent of hate crimes; race is the only factor that accounts for more hate crimes. Women’s Resource Center Assistant Director Melanie DeMaeyer reflected: “I hope that as we go through this grieving process, our anger doesn’t divide us; that we don’t lose the spirit of belonging to each other. We also need to honor and celebrate the sacred spaces that we create for ourselves.” Stephanie Ray, assistant dean of students and director of the Office of Student Diversity Programs, spoke about the event’s success in that regard. “It is so heartwarming to see a packed room of community members from all walks of campus life,” said Ray. “We have an opportunity to share and process our feelings, and it is freeing to release them.” Brandon Bray, federal work study coordinator in the Office of Scholarships and Financial Aid, agreed with Ray’s sentiments. “Five years ago, an event like this would not have happened. Now, it is amazing to see a large crowd of people from all walks of life.” Reverend Steve Fazenbaker, director of the Wesley Foundation, offered hope to a healing community: “Our history is moving from oppression to liberation. Liberation is here as tragedies like Orlando bring change. I hope that this thought offers solace because liberation will come as a result of this attack.”  To conclude the reflection, Adelman and Parsons provided suggestions on how the LGBTQIA community — and allies to this community — can help in the midst of this tragedy. The LGBTQIA community can help by cultivating a “Movement Perspective,” doing something, paying attention to allies, watching out for negative messages, making use of LGBTQIA and allied communities, and taking care of themselves. Allies to the LGBTQIA community can help by supporting LGBTQIA friends and family, speaking out regarding privilege and oppression, giving voice to the LGBTQIA community, educating themselves, and taking care of themselves as well. Since the shooting, the LGBTQIA Resource Center has received a surge in registrations for Safe Space, Georgia Tech’s LGBTQIA ally training program. “It seems that this tragedy has moved people to educate themselves and take action to support the LGBTQIA community,” added Parsons. If interested in registering for the Safe Space trainings this fall, email\nlgbtqia@gatech.edu\nfor more information.\nAdditional Images\nContact\nAnnette Filliat Communications Manager Institute Diversity annette.filliat@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}