{"text": "Coral Reef Researcher Wins Explorer’s Club Honor | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nCoral Reef Researcher Wins Explorer’s Club Honor\nGeorgia Tech Teasley Professor Mark Hay has received the Lowell Thomas Award from the New York-based Explorers Club.\nFacebook\nTwitter\nEmail\nGeorgia Tech Teasley Professor Mark Hay is shown with a background of glaciers in Alaska. Hay has spent his career understanding what's killing the world's coral reefs. (Credit: Candace Klein)\nNov 11, 2015\n— Atlanta, GA\nA century ago, being an explorer meant trekking across icy wastelands, scaling impossibly high mountains or spending months at sea in search of new lands, unseen creatures and new scientific knowledge. Today’s explorers may travel by airliner, but the organisms they see, what they explore and the scientific data they bring back are no less important. Understanding what's killing the world's coral reefs has been the life work of\nMark Hay , the Teasley Professor in the\nSchool of Biology\nat the Georgia Institute of Technology. During the past 35 years, he's made more than 5,000 dives, worked weeks at a time underwater in both the Caribbean and Pacific – and each year spends as much as five months with villagers on the Fiji Islands. On November 7, he received the Lowell Thomas Award from the New York-based Explorers Club, which cited his pioneering of innovative and effective new approaches for coral reef conservation. “Dr. Hay’s research and discoveries have influenced the foundations in the field of marine chemical ecology and created new procedures for effective conservation and management of the world’s coral reefs,” the organization said. Hay notes that over the last 40 years, the world has lost 80 percent of coral reefs in Caribbean and 50 percent of the reefs in the Pacific. That loss has broad impacts. “For about a billion people around the world in the tropics, coral reefs are one of the major sources of protein, so the loss affects food security for these areas,” he noted. “Reefs also provide storm protection for low-lying villages, absorbing big waves coming into shore. And coral reefs are kind of the underwater version of tropical rain forests because they have significant unexplored potential as a source of new therapeutic drugs.” Hay’s research has focused on the complex interactions between species, communicated by chemical signals emitted by the plants and animals that are part of the reef community. For instance, seaweeds harm coral by emitting poisonous chemicals, by shading the coral, and by mechanically damaging it. Certain fish protect coral by controlling the seaweeds, but overfishing has allowed seaweed to get out of control on many reefs. “We have asked which fish can get rid of those chemically-rich seaweeds, so we can tell villagers which species they can catch without harming the reefs, and which species they may want to protect,” he said. “We are trying to understand enough of the pieces and parts to know how we can work with local villagers. We can’t mandate what they do, but we can inform them and their culture will take care of it from there.” The demise of coral reefs likely has many causes, and Hay acknowledges that he cannot address them all. But he believes that by understanding the details of the ecosystem, tweaking some factors – such as which fish to protect – can have an impact. “We want to switch from cataloging the demise to asking how we can fix things,” he said. “We are looking at it more or less like a molecular scientist or human health researcher would. We’re asking what are the chemical signals involved, and whether there are opportunities to make minor adjustments that can have huge benefits.” Among recent examples, Hay and collaborators have learned that degraded reefs produce chemicals that tell baby fish and baby corals to stay away. Unless those signals can somehow be changed, damaged reefs won’t have a chance to recover. Many coral reef organisms lack hearing or vision. Instead, they must rely for their information on chemical signals provided by other organisms. “We’ve realized that many of these species are behaving based primarily on chemical cues,” he explained. “They are perceiving the world chemically and reacting to that. Simple phytoplankton in the ocean can smell their neighbors being attacked, and from the smell, can identify who’s attacking and then respond in appropriate ways – by changing their shape or chemistry.” At Georgia Tech, Hay keeps an office and lab. But the majority of his experiments are conducted in the wild, on the coral reef, building cages to determine what happens when certain species are excluded and to learn about interactions between plants and animals. “I really have Georgia Tech’s biggest lab – the world,” he explained. “We try not to extract things from nature to ask how species are interacting. We try to find that out in nature. We spend huge amounts of time underwater. We’re wearing wet suits and we’re up to our necks in mud and water all day.” Previous winners of the Lowell Thomas award, named after the noted broadcaster, have included Edwin “Buzz” Aldrin, Jr., Isaac Asimov, Sir David Attenborough, Robert Ballard, Eugenie Clark, Sylvia A. Earle, Sir Edmund Hillary, Carl Sagan, Kathryn D. Sullivan and Charles E. “Chuck” Yeager. The organization has 3,200 members worldwide. The Explorers Club was founded in 1904, and boasts a membership that was first to the North Pole, the first the South Pole, the first to the summit of Everest, the first to the deepest point of the ocean – and first to the surface of the moon. With all those accomplishments on record, does that mean the time of exploration is past? “I think this is the time of maximal exploration,” said Hay. “There is more exploration going on right now than has ever gone on before. I’ve been to more places around the world than any pirate. The amount of information we’re gathering – which is exploration and finding out new things about the world – is tremendous.” What keeps him going after all these years? “I love being underwater and seeing new things,” Hay said. “Everybody is trying to get lunch without becoming lunch. I’m always wondering about who eats who, what goes on, and the intricacies of the ecology and evolution.” Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contact : John Toon ( jtoon@gatech.edu ) (404-894-6986). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}