{"text": "Workshop Offers Student Organizations Opportunity to Archive Records | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nWorkshop Offers Student Organizations Opportunity to Archive Records\nUniversity Archivist Alex McGee and Digital Accessioning Archivist Dillon Henry invite student organizations to learn how keeping records can be beneficial for years to come.\nFacebook\nTwitter\nEmail\nAlex McGee is the university archivist for the Georgia Tech Library.\nNov 07, 2023\nWhile Georgia Archives Month concluded at the end of October, the Georgia Tech Library’s Archives and Special Collections Department is hosting a workshop to remind student organizations of the importance of archiving their records. University Archivist Alex McGee, along with Digital Accessioning Archivist Dillon Henry, will lead the workshop on the fourth floor of Crosland Tower on  Wednesday, Nov. 8, from 11 a.m. to noon . McGee and Henry share how student organizations can benefit from achieving their records and offers a few tips on how to get started.\nMembership and leadership in student organizations often changes from year to year. How does this underscore the importance of keeping detailed and organized records?\nLeadership changes often lead to organizational history and knowledge being lost if there isn’t a solid foundation of record keeping. Having a clear understanding of what documentation needs to be kept for your organization can help streamline the process. By keeping records, future leaders and members of your organization can glean insight into what worked, what didn’t, when major shifts in programming, membership, and budgets took place, and what factors contributed to them.\nWhat are the best habits for organizations to get into to ensure records are adequately archived?\nConsistent folder and file naming is key. Make dedicated folders for all aspects of your organization, from bylaws to meetings to one-time events. Make subfolders to keep track of chronology and use the YYYY-MM-DD date format. For example, a folder titled \"2023-12 Meeting Notes\" is far preferable to \"Dec 2023 Meeting Notes.\" This ensures that when you sort by filename, the folders will be sorted chronologically.\nSimilarly, if you have a lot of photographs from an event or some other sort of sequential files, number them with leading 0s. For instance, start numbering with \"001\" rather than '1.' Again, this will ensure that files stay ordered.\nIf you have physical records, how you store them is another important consideration. They are best kept in labeled boxes, in a secure space on shelving, and not on the floor. Should there ever be a water event, things on the floor are guaranteed to get wet.\nLastly, especially with photos, document who is in them and when and where they are. Years from now, your members won't know these things, and this information is guaranteed to get lost.\nIf an organization feels overwhelmed as it begins to archive records, where should it start?\nReach out to the university archivist. Part of my job is to be a resource on campus for questions like these. Whether or not you want to donate records, I am happy to consult and make suggestions on how you can better keep your organization's history and, by extension, Georgia Tech history.\nWhat resources are available to organizations to assist them in archiving their records?\nThe  GT SORT Resource Guide  is always available if you are looking for some basic guidance on how to start. This is an evolving guide that is going to be expanded to include more information about caring for your digital records. It also has information on what to do if your organization is interested in archiving your student organization’s historical records in the university archives in the Georgia Tech Library.\nFor digital files, there are free tools available that can help with various aspects of archiving. Advanced Renamer is a powerful tool for batch file renaming, which can save a lot of time and headaches in organizing your files. DupeGuru is a tool for finding duplicate files, including photographs, which can decrease clutter and save space. If you have flash drives or old CDs with organization records lying around, FTK Imager can help you create disk images and extract files.\nFor more overarching assistance,  COPTR  is an invaluable resource with information on hundreds of tools and workflows for all stages of digital preservation.\nWhat can participants of Wednesday’s workshop expect to learn about the archiving process?\nThis workshop is an opportunity to get a crash course in the basics of what to keep from a historical perspective and how to keep them. Physical and digital records each provide their own unique challenges, and we will be sharing some good practices to get you started or improve your organization’s existing system.\nWe will also be providing free “starter kits” for organizations that attend Wednesday, including acid-free archival boxes and folders. Plus, the workshop will offer free food for attendees.\nThis workshop is made possible thanks in part to the Society of Georgia Archivists Georgia Archives Month Spotlight Grant.\nAdditional Images\nRelated links\nWorkshop Registration Link\nContact\nSteven Gagliano\n- Institute Communications\nEmail\nSteven.gagliano@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}