{"text": "Optimization Modeling Helps Control Electricity Supply Continuity in Brazil | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nOptimization Modeling Helps Control Electricity Supply Continuity in Brazil\nOptimization research provided by Georgia Tech helped improve a computer algorithm used to ensure that electricity generation meets the demand in Brazil.\nFacebook\nTwitter\nEmail\nAlex Shapiro, a professor in Georgia Tech's Stewart School of Industrial &amp; Systems Engineering, poses in front of a utility substation. Assistance he provided to Operador Nacional do Sistema Eletrico (ONS) in Brazil helped improve a computer algorithm used to ensure that electricity generation meets the demand. (Georgia Tech Photo: Rob Felt)\nNov 14, 2013\n— Atlanta, GA\nFor boaters, fisherman and others, a lake filled with water is an opportunity for recreation. But for an organization such as Operador Nacional do Sistema Eletrico (ONS) in Brazil, a full lake behind a hydroelectric dam is also an optimization challenge that must be addressed to provide reliable electric power at a stable cost. Brazilian power system generation is dominated by hydroelectric sources using large reservoirs that allow multi-year regulation. As of 2010, the country’s power generation facilities included more than 200 major power plants, of which 141 were hydroelectric. The hydro facilities account for 77 percent of Brazil’s installed generating capacity, and are located in 14 large river basins with their generation interconnected to take advantage of hydrological diversity between the basins. Because the hydro plants use water stored in reservoirs to generate electricity, operators must decide when to use the water. Since the water inflows depend on rainfall, the amount of water available for future power generation cannot be predicted with high accuracy. Moreover, historical records indicate the possibility of dry periods which place a burden on hydro generation – and may require the use of thermal power plants to meet demand. ONS uses a complex computer algorithm that models the system to help ensure that electricity generation meets the demand at minimum expected cost, planning the generation of power based on such information as electricity demand forecast and water inflow scenarios based on the historical data. The system also sets the monthly price of power for the country. However, during the early part of this century, power rationing that took place in Brazil called into question the validity of meeting day-to-day needs using a policy based on minimizing the expected cost of power. To improve the system, ONS decided to develop a methodology for adding a risk aversion criterion to the planning model. Four years ago, it contacted Alexander Shapiro, a professor in the Stewart School of Industrial & Systems Engineering at the Georgia Institute of Technology. Shapiro is an expert on optimizing systems using stochastic programming, a technique useful for modeling complex systems when not all input parameters can be known. “The usual criteria used for our planning purposes took a neutral approach to the risk of energy supply failure,” explained Joari Paulo da Costa, a research engineer with the Methodology Development Department of ONS in Rio de Janeiro. “During earlier energy rationing, it turned out that this approach was not sufficient and that some measure of risk aversion had to be taken into account by the planning model. An ad-hoc procedure had been implemented, but only with the results of the risk-averse methodology proposed by Professor Shapiro have we achieved a proper inclusion of these concerns into the methodology and computer program.” During the course of the project, Shapiro visited Brazil several times to confer with officials of ONS, including da Costa and Murilo Pereira Soares, a senior engineer. “If they don’t have enough water, they have to use more expensive generation sources,” explained Shapiro. “The algorithm they have been using sometimes produces high prices for electricity, that, although fully justifiable within the mathematical framework, do not conform to the expectations and are not intuitive.” The system presented a classic optimization challenge concerning the use of a resource whose future availability could not be determined with accuracy. “The risks in the system are very simple,” Shapiro explained. “When you have water in the reservoirs, you can either use it now, which makes electricity very cheap now, or you can hold onto it. If you use it now, in a few months you might not have enough water to produce the electricity you need.” Shapiro and former Ph.D. student Wajdi Tekaya  worked with ONS to understand the problem formulation, and suggested some modifications that would reduce the risk of energy supply failures. The changes they made rely on stochastic programming, which is often used for modeling optimization programs that involve uncertainty. “We developed a methodology for how to control the risk of energy shortages while optimizing the use of water,” he explained. “We also wanted to control the risk of price spikes. It is a very complex system.” The project also provided a computer implementation of the proposed methodology. This prototype served as a proof of concept which played a fundamental role in validating the proposed methodology. The new risk-averse methodology developed in the collaboration between Shapiro and ONS has now been integrated into the computer program being used to set operational policy and prices for the Brazilian Interconnected Power System, da Costa said. The methodology developed by Georgia Tech and ONS could potentially be applied to other power generation systems, as well as to other operations in which uncertain natural resources – such as water supplies – must be used to meet the demand for electricity or other products. “The approach to managing risk is very general and could be applied in other areas,” Shapiro said. “The approach is a new one that could be used to reasonably control the risk.” In real-world optimization problems, decision-makers rarely have all the information they want, so decisions must often be made on incomplete data. “We have to make the best decisions with the information that we have,” said Shapiro. “We all know the past, but we cannot know the future. We have forecasts, but we do not know for sure what will happen.” Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia  30332-0181  USA Media Relations Contacts:\nJohn Toon (404-894-6986)( jtoon@gatech.edu ) or Brett Israel (404-385-1933)( brett.israel@comm.gatech.edu ). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}