{"text": "Georgia Tech to Explore New Academic Unit, Aligns Key Units | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech to Explore New Academic Unit, Aligns Key Units\nGeorgia Tech will submit a detailed proposal to University System of Georgia leadership and the Board of Regents.\nFacebook\nTwitter\nEmail\nPrice Gilbert Library - Georgia Tech\nAug 31, 2022\n— Atlanta, GA\nSteve McLaughlin, provost and executive vice president for Academic Affairs at Georgia Tech, has announced that initial planning is underway to explore the creation of a new academic unit around lifetime learning.\n“Georgia Tech’s strategic plan has an emphasis on expanding access, and we have always been a leader in serving all kinds of learners. Now we have an opportunity like never before to serve them in new and innovative ways,” said McLaughlin.\nAfter the launch of Tech’s strategic plan in late 2020, working groups were formed to explore ideas and initiatives to bring the\nstrategic focus areas\nto life. Nelson Baker, dean of Georgia Tech Professional Education (GTPE) and Charles Isbell, dean and John P. Imlay, Jr. Chair of the College of Computing, co-chaired one of those groups, called “GTPE Next.” They focused on ways to realize the Institute’s strategic focus areas — Expand Access and Amplify Impact, among others.\nThe GTPE Next group collaborated over the last year to develop several key takeaways, one of which was to explore the creation of a new academic unit. The proposed academic unit would expand research on learning innovation, hire faculty and develop curriculum around related topics, and provide services and support to learners from all phases of life.\n“Dean Baker, Dean Isbell, and GTPE Next members provided a critical analysis of the role Georgia Tech can and must play to expand access as demands and the environment transform rapidly around us,” said McLaughlin.\nMoving forward, the GTPE Next group will evolve into a broader “Lifetime Learning” group and begin preparations for a proposal outlining the structure of a new academic unit. With the assistance of an external consultant, planning will begin immediately and take place through January 2023. An inclusive planning process will include smaller groups, managed by campus stakeholders, focused on key aspects of a potential new academic unit, such as finance, operations, academic vision, and faculty governance. They will also address administrative processes and internal policies, communications planning, and faculty and staff roles. The process will include opportunities for feedback from key campus stakeholders.\nAt the end of the Lifetime Learning planning process, Georgia Tech will submit a detailed proposal to University System of Georgia leadership and the Board of Regents. Any final decisions on organizational or programmatic implementation of the proposed new academic unit would be made following approval from the Board of Regents.\n“We want this effort and the resulting proposal to be inclusive of voices from across the Georgia Tech community,” said McLaughlin. “For this process to be comprehensive and reflective of our individual and collective strengths, we need and want all ideas at the table.”\nA key foundational step for the proposed new academic unit is the expansion of Georgia Tech’s ecosystem for lifetime learning. That expansion will include the organizational alignment of the\nCenter for Education Integrating Science, Mathematics, and Computing (CEISMC) , the\nCenter for 21st Century Universities (C21U) , and\nGTPE . The three units will form the core group for the proposed academic unit.\nLeadership and members of the faculty and staff were informed about the alignment over the summer. No group is being absorbed into the other and day-to-day work will continue as usual. Steve Harmon, interim executive director of C21U and Lizanne DeStefano, executive director of CEISMC, will report to Baker. The C21U team will continue to report to Harmon. The CEISMC team will continue to report to DeStefano.\n“We have incredible talent among the faculty and staff of CEISMC, C21U, and GTPE, and it seems only natural that their expertise forms the starting point for the research and educational mission of the proposed new academic unit,” said McLaughlin. “These units are longtime campus partners and collaborators and have been driving forces behind Georgia Tech’s continued leadership in this space across the state, nation, and world. We are excited to maximize and elevate their existing work.”\nThe early inspiration for this ecosystem and exploring a new academic unit track closely to a recommendation made several years ago by Georgia Tech’s Commission on Creating the Next in Education (CNE). Led in part by C21U, the two-year CNE exercise engaged more than 50 faculty, staff, and students, including Baker and Isbell, as well as other campus leadership and representatives from GTPE and CEISMC.\nIn 2018, the Commission released its report, Deliberate Innovation, Lifetime Education. The report envisioned continual engagement with learners, alignment with primary and secondary schools, flexible learning options, connectivity for learning beyond traditional college, and a network that supports learners all over the world.\n“Georgia Tech has a long history of investment in education outside of our traditional degree programs,” said Dean Charles Isbell. “The next step is to explore how we might leverage our experience and our resources to make even more of a difference for learners and employers across the state … and to lead the national conversation on where lifetime learning goes from here.”\nAdditional Images\nContact\nSusie Ivy, Director\nOrganizational, Academic and Research Communications\nEmail\nprovostsoffice@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}