{"text": "Creating Communities that Draw People and Business Under the New Workplace Model | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nCreating Communities that Draw People and Business Under the New Workplace Model\n56th Annual Basic Economic Development Course 2023 theme focuses on Placemaking and Economic Recovery\nFacebook\nTwitter\nEmail\nThe 2023 BEDC keynote speakers include Eric Kronberg, founder of Kronberg Urbanists Architects, and Elizabeth Ward Williams, the firm’s director of urban design.\nJun 27, 2023\nATLANTA —\nAs communities move past the effects of COVID-19 and the economic turmoil stemming from the pandemic, economic development professionals are fully engaged in recovery.\nThe\n56th Annual Georgia Tech Basic Economic Development Course\n(BEDC) will arm these professionals with the tools and strategies needed to maximize opportunity and potential for local communities in a four-day course from August 28-31. ( Register:\nhttp://tiny.cc/BEDC2023 )\nThe new realities of today’s workforce in a post-pandemic economy means communities must reimagine themselves in ways that make them more attractive to people as places to live and for businesses to operate.\nPresented by Georgia Tech’s\nEnterprise Innovation Institute\nin collaboration with the\nInternational Economic Development Council   and the  Georgia Economic Developers Association ,\nthis comprehensive course will explore the use of placemaking as an economic development tool to help professionals create quality places where people want to live and businesses believe they will thrive.\nThe 2023 theme is\nPlacemaking and Economic Recovery: Creating Communities Where People Want to Live and Businesses Want to Be.\nKeynote speakers include\nEric Kronberg , founder of\nKronberg Urbanists Architects , and\nElizabeth Ward Williams , that firm’s director of urban design.\n“We know the pandemic has changed the way we operate in a lot of ways with telecommuting and remote working being a fixed reality for business and job seekers,”\nsaid Alan Durham, BEDC course director. With work-from-home or hybrid commuting schedules the norm, communities need to rethink how they create strategies and make them more appealing to potential residents and business investments, he said.\n“Our course is designed to teach attendees how to maximize opportunities in this new reality. People aren’t moving to a given community simply to be closer to work if there’s no central office or even a requirement to go into one,” Durham said. “So, it’s imperative that officials looking to boost their communities’ economic development opportunities shift their thinking.”\nPart of that shift means focusing on strategies that create an attractive quality of life both for residents and business, plan for economic recovery and resilience, smart incentive packages, and other tools. Communities must also find creative ways to address the shortage of workforce and entry-level housing options.\nBEDC course speakers will address several topics over the four days that will help attendees capitalize on their communities’ unique assets and how they can effectively use and maximize placemaking as an economic development tool.\nAmong the course topics:\nWorkforce Housing Strategies\nBusiness Retention and Expansion\nReal Estate Development and Reuse\nBusiness Credit Analysis\nWorkforce Development\nStrategic Planning\nEconomic Impact and Incentives\nManaging Economic Development Organizations\nEthics in Economic Development\nSmall Business and Entrepreneur Development\nMarketing and Attraction\nDisaster Recovery and Resilience\nMedia Strategy\nThis four-day conference gives attendees opportunities to network with industry peers and experts, deeply explore the fundamentals and emerging concepts of comprehensive economic development and prepare them to immediately implement tools and skills gained during the course.\nSince its inception in 1967, the Georgia Tech BEDC has prepared more than 3,300 economic developers from all over the world for the  IEDC Certified Economic Developer\n(CEcD) Examination. The certification is considered an essential component of a career in economic development. BEDC at Georgia Tech is\naccredited by the IEDC and qualifies as a professional development training requirement needed to sit for the exam.\nAdditional Images\nRelated links\nGeorgia Tech Basic Economic Development Course\nContact\nPéralte C. Paul\n404.316.1210\nperalte@gatech.edu\nEmail\nperalte@gatech.edu\nAdditional information\nAbout the Enterprise Innovation Institute\nThe Enterprise Innovation Institute, the Georgia Institute of Technology’s economic development unit, serves all of Georgia through a variety of services and programs that build and scale startups, grow business enterprises and energize ecosystem builders. As the nation’s largest and most comprehensive university-based economic development organization, the Institute’s expertise and reach are global; its innovation, entrepreneurship, and ecosystem development programs serve governments, universities, nonprofits, and other organizations worldwide. In 2022, Enterprise Innovation Institute programs worked with 15,785 clients to create or save 13,891 jobs and secure $2.4 billion in capital investments. As a group, the Enterprise Innovation Institute helped generate an economic impact return of $422.55 for every dollar received from state appropriations in 2022. Learn more at\ninnovate.gatech.edu .\nAbout the Center for Economic Development Research (CEDR)\nThe Center for Economic Development Research (CEDR) is a unit of the Enterprise Innovation Institute at Georgia Tech with a mission to help communities and economic developers grow and thrive. CEDR, which manages the Basic Economic Development Course, uses in-depth of research, planning, and implementation experience along with resources across the broader Georgia Tech community to provide cutting edge solutions for the innovation economy. To learn more about CEDR and the services offered, please visit\ncedr.gatech.edu .\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}