{"text": "Surfaces That Grip Like Gecko Feet Could Be Easily Mass-Produced | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nSurfaces That Grip Like Gecko Feet Could Be Easily Mass-Produced\nThe science behind sticky gecko's feet lets these materials pick up about anything, and now they could be easily mass-produced.\nFacebook\nTwitter\nEmail\nThe inset on the upper right illustrates how the gecko adhesion surface is made by pushing lab razor blades into a setting polymer. The razor blades are pulled out, leaving indentations and stretching some of the polymer up, resulting in flexible walls that produce the gecko adhesion effect. Credit: Georgia Tech / Varenberg lab\nMay 07, 2020\n— Atlanta, GA\nWhy did the gecko climb the skyscraper? Because it could; its toes stick to about anything. Engineers can already emulate the secrets of gecko stickiness to make strips of rubbery materials that can pick up and release objects, but simple mass production for everyday use has been out of reach until now.\nResearchers at the Georgia Institute of Technology have developed,  in a new study , a method of making gecko-inspired adhesive materials that is much more cost-effective than current methods. It could enable mass production and the spread of the versatile gripping strips to manufacturing and homes.\nPolymers with “gecko adhesion” surfaces could be used to make extremely versatile grippers to pick up very different objects even on the same assembly line. They could make picture hanging easy by adhering to both the picture and the wall at the same time. Vacuum cleaner robots with gecko adhesion could someday scoot up tall buildings to clean facades.\n“With the exception of things like Teflon, it will adhere to anything. This is a clear advantage in manufacturing because we don’t have to prepare the gripper for specific surfaces we want to lift. Gecko-inspired adhesives can lift flat objects like boxes then turn around and lift curved objects like eggs and vegetables,” said Michael Varenberg, the study’s principal investigator and an  assistant professor in Georgia Tech’s George W. Woodruff School of Mechanical Engineering .\nCurrent grippers on assembly lines, such as clamps, magnets, and suction cups, can each lift limited ranges of objects. Grippers based on gecko-inspired surfaces, which are dry and contain no glue or goo, could replace many grippers or just fill in capability gaps left by other gripping mechanisms.\nDrawing out razors\nThe adhesion comes from protrusions a few hundred microns in size that often look like sections of short, floppy walls running parallel to each other across the material’s surface. How they work by mimicking geckos’ feet is explained below.\nUp to now, molding has produced these mesoscale walls by pouring ingredients onto a template, letting the mixture react and set to a flexible polymer then removing it from the mold. But the method is inconvenient.\n“Molding techniques are expensive and time-consuming processes. And there are issues with getting the gecko-like material to release from the template, which can disturb the quality of the attachment surface,” Varenberg said.\nThe researchers’ new method formed those walls by pouring ingredients onto a smooth surface instead of a mold, letting the polymer partially set then dipping rows of laboratory razor blades into it. The material set a little more around the blades, which were then drawn out, leaving behind micron-scale indentations surrounded by the desired walls.\nVarenberg and first author Jae-Kang Kim published details of their new method  in the journal  ACS Applied Materials & Interfaces  on April 6, 2020.\nForget about perfection\nThough the new method is easier than molding, developing it took a year of dipping, drawing, and readjusting while surveying finicky details under an electron microscope.\n“There are many parameters to control: Viscosity and temperature of the liquid; timing, speed, and distance of withdrawing the blades. We needed enough plasticity of the setting polymer to the blades to stretch the walls up, and not so much rigidity that would lead the walls to rip up,” Varenberg said.\nGecko-inspired surfaces have a fine topography on a micron-scale and sometimes even on a nanoscale, and surfaces made via molding are usually the most precise. But such perfection is unnecessary; the materials made with the new method did the job well and were also markedly robust.\n“Many researchers demonstrating gecko adhesion have to do it in a cleanroom in clean gear. Our system just plain works in normal settings. It is robust and simple, and I think it has good potential for use in industry and homes,” said Varenberg, who studies surfaces in nature to mimic their advantageous qualities in human-made materials.\n[Ready for graduate school with social distancing?  Here's how to apply to Georgia Tech. ]\nGecko foot fluff\nBehold the gecko’s foot. It has ridges on its toes, and this has led some in the past to think their feet stick by suction or some kind of clutching by the skin.\nBut electron microscopes reveal a deeper structure – spatula-shaped bristly fibrils protrude a few dozen microns long off those ridges. The fibrils make such thorough contact with surfaces down to the nanoscale that weak attractions between atoms on both sides appear to add up enormously to create overall strong adhesion.\nIn place of fluff, engineers have developed rows of shapes covering materials that produce the effect. A common shape makes a material’s surface look like a field of mushrooms that are a few hundred microns in size; another is rows of short walls like those in this study.\n“The mushroom patterns touch a surface, and they are attached straightaway, but detaching requires applying forces that can be disadvantageous. The wall-shaped projections require minor shear force like a tug or a gentle grab to generate adherence, but that is easy, and letting go of the object is uncomplicated, too,” Varenberg said.\nVarenberg’s research team used the drawing method to make walls with U-shaped spaces in between them and walls with V-shaped spaces in between. They worked with polyvinylsiloxane (PVS) and polyurethane (PU). The V-shape made in PVS worked best, but polyurethane is the better material for industry, so Vanenberg’s group will now work toward achieving the V-shape gecko gripping pattern in PU for the best possible combination.\nAlso read:\nLung-heart super sensor on a chi p tinier than a ladybug\nHere's how to  subscribe to our free science and technology email newsletter\nWriter & Media Representative : Ben Brumfield (404-272-2780), email:  ben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\nAdditional Images\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}