{"text": "Ellen Zegura Honored With Class of 1934 Distinguished Professor Award | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nEllen Zegura Honored With Class of 1934 Distinguished Professor Award\nPassion for new challenges and dedication to her role as a teacher have become hallmarks of Ellen Zegura’s career at Georgia Tech.\nFacebook\nTwitter\nEmail\nApr 13, 2023\nIn 1993, just three years after the founding of Georgia Tech’s College of Computing, Ellen Zegura arrived on campus.\nFresh from earning a doctorate in computer science at Washington University in St. Louis, Zegura arrived as the College’s third female faculty member. In her role with the networking and telecommunications group, Zegura’s work fell into a category of computing research that many would consider “more traditional” — but she never saw things through a traditional lens.\n“One of the things that really stands out to me from those early years is that the College very deliberately hired in a way that was pushing the boundaries of what people thought of as computing,” said Zegura. “They hired key faculty in traditional areas of research like mine but were intentional about also hiring people (like Amy Bruckman) who were thinking in creative and new ways about what computing could be.”\nFor the first 10 years of her career, Zegura focused on digging into the incredible amount of work expected of a new faculty member. In the early days of the College of Computing, it was not uncommon for computing faculty to be asked to step in to fill teaching gaps in areas that were not yet staffed up by new instructors. For example, Zegura was asked to teach a discrete math course even though that was outside of her research area. She jumped in wholeheartedly and ended up loving her work with the undergraduate students in the course — so much that she has returned today to teaching a discrete math course with more than 250 students.\nThis passion for new challenges and dedication to her role as a teacher have become hallmarks of Zegura’s career at Georgia Tech. It was also during the first 10 years of her faculty career that Zegura began to build her community at Tech — friendships that would transform her future.\n“The job is challenging. You’re prepared for some of it, but you’re not prepared for all of it. I really valued my faculty friends from the beginning because they became my critical support system. The people that you’re hired with become good friends. And especially later, when my kids were born and my colleagues’ kids were born, it was so important to have that community.”\nIt was during what Zegura sees as the second phase of her career when things became “surprising.” In 2002, she was asked to step in as interim dean of the College of Computing during the search for Dean Peter Freeman’s successor. Prior to this, she was asked to oversee space planning for the College during a critical growth period. These two new roles began what Zegura jokingly calls the “slippery slope of administration.”\nAfter Rich DeMillo was hired as the new dean, Zegura was asked to take on the role of associate dean during another transformative time in the life of the College. It was during that period that Schools were first formed within the College, and Zegura was named as the first chair of the School of Computer Science.\nDuring her time as chair, the Computing for Good collective was launched as a social good initiative consisting of Georgia Tech faculty, partners, and computer science students. Zegura, Santosh Vempala, and Michael Best created a computing course with a focus on issues of social justice, and the course was taught for eight years (and is still taught, in a different iteration, as part of today’s Online Master of Science in Computer Science program). These years were filled with impactful collaborations with programs like the Carter Center’s Mental Health Program in Liberia, which empowered students in the Computing for Good course to assist with software and support for a national monitoring program for mental health resources.\nZegura then moved to other methods for involving students in social good projects, including a six-year summer internship program called Civic Data Science, and, most recently, establishing a Vertically Integrated Projects (VIP) team called Bits of Good.\nShe served as the chair of the School of Computer Science until 2012. It was an exhilarating time, and it was also an incredibly busy time. At that point in Zegura’s career, she was ready for a well-deserved sabbatical.\nHer sabbatical year took a surprising turn when she decided to take one of Beki Grinter’s Human-Centered Computing courses. Grinter initially offered alternatives to Zegura taking the course alongside the other students. But Zegura persisted and showed up for class every Wednesday, completed all the assignments, and gained new knowledge to enhance her ability for expanded human-centered research consistent with social good.\nWhen the Quality Enhancement Plan for the Institute opened the call for topic proposals in 2014, Zegura collaborated with other faculty concerned about community activism and issues of social justice and put together a concept paper for what would ultimately become Georgia Tech’s Serve-Learn-Sustain program.\n“I had an itch to do research that was in line with my educational focus on computing for good,” said Zegura. “I discovered that there is a set of people at Tech who are interested in trying to help students work in their communities and bring value to their communities through that work. I wanted to discover how my research could further that goal.”\nWorking closely with program co-creator Beril Toktay, professor of operations management and the Brady Family Chairholder in the Scheller College of Business, Serve-Learn-Sustain proposed a path for Georgia Tech students to learn to create sustainable communities through engagement with content and context. Since its launch in 2016, the program has grown to encompass six Signature Programs that include a Sustainable Cities minor, the Sustainable Communities Summer Internship Program, the Innovating for Social Impact Program, RCE Greater Atlanta, and an array of events and workshops.\n“I really think the focus on sustainability and community engagement — those ideas were a bit ahead of their time. To be talking in 2014 [when this idea was first developed] about sustainability, climate change, the importance of community — that’s very much in the national conversation now, but it wasn’t as much at that time.”\nThen, seemingly just as Zegura was settling into a new phase of her work, which includes her current role as a Regents’ Professor and the Stephen Fleming Chair in the College of Computing, the Covid-19 pandemic hit.\n“I think we all went through something very challenging and unimaginable,\" said Zegura. “It changed things, and it’s going to take time to settle into a new version of how education works. I believe that learning has a significant social and community component — that's an idea that is central to my work. This [the pandemic] impacted all of that.”\nAs campus adjusted and sought a new normal, one thing that crystalized even further for Zegura is that internet access is directly related to issues of equity. As a result, one of her current projects involves creating an Android-based app to help tribal and other communities across the U.S. take network coverage measurements and have those measurements reported to the Federal Communications Commission. This ongoing Rockefeller Foundation-funded project is part of a process challenging a lack of cellular provider coverage.\nAs a researcher, Zegura has big ideas about exciting, impactful projects. As a teacher, she remains deeply passionate about her work with Georgia Tech students. As a woman in computing, she feels excited about the collective of female faculty who now lead in computing — and across campus. As only the second woman to receive Georgia Tech's Class of 1934 Distinguished Professor Award, she hopes she’ll see many more women awardees in the future.\n“I feel proud and grateful. I’m proud to receive this award, and I’m so grateful for my relationships with my students and collaborators over these 30 years,” she said. “I’m continually looking for ways to do something big, beyond my own research, and I’m excited for what’s to come for the future of my work.”\nSomething big is surely in Zegura’s future, but ask any of her colleagues or students, and they will assure you that something big has already been accomplished.\nQuotes From Colleagues\n“The field of computing often falls into the trap of focusing on advancing itself while neglecting its impact on society. Ellen is one of those educators who intentionally resists this trap, teaching her students to use their skills to solve problems in their own communities. She is teaching the next generation to think of computing holistically, as a major factor in social problems and solutions. Ellen is an innovative teacher who cares deeply, and I am glad to see her recognized for it.” - Charles Isbell, Dean of the College of Computing and John P. Imlay Jr. Chair\n“Ellen's technical excellence and passion for contributing to societal good have made her a role model for many faculty in our School and College. Her research achievements in networking include the development of an influential internet topology model and the foundations of Software-Defined Networking. Her dedication to teaching is evidenced by the fact that she has taught classes at every level (from 1000 to 8000) and created a unique course on Technology and Sustainable Community Development (SLS 3110) as part of Georgia Tech's Serve-Learn-Sustain QEP. Her internal and external service and leadership have been exemplary, including serving as chair of the Computing Research Association board, an organization that represents all Ph.D.-granting computer science departments in the U.S. It is truly a joy to see Ellen receive this well-deserved recognition.” - Vivek Sarkar, Chair of the School of Computer Science and Stephen Fleming Chair in Telecommunications in the College of Computing\n“Ellen Zegura has been an ally and advocate for women in the College of Computing for the 17 years that I have known her. She is someone who has a vision and expedites it. We are all better off for having her in our community!” - Rosa Arriaga, Associate Professor and Associate Chair of Graduate Studies, School of Interactive Computing\n“Ellen has often mentioned that, while on leave, she took a class from me. Obviously, she was a fantastic student, and I was delighted to have her be part of a community of scholars all focused on human-centered computing. Since then, her research has continued to balance a deep knowledge of the fundamentals of how technology works, with a constant attention to the people who will have that computing experience. It’s a very impressive balancing act that she has managed for many years now. On a more personal note, Ellen has been a mentor and friend to me ever since I arrived at Georgia Tech. Her leadership has been a major inspiration to me, and I'm thrilled that she’s won this award. Thank you, Ellen!\" - Beki Grinter, Professor and Associate Dean for Faculty Development, School of Interactive Computing\n“As an advisor and mentor, Ellen is unrivaled. Her decades of experience in networking research, her visionary ability to apply computing to under-supported social problems, and her warm, fun-loving personality make every conversation with her transformative. If I acquire but a small fraction of her skills — working across disciplines to address pressing challenges and create sustainable partnerships — while studying under her, I will be thrilled.\" -Eric Greenlee, Computer Science Ph.D. Student\nAdditional Images\nRelated links\nRecipients of the Class of 1934 Distinguished Professor Award at Georgia Tech\nContact\nBrittany Aiello\nFaculty Communications Program Manager\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}