{"text": "State-of-the-Art Filming Studio Coming Soon to Savannah Area | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nState-of-the-Art Filming Studio Coming Soon to Savannah Area\nThis project aims to bolster economic and workforce development in the local area as well as the state of Georgia.\nFacebook\nTwitter\nEmail\nOct 08, 2021\n— Atlanta, GA\nGeorgia Advanced Technology Ventures Inc. (GATV), an affiliate organization of the Georgia Institute of Technology, is moving forward with the selection of a qualified development team to advance the creation of a major hub for film and TV productions within the Savannah region. This project aims to bolster economic and workforce development in the local area as well as the state of Georgia.\n“We are excited to be entering the next phase of this very impactful project for the state of Georgia,” said Tony Zivalich, associate vice president for Real Estate Development at Georgia Tech. “This represents an unprecedented opportunity to partner with several key stakeholders to repurpose underutilized assets that will support economic growth for the state and specifically the coastal region of Georgia to advance Georgia’s emerging leadership position in the film industry.”\nGeorgia’s film industry has experienced exponential growth for more than 10 years, making the state one of the top filming locations in the industry. In fiscal year 2021, Georgia hosted 366 film productions including 21 feature films, 45 independent films, 222 television series, 57 commercials, and 21 music videos, resulting in a record $4 billion invested in the state by the film industry.\nSavannah has captured a significant amount of production-related activity in Georgia. However, a shortage of purpose-built, scalable soundstages and production facilities has hindered the region’s ability to support this economic growth. Subject to approval from the University System of Georgia (USG) Board of Regents, the redevelopment of the current 52-acre Georgia Tech-Savannah campus and adjacent property owned by the Savannah Economic Development Authority (SEDA) will provide much needed high-tech facilities to further attract industry and support local workforce development. Furthermore, the project aims to identify programs and initiatives to facilitate diversity, equity, and inclusion in both procurement and staffing — in addition to demonstrating sustainability in design and construction.\nThis project is a collaborative effort between the USG Board of Regents, Georgia Film Academy, SEDA, and GATV. Currently, Georgia Tech’s Savannah campus occupies a portion of the land and anticipates relocating its programs to the downtown Savannah area as the project moves forward.\n“The Georgia Film Academy is delighted to be a part of this project, which will advance film and television production in the Savannah region and provide good long-term jobs for the Georgians we are committed to serving,” said Jeffrey Stepakoff, executive director of the Georgia Film Academy. “Students we will train from the state’s universities and technical colleges in the region will be ready to provide the sustainable workforce that this new world-class production hub will need.”\nIt is anticipated that redevelopment of the land to create this production hub will begin in 2022. Plans are to build out several soundstages, multiple production and workforce training facilities, as well as industry and vendor accommodations.\nAbout the Georgia Institute of Technology\nThe Georgia Institute of Technology, or Georgia Tech ,\nis a top 10 public research university developing leaders who advance technology and improve the human condition.\nThe Institute offers business, computing, design, engineering, liberal arts, and sciences degrees. Its nearly 40,000 students, representing 50 states and 149 countries, study at the main campus in Atlanta, at campuses in France and China, and through distance and online learning.\nAs a leading technological university, Georgia Tech is an engine of economic development for Georgia, the Southeast, and the nation, conducting more than $1 billion in research annually for government, industry, and society.\nAbout Georgia Advanced Technology Ventures Inc.\nGeorgia Advanced Technology Ventures Inc. (GATV) is a legally separate, not-for-profit corporation that is organized and operated exclusively as a supporting organization to and for the benefit of the Georgia Institute of Technology.\nGATV’s primary business purpose is to facilitate innovation and business collaboration with private enterprise, including, but not limited to, business, industry, entrepreneurs, and economic developers, and utilizing emerging technologies that are aligned with the strengths in research and education of Georgia Tech.\nGATV provides support for technology transfer and economic development activities, including the Institute’s Advanced Technology Development Center (ATDC) incubator facilities and services to ATDC-affiliated companies.\nAbout Savannah Economic Development   Authority\nThe Savannah Economic Development Authority’s mission is to help create, grow and attract new job opportunities and investment in the Savannah region. Whether a business is looking to relocate or an existing business is ready to grow, SEDA is the centrifuge of a propeller, making the connections, propelling the business to success. An independently funded organization, SEDA acts in the best interest of both the client and the community.\nAbout Georgia Film Academy\nThe Georgia Film Academy (GFA) is a collaboration of the University System of Georgia and the Technical College System of Georgia created by state leadership to meet education and workforce needs for high demand careers in Georgia’s film and creative industries.\nGFA classes are offered for college credit through more than 20 University System of Georgia and Technical College System of Georgia partner institutions. Classes may also be taken through continuing education programs at several partner institutions. The GFA higher education program offers rigorous professional training, and may lead to union-covered film and television production craft internships and placement in creative industry apprenticeships and jobs.\nThe GFA provides professional training in the form of post production education and AVID editing certification. The GFA also offers high school teacher training in production, content creation, and post production, in partnership with the GaDOE. These provide professional film and television experiences and training, as well as curriculum and resources for teachers across the state.\nAdditional Images\nContact\nFor Media Inquiries Contact:\nBlair Meeks\nAssistant Vice President of External Communications\nGeorgia Institute of Technology wmeeks7@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}