{"text": "Molten Storage and Thermophotovoltaics Offer New Solar Power Pathway | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMolten Storage and Thermophotovoltaics Offer New Solar Power Pathway\nThermophotovoltaic technology could directly convert heat from solar thermal to electricity.\nFacebook\nTwitter\nEmail\nResearchers in the laboratory of Asegun Henry at Georgia Tech are developing a thermal storage system that uses liquid tin as a transport fluid. The storage medium itself would be metallurgical grade silicon or an aluminum silicon alloy, which is much more cost effective. The technology they have developed could help increase the efficiency of energy systems based on concentrated solar thermal energy. (Credit: Rob Felt, Georgia Tech)\nJul 27, 2016\n— Atlanta, GA\nA new wrinkle on an old technology – solid-state thermophotovoltaics (TPV) – could provide a high-efficiency alternative for directly converting high-temperature heat from concentrated solar thermal to utility-scale electricity. New computer modeling suggests that high temperature TPV conversion – which captures infrared radiation from very hot surfaces – could one day rival combined-cycle turbine systems when combined with thermal storage using liquid metal at temperatures around 1,300 degrees Celsius. Advances in high-temperature components and improved system modeling, combined with the potential for conversion costs an order of magnitude lower than those of turbines, suggest that TPV could offer a pathway for efficiently storing and producing electrical power from solar thermal sources, a new study suggests. The underlying technologies of high temperature storage and thermophotovoltaic conversion could also be used to produce grid-scale batteries able to rapidly supplement other power sources by storing heat for quick conversion to electricity. The research, supported by ARPA-E, was reported July 4 in the journal\nEnergy and Environmental Science\nby researchers at the Georgia Institute of Technology. “The goal for our study was to provide a heat transfer and thermodynamic perspective on a system that combines concentrated solar power (CSP) with thermal storage and TPV to show that such a system is worthy of renewed attention,” said\nAsegun Henry , an assistant professor in the\nGeorge W. Woodruff School of Mechanical Engineering\nat Georgia Tech. “In the context of the full system, we suggest that the efficiency could one day rival the best heat engines available on planet today.” TPV operates on the same principle as solar cells in wide use today, but converts photons at infrared wavelengths rather than those in the visible spectrum. Infrared is the predominant kind of heat and light emitted by heaters that glow red-hot. Most research reported in the energy literature suggests that the conversion rate of TPV would be less than 20 percent, not competitive with other heat engines. But Henry believes those calculations do not properly consider the conversion wavelengths or account for efficiencies possible when the full heat delivery system is considered. “The entire system could be quite efficient if we understand where the heat is flowing and design appropriately,” Henry said. “We believe there is a pathway to make these TPV cells an order of magnitude cheaper than turbines for converting thermal energy to electricity.” The heat would be supplied by a CSP system collecting the sun’s thermal energy using reflectors. The heat would be used to melt silicon, which could be stored in large insulated reservoirs until needed; the heat would then be released as the silicon solidifies. By moving the TPV cells when their power isn’t needed, the system could be rapidly switched on and off to supplement electricity from wind or direct solar PV sources, Henry said. “It’s the dream of utility companies to have a resource that could go from zero to full power in a matter of seconds,” he said. “With the right insulation and shading of the cells, we could switch them on and off faster than any other conversion technology.” The critical challenge to making renewable energy competitive with fossil fuels at the utility scale is making the electricity dispatchable. The cost advantages of thermal storage over electrochemical storage also make a TPV with thermal energy storage (TES) system attractive for converting and storing energy for use on the grid, said Hamid Reza Seyf, a graduate research assistant who did the system modeling. “We are combining the great economic advantages of TES with the potential for low cost and high performance derived from TPV cells fabricated on reusable substrates, with high reflectivity back reflectors for photon recycling,” he said. “If solar energy is produced and not needed, you could use it to produce thermal energy that could be stored and discharged to TPV power block when needed. The extremely long lifetimes, high round-trip efficiency, and low cost of the thermal storage compared to electrochemical batteries make the TES very attractive.” If the TPV power block could be made 60 percent efficient, it could compete with most cost effective and efficient heat engine that has ever been achieved commercially, which is accomplished through a tandem turbine based cycle. The cost of turbines is well established and unlikely to see significant decrease, hence the only way to reduce their cost is by increasing their efficiency. However, because current turbines are extremely efficient and operate near their thermodynamic limit, there is little room for efficiency enhancement. TPV power block not only has the potential for lowering the cost but also has much more room for efficiency improvement, Seyf said. The computational model shows that a TPV system coupled with concentrated solar and storage could be as much as 65 percent efficient. But attaining that would require a long-term research initiative. In their model, the group studied the effects of a silver-based back surface reflector (BSR) to bounce unused light back to the emitter. The study quantified the importance of the BSR reflectivity to the overall system performance. Henry’s research group has recently demonstrated pumps, storage containers and other components that can operate at extreme temperatures of 1,300 degrees Celsius and above. The researchers hope their new paper encourages others to pursue TPV improvements – including fabrication of TPV cells on reusable substrates – that could lead to development of real-world systems at costs competitive with fossil fuels. “My hope is that this paper will help bring together the thermophotovoltaics and PV community with the CSP community to realize that the thermal and PV system takes advantage of both sides,” said Henry. “This is a heat engine that realistically may have a shot at beating the current record. This is a completely different technology, and there is a lot of research yet to be done.” This project was supported by DOE ARPA-E, grant number DEAR0000339. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the author(s) and do not necessarily reflect the views of the sponsor. CITATION : Hamid Reza Seyf and Asegun Henry, “Thermophotovoltaics: A Potential Pathway to High Efficiency Concentrated Solar Power,” (Energy & Environmental Science, 2016).\nhttp://dx.doi.org/10.1039/c6ee01372d Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contacts : John Toon ( jtoon@gatech.edu ) (404-894-6986) or Ben Brumfield ( ben.brumfield@comm.gatech.edu ) (404-385-1933). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}