{"text": "Thinning Ice Sheets May Drive Sharp Rise in Subglacial Waters | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nThinning Ice Sheets May Drive Sharp Rise in Subglacial Waters\nUp to twice the amount of subglacial water that was originally predicted might be draining into the ocean – potentially increasing glacial melt, sea level rise, and biological disturbances.\nFacebook\nTwitter\nEmail\nAug 21, 2023\nTwo\nGeorgia Tech\nresearchers,\nAlex Robel\nand\nShi Joyce Sim , have collaborated on a new model for how water moves under glaciers. The new theory shows that up to twice the amount of subglacial water that was originally predicted might be draining into the ocean – potentially increasing glacial melt, sea level rise, and biological disturbances.\nThe paper,\npublished in\nScience Advances ,\n“Contemporary Ice Sheet Thinning Drives Subglacial Groundwater Exfiltration with Potential Feedbacks on Glacier Flow,” is co-authored by\nColin Meyer\n( Dartmouth ),\nMatthew Siegfried\n( Colorado School of Mines ), and\nChloe Gustafson\n( USGS ).\nWhile there are pre-existing methods to understand subglacial flow, these techniques involve time-consuming computations. In contrast, Robel and Sim developed a simple equation, which can predict how fast exfiltration, the discharge of groundwater from aquifers under ice sheets, using satellite measurements of Antarctica from the last two decades.\n“In mathematical parlance, you would say we have a closed form solution,” explains Robel, an assistant professor in the\nSchool of Earth and Atmospheric Sciences . “Previously, people would run a hydromechanical model, which would have to be applied at every point under Antarctica, and then run forward over a long time period.” Since the researchers’ new theory is a mathematically simple equation, rather than a model, “the entirety of our prediction can be done in a fraction of a second on a laptop,” Robel says.\nRobel adds that while there is precedence for developing these kinds of theories for similar kinds of models, this theory is specific in that it is for the particular boundary conditions and other conditions that exist underneath ice sheets. “This is, to our knowledge, the first mathematically simple theory which describes the exfiltration and infiltration underneath ice sheets.”\n“It's really nice whenever you can get a very simple model to describe a process — and then be able to predict what might happen, especially using the rich data that we have today. It’s incredible” adds Sim, a research scientist in the\nSchool of Earth and Atmospheric Sciences . “Seeing the results was pretty surprising.”\nOne of the main arguments in the paper underscores the potentially large source of subglacial water — possibly up to double the amount previously thought — that could be affecting how quickly glacial ice flows and how quickly the ice melts at its base. Robel and Sim hope that the predictions made possible by this theory can be incorporated into ice sheet models that scientists use to predict future ice sheet change and sea level rise.\nA dangerous feedback cycle\nAquifers are underground areas of porous rock or sediment rich in groundwater. “If you take weight off aquifers like there are under large parts of Antarctica, water will start flowing out of the sediment,” Robel explains, referencing a diagram Sim created. While this process, known as exfiltration, has been studied previously, focus has been on the long time scales of interglacial cycles, which cover tens of thousands of years.\nThere has been less work on modern ice sheets, especially on how quickly exfiltration might be occurring under the thinning parts of the current-day Antarctic ice sheet. However, using recent satellite data and their new theory, the team has been able to predict what exfiltration might look like under those modern ice sheets.\n“There's a wide range of possible predictions,” Robel explains. “But within that range of predictions there is the very real possibility that groundwater may be flowing out of the aquifer at a speed that would make it a majority, or close to a majority of the water that is underneath the ice sheet.”\nIf those parameters are correct, that would mean there's twice as much water coming into the subglacial interface than previous estimates assumed.\nIce sheets act like a blanket, sitting over the warm earth and trapping heat on the bottom, away from Antarctica’s cold atmosphere — and this means that the warmest place in the Antarctic ice sheet is at the bottom of a sheet, not on the surface. As an ice sheet thins, the warmer underground water can exfiltrate more readily, and this heat gradient can accelerate the melting that an ice sheet experiences.\n“When the atmosphere warms up, it takes tens of thousands of years for that signal to diffuse through an ice sheet of the size, of the thickness, of the Antarctic ice sheet,” Robel explains. “But this process of exfiltration is a response to the already-ongoing thinning of the ice sheet, and it's an immediate response right now.”\nBroad implications\nBeyond sea level rise, this additional exfiltration and melt has other implications. Some of the places of richest marine productivity in the world occur off the coast of Antarctica, and being able to better predict exfiltration and melt could help marine biologists better understand where marine productivity is occurring, and how it might change in the future.\nRobel also hopes this work will open the doorway to more collaborations with groundwater hydrologists who may be able to apply their expertise to ice sheet dynamics, while Sim underscores the need for more fieldwork.\n“Getting the experimentalists and observationalists interested in trying to help us better constrain some of the properties of these water-laden sediments — that would be very helpful,” Sim says. “That's our largest unknown at this point, and it heavily influences the results.”\n“It's really interesting how there's a potential to draw heat from deeper in the system,” she adds. “There's quite a lot of water that could be drawing more heat out, and I think that there's a heat budget there that could be interesting to look at.”\nMoving forward, collaboration will continue to be key. “I really enjoyed talking to Joyce (Sim) about these problems,” Rober says, “because Joyce is an expert on heat flow and porous flow in the Earth's interior, and those are problems that I had not worked on before. That was kind of a nice aspect of this collaboration. We were able to bridge these two areas that she works on and that I work on.”\nDOI:\ndoi.org/10.1126/sciadv.adh3693\nFunding:\nThis work was supported by startup funds from the Georgia Tech Research Corporation (A.A.R. and S.J.S.) and NASA grant 80NSSC21K0912 (M.R.S.). Alex Robel (A.A.R.) is also the recipient of a\nNational Science Foundation CAREER grant .\nAdditional Media\nRelated links\nRobel Awarded NSF CAREER Grant for New Ice Melt Modeling Tool\nTurning the Tide on Climate Change\nSeawater Seep May Be Speeding Glacier Melt, Sea Level Rise\nCoastal Glacier Retreat Linked to Climate Change\nExploring a Greenland Glacier Reservoir, Plumbing Sea Level Rise Uncertainties\nContact\nBy: Selena Langner\nMedia Contact:\nJess Hunt-Ralston\nAbout the photos: Images of Change\nGlaciers are shrinking along western Antarctica, and NASA is documenting the melt.\nExplore and toggle satellite images\nwith the NASA Earth Observatory.\nEmail\njess@cos.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}