{"text": "Yes, Computing Genetic Ancestors is Super Accurate | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nYes, Computing Genetic Ancestors is Super Accurate\nFor two decades, geneticists have been using computer simulations to reconstruct genes and proteins millions of years old. But do their algorithms really work? A new study says: Yes, and how!\nFacebook\nTwitter\nEmail\nA fluoriscing protein changes color to indicate when it undergoes stronger mutations. This allows researchers to more easily sort lab bacteria by protein mutation. Credit: Georgia Tech / Rob Felt\nSep 15, 2016\n— Atlanta, GA\nRemnants of extinct monkeys are hiding inside you, along with those of lizards, jellyfish and other animals. Your DNA is built upon gene fragments from primal ancestors.\nNow researchers at the Georgia Institute of Technology have made it more likely that ancestral genes, along with ancestral proteins, can be confidently identified and reconstructed. They have benchmarked a vital tool that would seem nearly impossible to benchmark. The newly won confidence in the tool could also help scientists compute ancient gene sequences and use them to synthesize better proteins to battle diseases.\nFor some 20 years, scientists have used algorithms to compute their way hundreds of millions of years back into the evolutionary past. Starting with present-day gene sequences, they perform what’s called ancestral sequence reconstruction (ASR) to determine past mutations and figure out the genes’ primal forerunners.\n“With the help of ASR, we can now actually build those ancient genes in the laboratory and express their encoded ancient proteins,” said  Eric Gaucher, an associate professor at Georgia Tech’s School of Biological Sciences . In a separate project, his lab is computing ancient proteins that were very effective in blood clotting 80 million years ago,\nin hopes of using them to fight hemophilia\ntoday.\nThat protein comes from a common ancestor humans share with rats.\nTime travel substitute\nBut ASR algorithms have faced logical criticism. Species based on those primal genes are long extinct, and scientists can’t travel back in time to observe mutations that have happened since. So, how can anyone find any physical benchmark to verify and gauge ASR?\nA team of researchers led by Gaucher did it by building an evolutionary framework out of myriad mutations. Then they benchmarked ASR algorithms against it – no time machine required. Their results have shored up confidence that the widely used algorithms are working as they should.\n“Most of them did a very good job – 98% accurate,” Gaucher said of contemporary algorithms’ ability to compute ancient gene sequences. Their determination of proteins encoded by those sequences was virtually perfect.\nGaucher, research coordinator Ryan Randall and undergraduate student Caelan Radford published their results on Thursday, September 15, 2016,\nin the journal\nNature Communications .\nTheir research has been funded by the NASA Exobiology program, E.I. du Pont de Nemours and Company (DuPont) and the National Science Foundation.\nHolographic tree branches\nAncestral sequence reconstruction is like making a family tree for genes.\nThe many twigs and branches at the treetop would be sequences from species alive today. Shimmying down the tree, called a phylogeny in genetics, you would find their common ancestors, millions of years old, in the lower branches.\nThere’s a caveat; none of the lower branches exist any longer. They vanished in the extinction of the species bearing those genetic sequences.\nASR computes them back into place using algorithms based on scientific models of evolution. It’s like replacing missing branches with holographic duplicates.\nAlgorithm horse race\nThe accuracy of those evolutionary models has been a historic sticking point. And doubts about the algorithms based on them linger in some circles that hold on to an old, tried-and-true algorithm.\nSo, Gaucher and researcher coordinator Randall pitted the contemporary model-based, or “maximum likelihood,” algorithms in a race against the generic, or “parsimony,” algorithm.\n“Parsimony follows the simplest notion of evolution, which is that very little mutation occurs,” Randall said. The models behind contemporary “maximum likelihood” algorithms, by contrast, are laced with filigree, data-packed details.\nFor the race, Randall made a track of sorts by putting a gene sequence that made a single protein through multiple mutations to construct a real-life phylogeny. She used methods that closely mimicked natural evolution, but that were much, much faster.\nRainbow phylogeny racetrack\nIn cells, enzymes called polymerases aid in DNA duplication.  They work very efficiently, but their rare mistakes are the most common source of mutations, and Randall took her lead from this.\n“We used a polymerase that is error-prone to speed up mutations, and speed up evolution,” she said.\nThe genes used at the starting point of the lab evolution made a protein that fluoresced red when placed in bacteria.  As significant mutations arose, the proteins began changing color.  Bacteria containing green fluorescing proteins popped up among the red ones.\nRandall divided bacteria with major mutations into new groups, creating branches in the phylogeny, as she went. Many mutations produced new colors – yellow, orange, blue, pink – and Randall ended up with a gene family tree in rainbow colors.\nShow me the phenotype\nThe colors reflected not only new gene sequences but also new phenotypes – the actual proteins they produced, the organism’s working molecules.\n“What counts is phenotype,” Gaucher said. “When you analyze DNA strictly by itself, it ignores the context, in which that DNA is connected to phenotype,” he said.\nDNA can mutate and still encode the same amino acids, protein’s component parts. Then the mutation has no real effect. But when mutations cause DNA to encode different amino acids, they’re more significant.\nA worthy test of ancestral sequence reconstruction algorithms must therefore include phenotype. And Randall took this into account when she selected mutated proteins.\n“I selected for variants to purposely make it hard on the algorithms to infer the phenotypes,” she said. The race ensued, and the algorithms got limited information to infer the evolutionary tree’s many dozens of past mutations.\nASR a sure bet\nThough the tried-and-true parsimony algorithm performed well, maximum likelihood performed better.  “Even though it got the same number of residues (DNA sequences) wrong as parsimony, the incorrectly inferred sequences were still more likely to encode the right phenotypes,” said undergraduate student Caelan Radford, who analyzed the experiment’s statistics.\nThe margin of error was so tiny that it would not interfere in the determination of past species.\nThe experiment’s outcome was not too surprising, because prior simulations had predicted it.  But the researchers wanted the scientific community to have physical proof that feels trustier than proof from a computer.  “It’s a computer algorithm.  It will do what you will tell it to do,” Gaucher said.\nShort history of ASR\nDoubts about ancestral sequence reconstruction -- and maximum likelihood algorithms in particular -- go far back.  The idea of performing ASR first came up in 1963, but it didn’t get started until the 1990s, and back then, researchers battled fervently over wide-ranging methods.\n“People would come up with the craziest notion as to why one model was best,” Gaucher said. “They’d say, ‘Well, if I simulate this weird mode of evolution along these branches here, my algorithm will work better than your algorithm.’”\nThe parsimony algorithm was a way of reigning in the chaos that grew out of a lack of data in evolutionary models at the time.  “When the model is wrong, ‘maximum likelihood’ fails miserably,” Gaucher said.\nBut, now, a host of data and analysis give scientists a great picture of how evolution works (and it’s not a parsimony principle): For ages, nothing moves, then change bursts forth, then things stabilize again.\n“You get this quick evolution, so lots of stuff works and lots of stuff fails, and the stuff that works then goes on and kind of maintains its status and doesn’t change,” Gaucher said.  By confirming the high accuracy of the algorithms, the Georgia Tech team has also corroborated the validity of current evolutionary science they’re based on.\nKelsey Roof and Divya Natarajan of Georgia Tech coauthored the paper. Research was funded the NASA Exobiology program (grant number NNX12AI10G), DuPont (Young Professor Award) and the National Science Foundation (grant number 1145698). Any opinions, findings and conclusions or recommendations expressed in this material are those of the author(s) and do not necessarily reflect the views of the sponsoring agencies.\nRead more exciting science and technology research news at Research Horizons\nAdditional Images\nContact\nWriter and contact: Ben Brumfield\nResearch News\n(404) 660-1408\nEmail\nben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}