{"text": "An Animal That “Flies” through the Ocean | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nAn Animal That “Flies” through the Ocean\nSmall zooplankton snails don't paddle like most small water animals. They \"fly\" with wings.\nFacebook\nTwitter\nEmail\nSea butterflies, or Limacina helicina, is a zooplankton snail that lives in cold oceans.\nFeb 18, 2016\n— Atlanta, GA\nIt turns out that the sea butterfly ( Limacina helicina ), a zooplankton snail that lives in cold oceans, lives up to its name. Georgia Institute of Technology researchers went to the Pacific Ocean to scoop up hundreds of the 3-millimeter marine mollusks (pteropods) and then used high-speed cameras to watch how they move. They found that sea butterflies don’t paddle like most small water animals. Instead, they’re like flying insects, flapping their wings to produce lift and propel them through the water.\n“Snails evolutionarily diverged from flying insects 550 million years ago,” said\nDonald Webster , a professor in Georgia Tech’s School of Civil and Environmental Engineering. “Hence, it is amazing that marine snails are using the same figure-eight wing pattern that is typical of their very distant airborne relatives.”\nAnother amazing similarity between the pteropods and insects is the use of a clap-and-fling wing motion. Each species claps its wings together, then rapidly flings them apart to generate enhanced lift.\n“Almost all other plankton use their appendages as paddles, kind of like a turtle,” said David Murphy, who led the study and received his Georgia Tech doctoral degree in 2012.  “Sea butterflies are honorary insects.”\nMurphy is now a postdoctoral fellow at Johns Hopkins University.\nThe team did find one major difference in sea butterflies and flying insects. Nearly two-thirds of the plankton’s body is its shell. When it’s not moving forward, it sinks to the ocean floor. To avoid sinking, the pteropod rotates its body up to 60 degrees with each stroke. The rotation puts its wings in the proper position to flap downward during every half-stroke (about 10 times per second) and move in an upward, zig-zag path in the water.\n“Insects and birds don’t typically rotate their bodies in a similar manner to generate lift,” said Webster. “By rotating their shell during each stroke, sea butterflies put their wings in a position to always generate upward thrust and fly forward.”\nThe researchers study the plankton for two reasons. First, they play a vital role in the food web in the Pacific, Arctic and Southern Oceans. Fish, seals and sea birds eat them in massive quantities. Second, absorption of carbon dioxide increases the acidity of the oceans. As carbon dioxide levels increase in the future, so will seawater acidity, which breaks down the shells of pteropods. The Georgia Tech team wanted to better understand how they moved. The next steps in the research are seeing how changes in both shell composition and fluid viscosity affect its ability to rotate its body and “fly” upward.\nCivil Engineering Postdoctoral Fellow Deepak Adhikari and School of Biology Professor Jeannette Yen also co-authored the research paper.\nThey both traveled to Antarctica\nin 2014, in part, to study pteropods, which grow as large as six millimeters in the frigid Southern Ocean.\nIn addition to better understanding the biomechanics of the animal’s movement, the team thinks their findings could someday help engineers build miniature autonomous robots that swim in the ocean.\nThe study, “Underwater flight by the planktonic sea butterfly,” is published in the current issue of the\nJournal of Experimental Biology .\nAdditional Images\nRelated links\nRead the study\nSchool of Civil and Environmental Engineering\nRead the Full Feature Story\nContact\nJason Maderer\nNational Media Relations\n404-660-2926 maderer@gatech.edu\nEmail\nmaderer@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}