{"text": "New technology tracks tiniest pollutants in real time | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNew technology tracks tiniest pollutants in real time\nA team of six faculty members at the Georgia Institute of Technology has been awarded a Major Research Instrumentation (MRI) Program grant from the National Science Foundation (NSF) for air pollution research.\nFacebook\nTwitter\nEmail\nSep 25, 2014\n— Atlanta, GA\nResearchers may soon have a better idea of how tiny particles of pollution are formed in the atmosphere. These particles, called aerosols, or particulate matter (PM), are hazardous to human health and contribute to climate change, but researchers know little about how their properties are shaped by chemical reactions in the atmosphere. Unraveling this chemistry could someday lead to more effective policies to protect human health and the Earth’s climate.   A team of six faculty members at the Georgia Institute of Technology has been awarded a Major Research Instrumentation (MRI) Program grant from the National Science Foundation (NSF). The award, totaling approximately $700,000 from NSF and Georgia Tech’s office of the Executive Vice President for Research, will allow the research team to purchase a state-of-art, gas-particle high resolution mass spectrometer that can identify the components of gases and aerosol particles in real time. “It’s a dream instrument,” said\nNga Lee (Sally) Ng , principal investigator of the NSF award and an assistant professor in Georgia Tech’s School of Chemical and Biomolecular Engineering and School of Earth and Atmospheric Sciences. “It gives us real-time, molecular-level information both in the gas and the particle phase, simultaneously. It’s a very powerful instrument to let us learn about the detailed composition of these nanoparticles.” This NSF program serves to increase access to shared scientific and engineering instruments for research and research training in U.S. institutions of higher education and other centers for scientific research. The NSF program assists with the acquisition or development of a shared research instrument that is too costly or not appropriate for support through other NSF programs. Georgia Tech has a large group of people working on unraveling the complex chemistry of atmospheric pollutants. The new award was the product of teamwork involving multiple groups from Chemical and Biomolecular Engineering, Earth and Atmospheric Sciences, and Civil and Environmental Engineering, including Greg Huey, chair and professor; Athanasios Nenes, professor; Rodney Weber, professor; Armistead Russell, professor; and Michael Bergin, professor. The team members are all leaders in their respective disciplines and have been at the forefront of developing instrumentation and modeling tools for addressing science and policy questions around atmospheric trace gases, aerosols, clouds, climate, and air quality. Particulate matter less than 2.5 micrometers (PM 2.5 ) is hazardous to human health because it is inhaled and becomes lodged in tissue deep within the lung, causing respiratory illnesses. PM 2.5\nis blamed for millions of premature deaths every year. In 2013, the World Health Organization has categorized particulate matter as carcinogenic. Aerosol particles can be naturally occurring or man-made, such as soot from diesel truck. The particles, depending on their make-up, can absorb light and warm the Earth or reflect light and cool the Earth. Aerosols also seed the formation of clouds, which can affect the radiation balance. In certain environments, emissions from human activities can affect the amount of aerosols generated from natural sources, further complicating the picture. Particulate matter is so complex that researchers still are not sure which particulates are bad for human health or the climate. The particulates that people breathe are the products of complex chemical reactions in the atmosphere. The new mass spectrometer will identify in real time the molecular composition of these end products so that researchers can tease apart the mechanisms of how they are formed in the air. “We’re talking about sub-micron particles and that consist of hundreds or thousands of compounds, but we don’t know exactly what they are made of,” Ng said. “Now this instrument will give us molecular-level detail in real time. “ The instrument will be housed in Georgia Tech’s Ford Environmental Science & Technology Building for use by researchers across campus. The device will also be carried into the field to study air pollution both in Atlanta and around the world. Ng’s lab already has a\none-of-a-kind aerosol research space , which she designed and built. The Georgia Tech Environmental Chamber facility (GTIC) is a 21x12 foot climate-controlled enclosure that mimics the outside environment inside the lab. It houses two flexible Teflon chambers suspended from the ceiling, which are surrounded by both UV lamps and fluorescent lamps producing light at the frequency of sunshine. Also at Georgia Tech is a U.S. Environmental Protection Agency (EPA) Clean Air Research Center, the\nSoutheastern Center for Air Pollution and Epidemiology (SCAPE) , a collaborative effort with Emory University that has received $8 million in funding for five years. The MRI award will bolster Georgia Tech’s emerging reputation as a hub of clean air research, Ng said. Russell adds, “Our group has made important advances at understanding the links between specific types of compounds and health impacts, but we have been stymied at looking at the detailed molecular structure of air pollutant mixtures, and that is the type of information that we can use to identify policies to effectively reduce adverse health effects.” “The idea is that the chamber facility and this MRI award along with the EPA center will catalyze bringing researchers together so that we can do something bigger,” Ng said. “In the future, when people think, ‘I’d like to do aerosol, climate, or air quality research,’ they’ll want to come to Georgia Tech.” This research is supported by the National Science Foundation under award number\n1428738 . Any conclusions or opinions are those of the authors and do not necessarily represent the official views of the sponsoring agency. Research News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA @GTResearchNews Media Relations Contacts : Brett Israel ( @btiatl ) (404-385-1933) ( brett.israel@comm.gatech.edu ) or John Toon (404-894-6986) ( jtoon@gatech.edu ) Writer : Brett Israel\nAdditional Images\nContact\nBrett Israel 404-385-1933 @btiatl\nEmail\nbrett.israel@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}