{"text": "Identifying Cells to Better Understand Healthy and Diseased Behavior | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nIdentifying Cells to Better Understand Healthy and Diseased Behavior\nGeorgia Tech neuroscientists have found a way to identify cells in the brain by focusing on their relationship to other cells.\nFacebook\nTwitter\nEmail\nGeorgia Tech researchers use a graphical model framework to uncover a better way to identify cells and understand neural activities in the brain. (Photo credit: Christopher Moore, Georgia Tech)\nMar 17, 2021\n— Atlanta, GA\nIn researching the causes and potential treatments for degenerative conditions such as Alzheimer’s or Parkinson’s disease, neuroscientists frequently struggle to accurately identify cells needed to understand brain activity that gives rise to behavior changes such as declining memory or impaired balance and tremors.\nA multidisciplinary team of Georgia Institute of Technology neuroscience researchers, borrowing from existing tools such as graphical models, have uncovered a better way to identify cells and understand the mechanisms of the diseases, potentially leading to better understanding, diagnosis, and treatment.\nTheir research findings were reported Feb. 24 in the journal\neLife . The research was supported by the National Institutes of Health and the National Science Foundation.\nThe field of neuroscience studies how the nervous system functions, and how genes and environment influence behavior. By using new technologies to understand natural and dysfunctional states of biological systems, neuroscientists hope to ultimately bring cures to diseases. Before that can happen, neuroscientists first must understand which cells in the brain are driving behavior but mapping the brain activity cell by cell isn’t as simple as it appears.\nNo Two Brain Cells Are Alike\nTraditionally, scientists established a coordinate system to map each cell location by comparing images to an atlas, but the notion in literature that “all brains look the same is absolutely not true,” said\nHang Lu , the Love Family Professor of Chemical and Biomolecular Engineering in Georgia Tech’s\nSchool of Chemical and Biomolecular Engineering .\nTaking a coordinate approach presents two main challenges: first, the sheer number of cells in which none look that distinct; second, cells vary from individual to individual.\n“This is a current huge bottleneck – you can record neuron activities all you want but if you don’t understand which cells are doing what, it’s difficult to compare between brains or conditions and draw meaningful conclusions,” Lu said.\nAccording to graduate researcher Shivesh Chaudhary, there are also noises in data that make establishing correspondence between two different regions of the brain difficult.\n“Some deformations may exist in data or some portions of the shape may be missing,” he said.\nFocusing on Cell Relationships, Not Just Geography\nTo overcome these challenges, the Georgia Tech researchers borrowed from two disciplines – graphical models in machine learning and metric geometry approach to shape matching in mathematics – and built a computational method to identify cells in their model organism, the nematode\nC.elegans .\nThe team used frameworks from other fields such as natural language processing to build their own modeling software. In natural language processing, the computer can determine what sentences mean by capturing dependencies between words in a statement.\nThe researchers embraced a similar model but instead of capturing dependencies among the words, “We captured them among the neurons to identify cells,” Chaudhary said, noting that this approach limits error propagation as compared to other methods that examine the geographic location of each cell.\n“Using relationships among the cells was actually more useful in defining a cell’s identity,” Lu said. “If you define one, you will have the implications of the identity of the other cells.”\nThe approach, say the research team, is significantly more accurate than the current method of identification. The algorithm, while not perfect, performs significantly better in the face of imperfect data, and “gets less rattled” by noise or errors, Lu said.\nThe algorithm has huge implications for many developmental diseases, since once scientists can understand the mechanism of a disease, they can find interventions.\n“You can use this to do drug and genetic screens to assess genetic risks. You can take someone’s genetic background and examine how this background makes cells behave differently from the standard reference genetic background,” Lu said.\n“One cool thing about this approach is that it is data driven, and therefore, it captures the variations among individual worms. This method has a high potential to be applicable to a wide range of studies on development and function under normal as well as disease-like conditions,” said Yun Zhang, professor, Department of Organismic and Evolutionary Biology, Center for Brain Science at Harvard University.\nFaster Data Analysis\nThe algorithm greatly accelerates the speed of analyzing whole-brain data. The researchers explained that before this advance, their lab might take 20 minutes to record a set of data, but it would take them weeks to identify cells and analyze data. With the algorithm, the analysis takes “overnight at most on a desktop,” said Chaudhary.\nThe technique also supports crowdsourcing, collaborative online platforms that open up the algorithm to a larger community, which can test the algorithm and build atlases.\n“Every researcher working on the same problem could do recordings and contribute to further building these atlases that will be widely usable in all contexts,” Lu said.\nThe researchers credit the success of the project to being able to draw upon multiple disciplines across physics, biology, math, and chemistry. Chaudhary, who has an undergraduate degree in chemical engineering, took advantage of developments in computer science and math to solve this particular neuroscience problem.\n“In our labs, we have a physicist working on building microscopes, we have biologists, we have people like me who are inclined more towards computer science. We also collaborate with a pure mathematician,” he explained. “The neuroscience field has everything. You can go any direction that you want to.”\nIn addition to Lu and Chaudhary, other Georgia Tech researchers contributing to this work were Sol Ah Lee, Yueyi Li, and Dhaval S. Patel.\nThis research was supported by the National Institutes of Health through awards R21DC015652, R01NS096581, R01GM108962, and R01GM088333 and the National Science Foundation under awards 1764406 and 1707401. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the sponsoring agencies.\nCITATION : S. Chaudhary, et al., “Graphical-Model Framework for Automated Annotation of Cell Identities in Dense Cellular Images.” ( eLife,\n2021)\ndoi.org/10.1101/2020.03.10.986356 .\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact:\nAnne Wainscott-Sargent (404-435-5784)  (asargent7@gatech.edu)\nAdditional Images\nContact\nAnne Wainscott-Sargent\nResearch News\n(404-435-5784)\nEmail\nasargent7@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}