{"text": "With Recent Funding, Sea Level Sensor Project in Savannah Moves into New Phase | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nWith Recent Funding, Sea Level Sensor Project in Savannah Moves into New Phase\nThe rising sea levels along Georgia’s Savannah coast and an uptick in more severe storms during hurricane season are bellwethers to looming ecological challenges stemming from climate change.\nFacebook\nTwitter\nEmail\nAn aerial view of the Georgia Coast.\nApr 20, 2022\n— Atlanta, GA\nThe rising sea levels along Georgia’s Savannah coast and an uptick in more severe storms during hurricane season are bellwethers to looming ecological challenges stemming from climate change.\nOngoing research to study sea level rise led by Georgia Tech researchers, a coalition of universities, Savannah and Chatham County government leaders, and local community groups is creating what could be a national model for coastal regions across the country facing similar challenges.\nLaunched in 2018 with a  Georgia Smart Communities Challenge Grant , the data collected from the sea level sensors is used to inform city and county planners and emergency responders on resource deployment following major weather events.\nNow in its fourth year, the sea sensor project is now slated to receive $5 million from Congress to launch the Coastal Equity and Resilience Hub. It is secured by U.S. Sens. Jon Ossoff and Raphael Warnock, and U.S. Rep. Earl L. “Buddy” Carter to expand the network of sensors — currently 50 are deployed off Chatham County’s coast — to blanket Georgia’s 11-county coastal region.\n“With this new funding, we are recognizing a new phase of our project which has evolved,” said Kim Cobb, former director of Georgia Tech’s  Global Change Program  and a professor who studies climate, oceanography, and weather in the  School of Earth and Atmospheric Sciences .\nCobb and Russell J. Clark, senior research scientist in the  School of Computer Science  at Georgia Tech’s College of Computing, co-lead the project. Allen Hyde, assistant professor in the  School of History and Sociology  in Georgia Tech’s Ivan Allen College of Liberal Arts, leads a  National Science Foundation project  focused on youth disaster resilience as part of the effort.\nThe funding will support expansion of building out more hyperlocal flood forecasting models, resilience planning tools for underserved communities, and further development of a K-12 education curriculum, paid internships, and other workforce development programs.\nGeorgia Tech and its partners in the Coastal Equity and Resilience Hub — which includes Savannah State University, the University of Georgia, and the University of South Carolina — is using these low-cost sensors to gain real-time data that over time will help inform the policies on infrastructure design and retrofitting, Cobb said. It will also further expand first responders and emergency planners’ ability to forecast extreme rainfall and storm surge events on a neighborhood-by-neighborhood specific basis.\n“It's going to translate into a saved lives and saved infrastructure,” Cobb said.\nA National Model\nHub researchers say the data being collected from the sensors and additional information gleaned from the sensor expansion has immediate applications in terms of flood disasters and hurricanes. Those findings over the long-term could also help frame the national dialogue and help inform policy as leaders in Washington shape it to tackle rising sea levels and climate change.\nThe award is part of a broader federal push, including a  $12 billion funding package , to help Georgia and other states along the Eastern Seaboard, as well as the West and Gulf coasts, develop resiliency and flooding plans and protocols to mitigate damage from future floods.\nCobb said this new funding allows the Hub to further efforts in its research that further expands education and workforce development — particularly in underserved minority communities — as components of the broader strategy.\n“Our project started out anchored on the sensors and trying to provide real-time data to emergency planners and emergency response responders, but it’s no longer just a small team of people who are interested in sensors or physical scientists, engineers and researchers on the science and technology side,” she said, explaining the research team of some 30 people also includes policy and planning experts, along with community advocates.\n“We're trying to think about solutions in the context of history, geography, — the history of people, cultures, and economies down on the coast,” Cobb said. “There’s no waving a magic wand and making this all right, especially for the most vulnerable communities.”\nCommunity Voice\nIn broad terms, the project touches flooding, infrastructure, property, and pollution. But this newer phase brings in aspects that go beyond scientific modeling of risk, said  Dean Hardy , an assistant professor in the University of South Carolina’s Department of Geography.\nIt’s what he calls the “human dimension” phase.\n“There are disaster plans, there's resiliency plans, and there's community level thinking. But what we need is systemic change,” said Hardy, whose research expertise is in geography and integrative conservation, which marries preservation and social and community goals with public policy.\n“So, what I hope partially comes out of this is not just a bunch of scientific publications or better scientific understanding of these issues, but capacity-building with community organizations that leads to the capacity for self-determination.”\nThat acknowledgement is important to marginalized communities, said Dawud Shabaka, interim director of  Harambee House , in Savannah. The organization, which is involved in the sensor project, promotes and advocates for civic engagement and environmental justice from the coastal city’s Black residents and youth.\nShabaka noted that the engagement component, particularly local high school and middle school students working on the sensors and coding, has allowed the participants to see themselves not only as budding scientists, but as future community leaders.\n“When you’re dealing with or managing or mitigating an issue that’s affecting society, it’s got to involve research and dialogue with the community. This project is allowing us to recognize that the community themselves are the subject matter experts,” said Shabaka. “Having the students involved at an early age, benefits society as a whole and lets them know that the work they’re doing is having a much wider impact. This is the type of community engagement that needs to happen to make people feel like they’re worthwhile.”\nAdditional Images\nContact\nPéralte C. Paul\nperalte.paul@comm.gatech.edu\n404.316.1210\nEmail\nperalte.paul@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}