{"text": "Students Prepare to Reflect With Peers | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nStudents Prepare to Reflect With Peers\nA select group of graduates each semester are tasked with putting years of memories, observations, and feelings into words that will inspire their classmates and everyone in the seats.\nFacebook\nTwitter\nEmail\nSpring 2021 Commencement Reflection Speakers\nMay 06, 2021\n— Atlanta, GA\nOn Friday and Saturday, Georgia Tech will celebrate Commencement during extraordinary, and extraordinarily weird, times. Graduates and their families and friends will gather in Bobby Dodd Stadium. They’ll be wearing face coverings and minding their distance.\nBut some things will remain untouched by the pandemic — the joy, the tears, the collective pat on the back for this singular accomplishment, and the traditions, including a select group of graduates who, each semester, are tasked with putting years of memories, observations, and feelings into words that will inspire their classmates and everyone in the seats. This semester’s student reflection speakers are more than up to the challenge. They’re preparing to knock it out of the proverbial park.\nIsabella Sanders\nis receiving a Ph.D. in industrial engineering (as well as an MBA from Scheller College), and she has already begun teaching in the Department of Systems Engineering at the U.S. Military Academy in West Point, New York.\nHer motivation for serving as a reflection speaker had a lot to do with recognizing the support network behind every graduate, especially at the Ph.D. level. “I think a lot of ceremonies focus on the people who are graduating, but there isn’t enough focus on the people who support the graduates,” she said. “So my speech is about thanking those people. It isn’t a trip that you take by yourself, and I feel like it's good to thank everyone who got you to where you are.”\nFor Sanders, a New York native who did her undergraduate work at MIT, these are not her first Tech graduate degrees. She also holds a master’s in operations research and another in geographic information science and technology. In her remarks, she’s not planning to spend too much time on the upheavals of the past 14 months. “Most people who have supported our Ph.D. journeys have been in our lives long before the coronavirus hit, so my reflections were not largely affected by the pandemic.”\nThe reflection speaker at Friday’s master’s ceremony will be computer science graduate\nSheryl Ratnam\nfrom Santa Clara, California. She, like Sanders, finished her degree in December but is returning to campus for this special day. Two months ago, she began working as a software development engineer at Amazon.\n“I really wanted to take this as an opportunity to celebrate a remarkable group of people who have inspired me in more ways than one,” Ratnam said. “I’m grateful to have met lifelong friends at Georgia Tech, and am honored to have learned alongside the best and brightest.” She  thinks of her reflection speech as a thank you and a gesture of appreciation “for Georgia Tech, and the Class of 2020, both of which have paved the path toward my future . ”\nFor Ratnam, how — and how much — she will talk about the pandemic is a balancing act. Not mentioning it at all would be to ignore “a monumental historical event that has no doubt shaped our academic and personal journeys.” She instead will focus on the ways that Covid-19 has brought into sharp relief, for many people, an awareness of “all that we can accomplish despite the obstacles that may stand in our way.”\nSaturday, May 8, will feature two bachelor’s ceremonies, one in the morning and one in the afternoon. Morning speaker\nSidartha Rakuram\nis a computer science graduate from Petaling Jaya, Malaysia. The first time he set foot in the U.S., in 2017, he was on his way to Atlanta for FASET. Now, he is “excited at the opportunity to reflect on all the memories we have made over the past few years. Commencement is also such a joyous celebration, and I am so honored.”\nRakuram’s emphasis will be on gratitude. He plans to “reflect on the love and kindness we experienced that has helped all of us through our time at Tech — whether it was family, friends, or the faculty and staff here — and I will be thanking them all in the address.”\nLater this month, he will return to Malaysia to begin working at Astro, a leading entertainment and content provider. While he looks forward to being back home with his family, he knows this goodbye is going to be tough. Still, he has “told all my friends that they have an open invitation to visit.”\nAbigail Burke ’s journey to Tech was considerably shorter, originating in nearby Peachtree City. The economics and international affairs major will be delivering the reflection speech at the final Commencement ceremony of Spring 2021. She was motivated to apply, in part, because all four of her grandparents will be sitting in the audience.\nFor Burke, the pandemic “was at the forefront of my mind as I was brainstorming what to talk about. It's been a difficult time for everyone, and graduating this year is an immense accomplishment for the Class of 2021,” she said. “With most of my extraneous activities gone, I had the chance to focus on my close friendships and get involved at Georgia Tech in ways I didn't expect.” That included working as the assistant manager for the McCamish Pavilion voting precinct in November, and as an intern for a voter education startup. These experiences helped shape the reflection speech she ended up writing.\nAfter graduation she will take some time for herself — by working on a ranch in Colorado — before heading to the University of Oxford to pursue a master’s degree in social science of the internet.\nBut not until she’s had her moment on the stage, reflecting on “what has ultimately made my time at Georgia Tech meaningful.”\nAdditional Images\nRelated links\nCommencement Information\nContact\nStacy Braukman\nInstitute Communications\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}