{"text": "NSF Invests $4 Million in Big Data for Southern United States | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNSF Invests $4 Million in Big Data for Southern United States\nA $4 million NSF award will help apply data science and engineering to challenges of the southern U.S.\nFacebook\nTwitter\nEmail\nThe southern United States is disproportionately affected by hurricanes. Understanding these and other coastal threats is among the priorities for the South Big Data Innovation Hub. (Image from Sagis.org)\nJun 19, 2019\n— Atlanta, GA\nPrecision medicine and understanding health disparities, innovation to power competitive manufacturing, technology for smarter communities, and addressing coastal hazards such as hurricanes are among the challenges facing the Southern United States. A $4 million award from the National Science Foundation (NSF) will help apply data science and engineering to address those challenges.\nThe funding will continue support for the\nSouth Big Data Innovation Hub , an organization that helps 16 Southern States and the District of Columbia identify and utilize data science and engineering to address critical societal needs. One of four NSF-supported regional data hubs in the U.S., the South Big Data Hub is managed by the Georgia Institute of Technology and the University of North Carolina-Chapel Hill.\n\"The Big Data Hubs provide a connective tissue for the data science ecosystem across sectors and domains,” said Renata Rawlings-Goss, the Hub’s executive director. “I am deeply pleased by NSF's recommitment to the growth of the South Hub and our community. Over the last three years, we have made great strides within our priority areas and are looking to broaden that reach in the next four years.”\nThe NSF-supported data hubs play four key roles: (1) Accelerating public-private partnerships that break down barriers between industry, academia and government, (2) Growing R&D communities that connect data scientists with domain scientists and practitioners, (3) Facilitating data sharing and shared cyber infrastructure and services, and (4) Building data science capacity for education and workforce development.\n“There is a global shortage of data science and analytics talent that is threatening the future of innovation,” added Rawlings-Goss “By working across sectors, the South Hub joins in creating solutions to increase the capacity of universities and industry to work on pressing problems for our region and for the world.”\nPriorities for the hubs are determined regionally to bring together collaborators that include academics, community leaders, local and state government executives, regional businesses, national laboratories and others, explained Srinivas Aluru, principal investigator for the Hub, which was launched in 2015 and won the 2019 Georgia Tech Outstanding Achievement in Research Development Award.\n“We want to collaborate to help solve regional problems using the resources of the Hub,” explained Aluru, who is also co-executive director of the Institute for Data Engineering and Science at Georgia Tech. “We are addressing truly regional issues that affect more than one state and more than one set of collaborators. These are challenges that can only be addressed by bringing these groups together.”\nThe south region is pursuing five major big data priorities:\nHealth and Disparities : High impact applications of data science in precision medicine, health analytics, and health disparities. “If you look at the health outcomes, they differ by ethnic groups. Trying to understand and address these health disparities is one of our big data challenges,” Aluru said.\nSmart Cities and Communities : Collection and integration of data on infrastructure, sensors, and behavior to design efficient use of resources and services, and to achieve a higher quality, affordable lifestyle, as well as concrete applications of analytics and machine learning to improve the nation’s energy production and smart grid.\nAdvanced Materials and Manufacturing:\nAccess to data infrastructure for creating new materials for advanced manufacturing in every state. “Manufacturing is very important to the Southeast, and we plan to workwith the state manufacturing extension partnerships in different states, trying to inject big data techniques into materials science and manufacturing to shorten the deployment cycle,” Aluru added.\nEnvironment and Coastal Hazards : Prevention and enhanced response to natural and human-induced environmental hazards. Southern states are disproportionately affected by hurricanes on the both the Atlantic and Gulf Coasts. Understanding these threats and how best to protect people and property is critical.\nSocial Cybersecurity : Best practices across sectors to forecast cyber-mediated changes in human behavior to ensure private, secure and ethical data sharing, reporting and use. “In modern times the virtual world is a force in and of itself; we want to support transparency in how it can change interactions and social outcomes,” said Rawlings-Goss.\nThe new NSF award includes seed funding designed to evaluate the feasibility of new big data projects. Part of a hub-and-spoke system, the seed money should help create new spokes to address specific data issues identified by collaborators.\n“Developing innovative, effective solutions to grand challenges requires linking scientists and engineers with local communities,” said Jim Kurose, Assistant Director for Computer and Information Science and Engineering at the NSF. “The Big Data Hubs provide the glue to achieve those links, bringing together teams of data science researchers with cities, municipalities and anchor institutions.”\nUltimately, the goal is to harness the synergy of the collaborators to address issues that require the use of data science and engineering techniques.\n“By catalyzing partnerships that integrate academic researchers into the fabric of communities across the U.S., we can accelerate and deepen the impact of basic research on a range of societal issues, from water management to efficient transportation systems,” said Beth Plale, one of the NSF program directors managing the Big Data Hubs awards.\nThe South Big Data Hub was funded through the National Science Foundation’s Big Data Science & Engineering Program, Awards 1550305 and 1550291. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the National Science Foundation.\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact:\nJohn Toon (404-894-6986) (jtoon@gatech.edu).\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}