{"text": "Meet Gary McMurray, Principal Research Engineer | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMeet Gary McMurray, Principal Research Engineer\nGary McMurray wears two hats at GTRI — division chief for the Intelligent Sustainable Technologies Division and an associate director for the Institute for Robotics and Intelligent Machines (IRIM).\nFacebook\nTwitter\nEmail\nGary McMurray is a principal research engineer with GTRI. (Photo by Rob Felt)\nFeb 19, 2021\n— Atlanta, GA\nAfter earning bachelor’s and master’s degrees in mechanical engineering from Georgia Tech, Gary McMurray interviewed for a number of jobs. Most were in the defense industry, and the job duties were very specific.\n“I joke about one job that was to design fuel pumps for the aft section of cargo planes,” McMurray recalled. “I asked, ‘Well, what if I want to design fuel pumps for the front section?’ They said, ‘No. That’s a different skill set.’”\nThe job sounded too constraining and unappealing to McMurray, so he continued his job search, interviewing with the Georgia Tech Research Institute (GTRI) in 1989. He had been working in robotics, a relatively new field at the time.\n“I was looking for something in robotics, and GTRI was trying to get into robotics,” he said. “They didn’t have anybody working in that field at all, so I was really the first person hired to work in that area. It gave me an opportunity to start from scratch and develop something unique and different. I really enjoyed that.”\nThree decades later, McMurray still works at GTRI.\n“I wear two hats in the organization,” he said. He is the division chief for the Intelligent Sustainable Technologies Division, and an associate director for the Institute for Robotics and Intelligent Machines (IRIM), working with director Seth Hutchinson.\nThe Intelligent Sustainable Technologies Division conducts research to improve the human condition through transforming the agricultural and food systems, sustainable use and access to energy and water, and improving workplace safety and pandemic response. IRIM is an umbrella under which robotics researchers, educators, and students from across campus can come together to advance a wide variety of robotics activities at the Institute.\nThe Intelligent Sustainable Technologies Division has approximately 36 research faculty and 40 students. The unit hires about 10% of all the students at GTRI and maintains close ties with the academic side of campus.\n“One of the things I enjoy in my role as a division chief is the ability to set the vision and mission,” McMurray said. “We’re a little bit different from the rest of GTRI because we don’t do the Department of Defense work. We work a lot with the campus, but we also work with other universities on sustainability projects regarding food or energy. The projects have the potential to make a big impact. I describe it as having one foot on the basic research side and one foot on the applied side. We have master’s and Ph.D. students doing cutting-edge basic research, and we’re also building systems and applying research and deploying things into the field.”\nThe division’s food processing research includes improving yield, food quality, and food safety while minimizing the environmental impact by applying image processing, robotics, biosensors, and environmental treatment technologies. The division also conducts air quality research, including monitoring and reducing the effects of vehicular emissions.\nSo, what’s the connection between food processing and auto emissions?\n“To solve problems in both of those areas we employ general research technologies — robotics, chemical and biological sensing, data analytics, machine learning, systems engineering, and then energy and materials,” McMurray said. “Approaches that work in traditional manufacturing may not work in the food industry. There is no CAD drawing for a boneless chicken breast or a chicken leg. Each one is different. It’s also wet, slippery, and could be spoiled.”\nThat’s where sensing and data analytics come into play. The same applies to analyzing vehicular emissions.\n“When you look at food processing, our work really brings together all of these different skill sets. And then when you look at the data analytics side of air quality emissions, the team has the longest continuous set of data about air quality in the city. This has been the key database that the EPA uses for studying carbon emissions for automobiles,” McMurray said.\nAfter more than 30 years at GTRI, McMurray still gets excited when a plan comes together.\n“The most rewarding part of the work is when you can bring together the basic research and the applied, build a system that does something new and novel, put it into the field and test it, and have somebody come back and say, ‘That’s really cool. That worked.’”\nAway From the Office\nMcMurray and his wife have two sons — a first-year student at Kennesaw State University and a high school senior. He recently started playing chess again, which was a passion of his in middle and high school.\n“My parents were always afraid I was going to quit school and go play chess professionally,” he said. “They were quite worried about that.”\nBut then he got into robotics and work, so chess took a back seat. As his children have grown older, he has gotten back into the game. “Every night I study and play online,” he said. “It’s always interesting.”\nHe read\nThe Queen’s Gambit,\na book about the game that was made into a Netflix series, and he said it was required reading for chess enthusiasts.\n“Chess players are not normal people,” he said, laughing. “The game is very obsessive, and you just sit there at the board for hours. My longest game lasted six and a half hours.”\nMcMurray used to play competitively all over the U.S. “One of my goals, maybe when I retire, is to try to reach the rank of international master.”\nAdditional Images\nRelated links\nRead More Staff Stories\nContact\nVictor Rogers\nInstitute Communications\nEmail\nvictor.rogers@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}