{"text": "Secret Phenotypes: Disease Devils in Invisible Details | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nSecret Phenotypes: Disease Devils in Invisible Details\nComputers viewing tiny traits could reveal previously invisible underpinnings of horrible diseases.\nFacebook\nTwitter\nEmail\nEngineering Professor Hang Lu holds up a chip used to immobilize C. elegans roundworms for photographing by a microscope optic connected to a computer. The chip then sorts the worms into one of two channels for either mutants or non-mutants, a status an algorythm determines based on subtle phenotypical differences it recognizes in the microscope photo. Credit: Georgia Tech / Rob Felt\nNov 23, 2016\n— Atlanta\nWhen a microscopic lab worm grows an eye-popping oddity, scientists locate the mutated gene that caused it. It’s truly interesting. Yet, more important findings, medically relevant ones, may be hiding in traits invisible to the eye, even with the best microscope.\nResearchers at the Georgia Institute of Technology are exposing these secrets -- micron-sized bumps and grooves -- and the intricate web of gene mutations possibly behind them in high detail. Their computational genetics work using digital optics could prove useful to understanding debilitating disorders.\n“When these faint mutations come together, it gives you a ginormous boost in disease risk,” said\nHang Lu, a professor\nwho applies engineering and data science to the study of neurology.\nNeurological disorder: Brain often looks normal\n“If you look at psychiatric diseases, anything that is relevant to humans, what you see is not that dramatic,” Lu said. “Brains of people who had\nschizophrenia , bipolar disorder, or autism don’t look physically very different from healthy brains. It’s not like they’re missing a chunk.”\nResearchers led by Lu at Georgia Tech’s\nSchool of Chemical and Biomolecular Engineering\nhave developed algorithms and special microscope slide to expose previously unseen neurological nuances and intricate mutations that may be behind them. But their findings could apply as well to computational genetics research pursuing other\ndiseases such as autoimmune disorders .\nLu and former Georgia Tech researcher\nAdrianna San-Miguel  published their latest results on Wednesday, November 23, 2016,\nin the journal\nNature Communications . Their research was funded by the National Institute of General Medicine, and the National Institute on Aging, both agencies of the National Institutes of Health.\nSeeing dots: Computers spot subtleties\nLu has replaced the fallible human eye with a proficient computer to pin down faintest phenotypes, the geneticist’s term for physical traits based on genes. In the latest experiment, nerve proteins were marked to appear as dots on roundworms' undersides for the computer to scan.\nWhen mutations occur, the dots can change ever so slightly. “To the naked eye, they’re just dots on a dark background,” Lu said. But the computer sees in them phenotypical shifts.\nRoundworm\nCaenorbabditis elegans ,\nused in the experiment, helps scientists understand what may be going on in humans, because its nerves share strong similarities with ours. Ultimately, Lu wants the insights gained in studying them to lead to localizing genetic biomarkers for diseases in humans.\nSynaptic puncta: Glowing green tags\nThe Georgia Tech scientists narrowed their focus to\nsynapses on a single neuron\nwhere it connects to muscles. These “ synaptic puncta ” were tagged with a glowing green protein to form the dots.\nSome mutations did cause big shifts in dot position and size that the naked eye could actually pick up. And traditionally, forward geneticists -- geneticists who follow changes in phenotypes to see if they can find genes that cause them -- have used their eyes and microscopes to pick out such really obvious changes.\nBut natural limitations on human perception have introduced a bias, Lu said. Her research aims to reduce it to boost the amount of data scientists can gather.\nMutant bias: It looks funny\nHere’s how the bias roughly works. Sorting mutants from non-mutants in the lab is usually tedious with the tiny worms, and that has consequences for science.\n“The normal way of doing it would be to take a little platinum wire and literally go under the microscope, pick up a worm, drug it, mount it on a slide, and then you have to recover it alive, if you think it's interesting,” Lu said.\nThe tedium plus the limited abilities of the human eye lead researchers looking for mutations to single out worms that are markedly odd. Eye-popping phenotypes are namely likely to be caused by genotypic changes, i.e. mutations, so finding a clear phenotype is likely to lead to a successful research outcome.\nStochasticity: Not a mutant\nAs a result, researchers might overlook subtle samples. In addition, amassing enough of them to determine important nuances may prove too difficult to do, and quirks can get in the way, too. For example, a single weird-looking worm might not be a mutant at all.\n“You can always find a ‘ wildtype ’ (basically normal worm) that looks nothing at all like a wildtype,” Lu said. “It’s just a crazy wildtype. Genotypically, it looks like everybody else, but phenotypically it’s so different.\"\nWhy? Because nature can be stochastic – sort of random -- and mess up an individual worm, even when there’s no mutated gene.\nPhenospace: A world revealed\nLooks can deceive the eye, but they’re less likely to fool a high-resolution camera connected to a computer and an\nalgorithm that statistically examines\nfaint variations in order to sort mutants from non-mutants.\nLu’s technique works via a transparent slide with tiny tubes that suck in one worm at a time under the computer's microscope. “Then we freeze the worm for a moment, so we can take its picture,” Lu said. “Then it unfreezes, and it’s totally okay.”\nThere’s a fork in the tube holding the worm. If the algorithm detects a mutant based on its synaptic puncta pattern in the image – even if this is not visible to the eye – the worm gets sucked down the first path for further study. If it isn’t a mutant, it gets sucked down the second path.\nIn the latest experiment, the algorithm analyzed phenotypic variations in the synaptic puncta of large worm populations. Parallel to that, the worms' genomes were analyzed to determine which phenotypical differences may be connected to mutated genes.\nThen the researchers mapped out genotypes in relation to the differences in phenotypes they underpinned. What was so nuanced before that it was virtually invisible, turned out to be a large, filigree web.\nSilent affliction: Poor little worm\nThen there was a particularly lucky find that made for a good metaphor for the study and its potential to advance research. The scientists stumbled upon a very subtle allele – a variation of a gene caused by mutation.\nThe worms that had the allele were real mutants, but no one would have guessed it, because to the eye, they were completely neat and normal. They even behaved normally at first glance, and the researchers thought the computer may have sorted them out as mutants by mistake -- until a hitch turned up.\n“After they swam for about 40 minutes, they got really, really weak and couldn’t swim well anymore,” Lu said. The allele seemed to be associated with some kind of neurological disorder.\n“Seen as a metaphor, this is an example of how you might identify something that is relevant to a disease but incredibly subtle,” she said, “and you would never have found it using eyes and a microscope.”\nThe research paper was coauthored by Matthew M. Crane, Yuehui Zhao, and Patrick McGrath of Georgia Tech, and Peri Kurshan and Kang Shen of Stanford University. The research was funded by grants from the National Institutes of Health (numbers R01GM088333 and K99AG046911) Any opinions, findings and conclusions or recommendations expressed in this material are those of the author(s) and do not necessarily reflect the views of the sponsoring agency.\nAdditional Images\nContact\nWriter and media contact: Ben Brumfield\nCell: (404) 660-1408\nResearch Communications\nEmail\nben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}