{"text": "Back-to-Back Drone Racing Titles Further RotorJackets Goal of Expansion | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nBack-to-Back Drone Racing Titles Further RotorJackets Goal of Expansion\nRotorJackets, Georgia Tech’s drone racing team, captured their second straight national title, but their mission extends beyond winning championships.\nFacebook\nTwitter\nEmail\nPhoto courtesy of RotorJackets\nMay 05, 2023\nApril was a month of national championships at Georgia Tech as Buzz was crowned the nation's best mascot, and the RotorJackets took home their second straight Collegiate Drone Racing championship.\nTech's team, comprised of four racers, narrowly emerged from the field of 15 schools and 52 individual pilots to take home the title following two days of competition at the Fayette Fliers Field in Tyrone, Georgia. While scores from the qualifying round and the previous races in the knockout round are compiled into a sum, it was RotorJackets' vice president Tanner Beard who put his team in the lead in the final race of the competition. Beard also finished in second place in the individual competition, but it's the team’s accomplishment that he's proudest of.\nBeard and outgoing team president Luke Lawver started flying first-person view (FPV) drones together in 2018 before officially founding RotorJackets in the fall of 2020. As Beard, a\nmechanical engineering\nstudent, and Lawver, an\naerospace graduate student , get set to leave Tech, the pair couldn't have imagined the success the group has achieved in a short time.\n\"I'm just very proud of how far it's come. We started out practicing on fields with PVC pipes, and our gates and materials were falling apart. We didn't really have anything, but we were able to build everything up, and we've practiced every single weekend for events like this,\" Beard said.\nThe team learned the layout of the championship track just two weeks before the event, but practicing from first light to sundown was nothing new for the RotorJackets. The hard work and preparation continued up until the last minute as the team was forced to replace a drone the night before the competition. But the two senior members of the team were impressed by first-year\ncomputer engineering\nstudent Ian Boraks –– the incoming president –– and Dylan Wyckoff, in his first-ever drone race. Wyckoff is a third-year\ncomputer science\nmajor and will take over as the club’s treasurer.\nBoth relished the opportunity to fly alongside their experienced teammates and are now focused on continuing their legacy in pursuit of a three-peat.\nOther than winning titles, the club also wants to expand the drone-flying community on campus. When the fall semester begins, monthly events will be held on Tech Green, where all students can learn how to fly. No experience is necessary, and all equipment will be provided. Not all club members are racers, and the benefits of learning the skill go well beyond the group.\n\"The cool thing about FPV as a hobby is that, especially as an engineering major or someone in any STEM field, it teaches you a ton of practical skills that are incredibly useful in your day-to-day job,\" Lawver said. \"We build all of our drones basically from scratch, so you can learn about electrical hardware design, mechanical hardware design, and software engineering and dive into whatever areas you want. Or, you can just treat it as a black box, and you'll have fun with it.\"\nUsing the skills they've acquired, the RotorJackets have expanded their footprint at Tech, using drones to enhance coverage of events like the iconic\nMini-500\nas well the Pi Mile, and they've assisted Athletics in creating digital content.\nWhile not necessary to join the club and learn the ropes, obtaining your Remote Pilot Certificate from the FAA is recommended if you're interested in the more advanced stages of drone piloting, and the plan is to offer this certification through the club in the coming semesters.\nFor information on how to join the RotorJackets and the latest updates on upcoming events, join their\nDiscord .\nAdditional Images\nContact\nSteven Gagliano - Communications Officer\nInstitute Communications\nEmail\nSteven.gagliano@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}