{"text": "Georgia Tech Researchers to Lead Pioneering Space Wargaming Series | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Researchers to Lead Pioneering Space Wargaming Series\nMariel Borowitz and Jon Lindsay of the Sam Nunn School of International Affairs will help lead a series of public wargaming exercises to test the limits of U.S. deterrence strategies in space.\nFacebook\nTwitter\nEmail\nMariel Borowitz and Jon Lindsay of the Sam Nunn School of International Affairs will help lead a series of public wargaming exercises to test the limits of U.S. deterrence strategies in space.\nJun 26, 2023\nSpace is, thankfully, a peaceful place. But that lack of conflict high overhead also obscures how little scholars down here know about the ways a conflict in orbit might play out, much less how to deter it.\nGeorgia Tech space policy expert Mariel Borowitz thinks she has a way to help clear up some of that confusion. Under a new $1.3 million grant from the U.S. Department of Defense, Borowitz plans to help lead a major series of public space wargaming exercises. They’re meant to tease out how current U.S. deterrence strategies might fall short when it comes to stopping a conflict in space and what can be done to improve them.\n“When it comes to conflict in space, the stakes are enormously high and the challenges are extremely complex,” said  Borowitz , an associate professor in the Sam Nunn School of International Affairs, a unit of the Ivan Allen College of Liberal Arts. “This project will better equip us to understand whether existing deterrence models can help hold the line in space or whether another model is necessary to prevent a potentially devastating outbreak in orbit.”\nJon Lindsay, an associate professor in the  Nunn School  with a joint appointment in the School of Cybersecurity and Privacy, will work with Borowitz on the project, as will U.S. Space Force Lt. Col. Brian Stewart — a Nunn School Ph.D. graduate who now teaches at the U.S. Air Force Academy. Jacquelyn Schneider — a Hoover Fellow at The Hoover Center at Stanford University — rounds out the team.\nA central theme of the project will be trying to understand how the concept of integrated deterrence applies to conflict in space. Integrated deterrence essentially boils down to a country using everything at its disposal to prevent conflict from escalating too far, from applying diplomatic and economic pressure to bringing the military into the mix.\nUsing such means to deter conflict in a global hotspot on the ground is tricky enough. Look no further than Ukraine for contemporary evidence of that.\nBut when that hotspot is space, conflict doesn’t just threaten stability in one part of the planet. It could quickly become a serious threat to civilian communications, commerce, and military operations across the globe. Despite the high stakes, trying to understand how to tamp down such conflict is something government officials and scholars are only beginning to tackle.\nMuch of the work in this space focuses on improving military technology to sense what adversaries are doing and improving the ability of militaries to destroy incoming attacks quickly. But this project highlights how no complex problem can be solved without considering both technological and human factors — a core competency of the Nunn School and the Ivan Allen College of Liberal Arts.\n“We understand entanglement from a technological standpoint, but we need to better understand how these entanglements affect perceptions and decisions, which ultimately shape deterrence,” Borowitz said. “And we need to have more clarity on how decisions to separate military and civilian systems or choices to integrate different sectors within the space domain more closely might affect deterrence, before billions of dollars are spent on these efforts.”\nBorowitz and her colleagues have already staged versions of space conflict scenarios in the classroom at Georgia Tech. They are now broadening the scope and preparing for the first exercises, which could come as soon as September.\nThe team plans to hold wargaming sessions across the globe over the next few years, including at Georgia Tech and the Air Force Academy and in Washington, Brussels, Taiwan, and Tokyo. The sessions will include national security figures, scholars, students, and international partners.\nThe project is expected to generate a significant dataset of use to scholars, as well as a book, game design materials, and other assets to help other researchers continue the work, Borowitz said\nAdditional Images\nContact\nMichael Pearson\nIvan Allen College of Liberal Arts\nEmail\nmichael.pearson@iac.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}