{"text": "Black History Month Viewing Recommendations | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nBlack History Month Viewing Recommendations\nFaculty and staff members recommend documentaries, feature films, and television series that explore race, identity, history, and memory.\nFacebook\nTwitter\nEmail\nImages of what to watch during Black History Month\nJan 27, 2022\n— Atlanta, GA\nFebruary is Black History Month, a time to reflect on the struggles and achievements of Black Americans, and their centrality to U.S. history. We asked several faculty and staff members for viewing recommendations that explore race, identity, history, and memory. The recommendations range from a revisionist Western film with characters loosely based on real cowboys and outlaws of the 19th-century American West to a documentary on chemist Percy Lavon Julian whose contributions include finding a way to mass produce a drug for glaucoma treatment.\nThe Amazing Nina Simone\nAmazon Prime Video, released in 2015. Available online through\nAcademic Video .\n“This award-winning documentary shows the human complexity and brilliance of Nina Simone, who was a singer, songwriter, storyteller, music producer, and civil rights activist. Through interviews with those who knew and loved her, it details her journey from her classical musical roots to her unique development of an eclectic blend of jazz, folk, gospel, classical, blues, and African music that could not be defined by one single genre. The movie highlights her resilience and the ways that she shared her truth and advocated for others through music.”\n—Tiffiny Hughes-Troutman, director of the Center for Assessment, Referral, and Education (CARE), Division of Student Engagement and Well-Being\nForgotten Genius: Percy Lavon Julian (1899-1975)\nNOVA/PBS documentary, first aired in 2007 and is often shown on PBS affiliate stations in January and February. Available online through\nPBS .\n“ Forgotten Genius: Percy Lavon Julian (1899-1975)\nis a NOVA documentary of his personal life and scientific career as a chemist. The documentary was the recipient of the American Association for the Advancement of Science’s ‘Best Public Science’ film. The documentary chronicles Julian’s struggles with personal and institutional racism, especially in the American academic scientific community, to become the first African American to head a division in industry. In the mid-1930s, Julian was appointed director of research at Glidden’s Soybean Division. Under his leadership, the division produced several scientific breakthroughs including artificial sex hormones and cortisone. Respectively, these discoveries resulted in the commercialization of birth control pills and affordable treatment for rheumatoid arthritis. Later, Julian left Glidden to found Julian Laboratories with facilities in the U.S. and Mexico. He became one of the few Black millionaires and was actively involved in the civil rights movement. His contributions to science resulted in his election to the National Academy of Sciences and appearance on a U.S. postage stamp. Despite his significant scientific and civic accomplishments, few Americans are aware of him.”\n—Willie Pearson, professor, School of History and Sociology (Note: Pearson served on the film’s advisory board and appears in the film as an interviewee.)\nFruitvale Station\nHulu, released in 2013. Available online through\nSwank .\n“This 2013 film has only gained power and relevance in the years since its release. Driven by Michael B. Jordan’s performance in the role of Oscar Grant, it tells the story of Grant’s 2009 shooting by a police officer in the Fruitvale station of the BART transit system in Oakland, California. Released in the wake of the death of Trayvon Martin and before the shooting of Michael Brown, the film’s events are excruciatingly familiar. The filmmaker Ryan Coogler’s stated aim was to get viewers ‘attached’ to Grant\n—\nto connect deeply to the meaning that his life had, especially for those who loved him, and to grapple with the horrific impact of police violence on Black families and communities, and the absence of accountability in the aftermath.”\n—Ruthie Yow, service learning and partnerships specialist, Center for Serve-Learn-Sustain\nLovecraft Country\nHBO, released in 2020. The Georgia Tech Library has the\nbook , not the series.\n“ Lovecraft Country\nis a must-see for Black History Month. The HBO series is based on Matt Ruff’s novel of the same name. The story follows the life of Atticus Freeman as he returns home to Chicago after serving in the Korean War. Upon arriving, he finds that his father has mysteriously disappeared, and Atticus joins his uncle and childhood friend to search for him. With the Negro Motorist Green Book to guide them, they embark on their journey only to come face to face with monsters. Who and what are these monsters? Are the monsters portrayed in the 1950s really that different from the monsters Black people face today? The murder of Emmett Till and the burning of ‘Black Wall Street’ in Tulsa, Oklahoma are just a few historical events embedded in the series\n— which can be\ndescribed as Black strength providing a tool for liberation, with a science fiction twist.”\n—Stephanie Ray, associate dean of students and director of Student Diversity Programs, Division of Student Engagement and Well-Being\nWhen They See Us\nNetflix, released in 2019. Available on Netflix.\n“Ava DuVernay’s Netflix series,\nWhen They See Us , offers an intimate look at the lives of five Black and Latino teenagers falsely accused of the 1989 assault of a white woman in Central Park. DuVernay’s delicate rendering of this infamous miscarriage of justice merges art and politics, reframing this shameful chapter of our country’s long history of judicial racism by giving voice and visibility to the resilience of these young men and their families. At once ambitious and intimate,\nWhen They See Us\nensures, with its elegant and sometimes harrowing lens, that we bear empathetic witness to both the pain and the strength of these innocent men.”\n—Nihad M. Farooq, associate professor, School of Literature, Media, and Communication\nThe Harder They Fall\nNetflix, released in 2021. Available on Netflix.\n“I have always enjoyed Western genres, and\nThe Harder They Fall\ndoes not disappoint. Director Jeymes Samuel’s modern western, set in Redwood City, is an epic fictional battle between historical outlaws and legendary badasses. Samuel imagines the American West through the eyes of Trudy Smith, Bill Pickett, Stagecoach Mary, James Beckworth, Cherokee Bill, Rufus Buck, and Bass Reeves, as he crafts a decadent tale of love, respect, and revenge. The film features Regina King, Idris Elba, Jonathan Majors, and LaKeith Stanfield.”\n—John Thornton, senior academic professional and director of Film and Media in the School of Literature, Media, and Communication\nAdditional Images\nContact\nVictor Rogers\nInstitute Communications\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}