{"text": "Georgia Tech Names Commercialization Leadership Focused on Expanding Impact | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Names Commercialization Leadership Focused on Expanding Impact\nEntrepreneur and Professor Raghupathy “Siva” Sivakumar has been named Georgia Tech’s inaugural Interim Chief Commercialization Officer.\nFacebook\nTwitter\nEmail\nRaghupathy “Siva” Sivakumar, a professor and entrepreneur, has been named Georgia Tech’s inaugural Interim Chief Commercialization Officer. (Credit: Christopher Moore)\nNov 17, 2020\n— Atlanta, GA\nRaghupathy “Siva” Sivakumar, a professor and entrepreneur who helped found three technology companies and launched a popular student entrepreneurship program, has been named Georgia Tech’s inaugural Interim Chief Commercialization Officer.\nIn that role,\nSivakumar\nwill bring together commercialization and technology transfer activities from across campus with a goal of moving more intellectual property out into the marketplace to help expand Georgia Tech’s impact on the world. Attaining that goal will involve increasing the number of startups launched by faculty, staff, and students, expanding the amount of technology transferred to industry – and instilling entrepreneurial confidence in faculty, staff, and students.\n“We want to make Georgia Tech the number one startup campus in the country,” Sivakumar said. “The culture on campus is changing to embrace commercialization, entrepreneurship, and technology transfer to power an ecosystem that is generating impact in those areas. We are changing the culture in such a way that we’ll absolutely get to the next level.”\nAs Interim Chief Commercialization Officer, his job for the coming months will be to assess Georgia Tech’s strengths and weaknesses to build the foundation for streamlining the process of connecting Georgia Tech faculty, staff, and students with potential users of the technology produced in large part by the Institute’s billion-dollar research program.\n“We want to provide a pathway for everyone associated with Georgia Tech to contribute to the innovations that improve the human condition and address the issues that will be critical in the coming decades,” said\nRaheem Beyah , vice president for Interdisciplinary Research and founder of a company in the industrial security space. “As a state institution, we must expand our focus on economic impact for Georgia.”\nBuilding Experience in Entrepreneurship\nSivakumar, who holds the Wayne J. Holman Chair in the\nSchool of Electrical and Computer Engineering\n(ECE), saw firsthand the power of entrepreneurship during his graduate program at the University of Illinois at Urbana-Champaign as his advisor launched a company that raised capital, manufactured products, and was ultimately acquired.\n“That really planted a seed in my mind and I could see the difference and the interplay between research for the purpose of furthering knowledge and research that gets translated into impact,” he explained. After he arrived at Georgia Tech as a tenure-track assistant professor, he found support for pursuing interests in video technology startup EG Technology, which was headed by another ECE professor before it was acquired.\n“I was fortunate to be part of the founding team, and that really helped me understand the mechanics of what it takes to raise money, build product, and go to market,” he said. “It really changed my perspective on the meaning of research and how I should be thinking as a researcher about the potential for impact.”\nThat experience whetted Sivakumar’s appetite, and two other successful startups followed: Asankya and StarMobile, both of which were acquired by larger firms. With a record of three successful companies, he moved next to support the growing interest in entrepreneurial competence for students through\nCREATE-X . The Georgia Tech program’s goal is to “provide the knowledge, skills, abilities, and experiences that will give Georgia Tech graduates the confidence to create their own future and confidently pursue entrepreneurial opportunities.”\nIn six years, CREATE-X has helped launch 230 student-founded companies, the largest of which now has more than 100 employees and raised $15 million from investors including a famed Silicon Valley venture capital company. CREATE-X engages thousands of students each year.\n“We think we have changed the student perspective on entrepreneurship quite a bit,” Sivakumar said. “Even if they do not create a venture, they have the entrepreneurial confidence. That makes them more valuable to the large companies who may hire them for their entrepreneurial skills even if they never launch a new company.”\nCreating a Culture of Impact\nBuilding on all this experience, Sivakumar is now taking on perhaps the most significant challenge of all: changing the culture of Georgia Tech.\n“Siva is a proven entrepreneur and educator in this space,” said\nChaouki Abdallah , Georgia Tech’s executive vice president for Research. “He is uniquely qualified to translate the language of faculty, staff, students, and the people who will use the technology we develop. He knows how the process works and how to connect the different parties involved.”\nUniversities have a long history of developing and sharing knowledge with the world. As useful as that is, it leaves the ultimate application of this knowledge largely to other entities. Universities trust that their graduates may transfer the knowledge they learn in class, team activities, and labs. Intellectual property may be used by industrial companies or government agencies to improve products and processes. New technology may fuel the formation and growth of new companies, creating jobs and investment.\nBut too often that doesn’t happen.\n“This has always been a rather disconnected process and universities are figuring out that they need to play a more active role in creating that impact,” Sivakumar said. “We can’t just hope that somebody from the outside will find out about what we’ve done and make an impact with it. We have to take an active role, and that will amp up the impact that universities will have in the long run.”\nThat’s not to say that Georgia Tech hasn’t been working hard on that goal. In the 1980s, with support from state government and alumni, Georgia Tech launched\nATDC , Georgia’s technology incubator, which helps entrepreneurs launch and build startup companies. From ATDC, Georgia Tech created\nVentureLab\nto help faculty members identify pathways to company formation. And the\nOffice of Technology Licensing\nsupports the protection and licensing of technology.\nNow VentureLab and the Office of Technology Licensing will form the core of a new organization that Sivakumar and others will design.\nWhat’s needed ahead, he says, is to change the culture so the entire Georgia Tech community can expect to create a company, move technology into the marketplace and apply entrepreneurial techniques to their work. “This should be the culture on our campus – to enable our faculty, staff, and students to create impact,” he said.\nWelcoming the Outside World to Campus\nSuccess for this new commercialization initiative will require more than a focus on impact. It will require the Georgia Tech culture to welcome collaboration with entrepreneurs, investors, companies, and others, using processes and procedures that are friendly to the outside world.\n“We want to facilitate the interaction between our researchers and the people who are interested in their creative works, and it’s a two-way street,” said Abdallah, who has himself launched two startup companies. “Organizations from outside Georgia Tech need to have a good experience in licensing what we learn. We want to provide a seamless and pleasant experience for all parties.”\nBy moving organizations responsible for that collaboration into a single organization, Beyah expects to reduce friction in the complicated system.\n“We’ve never had such a great opportunity at Georgia Tech as we have today,” he said. “We have always been interested in innovation, commercialization, and technology transfer, and now we want to have everybody engaged in the future of commercialization at Georgia Tech. That’s important to how we fulfill our mission to serve the state, our nation, and the world.”\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : John Toon (404-894-6986) (jtoon@gatech.edu).\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404-894-6986)\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}