{"text": "A New Framework for Measuring Stability During Walking | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nA New Framework for Measuring Stability During Walking\nBy using mechanical energetics to measure stability, Georgia Tech researchers gain deeper insights into how and why we fall.\nFacebook\nTwitter\nEmail\nPawel Golyski uses a computer to operate the CAREN during experiments.\nJul 29, 2022\n— Atlanta, GA\nFalls are a serious public health issue, resulting in tens of thousands of deaths annually and racking up billions of dollars in healthcare costs. While there has been extensive research into the biomechanics of falls, most current approaches study how the legs, joints, and muscles act separately to respond, rather than as a system. The ability to measure how these different levels relate to each other could paint a much clearer picture of why someone falls and precisely how their body compensates. Until recently, however, an integrated measuring approach has been elusive.\nIn newly published research, Pawel Golyski and his Ph.D. advisor\nGregory Sawicki , associate professor of\nmechanical engineering\nand\nbiological sciences\nat Georgia Tech, investigate whether mechanical energy can be used as a “common currency” to measure how humans use lower limbs to stabilize during walking.\nTheir research , published in the\nJournal of the Royal Society Interface , lays the groundwork for using mechanical energetics to understand the roles of joints and muscles during unsteady locomotion. The paper also contributed to Golyski’s selection as this year’s recipient of the\nAmerican Society of Biomechanics’\n(ASB)\nPre-Doctoral Achievement Award\n— a prestigious honor that considers a candidate’s entire portfolio of publications.\nGolyski, a graduating member of Sawicki’s\nPhysiology of Wearable Robotics (PoWeR) Lab , previously worked as a research scientist with individuals with lower-limb amputation at\nWalter Reed National Military Medical Center . For his graduate work at Georgia Tech, his aim was to develop an understanding of how devices and the human body work together, specifically at the intersection of three elements: muscle mechanics, wearable exoskeletons, and stability during walking.\nEach of the three elements relates to the others. Exoskeletons affect a person’s stability while also affecting how their muscles work, and vice versa. But to examine how muscles both interact with exoskeletons and affect stability makes for an interesting challenge, Golyski says. Because, while one can observe how muscle dynamics change with the use of an exoskeleton, how those changes relate to stability is not understood. To understand how all three pillars work together to help humans compensate during a fall, Golyski and Sawicki needed to come up with a new framework to measure stability.\nEnergy Accountants\nThe researchers knew that for a person walking at a steady speed on level ground, the net mechanical energy of the person and each leg over one stride — from the heel strike of one leg to the next heel strike of that same leg — is zero. They also knew that energy needed to be equal to mechanical energy at all levels of description of the leg, specifically the joints and muscles.\n\"The idea is that if we can relate stability to a demand in energy, then we can become accountants, and track how the energy — our currency — changes at the level of the person, muscle, and exoskeleton,\" Golyski said. “That provides a really powerful framework to relate all three of those areas.”\nGolyski and Sawicki designed an experiment with a person walking on a treadmill. Using a split-belt treadmill, they applied short, quick disturbances, known as perturbations, in the form of increases in belt speed to one leg during walking. The purpose was to inject or extract energy during a stride, so that they could then measure how the person’s leg and joint energies change.\nFor the experiment they used Georgia Tech’s\nCAREN\n(Computer Assisted Rehabilitation Environment) — an integrated system used to study stability during movement. It features cameras mounted above a treadmill to track a person’s movement using motion capture markers attached to the person. Using an algorithm designed by Golyski, Sawicki, PoWeR lab Ph.D. student Jennifer Leestma, and a high school mentee, Esmeralda Vazquez, the CAREN can execute perturbations based on a person’s movements — enabling the researchers to initiate perturbations at specific times in the gait cycle. By combining the force of the treadmill with the positional data collected by the CAREN, Golyski and Sawicki can calculate the changes in energy in a person’s individual joints.\nTheir new framework could assist in determining which part of a person’s body manages responses to destabilizing energy, pointing to specific muscles or joints to target with rehabilitation therapy. It could also open doors to advanced exoskeletons and prostheses that target specific joints to restore stabilizing responses in individuals with impaired balance.\n“The body of research that Pawel completed during his doctoral studies is nothing short of impressive. He broke new ground by developing new experimental techniques and a new hip exoskeleton assistive device, making first-of-a-kind muscle imaging measurements, and ultimately answering the question of how exoskeletons modify joint and muscle dynamics to influence human walking stability,” Sawicki said. “I was thrilled that Pawel’s outstanding contributions as a scientist-engineer were recognized by ASB, and I’m even more thrilled that he will return to Walter Reed — his dream job — to apply his new skillset to help people get from here to there.”\nThis summer, as part of this recognition, Golyski will deliver a research talk during an awards session at the\nNorth American Congress on Biomechanics\nin Ottawa, Ontario. He will also be graduating from Georgia Tech and resuming his work with veterans and active service members at Walter Reed.\nCitation : Golyski, Pawel R. and Gregory S. Sawicki, “Which lower limb joints compensate for destabilizing energy during walking in humans?” Journal of the Royal Society Interface.192022002420220024 01 June 2022\nDOI :\ndoi.org/10.1098/rsif.2022.0024\nFunding : This research was supported by the U.S. Army Natick Soldier Research, Development, and Engineering Center (grant no. W911QY18C0140) to G.S.S. and the National Science Foundation (grant no. DGE-1650044) to P.R.G.\nWriter : Catherine Barzler\nPhotography : Rob Felt\nMedia Contact : Catherine Barzler |\ncatherine.barzler@gatech.edu\n###\nThe Georgia Institute of Technology, or Georgia Tech, is a top 10 public research university developing leaders who advance technology and improve the human condition. The Institute offers business, computing, design, engineering, liberal arts, and sciences degrees. Its nearly 44,000 students, representing 50 states and 149 countries, study at the main campus in Atlanta, at campuses in France and China, and through distance and online learning. As a leading technological university, Georgia Tech is an engine of economic development for Georgia, the Southeast, and the nation, conducting more than $1 billion in research annually for government, industry, and society.\nAdditional Images\nContact\nCatherine Barzler, Senior Research Writer/Editor\nEmail\ncatherine.barzler@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}