{"text": "Tech Volunteers Support Mask-Making Organization | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nTech Volunteers Support Mask-Making Organization\nEmployees use their professional skills in a volunteer setting.\nFacebook\nTwitter\nEmail\nSummitRidge Hospital employees wearing face coverings sewn by Sewing Masks for Area Hospitals. (Photo courtesy: SMAH)\nJun 09, 2020\n— Atlanta, GA\nWhen Shelley Wunder-Smith volunteered to brush up on her sewing skills to help an organization named Sewing Masks for Area Hospitals (SMAH), she had no idea she would end up becoming the communications director for the group.\n“I was like a lot of people, just absolutely desperate to do something helpful and meaningful during the pandemic,” said Wunder-Smith, a senior writer-editor for the H. Milton Stewart School of Industrial and Systems Engineering (ISyE). “I haven’t sewn since I was a kid but was willing to do whatever I could to support SMAH’s mission.”\nThat mission is to provide supplementary cloth face coverings to healthcare professionals experiencing shortages of personal protective equipment (PPE) due to the Covid-19 pandemic.\nSMAH responded to Wunder-Smith’s willingness to help, and one of the co-founders asked if she would like to be more involved and use her professional communications skills and talent. She immediately said yes.\n“It was a much better fit for me than trying to re-learn how to sew,” Wunder-Smith said. “And, it’s given me the unique challenge of managing crisis communications while in the middle of the fast-paced environment of what is, essentially, a start-up.”\nHer duties include responding to media requests, creating the organization’s website and social media content, developing blog posts, and editing all external documents — such as patterns and sewing instructions — for the organization. She also created a press kit, manages social media, and is working on a public relations strategy so the organization can be proactive instead of reactive.\nAnd yes, she has done all this while still working full-time for Georgia Tech. So, it has meant a lot of late nights.\nShortly after joining SMAH, Wunder-Smith reached out to one of her College of Engineering colleagues, Kelsey Gulledge, a communications officer in the Daniel Guggenheim School of Aerospace Engineering, for help with the organization’s social media.\n“I wanted to help in any way that I could,” said Gulledge, “and that happened to be establishing and managing the SMAH Twitter and Instagram accounts. This included establishing the voice and tone, creating content, and coordinating with SMAH volunteers for user-generated content.”\nAs the stay-at-home order continued, Gulledge realized she did not have enough time to work her full-time job, volunteer with SMAH’s social media, and also sew masks.\n“With the support of the SMAH leadership, I made the decision to alter my volunteerism to focus solely on making masks. Sewing can be really challenging, but I’ve found it to be very therapeutic in these difficult times,” she said.\nAfter Gulledge curtailed her involvement, Wunder-Smith enlisted two ISyE students to assist with social media: Maya Menon, a rising third-year student, and Nithya Koganti, a fifth-year student.\n“Maya and I work together to keep all of SMAH’s social media channels up to date,” said Koganti. “We post content and create some of it with the help of other SMAH team members.” They also strive to increase engagement with SMAH members and reach people who are not familiar with the organization.\n“I have learned so much from working with this organization during the past month,” said Menon. “I’ve really been able to learn just how much social media engages and brings together a group of people that don’t even know each other to create something so powerful and helpful.”\nWunder-Smith said SMAH’s founders initially thought the group would make about 1,000 face coverings. But by the end of May they had delivered 55,000 masks to area hospitals. The organization recently enlisted another group of ISyE students to address some supply chain issues, which will result in a smoother operation.\nPhu Jaitrong, one of 10 students working on the project, said, “We've been interviewing and process mapping to identify pain points and issues, some of which we've found so far are supply chain related.” The students are also examining the allocation of work, as well as technology and IT issues.\nSMAH recently received its 501(c)(3) designation, making it one of a few nonprofit groups providing personal protective equipment. The designation allows the organization to apply for grants, and it makes donations tax-deductible. (The organization does not need fabric at this time, but to make a financial donation or to volunteer, see the\nwebsite .)\nWhen asked what she has learned from this experience, Wunder-Smith said, “Go where the important work is happening, and give yourself to it. Sometimes that means you don’t get to do the thing you’re best at. Sometimes that means you find a new way to do that thing. Sometimes you find that the thing you’re actually best at is being willing to give yourself where you can help. Because if the work is really important, you don’t have to be. Because it’s not about you.”\nNOTE: As of press time, SMAH is responding to current events by expanding its original mission of supplying PPE to healthcare workers. Once they provide the remaining 3,000 masks that have been requested by local healthcare facilities, SMAH’s administrative team will pivot the organization to supporting the black and African American communities and providing face coverings for civil rights protesters. If there is a second Covid-19 wave in the fall or winter, SMAH will return to its original mission. For more information, follow SMAH on Facebook, Instagram, and Twitter @smahatlanta.\nAdditional Images\nRelated links\nH. Milton Stewart School of Industrial and Systems Engineering\nSewing Masks for Area Hospitals\nContact\nVictor Rogers\nInstitute Communications\nEmail\nvictor.rogers@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}