{"text": "In the Mood for Giving: Charitable Donations May Be More About How You Feel Before Giving, Not After | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nIn the Mood for Giving: Charitable Donations May Be More About How You Feel Before Giving, Not After\nTwitter posts and an online experiment involving the cheery “Hakuna Matata” scene from The Lion King offer new insights into why we give to charity.\nFacebook\nTwitter\nEmail\nSchool of Economics Assistant Professor Casey Wichman and a co-author at the University of Massachusetts Amherst studied the impact of mood on giving.\nJun 26, 2023\nConventional wisdom suggests that we give to charity at least partly because of post-donation warm and fuzzies that make us feel great inside. Turns out, it might be the other way around.\nGeorgia Tech\nSchool of Economics\nAssistant Professor Casey Wichman and a colleague from the University of Massachusetts Amherst have found evidence from social media posts that a good mood reliably predicts a charitable donation. The\nfindings , recently published in  The Economic Journal,  question common beliefs about why we give of our time and money and may have practical implications for the causes that seek to benefit from our generosity.\n“The findings are interesting simply because I think many of us believe one reason we give to charity is because of how it makes us feel,”\nWichman\nsaid. “But there’s a practical side of this, as well, and that has to do with how non-profit fundraisers might want to think about shifting tactics to improve the moods of would-be donors before soliciting donations.”\nThe concept Wichman and his UMass colleague, Nathan Chan, explored is called “preheating,” a riff on the “warm glow” often associated with post-donation moods. While psychologists are familiar with this idea, the study by Wichman and Chan may be the first to identify the effect outside of a controlled lab setting.\nFor their study, Chan and Wichman turned to Twitter. The researchers first grabbed batches of tweets from about 20,000 people who donated to Wikipedia. To mark the moment the donation occurred, they used #ILoveWikipedia tweets the non-profit encyclopedia prompts users to post after contributing.\nThe researchers then used natural language processing tools to analyze the sentiment of tweets those users sent before and after they made their donation. The authors detected a reliable and statistically significant mood boost in tweets sent up to about an hour before donating to Wikipedia, according to Wichman.\nHow much of a boost? The “preheating” associated with donating roughly equaled the joy you might feel on discovering a $20 bill crumpled up in the pocket of an old coat, Wichman said. That’s based on earlier economics research assigning monetary values to varying degrees of mood changes.\nThe buoyant mood seemed to last for about 30 minutes after the donation before returning to baseline levels, according to the researchers.\nThe analysis by Wichman and Chan didn’t capture what the donors were so happy about before their donation. They also don’t know how much money the ebullient Twitter users donated to Wikipedia or how much they might have given in a less giddy mood.\nThe pair did, however, carry out an experiment that offers some insights. They asked volunteers online to decide how to split $50 between themselves and a charity. But first, the would-be philanthropists had to watch either the cheerful “Hakuna Matata” scene from Disney’s\nThe Lion King\nor a neutral clip about microbes.\nThe researchers found that those who watched the relentlessly optimistic singing warthog and meerkat duo donated 7% more to charity and were more likely to give away the entire amount than those who watched the microbe video. The results, while less conclusive due to a smaller sample size, support the paper’s overall finding that mood influences giving more than many researchers have given it credit for, Wichman said.\nConsequently, the idea of “preheating” potential donors with feel-good content or hitting them up with solicitations after they post positive messages online could be a winner for non-profits looking to maximize givers, the researchers say.\n“If you can find moments when people are happy, that might be a good time to be targeting them for charitable contributions,” Chan said.\nThe paper, “Preheating Social Behavior,” was first published online June 6, 2023, in\nThe Economic Journal . It is available at\nhttps://doi.org/10.1093/ej/uead041 .\nThe School of Economics is a unit of the Ivan Allen College of Liberal Arts.\nAdditional Images\nContact\nMichael Pearson\nIvan Allen College of Liberal Arts\nEmail\nmichael.pearson@iac.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}