{"text": "Sequencing of five African fishes reveals diverse molecular mechanisms underlying evolution | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nSequencing of five African fishes reveals diverse molecular mechanisms underlying evolution\nResearchers have sequenced the genomes and transcriptomes of five species of African cichlid fishes and uncovered a variety of features that enabled the fishes to thrive in new habitats and ecological niches within the Great Lakes of East Africa.\nFacebook\nTwitter\nEmail\nA display of the diversity in male cichlid fish. Researchers have sequenced the genomes and transcriptomes of five species, which offers insight into how diversity evolves. Credit: Ryan Bloomquist.\nSep 04, 2014\n— Atlanta, GA\nResearchers have sequenced the genomes and transcriptomes of five species of African cichlid fishes and uncovered a variety of features that enabled the fishes to thrive in new habitats and ecological niches within the Great Lakes of East Africa. The study helps explain the genetic basis for the incredible diversity among cichlid fishes and provides new information about vertebrate evolution. The genomic information from the study will help answer questions about human biology and disease. \"Our study reveals a spectrum of methods that nature uses to allow organisms to adapt to different environments,” said co-senior author Kerstin Lindblad-Toh, scientific director of vertebrate genome biology at the Broad Institute of Harvard and MIT, a biomedical and genomic research center. “These mechanisms are likely also at work in humans and other vertebrates, and by focusing on the remarkably diverse cichlid fishes, we were able to study this process on a broad scale for the first time.” The new study was published in the September 3 advance online edition of the journal\nNature . The work was a collaboration between the Broad Institute of MIT and Harvard, the Georgia Institute of Technology, and the Eawag Swiss Federal Institute for Aquatic Sciences, in addition to more than 70 scientists from the international cichlid research community. African cichlid fishes are some of the most diverse organisms on the planet, with over 2,000 known species. Some lakes are home to hundreds of distinct species that evolved from a common ancestral species in the Nile River. Like Darwin’s finches, the cichlids are a dramatic example of adaptive radiation, the process by which multiple species radiate from an ancestral species through adaptation. In the new study, the researchers sequenced the genomes and transcriptomes – the protein-coding RNA - from ten tissues of five distinct lineages of African cichlids. The sequenced species include the Nile tilapia, representing the ancestral lineage, and four East African species: a species that inhabits a river near Lake Tanganyika; a species from Lake Tanganyika colonized 10-20 million years ago; a cichlid species from Lake Malawi colonized 5 million years ago; and species from Lake Victoria where the fish radiated only 15,000 to 100,000 years ago. The researchers found a number of genomic changes at play in the adaptive radiation. Compared to the ancestral lineage, the East African cichlid genomes possess an excess of gene duplications, alterations in regulatory elements in the genome, accelerated evolution of protein-coding elements in genes for pigmentation, and other distinct features that affect gene expression. “It’s not one big change in the genome of this fish, but lots of different molecular mechanisms used to achieve this amazing adaptation and speciation,” said Federica Di Palma, co-senior author of the\nNature\nstudy and director of science in vertebrate and health genomics at The Genome Analysis Center in the UK. Some changes in the genome appear to have accumulated before the species left the rivers to colonize lakes and radiated into hundreds of species. This suggests that the cichlids were once in a period of reduced constraint. During this time, the fishes accumulated diversity through genetic mutations, and the relaxed constraint – in which all individuals thrived, not just the fittest – allowed genetic variation to accumulate. As the fish later inhabited new environmental niches within the lakes, new species could form quickly through selection. In this way, a reservoir of mutations – and resultant phenotypes – represented a genomic toolkit that allowed quick adaptation. More work remains to fully dissect the mutations that cause each of the varying phenotypes in cichlid fish, which could help explain how similar forms or traits evolved in parallel in different lakes. \"By learning how natural populations, such as fishes, adapt and evolve under selective pressures, we can learn how these pressures affect humans in terms of health and disease,” Di Palma said. Todd Streelman, professor in the School of Biology at Georgia Tech and a co-author of the study, studies Lake Malawi cichlid species to address biological questions that are difficult to study in traditional model organisms. \"These fishes provide a great way to identify the genes that control traits in natural populations,\" Streelman said. “Now that we understand the genome sequences of some of these species, it’s a lot easier to interpret all of the new genetic and genomic data we collect in the lab.” His lab studies natural mechanisms of lifelong tooth replacement and the genomics of complex social behavior using closely-related Malawi cichlids. The new genome sequence of the Lake Malawi cichlid will allow Streelman’s lab to investigate which genes are turned on or off during these processes. Streelman's research group cultures roughly 25 different Malawi cichlid species in aquatic facilities at Georgia Tech, through research funded by the National Institute of Dental and Craniofacial Research (NIDCR) and the National Institute of General Medical Sciences (NIGMS). This work was funded in part by the National Human Genome Research Institute (NHGRI), the Swiss National Science Foundation, the German Science Foundation, Biomedical Research Council of A*STAR, Singapore, the European Research Council, US National Institute of Dental and Craniofacial Research (NIDCR), and the Wellcome Trust.   CITATION:\nDavid Brawand, et al.\"The genomic substrate for adaptive radiation in African cichlid fish.\" ( Nature,\nSeptember 2014)\nhttp://dx.doi.org/10.1038/nature13726       Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia  30332-0181  USA @GTResearchNews   Media Relations Contacts:\nBrett Israel ( @btiatl ) (404-385-1933) ( brett.israel@comm.gatech.edu ) or John Toon (404-894-6986) ( jtoon@gatech.edu )   Writer:\nLeah Eisenstadt, Broad Institute of Harvard and MIT\nAdditional Images\nContact\nBrett Israel 404-385-1933 @btiatl\nEmail\nbrett.israel@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}