{"text": "Chemotherapy and Cancer Gang up to Cause a Neurological Side Effect, Study Says | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nChemotherapy and Cancer Gang up to Cause a Neurological Side Effect, Study Says\nChemotherapy has gotten the blame for this neurological side effect, but it's cancer's fault, too.\nFacebook\nTwitter\nEmail\nStock photo illustrating the administering of chemotherapy. Credit: National Cancer Institute\nJun 08, 2020\n— Atlanta, GA\nContrary to common medical guidance, chemotherapy does not appear to be the only culprit in neuropathy, a neurological side effect of cancer treatment,  a new study  says. Cancer itself contributes heavily, too, and the stresses on neurons appear far worse than the sum of the two causes.\n“There was some distress caused by cancer alone and some distress from chemo alone, but when you put the two things together, it was off the charts, seven times the trauma to neurons of the two things added together,” said Nick Housley, first author of the study performed in rats at the Georgia Institute of Technology. “It turned out to be the first-ever evidence that there is this exacerbation going on.”\nEvery year in the U.S., there are 1.8 million new cancer diagnoses, and about half of patients receive platinum-based drugs, which are very effective. About 40 percent of patients receiving platinum chemotherapy come down with neuropathy, suffering strange sensations, pain, fatigue, or loss of muscle coordination that impedes day-to-day life. Neuropathy can persist for years after chemotherapy ends.\nHope for treatment\nThe new study also challenges established medical explanations that neuropathy is caused by structural damage to nerves alone and that it is untreatable.\n“The idea of damage has been the standard explanation – that these neurons are dying back and that they are retracting. And we have found time and time again zero evidence of this in the neurons we studied here,” Housley said.\n“The evidence does not support physical damage as the basis for the disabilities we observe. We find functional problems that might be fixable,” said Tim Cope, one of two principal investigators of the study. Functional problems usually refer to neurons not firing properly versus actual tears or shrinkage in neurons.\nCope is  a professor in Georgia Tech’s School of Biological Sciences  and in the Wallace H. Coulter Department of Biomedical Engineering at Georgia Tech and Emory University. Housley is a postdoctoral researcher in his lab.\nThe researchers published their results  in the journal  Cancer Research  on April 28, 2020 . The research was funded by the National Institutes of Health’s National Cancer Institute. John McDonald, the other principal investigator, is a professor in Georgia Tech’s School of Biological Sciences and the  director of Georgia Tech’s Integrative Cancer Research Center .\nGene expression surprises\nTo explore neuropathy’s causes, the researchers cast a broad net. They examined gene expression in neurons,  protein expression , and neuron signaling, and they measured body movements, which became markedly uncoordinated.\nGene dysregulation went into overdrive in reaction to chemo and cancer, including boosting inflammatory responses while suppressing some of neurons’ protective mechanisms. But despite the plethora of  gene regulation  red flags, there were also surprising signs of intact neuron health.\n“Many things the neuron relies on to live and function were unscathed on the gene expression level. That’s potentially good news for patients and for fixing neuropathy because it means there may be just one thing or a few things to fix to restore normal functioning,” Cope said. “The downregulation of just a few genes may be responsible for the problems we’ve seen.”\nIon channel mystery\nClues from one downregulated gene took a twist that led to a new scientific discovery in neuronal biology before arriving at what appeared to be a pathology.\nThe downregulated gene is responsible for creating protein structures called ion channels that appear in a neuron’s cell wall and  enable the neuron to fire electrical impulses , i.e. action potentials. Ion channels abruptly shuttle potassium ions (K+) and sodium ions (Na+) in and out of cells, flipping the net negative and net positive charges on either side of cell walls, which creates the action potentials.\nThis particular downregulated gene was for a potassium ion channel called  Kv3.3 , which was not previously known to exist in muscle spindles – neural receptors embedded in muscles to sense when they are contracting or stretching. The researchers found the channel to be prolific there.\n“That was a discovery in its own right in basic neuroscience. Finding its involvement in this sensory-motor problem was also profound,” Housley said.\nMost Kv3.3 expression disappeared under the combination of chemo and cancer. More research is needed to establish whether the lack of Kv3.3 is indeed an important contributor to neuropathy, but in this study, it strongly correlated with observed neural pathology.\n“Despite the neurons still having the ability to fire action potentials, the process of neurons encoding information was really corrupted,” Housley said.\nAlso read:  App Detects Harsh Side Effect of Breast Cancer Treatment\nThe following researchers from Georgia Tech coauthored the study: Paul Nardelli, Dario Carrasco, Travis Rotterman, Emily Pfahl, and Lilya Matyunina. The research was funded by the National Institutes of Health’s National Cancer Institute (grants R01CA221363 and R01HD090642). Any findings, conclusions, and recommendations are those of the authors and not necessarily of the NCI.\nHere's how to  subscribe to our free science and technology email newsletter\nWriter & media inquiries : Ben Brumfield (404-272-2780),\nben.brumfield@comm.gatech.edu  or John Toon (404-894-6986), jtoon@gatech.edu.\nGeorgia Institute of Technology\nAdditional Images\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}