{"text": "New Techniques Allow Greater Control of Smartwatches | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNew Techniques Allow Greater Control of Smartwatches\nCollege of Computing researchers control smartwatches with breaths and taps.\nFacebook\nTwitter\nEmail\n3D-printed flutecase snaps onto a watch to support Whoosh. The attachment has eight holes around the bezel, each with varying lengths. When a wearer blows into each of the holes, unique frequencies are generated much like a flute.\nJan 24, 2017\n— Atlanta, GA\nSmartwatches aren’t the easiest things to control, with their small screens and owners’ bulky fingers. Georgia Institute of Technology researchers have invented new ways to interact that provide a little more control. Among their enhancements using LG and Sony watches:\nScrolling through apps running your fingers along the watch band\nLaunching eight smartwatch apps by tapping key points on the watch case (or bezel)\nRejecting phone calls by blowing on the screen or tapping the side of the watch\nEditing dictated text message errors by breathing on the screen\nTransferring on-screen information from the watch to a phone with breaths\nSelecting numbers by tapping the back of your hand\nThe research was presented at several conferences in the fall, most recently in Niagara Falls at the\n2016 ACM International Conference on Interactive Surfaces and Spaces\nin November.\nPh.D. student\nCheng Zhang\noversaw WatchOut, an interaction technique that uses taps and scrolling gestures on the case and watchband, “outside” the watch screen. They’re possible because of the watch’s gyroscope and accelerometer sensors.\n“Other techniques that improve control of smartwatches have included 3D gestures above the screen, bigger screens or adding an extra armband,” Zhang said. “We wanted to show it could be done with existing technology already common on today’s devices.”\nOne demo app allows wearers to scroll up, down, left and right by swiping on the watchband. According to Zhang it makes it easier to interact with GPS maps or menus. His study showed that scrolling on rubber watchbands was more accurate than leather bands due to the different friction of the materials.\nThey also created an app that creates eight touchpoints on the device’s bezel. Rather than scrolling through a long list of apps, the user simply hits one of eight spots on the case to launch Facebook, for example. Hitting the sides of the watch can also control incoming calls.\n“Smartwatches aren’t very convenient when you’re carrying something,” Zhang said. “That’s why we wanted to create a technique that allows the user to tap the watch to accept or deny phone calls. Hitting the right side answers the call; the left side ignores it.”\nHands-free control is exactly what the other Georgia Tech team, led by Ph.D. student\nGabriel Reyes , had in mind. One day he watched his wife blow a piece of fuzz off her phone while holding their newborn son. He and a team of students later created Whoosh, a technique that allows a person to control the watch by blowing, exhaling, shushing, sipping or puffing on the screen. The watch uses its microphone and machine learning to identify the breath patterns of each acoustic event, then assigns an action to each.\nFor example, a wearer can shush the watch to ignore a call or blow on it twice to accept. In another scenario, the watch can be locked or unlocked using a correct combination of short or long breaths. Voice recognition sometimes produces incorrect words when dictating a text message. Blowing quickly on the watch can erase words, while blowing on it longer will send the text message when ready. Finally, the technique also works with smartphones. A user can transfer content from the watch to a smartphone simply by sipping it off the watch and puffing it on the phone.\nReyes and his team are excited that they’ve proven the technology works. He says it could have potential for people with disabilities. “The sip and puff technique has been used to control wheelchairs,” he said. “Perhaps Whoosh could be the foundation for developers looking for ways that allow more control for those who can’t easily interact with their mobile and wearable devices.”\nDingtian Zhang , a Ph.D. student and labmate of Reyes, also designed a 3D-printed case that snaps onto the watch. The attachment has eight holes around the bezel, each with varying lengths. When a wearer blows into each of the holes, unique frequencies are generated much like a flute. The watch’s microphone and the Whoosh system detects the subtle differences in the frequencies produced and identifies the intended target. Each target is linked to a specific action within applications.\nThe final project, TapSkin, allows users to tap on the back of their hand to input numbers 0-9 or commands into the watch. The technique uses the watch’s microphone and inertial sensors to detect a total of 11 different tapping locations on a person’s skin around the watch.\nAdditional Images\nContact\nJason Maderer\nNational Media Relations\nmaderer@gatech.edu\n404-660-2926\nEmail\nmaderer@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}