{"text": "MasterCard makes financial investment in First Performance Global | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMasterCard makes financial investment in First Performance Global\nThe investment allows First Performance to expand its efforts to offer self-service tools to payment card issuers and processors.\nFacebook\nTwitter\nEmail\nA. Wayne Johnson is chief executive and executive managing officer of First Perfomance Global, a startup financial technology company in the Select program of Georgia Tech's Advanced Technology Development Center.\nMay 04, 2015\n— Atlanta, GA\nMasterCard, the global payments network, has taken an ownership stake in First Performance Global, a technology startup at the Advanced Technology Development Center (ATDC). Terms of the agreement were not disclosed, but it further expands First Performance’s global extension of a license for MasterCard’s proprietary MasterCard In Control technology. As a result, the two companies will collaborate on growing First Performance’s ability to offer payment card issuers and processors self-service tools for cardholders. First Performance’s technology gives consumers more control with the security surrounding their credit, debit, and other payment cards. Cardholders can define whether or not a card may be used at an ATM, online, via mail order or telephone order, in a bricks and mortar store, or even a specific geographic location, for example. Corporate comptrollers can limit how much and where employees use their company credit cards. “The way people shop and pay is continually changing through new technologies,” said Geoff Iddison, executive vice president, strategic partnerships, MasterCard. “Solutions like these complement platforms like MasterPass and EMV in delivering cardholders both a better shopping experience and peace of mind in the protection of their accounts.” Since 2014, First Performance has used the MasterCard license to design and develop its platform, providing cardholders the ability to personally make decisions about when to “turn on” and “turn off” their credit and debit cards. It also allows them to activate loyalty programs and control where and how their cards can be used through a simple, easy-to-use GogoNogo mobile app. “We have enjoyed a great relationship with MasterCard,” said A. Wayne Johnson, First Performance’s CEO and executive managing director. “The expansion of our intellectual property relationship on a global basis is an exciting opportunity for our company.” First Performance joined ATDC’s highly competitive Select program in 2015. ATDC is a program of the Enterprise Innovation Institute (EI 2 ), the Georgia Institute of Technology’s primary economic development and business outreach unit. Startups designated as ATDC Select are those deemed most ready to succeed, get investors, and thrive as stand-alone enterprises. They also receive one-on-one mentoring, as well as access to other ATDC and Georgia Tech business development programs. About MasterCard MasterCard (NYSE: MA),\nwww.mastercard.com , is a technology company in the global payments industry. The company operates the world’s fastest payments processing network, connecting consumers, financial institutions, merchants, governments, and businesses in more than 210 countries and territories. MasterCard’s products and solutions make everyday commerce activities – such as shopping, traveling, running a business, and managing finances – easier, more secure, and more efficient for everyone. Follow MasterCard on Twitter @MasterCardNews, join the discussion on the Beyond the Transaction Blog, and subscribe for the latest news on the Engagement Bureau. About First Performance Global First Performance Global delivers an innovative platform revolutionizing how issuers and processors connect and engage with their customers. Through interaction with the ISO 8583 authorization stream, the First Performance platform provides financial institutions with customer self-service capabilities, card management, loyalty, and messaging tools that deliver greater control, security, interactive communication, and an overall enhancement to the card use experience. For more information, visit\nwww.firstperformance.com . About the Advanced Technology Development Center (ATDC) The Advanced Technology Development Center (ATDC) is one of the oldest and largest university-based startup incubators in the country. ATDC, which is celebrating its 35th anniversary this year, has graduated approximately 150 companies from its program. ATDC is a unit of the Enterprise Innovation Institute, Georgia Tech’s chief economic development arm. For additional information, visit\nwww.atdc.org .\nAdditional Images\nRelated links\nwww.firstperformance.com\nwww.mastercard.com\nhttp://www.atdc.org\nContact\nLaura Diamond  Georgia Tech Media Relations 404-894-6016  Laura.diamond@comm.gatech.edu @LauraRDiamond Contact E-mail: laura.diamond@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}