{"text": "Snaring Bacteria in DNA-based Nets the Way White Blood Cells Do | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nSnaring Bacteria in DNA-based Nets the Way White Blood Cells Do\nLike Spiderman, white bloods cells shoot NETs at bacteria, made mostly of DNA, and this synthetic microweb emulates it.\nFacebook\nTwitter\nEmail\nNature inspired this synthetic microweb that nabs bacteria and allows antibiotics to more effectively kill them. White blood cells shoot so-called NETs like Spiderman at bacteria. NETs contain hundreds of ingredients, the main one being DNA, but researchers engineered their microweb with just DNA and one other ingredient. Credit: Georgia Tech / Ella Maru Studio (work for hire)\nFeb 11, 2019\n— Atlanta, GA\nOne holds it; the other poisons it. This is how a white blood cell may someday work together with an antibiotic. Today's antibiotics are not particularly engineered to coordinate their fight against bacteria with white blood cells, the body’s own first line of defense against infectors, but a\nnew study\ngives hope that that could change.\nHow white blood cells called neutrophils work has not been understood well on a micron level, but researchers have gotten a closer look by chemically modeling one of their combat weapons, a kind of web, and trying it out on bacteria. The researchers then successfully double-teamed the bacteria with an antibiotic and their synthetic version of the white blood cell's web.\n“One of their (the cells') weapons are neutrophil extracellular traps, also called NETs,” said\nJ. Scott VanEpps , assistant professor of emergency medicine at the University of Michigan. VanEpps co-led the study with Shuichi Takayama from the Georgia Institute of Technology.\nShooting DNA webs\nNETs are microscopic networks of fibers made primarily of DNA that neutrophils produce to capture bacteria.\n“It’s amazing to think that molecular DNA tape, on which our genetic code is recorded, can also be used as a bacteria-lassoing web. White blood cells can act like cellular Spidermen that net bacterial micro-villains to protect our body,” said Takayama, who is a professor in Georgia Tech’s\nPetit Institute for Bioengineering and Biosciences\nand in the\nWallace H Coulter Department of Biomedical Engineering at Georgia Tech and Emory University .\nTakayama and VanEpps synthesized a rough chemical imitation of the NETs to study how they work by snaring bacteria in the lab\nin vitro . They also found antibiotics killed bacteria more effectively when combined with the synthetic web than when applied alone. The researchers published their results in\nthe journal\nAdvanced Materials\non January 20, 2018 .\nSnagging, poisoning\nE. coli\n“Although there are literally hundreds of different ingredients in natural NETs, we were able to recreate a lot of their structure and function with just two ingredients,” VanEpp said. “They look and function very similar to NETs produced by those neutrophil white blood cells and the synthesis method is much simpler than isolating them from neutrophils.”\nThe researchers first used their microwebs to snare and kill bacteria in order to better understand how white blood NETs work. Then they combined their microwebs with antibiotics  in vitro  to test for increased drug effectiveness.\nTheir results imply that the presence of white blood cell NETs in the body may increase the effectiveness of antibiotics. Also, the synthetic microwebs may have medical potential on their own.\nFighting antibiotic resistance\n“As bacteria develop resistance even to last-resort antibiotics, there is worry of untreatable infections. We found that microwebs can help antibiotics break through such resistance,” said Takayama, who is also Price Gilbert, Jr. Chair in Regenerative Engineering and Medicine at Georgia Tech.\n“The knowledge gained in this study could be helpful in the future in designing new and better antibiotics that mimic the body’s natural defense mechanisms, as well as potentially change how we dose antibiotics given the potential synergy between the immune system and certain antibiotics,” VanEpps said.\nThe new microwebs also serve as a foundation for future research on even more functions of DNA ejected outside of cells.\n“The ability to readily customize the microweb composition opens many opportunities to engineer new DNA materials that mimic biology and increase our understanding of the role of NETs and other types of extracellular DNA in the body,” Takayama said.\nThese authors contributed to this study: Yang Song from Georgia Tech; Usha Kadiyala, Priyan Weerappuli, Srilakshmi Yalavarthi, Cameron Louttit, Jason S. Knight, and James J. Moon from the Unversity of Michigan; Jordan J. Valdez and David S. Weiss from Emory University School of Medicine. The research was funded by the National Institutes of Health: the National Institute of Allergy and Infectious Diseases, the National Institute of General Medical Sciences; and the National Heart, Lung, and Blood Institute ,\n(grants: NIH NIAID U19 AI116482, R01 AI141883, and K08 AI128006; NIGMS R01 GM123517; NHLBI R01 HL134846 and U01 CA210152), the Veterans Administration (merit award BX‐002788), and a Burroughs Wellcome Fund Investigator in the Pathogenesis of Infectious Disease award.\nWriters / media contacts:\nKylie Urban, University of Michigan,\nkylieo@med.umich.edu\nBen Brumfield, Georgia Institute of Technology,\nben.brumfield@comm.gatech.edu , 404-660-1408\nAdditional Images\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}