{"text": "New Master of Science in Urban Analytics to Launch in the Fall | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNew Master of Science in Urban Analytics to Launch in the Fall\nUrban planning, computing, and industrial and systems engineering combine to fix big city problems\nFacebook\nTwitter\nEmail\nAtlanta Skyline\nMay 25, 2021\n— Atlanta, GA\nGeorgia Tech is launching a new interdisciplinary degree this fall: the Master of Science in Urban Analytics (MSUA). The\nSchool of City and Regional Planning\nwill administer the degree in partnership with the\nH. Milton Stewart School of Industrial and Systems Engineering\n(ISyE), the\nSchool of Computational Science and Engineering\n(CSE), and the\nSchool of Interactive Computing\n(IC).\nUrban analytics is an emerging field that incorporates smart cities, urban informatics, and urban science. The goal of urban analytics is to leverage data science in addressing major issues cities continue to face, including air, water, and land pollution; carbon emissions; traffic congestion; inadequate housing options; and disparities in access to services. The skills and knowledge necessary to tackle such challenges require an integrated multidisciplinary approach, which this degree is designed to provide.\nIt is aimed at students who are interested in solving urban problems through the acquisition, integration, and analysis of various forms of data. Undergraduate preparation for this degree can include a range of fields such as engineering, planning, computing, and various social science disciplines.\nGeorgia Tech is the only university in the University System of Georgia offering an urban analytics degree. Programs of this kind are quickly gaining national relevancy — similar graduate programs exist at Carnegie Mellon University, New York University, Northeastern University, and the University of California at Berkeley.\nSubhro Guhathakurta , chair of the School of City and Regional Planning and the director of the\nCenter for Spatial Planning Analytics and Visualization , noted that Tech’s urban analytics program stands out from the others given its strategic partnership with top-ranked programs in engineering and computing to offer this multidisciplinary degree.\n“The objective is to harness Georgia Tech’s recognized strengths and expertise in data analytics to focus on the critical problems facing urban regions,” he said.\nRead also: Gulsah Akar Appointed New School of City and Regional Planning Chair\nAdditionally, there are many aspects of industrial engineering that can be applied to urban analytics,\nPascal Van Hentenryck , associate chair for Innovation and Entrepreneurship and A. Russell Chandler III Chair and Professor in ISyE, said.\n“Many supply chain logistics concepts and solutions can be applied to address the inefficiencies in public transportation, accessibility, and the relationship between mobility and the built environment. This program is pioneering in that it links many viewpoints holistically, from the concepts to the mathematical and computational tools, and their applications to problems faced by our growing cities,” he said.\nGeorgia Tech’s ISyE program is ranked as the No. 1 graduate program in in the industrial, manufacturing, and systems specialty and has held the top rank for 31 years.\nAdvances in computation are also essential to ensure the sustainable development of modern cities and guarantee that they operate effectively,\nHaesun Park , Regents' Professor and chair of CSE, said.\n“Understanding and planning for the interdependent and interactive quality of city infrastructures require computational models and tools of increasing complexity and scale. This is where data, computing, and networks are ubiquitous, with computation playing unprecedented new roles in the management and operation of cities,” she said.\nBesides new introductory courses, several existing classes in the degree-participating schools are available as part of a well-rounded curriculum. These courses are carefully selected to meet four core competencies: urban systems, spatial analysis, computational statistics including machine learning, and modeling and visualization.\nThe curriculum will place special emphasis on social end-values such as sustainability, justice, and resilience, and on individual data rights including: permission for collection; privacy through aggregation; and transparency through open data.\n\"One of the most exciting aspects of this new degree is the diversity of academic programs working together on this topic of urban analytics. It will unite faculty and students from across campus to work on solving many important challenges,\"\nJohn Stasko , Regents' Professor and interim chair of IC, said.\nSpecialization within the degree is encouraged. The one-year program spans fall and spring semesters, with a summer workshop.\nApplications for the Fall 2021 cohort open this summer. For more information,\nclick here .\nAdditional Images\nContact\nAnn Hoevel\nCollege of Design\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}