{"text": "‘Georgia Trend’ Names Tech Alumni Among Most Influential Georgians | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\n‘Georgia Trend’ Names Tech Alumni Among Most Influential Georgians\nThese 11 Yellow Jackets are being recognized for their transformative roles around the state.\nFacebook\nTwitter\nEmail\nGeorgia Trend 2024 Most Influential Georgians\nFeb 12, 2024\nFor their efforts to transform their communities through public service, leadership, and philanthropy, 11 Georgia Tech alumni have been named among Georgia Trend’s 100 Most Influential Georgians for 2024.\nBrian Blake, EE 1994 – President, Georgia State University\nUnder Blake’s leadership, Georgia State University received a\nschool-record $224 million\nin research grants in fiscal year 2023 and is preparing to construct its third research tower on campus. Now in his second year, Blake, the university’s first Black president, launched a strategic plan that will guide GSU through 2033 with the goal of building on the four pillars he set when he arrived: research and innovation, student success, college to careers, and identity and placemaking.\nÁngel Cabrera, M.S. PSY 1993, Ph.D. PSY 1995 – President, Georgia Institute of Technology\nContributing $4.5 billion to the state economy , Georgia Tech leads the 26 University System of Georgia member institutions and ranks among the leading research institutions in the U.S. with over $1.45 billion in research awards annually. In November, Cabrera announced the\nComprehensive Campus Plan , which will increase the Institute’s footprint around Atlanta and includes the innovative Arts Square project, two new residential halls, a thermal energy plant, and additional infrastructure upgrades throughout campus.\nLisa Cupid, ME 2000 – Chair, Cobb County Board of Supervisors\nA board member since 2013, Cupid became the first female and first Black chair in 2021. Throughout her career in public service, Cupid has championed efforts to expand transit services and enhance public safety measures, and continues to advocate for inclusion and equity for all Cobb County residents. In 2022, she was appointed to chair the National Association of Counties’ economic development subcommittee. Alongside her duties on the board, Cupid is an attorney and a former policy analyst and manufacturing process engineer.\nAndre Dickens, ChE 1998 – Mayor, City of Atlanta\nNow in his second year in office, Dickens recently celebrated the culmination of his Year of the Youth campaign, which resulted in a\n$20 million investment into early childhood education\nin Atlanta and a $1 million pledge to the Boys & Girls Clubs of Metro Atlanta, among other achievements. This year, the city added 3,000 affordable housing units, with an additional 5,000 planned.\nThe mayor visited the White House\nto discuss infrastructure improvements at Hartsfield-Jackson Atlanta International Airport with President Joe Biden. In 2023, Dickens was elected to lead the Atlanta Regional Commission, becoming the first Atlanta mayor to serve as the board’s chairman.\nWatch Dickens’ May 2022 Georgia Tech Commencement Speech.\nRoderick McLean, M.S. EE 1993 – Vice President and General Manager, Air Mobility and Maritime Missions, Lockheed Martin\nAs the vice president for Lockheed Martin’s Air Mobility and Maritime Missions division, McLean oversees 5,000 employees at three of the company’s primary aircraft production facilities and leads the C-130J Super Hercules airlifter, LM 100J, c-5, and P-3 programs. McLean began as a radar systems engineer with Lockheed Martin in 1994, ascending to his current position in 2019. He serves on the Metro Atlanta Chamber Board of Directors and is a member of the Executive Leadership Council.\nJannine Miller, MBA 2013 – Executive Director, SRTA, GRTA, and Atlanta-Region Transit Link Authority\nWith more than two decades of experience in the transportation industry, Miller is tasked with improving mobility in Georgia by providing reliable, safe, innovative, multimodal transportation solutions as the leader of the Tollway Authority, Georgia Regional Transportation Authority, and the Atlanta Region Transit Link Authority. In the role, Miller seeks to add express lanes to GA 400 and will explore new ridership options for express commuter bus services.\nJerald Mitchell, MBA 2011 – President and CEO, Greater Columbus Chamber of Commerce\nMitchell took the reins of the Greater Columbus Georgia Chamber of Commerce in 2020 — becoming its first Black President — with the goal of attracting businesses to the area while improving local infrastructure. In the past year, Pratt & Whitney announced a $206 million expansion of its Columbus facility, creating 400 new jobs. Mitchell previously served as the vice president of economic development for Atlanta BeltLine Inc. and is the current president of Leadership Georgia, a statewide leadership development program.\nValerie Montgomery Rice, Chem 1983 – President and Dean, Morehouse School of Medicine\nRice strongly advocates for equity in the medical field as the first female president of the Morehouse School of Medicine. Under her leadership, Morehouse will establish the Maternal Health Research Center of Excellence. With funding from a National Institutes of Health grant, the center will develop methods to reduce maternal mortality rates. Since Rice assumed the role in 2014, Morehouse's M.D. candidates have doubled.\nWatch Rice’s May 2018 Georgia Tech Commencement Speech.\nHonorary Degrees:\nRaphael Bostic, HON Ph.D. 2022 – President and CEO, Federal Reserve Bank of Atlanta\nLeading the Federal Reserve Bank of Atlanta, Bostic is responsible for its monetary policy, bank supervision and regulation, and payment services. Bostic is a member of the Federal Open Market Committee, the monetary policymaking body of the Federal Reserve System. In 2021-22, Bostic served as the chair of the board of directors of the United Way of Greater Atlanta and chaired the Metro Atlanta Chamber of Commerce in 2022.\nWatch Bostic's May 2022 Georgia Tech Commencement speech.\nJames Quincey, HON Ph.D. 2020 – Chair and CEO, The Coca-Cola Company\nAs The Coca-Cola Company continues to experience sustained growth around the globe, including a $1 billion investment in India, the soft drink giant is also investing locally. In March 2023, Quincey and Coca-Cola announced $1.7 million in grants to be distributed to Atlanta youth organizations, including Atlanta Public Schools and the United Way of Greater Atlanta.\nWatch Quincey's December 2020 Georgia Tech Commencement speech.\nChris Womack, HON Ph.D. 2023 – President, CEO, and Chair, Southern Company\nIn March 2023, after previously leading Georgia Power, Womack became the president and CEO of Southern Company, which serves more than 9 million customers nationwide. The company has set a goal of reaching net zero emissions by 2050. Womack has been named among Black Enterprise’s 100 Most Powerful Executives in Corporate America and received numerous awards for his efforts as a civic and business leader.\nWatch Womack’s December 2023 Georgia Tech Commencement speech .\nRelated links\n'Georgia Trend' 2024 100 Most Influential Georgians\nContact\nSteven Gagliano\n- Institute Communications\nEmail\nSteven.gagliano@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}