{"text": "International Affairs Experts Discuss Kissinger’s Legacy | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nInternational Affairs Experts Discuss Kissinger’s Legacy\nExperts examine Kissinger's impact on the world and on the art of statecraft.\nFacebook\nTwitter\nEmail\nHenry Kissinger working aboard Air Force One in 1972.\nDec 01, 2023\nHenry Kissinger, a powerful former Secretary of State and advisor to 12 U.S. Presidents, was both a revered and an infamous diplomat.\nGeorgia Tech experts from the Sam Nunn School of International Affairs share their observations on his complex legacy and impact on the discipline of international affairs.\nFormer Senator Sam Nunn, Distinguished Professor of the Practice, Sam Nunn School of International Affairs\nHenry Kissinger made significant contributions to American security and global leadership while in office and continuing all of his life. I was fortunate to work with him, travel with him, learn from him, and enjoy his friendship.\nHe had a brilliant grasp of history and was a global strategist without peer. He was a superb writer and speaker whose ego was well balanced with a great sense of humor.\nHe was quick to understand that when threats change, we need to think anew. During our work together alongside George Shultz and Bill Perry in support of the vision and steps toward a world without nuclear weapons, I saw his often unrecognized but always present, deep commitment to build a more just and peaceful world.\nAdam Stulberg, chair and professor, Sam Nunn School of International Affairs\nHenry Kissinger was a paradigmatic scholar-policy practitioner. His intellectual mooring in the realist tradition of international relations nourished his stature as the 20th century’s leading practitioner of realpolitik.\nAs such, for many, he set the standard for “bridging the gap” between the worlds of academia and foreign policymaking that have since, in the main, grown apart.\nFor others, his cold and pragmatic fixation on the pursuit of American power and material interest came at the cost of upholding principles, norms, and values in diplomacy.\nThis enduring debate betrays\nKissinger’s distinct legacy for today’s students of international affairs: His career illuminated the promise of applying the rigors of scholarly insight as a benchmark for informing and assessing the contours of U.S. grand strategy, but the pitfalls of adhering too closely to antiseptic intellectual artifacts as lodestars for navigating the nuances, complexity, humanity, and richness of international social interaction.\nRobert Bell, Diplomat-in-Residence, Sam Nunn School of International Affairs\nNo summary characterization can do justice to the comprehensive, complex, and at times, conflicting contributions made by Dr. Henry Kissinger to America’s national security during his 100 years of life. For the sake of brevity, though, one can focus on 10 accomplishments and personal characteristics that perhaps best define the man.\n1. Articulation of nuclear deterrence doctrine: as a professor at Harvard, Kissinger, in concert with other great U.S. theorists such as Bernard Brodie and Thomas Schelling, succeeded in outlining a conceptual basis for the U.S./Soviet nuclear stand-off, commonly known as “Mutual Assured Destruction (MAD),”. During the four decades of the Cold War, it helped ensure that no nuclear device was ever employed in anger by either superpower.\n2. Bringing the Vietnam War to a close: as President Nixon’s National Security Advisor and, for a few years simultaneously as Secretary of State, Kissinger managed the diplomatic process that resulted in the United States withdrawing from South Vietnam and gaining a “decent interval” before that nation and former ally fell to the North Vietnamese — but only after having spent several years during the war escalating the conflict to try to gain a “victory” (e.g., ordering the secret bombing of North Vietnamese targets in Cambodia, expanding the war into Laos, and directing the massive U.S. bombing of North Vietnam that was known as the “Rolling Thunder” air campaign).\n3. Opening to China: in a classic display of realpolitik and “triangulation,” Kissinger convinced the formerly rabid anti-Communist president, Richard Nixon, to go to Beijing and establish diplomatic relations with the Communist-led People’s Republic of China, thereby offsetting Soviet power and exploiting inherent tensions and rivalries between these two Communist nations, though at the cost of effectively “throwing democratic Taiwan under the bus.”\n4. First Cold War initiatives on arms control and détente: Kissinger oversaw negotiations that resulted in the SALT I Interim Agreement on Strategic Offensive Arms and the Anti-Ballistic Missile (ABM) Treaty, thereby ushering in a period of détente in U.S./Soviet relations.\n5. Support for Israel: Kissinger worked diligently to try to promote a lasting peace in the Middle East. When that proved a bridge too far, he acted as a stalwart ally of Israel, including during the 1973 Arab-Israeli War, when, after U.S. intelligence discovered that the Soviets were preparing to send airborne regiments to intervene on the side of Egypt, Kissinger advised President Nixon to order U.S. military forces to DEFCON 3 (a status that assumes a nuclear war may be “imminent”) and to send General Secretary Brezhnev an urgent demarche warning that the United States would respond with all appropriate force should the Soviet troops actually be deployed.\n6. Helping America survive Watergate: in the face of President Nixon’s increasingly erratic and potentially catastrophic leadership during the final days of the Watergate impeachment proceedings, Kissinger, together with Secretary of Defense James Schlesinger, kept enough “guardrails” in place within the Federal national security establishment to prevent disaster.\n7. Policy reversal on Ukraine: after first dismaying Ukrainian President Zelensky by advocating a ceasefire and negotiated resolution to the war precipitated by Russia’s illegal and brutal invasion of Ukraine in 2022, Kissinger reversed himself during the second year of the war and declared that Russia’s conduct of the war was so far outside international norms that Ukraine could not be expected to sue for peace and would necessarily need to try to prevail on the battlefield.\n8. Stalwart Republican: although every American President, starting with Nixon, sought and received Kissinger’s counsel, there was no disputing the fact that his political orientation strongly favored conservative Republicans.\n9. Supreme Ego: Kissinger was supremely confident in his own intellect and his appreciation of policy challenges and their recommended solutions, and he therefore tended to keep his own counsel and compartmentalize and marginalize others to keep them outside direct policy advisory roles at the highest level of the U.S. government (e.g., conducting secret “back-channel” negotiations with the Soviets on SALT I/ABM that were unknown even to the Chief U.S. Negotiator, Gerard Smith and his delegation in Geneva).\n10. Crossing Legal Lines: Kissinger will also be remembered for illegal activities that compromised American democratic principles and values, including ordering the wiretapping of journalists and directing covert coup campaigns in various Third World countries.\nLawrence Silverman, Diplomat-in-Residence, Sam Nunn School of International Affairs\n“I think the most notable aspect of Kissinger’s legacy as a U.S. official is his emphasis - when dealing with conflict - on U.S. leadership internationally and the ability of diplomacy to promote U.S. national interests more broadly. He had a belief that diplomacy can accomplish many things and that we should support, meaning with resources and politically, the efforts of U.S. diplomacy to deal with certain conflicts and situations.\nAnd yet, if Kissinger were working now, I think the diplomatic task would be more difficult and complicated. Countries’ power, which Kissinger assessed as a basis for his strategic thinking, is much more diffuse. For example, we weren’t talking about economic sanctions or cyber capabilities during his time. There are more diplomatic tools available now, but they’re harder to coordinate, and social media makes public diplomacy more challenging.\nKissinger had his successes, including the opening to China and a peace agreement between Egypt and Israel, but also took positions for which he was criticized, such as the bombing of Cambodia or not pressing for a solution to the Palestinian issue. Some of his diplomatic successes came in the midst of domestic political turmoil like Watergate. But I think he would look at our own internal political divisions in the U.S. as something that potentially weakens diplomacy - because you’re not always speaking with one voice. We used to speak about “politics stopping at the water’s edge.”\nIf you ask a U.S. diplomat what they take away from Kissinger beyond his stance on individual issues, they might say that his “realpolitik” outlook means to judge the situation as it is, not as you want it to be. You work with what you find and try to deal with that to your advantage, using changing realities on the ground in a way that you believe can benefit the U.S.”\nAdditional Images\nContact\nMegan McRainey\nIvan Allen College of Liberal Arts\nEmail\nmegan.mcrainey@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}