{"text": "Water on the Moon May Be Forming Due to Electrons From Earth | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nWater on the Moon May Be Forming Due to Electrons From Earth\nThe research, which was published in Nature Astronomy last month, has the potential to impact our understanding of how water, a critical resource for life and sustained future human missions to the Moon, formed and continues to evolve.\nFacebook\nTwitter\nEmail\nNov 09, 2023\nScientists have discovered that electrons from Earth may be contributing to the formation of water on the Moon’s surface.\nThe research, published in\nNature Astronomy , has the potential to impact our understanding of how water — a critical resource for life and sustained future human missions to Earth's moon — formed and continues to evolve on the lunar surface.\n“Understanding how water is made on the Moon will help us understand how water was made in the early solar system and how water inevitably was brought to Earth,” says\nThom Orlando ,\nRegents' Professor in the School of Chemistry and Biochemistry\nwith a joint appointment in the\nSchool of Physics , who played a critical role in the discovery alongside\nBrant Jones ,\na research scientist in the School of Chemistry and Biochemistry at Georgia Tech.\n“Understanding water formation and transport on the Moon will help explain current and future observations,” Jones adds. “It can help predict areas with high concentrations of water that will help with mission planning and in situ resource utilization (ISRU) mining. This is absolutely necessary for sustained human presence on the Moon.”\nThe role of solar wind\n“Water production on airless bodies is driven by a combination of solar wind, heat, ionizing radiation and meteorite impacts,” Jones explains.\nSolar wind\n—\na continuous stream of protons and electrons emitted by the Sun, traveling at 250 to 500 miles per second\n—\nis widely thought to be one of the primary ways in which water has been formed on the Moon.\nWhile solar wind buffets the Moon’s surface, Earth is protected due to its magnetosphere, a shield that forms as a result of the magnetic fields associated with the hot metals circulating in the Earth’s molten interior layers. However, solar wind is affected by the magnetosphere, forming the\nnorthern lights (aurora borealis) and southern lights (aurora australis)\nat Earth’s poles, and stretching the spherical shield into having a long “tail\" — the magnetotail — which the Moon passes through periodically on its orbit around Earth.  When the Moon is in the magnetotail region, it is temporarily shielded from the protons in solar wind, but still exposed to photons from the Sun.\n\"This provides a natural laboratory for studying the formation processes of lunar surface water,\" says University of Hawai‘i (UH) at Mānoa Assistant Researcher\nShuai Li , who led the research study . \"When the Moon is outside of the magnetotail, the\nlunar surface\nis bombarded with solar wind. Inside the magnetotail, there are almost no solar wind protons and water formation was expected to drop to nearly zero.\"\nSurprisingly, while the Moon was within the magnetotail, and shielded from solar wind, the researchers found that the rate of water formation did not change. Since water was still forming in the absence of solar wind, the researchers began to theorize what could be responsible for forming the water.\nBuilding on previous research, Orlando and Jones hypothesized that electrons from Earth could be responsible.\nA work in progress\n“This work was actually based, in part, on our previous studies examining the role of ionizing radiation in metal-oxide particles present in nuclear waste storage tanks,” Orlando explains, adding that in a previous project as part of an Energy Frontier Research Center called IDREAM, they showed that water forms when a mineral called boehmite is irradiated with electrons produced by energetic particles after radioactive decay.\nWhile boehmite does not exist on the Moon’s surface, minerals with similar compositions are present, and Orlando and Jones theorized that, like the boehmite, irradiation from electrons might be producing water on lunar surface grains. “Despite the incredibly different physical environments,” Orlando says, “the chemistry and physics is likely very similar.”\nThe solar wind water cycle has the potential to make huge impacts on human discovery of the Moon and beyond.\n“While some of these water molecules will be destroyed by the Sun, some will eventually make it to the cold spots in permanently shadowed regions at higher latitudes,” Orlando says,\nin “the regions where some of the planned Artemis landings will be.”\nThe next step? “Our hope is to prove that the hypothesis is correct!”\nOrlando and Jones have been studying the role of solar wind on the\nin situ\nproduction of water on the Moon, Mercury, and other airless bodies as part of the NASA Solar System Exploration Research Virtual Institute (SSERVI) center called\nRadiation Effects on Volatile Exploration of Asteroids and Lunar Surfaces\n(REVEALS).\nThe realization that electrons from Earth were part of the dynamic lunar water cycle was a direct result of the interactions of several scientists with diverse backgrounds made possible by the SSERVI support. The work, which will further expand on the solar wind water cycle — including other sources of energy beyond surface temperature like meteorite and electron impacts — will continue in a new Georgia Tech-led SSERVI program, the\nCenter for Lunar Environment and Volatile Exploration Research\n(CLEVER).\nAdditional Images\nContact\nWritten by Selena Langner\nEditor: Jess Hunt-Ralston\nEmail\njess.hunt@cos.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}