{"text": "Not Forgotten | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNot Forgotten\nIn Georgia Tech’s history, there are many untold stories of people whose lives were shaped before segregation ended.\nFacebook\nTwitter\nEmail\nSam Bolton and the Three Pioneers in Harrison Square at Georgia Tech\nFeb 26, 2024\nFor every trailblazer, countless others are excluded, diminished, or told “No.” As easily as we celebrate progress, it is often even easier to forget the pain of those left behind.\nIn Georgia Tech’s history, there are many untold stories of people whose lives were shaped before segregation ended. By telling those stories, we uncover a more complex picture — and discover the power of acknowledging the past.\n‘This Mattered’\n“My grandfather’s history is Tech history,” said Samantha “Sam” Bolton. “Walking past the Trailblazers statue pains me, because my family experienced the same struggle — just too early to get any recognition at all.”\nBolton is a second-year student in the Scheller College of Business. Her grandfather, Robert Cheeseboro, applied for and was denied admission to Tech as a transfer student from Morehouse College in 1953. “This was a teenager who just wanted to be seen as a human being and wanted to get a degree. He wanted to innovate; he wanted to create things,” she said.\nTwo years ago, Bolton read her grandfather’s correspondence with Georgia Tech’s registrar and the Board of Regents in an archival collection her mother had tracked down online at the Library of Congress. “I don’t think I fully understood the gravity of it until we found correspondence with Thurgood Marshall,” she recalled, “and articles about him in newspapers throughout the country. So, I thought, OK, this mattered.”\nShe has been sharing her grandfather’s story ever since — because, she said, “The worst thing Tech did wasn’t to reject him; the worst thing they did was to forget him.”\nMoving Forward\nBolton wants to change that.\nIn 2022, she founded the Organization for Social Activism (OSA), which aims to spread awareness and education on current events and pursue justice through the principles of community, compassion, and collaboration.\nThe following year, OSA and the Georgia Tech Black Alumni Organization hosted a forum on the overturning of affirmative action by the U.S. Supreme Court and the need for open and transparent communication between students and administrators. And, she argued, it was necessary to be transparent about the past in order to navigate current policy changes and shape the future.\nHis Story\nCheeseboro was an aspiring mechanical engineer born in Mobile, Alabama, and raised in Columbus, Georgia. In February 1953, the honors student submitted his transcript and a recommendation letter to the Georgia Tech registrar. Months of silence passed, with Cheeseboro repeatedly asking for a response.\nFinally, the Board of Regents offered him scholarship aid to study engineering out of state, because engineering was not offered by any Georgia colleges open to Black students.\nMeanwhile, in June, four months after his transcript and recommendation letter submission, Georgia Tech’s registrar mailed the forms necessary for Cheeseboro to complete his admission application. They reflected a new policy adopted specifically to keep Cheeseboro, and other potential Black applicants, out: It required applicants to provide attestations of “good moral character” from two alumni.* In the segregated South, this was virtually impossible for Black students.\nSo, he decided to accept the out-of-state scholarship, moving to New York to attend the University of Rochester. After graduating, he settled in Crenshaw, California, where he earned patents — but little money — on numerous inventions, including a portable record player. In the face of ongoing racial barriers and with limited financial resources, he and his wife raised three daughters.\nHistorical Accountability\nMany decades later, Bolton achieved what her grandfather was prevented from doing, enrolling as an engineering student at Tech. In her second year, she switched to business, with a concentration in organization and leadership — and a plan to combine her passion for art and activism through nonprofit work, building art spaces in developing countries and low-income communities.\nBolton also wants to keep her grandfather’s story, and stories like his, alive. On Wednesday, Feb. 28, she and the OSA, along with archivists and members of the Student Government Association and the NAACP, will participate in a\nconversation\nhosted by the Library about Georgia Tech in the Jim Crow era, how desegregation happened at Tech, and historical accountability.\nCheeseboro died in 2022, before Bolton arrived on campus.\n“Even if he didn’t know it, he was a trailblazer,” she said. “I would want him to know that he genuinely paved the way for the people who came after him, and that I’m not going to let him be forgotten.”\n*NAACP Legal Defense and Educational Fund Records, Box 132, Library of Congress.\nAdditional Media\nSam Bolton, undergraduate business administration major\nRobert Cheeseboro\nRelated links\nBefore the First Three Event Information\nContact\nStacy Braukman\nInstitute Communications\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}