{"text": "Saving Hand Crafts through Algorithms | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nSaving Hand Crafts through Algorithms\nIndustrial Design's Lisa Marks wins Grand Prix for custom-crafted post-mastectomy bra.\nFacebook\nTwitter\nEmail\nThe Algorithmic Lace post-mastectomy bra uses 3-D weaving to conform to cancer survivors' bodies.\nApr 09, 2019\n— Atlanta, GA\nLisa Marks, assistant professor in the School of Industrial Design, and her Algorithmic Lace project won the Grand Prix at the Lexus Design Award Event at Design Week in Milan, Italy, April 8.\nMarks’ inventive design is a post-mastectomy, custom-crafted bra designed to avoid common bra discomforts after surgery.\nThe competition received more than 1,500 entries from up-and-coming creators around the world aspiring to “Design for a Better Tomorrow.” With a better tomorrow in mind, Marks’ design gives women an optimistic start in their new beginning.\nMarks was among six semi-finalists for the prestigious competition and the only semi-finalist from North America.\nMarks’ achievement stems from a career and research focus in methods of integration between endangered traditional handcraft with algorithmic modeling, with the aim of creating new modes of production. As a professor at Georgia Tech, Marks furthers her impact through her research lab focused on digital modeling combined with handcraft.\nIn a world where certain types of crafts are favored over others in design, Lisa Marks sees a need and an opportunity to blend industrial design and forms of traditional craft, not only for craft revitalization but for better, more inclusive design.\nThe Back-Story\nDuring Marks’ time as an Industrial Design student, she was involved in a material exploration project. From this project was born her initial point of focus when she decided on knit material as her point of exploration. Through the project, Marks created her first knitting tool.\nOver time, Marks began to approach the idea of knitting in different materials and participated in a project based around the bamboo trade in Thailand, in collaboration with the Thai government.\nIn a country rich in craft communities, how could a thriving bamboo trade help minimize its increasing wealth gap?\nIt has been years since Marks’ visit but she fondly remembers her travels to Thailand. Based on her observation, she felt that craft revitalization could help empower communities on the less fortunate side of the wealth gap.\n“It was really striking to see the wealth gap. 40% of their population only has 2% of the wealth, and if they were to continue to lose handcraft the wealth gap would have little room to improve,” Marks said.\nAs a professor at Georgia Tech’s School of Industrial Design, Marks advocates for empathetic design that humanizes innovative technologies to solve global problems. “Grad students are currently looking for creative ways to combine craft and industrial design to revitalize,” Marks said, showing the implications of her coursework in shaping proactive and solution-oriented design.\nIn her time in Thailand, Marks worked with craft communities to approach the problem with the wealth gap, a dilemma not unique to Thailand, and began to see the need for exportable modern design among craft communities. Marks ended up creating a series of objects that used parametric modeling to knit semi-rigid material with knit bamboo.\n“This led me to a larger interest in craft revitalization and different ways of thinking to incorporate craft and design,” she said. This approach directly impacted her decision to focus her thesis on a similar opportunity to revitalize the craft of Croatian bobbin lace.\nMarks’ approach is socially responsible and fills a growing need.\nThis is a form of design practice that not only thinks of the end-user, but also empowers the original designers, she said, the ones that are passing down centuries of historically driven design. “As designers, we can contribute. We can design objects using these techniques.”\nAs a professor at Georgia Tech, Marks teaches that design not only needs to express creativity, but also explore solutions around the world.\nThe original computers and binary code were inspired by the weaving process. Advancement and craft have always been integrated and there is importance in understanding the history of where things come from. “Let’s not forget the importance of craft in our modern world,” Marks said.\nWith advancement and craft in mind, Marks developed the idea of a post-mastectomy bra. One that could be custom-crafted for each woman to avoid common bra discomforts after surgery. Her unique research track helped identify Marks as a valuable faculty addition for the Industrial Design program, and in her short time at Tech, Marks has continued her exploration into handcraft and algorithmic modeling to further develop her designs.\nSchool of Industrial Design chair, Jim Budd, notes, “Lisa’s combined focus on the integration of craft and parametric modeling that leverages the latest advances in digital technology to produce new historically inspired woven materials is an ideal fit for our fast growing Industrial Design program here at Georgia Tech.”\nMarks has been very pleased with the support she has received. “My specialization has been valued and is encouraged at an R1 like Georgia Tech. Algorithmic Lace is now part of a design award!”\nWhile our society is currently obsessed with plastic, automation, and apps, Marks said, “the obsession with 'one' has also yielded to conversations about craft.\"\n\"Not everything is a smooth shiny object. When you go home and look around at your belongings, most of them are not that.” To Marks, it is evident people have begun to recognize that some crafts are dying out.\nCraft objects carry history and comfort that we want in our environment. “I think we have to fight to keep craft alive and part of that is incorporating craft into the built environment, which is what designers do,” she said.\nWeaving Design and Empathy\nFor years, Marks conducted 3-D modeling projects to analyze the base mathematics behind a stitch of a particular fabric and using that to create design. The idea of algorithmic patterning is using mathematic inputs to “model, in this case, each stitch on a micro level and mathematically modeling proportions, shapes and such,” Marks said.\n“I think understanding the math honors the history of how these patterns use to be integrated and their influence in inspiring others.”\nThe advancement of craft through the Algorithmic Lace project has a unique thought process for Marks.\n“As industrial designers, we can create objects by thinking of what we can do with our hands, but we can’t do with machines. We can make lace with machines, very easily, we do it all the time – but, as yet, machines cannot make three-dimensional lace,” she said.  This thought process applied to the idea of a post-mastectomy bra, and how craft can be revitalized from what a machine cannot do to enhance user experience.\nGiven that women with a mastectomy have very sensitive skin, “About 40 percent of women with a post-mastectomy choose to not have reconstructive surgery,\" Marks said.\n\"Many wear mastectomy bras and external prosthetics that are very heavy and create discomfort. Since seams, underwires, and traditional bras can be uncomfortable, with the Algorithmic Lace bra, you can create a three-dimensional bra that fits the body and honors whatever form the body is.\"\nThe way that the Algorithmic Lace is patterned creates an optical illusion of fullness, so when looking at a mirror there is a sense of symmetry where there isn’t, giving women an optimistic start in their new beginning.\nThe process of creating a custom bra requires the woman to have a 3-D body scan. The scan captures everything from size to depths and a program then takes a basic pattern on lace and morphs it onto the body. The base math can then be edited through the points and lines to make it more or less dense, and fully customized for the woman’s comfort.\nThere are many design choices that the woman can make. This freedom to decide empowers women. As Marks explained, “For instance, some women want it to look more symmetrical, some women may want more dense lace to follow the scar to have the bra express her shape. The pattern is up to women and their design choices.”\nWith about six months of aggregated work into the Algorithmic Lace design, Marks now advances to develop working prototypes with mentorship by highly respected world-class design leaders – and represents Georgia Tech and the United States on a high level. The prototypes will debut on April 8, 2019, during the Milan Design Week, where the Grand Prix winner of the Lexus Design Award 2019 will be announced.\nGiven the decline of different hand-craft skills, and the way that different communities depend on hand-craft, Marks said she believes it is worth thinking about how we can design in ways that are really efficient, modern, and exportable to create jobs in these communities. Marks would like to see the project move forward, even if not manufactured, as a speculative project. One that brings attention to craft revitalization through design. The possibilities of good design are endless.\nAdditional Images\nRelated links\nLexus Design Award\nContact\nalejandra.nash@design.gatech.edu\nEmail\nalejandra.nash@design.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}