{"text": "Dehydration Alters Human Brain Shape and Activity, Slackens Task Performance | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nDehydration Alters Human Brain Shape and Activity, Slackens Task Performance\nVisible proof that dehydration messes with the brain and cognitive performance.\nFacebook\nTwitter\nEmail\nIllustration for dehydration fMRI study. Free sources: Getdrawings.com and Remi Yuan on Unsplash\nAug 23, 2018\n— Atlanta, GA\nWhen dehydration strikes, part of the brain can swell, neural signaling can intensify, and doing monotonous tasks can get harder.\nWith the help of brain scans and a simple, repetitive task to test responsiveness, exercise physiologists at the Georgia Institute of Technology\nstudied volunteer subjects\nwho sweated a lot and did not hydrate. The fluid loss led most of the subjects to make more goofs on the task, and areas of participants’ brains showed conspicuous changes.\nThe researchers also found that even without dehydration, exertion and heat put a dent in test subjects’ performance, but water loss made the dent about twice as deep.\n“We wanted to tease out whether exercise and heat stress alone have an impact on your cognitive function and study the effect of dehydration on top of that,”  said Mindy Millard-Stafford, the study’s principal investigator and a professor in Georgia Tech’s School of Biological Sciences . “We found a two-step decline.”\nHeat, strain, accident\nThe researchers hope that someday this kind of research will offer insights into how increased cognitive slipups in hot settings with strenuous labor and poor hydration may endanger occupational safety, especially around heavy machines or military hardware. The fuzzed cognition could also contribute to reduced performance in competitive sports.\n“When I was just getting interested in this subject, my brother was doing an internship at a steel plant, where I visited him, and it was extremely hot,” said the study’s first author  Matt Wittbrodt , a former graduate research assistant at Georgia Tech. “In addition, everyone had on layers of protective clothing. We want to figure out if we can help prevent accidents in those environments.”\nMillard-Stafford and Wittbrodt, who is now a postdoctoral researcher at Emory University, published\ntheir study on Thursday, August 23, in the journal  Physiological Reports . Their research was partly funded by The American College of Sports Medicine Foundation.\nBrain ventricles expand\nIn the experiments, when participants exercised, sweated and drank water, fluid-filled spaces called\nventricles in the center of their brains\ncontracted. But with exertion plus dehydration, the ventricles did the opposite; they expanded.\nFunctional magnetic resonance imaging ( fMRI ) revealed the differences. Oddly, the ventricle expansion in dehydrated test subjects may not have had much to do with their deeper slumps in task performance.\n“The structural changes were remarkably consistent across individuals,” said Millard-Stafford a past president of The American College of Sports Medicine. “But performance differences in the tasks could not be explained by changes in the size of those brain areas.”\nChanges in neural firing patterns showed up during dehydration, too.\n“The areas in the brain required for doing the task appeared to activate more intensely than before, and also, areas lit up that were not necessarily involved in completing the task,” Wittbrodt said. “We think the latter may be in response to the physiological state: the body signaling, ‘I’m dehydrated’.”\nMind-numbing task\nThe task the subjects completed was mindless and repetitive.\nFor 20 straight minutes, they were expected to punch a button every time a yellow square appeared on a monitor. Sometimes the square appeared in a regular pattern, and sometimes it appeared randomly. The task was dull for a reason.\n“It helped us to avoid the cognitive complexity behind elaborate tasks and strip cognition down to simple motor output,” Wittbrodt said. “It was designed to hit essential neural processing one would use to make straightforward, repetitive movements.”\nPast studies have indicated that this kind of task reflects the neural processing involved in real-life motor functioning, especially in the repetition common in manual labor or military exercises. Such monotony can foster attention lapses that heat, strain, and fluid loss may exacerbate.\nSweating for science\nThirteen volunteers performed the task on three separate occasions:\nOnce after just relaxing and staying hydrated.\nOnce after extended heat, exertion, and sweat but  with  drinking water during exercise.\nAnd once with heat, exertion, and sweat but  without  drinking water.\nEven after just relaxing, task performance gradually slipped as the 20 minutes crept by. But under the subsequent stressors, average overall performance ratcheted down. A few of the volunteers did perform the task stalwartly under all imposed conditions.\nThe subjects completed the task in air-conditioned rooms and after a break from strenuous activity. In a real-world scenario, in which heat and toil are unrelenting, performance may collapse even further.\nOverhydration also bad\nGoing forward, the researchers would like to know if hydrating with electrolyte drinks might mitigate performance slumps even better than water did.\n“Blood plasma gets diluted with water replacement alone,” Millard-Stafford said. “If blood sodium -- plain old salt -- drops too much while water in the blood increases too much, that’s dangerous. It’s a condition known as water intoxication or\nhyponatremia .”\nUltra-endurance athletes who end up in the medical tent are sometimes suffering from dehydration but also sometimes from water intoxication. Just the right balance of water seems to be important for the brain.\nLike this article?  Subscribe to our email newsletter\nAlso READ:\nAs We Get Parched, Cognition Can Sputter\nGeorgia Tech’s Michael Sawka and Lewis Wheaton, and J. C. Mizelle of East Carolina University contributed to this study. Research was partly funded by The American College of Sports Medicine Foundation’s C. V. Gisolfi Doctoral Student Research Grant.  Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of The American College of Sports Medicine.\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia relations assistance : Ben Brumfield (404) 660-1408, ben.brumfield@comm.gatech.edu\nWriter:  Ben Brumfield\nAdditional Images\nEmail\nben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}