{"text": "Game Theory Shows How Tragedies of the Commons Might be Averted | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGame Theory Shows How Tragedies of the Commons Might be Averted\nGeorgia Tech researchers have developed a theory to unite the study of behavior and its effect on the environment.\nFacebook\nTwitter\nEmail\nGeorgia Tech researchers have developed a theory to unite the study of behavior and its effect on the environment, combining theories of strategic behavior with those of resource depletion and restoration, leading to what they term an “oscillating tragedy of the commons.” Shown is Professor Joshua Weitz. (Credit: Stephen Beckett, Georgia Tech)\nNov 09, 2016\n— Atlanta, GA\nLake Lanier in Georgia is the primary water reservoir serving suburban and metropolitan Atlanta. When the lake’s water level drops below a certain point, calls go out for water conservation and news reports show images of the red mud shoreline. In some affected counties, water restrictions are imposed. The combination of usage restrictions and changes in precipitation eventually averts the crisis. But, when the crisis ends, water usage rebounds – until the next shortage.\nInspired by this example, researchers at the Georgia Institute of Technology have developed a theory to unite the study of behavior and its effect on the environment. In doing so, they combined theories of strategic behavior with those of resource depletion and restoration, leading to what they term an “oscillating tragedy of the commons.” The research was reported in November 8 in the journal\nProceedings of the National Academy of Sciences .\nThe study of how behavior affects resource depletion has a long history. The originating example is that of small farmers who share a common pasture. Each farmer has to decide whether to graze some or all of his flock, while also considering what actions other farmers might take. To avoid losing out to a competitor, each farmer decides to attempt to maximize the benefit by grazing as many sheep as possible. Consequently, the sheep overgraze and damage the pasture. Paradoxically, the benefit to each farmer over the long run is less than if they had cooperated and each grazed fewer sheep.\nThat individuals acting out of their own self-interest can be worse off than had they coordinated is termed a “tragedy of the commons” – a concept introduced nearly 50 years ago by the ecologist Garrett Hardin. (The use of the term “tragedy” denotes its inevitability). However, the originating example does not include a mechanism by which incentives for cooperation change as the resource is depleted.\n“Our actions can substantively change the environment and, in turn, the changing environment influences the incentives for future action,” said\nJoshua Weitz , who led the study and is a professor in Georgia Tech’s\nSchool of Biological Sciences\nand director of the Interdisciplinary Graduate Program in Quantitative Biosciences. “The theory in our paper proposes a unified approach for the co-evolution of actions and environment.”\nOther authors on the study include postdoctoral fellow Ceyhun Eksin and graduate teaching assistant Keith Paarporn, both members of the Weitz group in the School of Electrical and Computer Engineering, as well as Professors Sam Brown and Will Ratcliff, both faculty in the School of Biological Sciences.\nThere are many other prominent examples of tragedies of the commons. One example is that of antibiotic resistance in microbes. The widespread use of antibiotics among humans and in agriculture selects for antibiotic resistance strains. Over time, the spread of resistance renders antibiotics ineffective for use in patients with otherwise curable infections. Hence, individuals trying to maximize their own benefit can unintentionally degrade the collective value of the antibiotics.\nAnother example stems from individual decisions about whether or not to vaccinate against childhood infectious diseases like measles, mumps and rubella. Crucially, a retracted study falsely linking autism to vaccination has inspired some parents not to vaccinate their children. Yet, when population levels of immunity drop, then these potentially lethal infectious diseases that had been prevented in the past will reappear in sporadic outbreaks or, dangerously, as large-scale epidemics.\n“Individual agents acting in their own self-interest – trying to do what’s right for them alone – can end up in a worse state than if they coordinated,” Weitz said. “For example, the decision not to vaccinate increases the frequency of individuals having a dangerous, infectious disease. As people see the disease return, the incentives for vaccination change.”\nThe research proposes a new model of evolutionary games with a feedback loop in which changes to the resource – whether it be water supplies, pastureland, antibiotics, or vaccine use – change the incentives for people to take action in their own interests. The environment and the incentives co-evolve and are tied to one another, allowing the outcome to be predicted.\n“Incentives to use a lot of water when water is in short supply are different than when water levels are replete,” Weitz said. “When things are bad and the commons is depleted, there may be greater incentives to cooperate than when the commons are in good condition.”\nUnlike in the originating example of the tragedy of the commons, Weitz and colleagues report that tragedies can recur again and again. Formally, the researchers unite game theory with evolutionary models in which both the tendency to cooperate and the state of the environment coevolve.\nThe theoretical research also pointed the way to a testable principle to avert the tragedy of the commons in specific application domains. For example, in their analyses, Weitz and colleagues found that averting the tragedy of the commons was only possible when cooperation was incentivized even when the environment was depleted and others continued to act to degrade the resources.\n“Another lesson is that idealism matters,” said Weitz, continuing, “A small group of cooperating individuals can, over time, change the social and environmental context for all and for the better.”\nThis work was supported by a grant W911NF-14-1-0402 from the Army Research Office. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the sponsor.\nCITATION : Joshua S. Weitz, Ceyhun Eksin, Keith Paarporn, Sam P. Brown and William C. Ratcliff, \"An oscillating tragedy of the commons in replicator dynamics with game-environment feedback,\" (Proceedings of the National Academy of Sciences, 2016).\nhttp://www.pnas.org/content/early/2016/11/02/1604096113.abstract\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contacts : John Toon (404-894-6986) (jtoon@gatech.edu) or Ben Brumfield (404-385-1933) (ben.brumfield@comm.gatech.edu).\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}