{"text": "New Section of the EcoCommons Opens for All to Enjoy | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNew Section of the EcoCommons Opens for All to Enjoy\nAs the construction fencing comes down, a fresh, new greenspace welcomes students for the spring semester.\nFacebook\nTwitter\nEmail\nA view from the granite outcropping toward the meadow and contemplative grove.\nJan 19, 2021\n— Atlanta, GA\nAs students, faculty, and staff have adjusted to new ways of studying, teaching, and working due to the coronavirus, the corner of Hemphill Avenue and Ferst Drive has been quietly undergoing changes as well. As the construction fencing comes down, a fresh, new greenspace welcomes students for the spring semester.\nThe campus EcoCommons is 80 acres of smartly designed and engineered performance landscape. This new 8-acre portion features more than 600 trees, tens of thousands of perennials, and an abundance of ferns and grasses. A granite outcropping adjacent to The Kendeda Building for Innovative Sustainable Design provides an area of engagement featuring multi-level grassy areas perfect for picnics and excellent views of the entire acreage. Nestled among the granite boulders will be three bright yellow slides slated for installation this March. Nearby, a “snag,” or dying tree, has been purposely left in the area to encourage a wildlife habitat, and work is ongoing to certify the area as an Audubon bird sanctuary. Close to Ferst Drive will be a temporary sculpture installation by Stickworks artist Patrick Dougherty. With the help of hundreds of campus volunteers, the piece, resembling a small fortress, blends seamlessly into the landscape. Read more about the artist and his work\nhere.\nTraversing the area are pervious pathways, wooden bridges, and natural trails that will encourage a relaxing walk in the park between classes and meetings. Benches throughout will provide additional places to rest and enjoy this refreshed and renewed area of campus. Landscape Project Manager Jerry Young has guided the site transformation and looks forward to seeing the Georgia Tech community enjoy its natural beauty. \"I've worked for Georgia Tech since 2006 and have overseen lots of projects. I can honestly say that this one was quite complex and extremely satisfying to watch evolve. I'm excited for spring to see it really come alive.\"\nAcross from Couch Park, a swath of tupelo trees strung with hammocks encircles a raised meadow planted with native grasses. There is also a contemplative grove, which pays tribute to and symbolizes an important moment in civil rights history. From 1947 to 1964, the Pickrick Restaurant stood on this portion of land and was the site of conflict over equal access to public accommodations. Historical signage will be in place to explain and contextualize the events that occurred there. Read more about the EcoCommons design, and the Pickrick and its significance,\nhere .\nThe EcoCommons is more than just a park. According to Jason Gregory, senior planner in Capital Planning and Space Management, “If people think this is just a park, we have failed.” Georgia Tech’s overall EcoCommons project envisions 80 acres of greenspaces throughout campus that follow what were once naturally occurring stream paths before urbanization. These greenspaces are being designed, connected, and engineered to reduce stormwater runoff by 50%, increase biodiversity on campus, and provide a living, learning laboratory for the Georgia Tech community.\nExtensive grading, soil amendments, and installation of drainage infrastructure were the first steps in transforming this area into an ecological treasure. Located near the Dalney Building is a large bioswale, capable of holding 500,000 gallons of water before releasing any of it back into the city’s water system. This large channel is designed to convey stormwater runoff while removing debris and pollution. A covered platform overlooks this seepage wetland and provides unique vantage points for observing this smart and effective water stewardship.\nLocated throughout the 8 acres will be numerous sensors connected to the LORA-WAN (Long Range Wide Area Network) Internet of Things (a networking protocol wirelessly connecting battery-operated “things” to the internet), which will measure air temperature and humidity, wind speed and direction, barometric pressure, carbon dioxide levels, soil moisture, and water depth and pressure. Sensors placed at Tech Green will allow for a comparison of data between its open, grassy expanse and this piedmont woodland. The trove of ecological data collected from the sensors will be available to campus operators, researchers, and students alike so that the entire campus community can leverage this living laboratory.\nWith more than 10 years in planning and design, this latest portion of the campus EcoCommons performance landscape exemplifies Georgia Tech’s commitment to the individual health and well-being of its campus inhabitants while supporting its sustainability initiatives well into the 21 st\ncentury.\nAdditional Images\nContact\nCathy Brim\nCommunications Officer\nSustainability, Facilities and Safety\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}