{"text": "Meet Chris Griffin, Title IX Coordinator | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMeet Chris Griffin, Title IX Coordinator\nAs the Title IX Coordinator, Chris Griffin is the designated Institute official with responsibility for coordinating the institute’s compliance with Title IX and other federal and state laws and regulations relating to sex-based discrimination.\nFacebook\nTwitter\nEmail\nChris Griffin is the Title IX coordinator for Georgia Tech. (Photo by Allison Carter)\nApr 28, 2022\n— Atlanta, GA\nChristina “Chris” Griffin is director of Equity and Compliance Programs and Title IX Coordinator in the Equity and Compliance Programs Office, which is part of Institute Diversity, Equity, and Inclusion.\nShe came to Georgia Tech last June from Kennesaw State University, where she was a Title IX civil rights investigator.\n“A friend worked at Tech and told me about the job opening,” Griffin said. “I loved Kennesaw and had no intention of leaving, but the job seemed like a great fit for me because I would focus on Title IX matters and sex discrimination matters exclusively. And that’s what I wanted to do.”\nAs the Title IX Coordinator for Georgia Tech, Griffin is the designated Institute official with responsibility for coordinating the institute’s compliance with Title IX and other federal and state laws and regulations relating to sex-based discrimination. Title IX became law in 1972.\n“Title IX says that no person shall, on the basis of sex, be discriminated against, be excluded from participation in, be denied the benefits of, or be subjected to discrimination under any education program or activity receiving federal financial assistance,” she explained. Title IX applies to students, faculty, and staff.\nGriffin gave examples of the types of things prohibited by Title IX.\n“Title IX prohibits sex discrimination, which has been defined to include sexual assault and sexual harassment, as well as sex-based discrimination in a school’s courses, programs, and activities, including its athletic programs. It also prohibits discrimination based on pregnancy,” she said.\n“Title IX is celebrating its 50th anniversary this year. Thanks to Title IX, there is greater acceptance of women in all roles of society. It’s all about opportunity and not limiting opportunity based on sex. Title IX has influenced American life and made it better for everybody,” she said.\nGriffin holds a Juris Doctor degree from the University of Virginia and a Master’s in conflict resolution from Kennesaw State University. She has worked as a government and private practice attorney. She also is a certified civil rights investigator, mediator, and conflict resolution professional.\nHer current projects include a collaborative effort with several campus partners to implement a new NCAA policy that requires schools to vet all incoming and transfer student athletes for Title IX or sexual misconduct disciplinary records.\n“Another project that I’m involved in is a campus wide, multi-department effort to assess and strengthen Georgia Tech’s capacity to address and end sexual violence,” she said. The project is a part of the National Association of Student Personnel Administrators’ Culture of Respect initiative.\n“Without question, the most rewarding part of my job is helping students by making sure they have the support and resources they need to get them through what is often the most stressful time of their lives,” she said.\nAway From Work\nGriffin is one of seven children born to a Croatian mother and an American serviceman father who met on a military base in Italy, where her mother worked as a telephone operator.\n“My three older siblings were born in Italy, and I was the first to be born in the United States,” she said.\nWhen she isn’t working, Griffin likes to have fun.\n“I enjoy spending time with my family first. I also enjoy spending time with friends, reading, hiking, doing yoga, and listening to podcasts.”\nGriffin’s husband David has been her biggest supporter. They have been married for 34 years and have three adult children — Michael, Andrew, and Claire.\nGriffin’s taste in books varies, but she leans toward autobiographies. “I just finished Victor Frankl’s  Man’s Search for Meaning,  which is the story of his experience in a Nazi concentration camp. I read it many years ago and I just read it again,” she said. “I also have an audiobook waiting for me — Maya Angelou’s  I Know Why the Caged Bird Sings  — which has been on my reading list forever.”\nAdditional Images\nRelated links\nRead More Staff Stories\nContact\nVictor Rogers\nInstitute Communications\nEmail\nvictor.rogers@comm.gatech.edu\nAdditional information\nThis year marks the 50th anniversary of Title IX, the most used name for the federal civil rights law in the United States that was passed on June 23, 1972. It is part of the Education Amendments of 1972 and prohibits sex-based discrimination in any school or any other education program that receives funding from the federal government.\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}