{"text": "Reframing Antarctica’s Meltwater Pond Dangers to Ice Shelves and Sea Level | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nReframing Antarctica’s Meltwater Pond Dangers to Ice Shelves and Sea Level\nThere's a speed limit on the damage surface ponds can do to ice shelves, but that doesn't mean the ponds aren't dangerous.\nFacebook\nTwitter\nEmail\nBefore its sudden shattering, numerous meltwater ponds riddled Antarctic ice shelf Larsen B. They are seen in this 2002 satellite image as a matrix of aquamarine spots. Scientists believe that the ponds hydrofractured the kilometer-thick ice shelf, causing its swift destruction. Credit: NASA Earth Observatory\nOct 29, 2019\n— Atlanta, GA\nDangers to ancient Antarctic ice portend a future of rapidly rising seas, but  a new study  may relieve one nagging fear: that ponds of meltwater fracturing the ice below them could cause protracted chain reactions that unexpectedly collapse floating ice shelves. Though pooled meltwater does fracture ice, ensuing chain reactions appear short-ranged.\nStill, massive increases in surface melting due to unusually warm weather can trigger catastrophic ice shelf collapses like that of the  iconic shelf “Larsen B,” which shattered in 2002 . Now, a study led by a researcher at the Georgia Institute of Technology has modeled fracture chain reactions and how much water it would take for a repeat of that rare, epic collapse.\nLarsen B’s disintegration was preceded by an atypical heatwave that riddled it with meltwater ponds, focusing researchers’ attention on pond fracturing, also called hydrofracturing. They discovered that a melt pond hydrofracturing the ice shelf can prompt neighboring ponds to do the same. Concerns grew of possible extensive chain reactions, which the new study addressed.\nToo much meltwater\n“The chain reactions will not spread that far on the ice shelf,” said Alex Robel,  an assistant professor in Georgia Tech’s School of Earth and Atmospheric Sciences . “Normally, it would take many years for the chain reactions to have an effect on the integrity of the ice shelves. But there’s a caveat. Ponds that are close together and growing rapidly deeper could destroy the ice’s integrity.”\n“There is a speed limit in the study that shows that an ice shelf can’t collapse ridiculously fast,” said co-author Alison Banwell, a  glaciology researcher at the University of Colorado Boulder . “However, if it becomes as covered in meltwater ponds very quickly like Larsen B was, it can collapse in a similar way.” She added, “Multiple hydrofracture chains originating in different areas of an ice shelf could also lead to a larger-scale ice shelf breakup.”\nThe researchers  published their results in the journal  Geophysical Research Letters  on October 24, 2019. The research was funded by the National Science Foundation and the Cooperative Institute for Research in Environmental Sciences at CU Boulder. An unrelated,  recent study  reported a record number of meltwater ponds on Antarctica.\n“Currently there are not nearly enough ponds on any ice shelf for a repeat of Larsen B, but much meltwater is weighing on ice shelves and contributing damage to them,” said Banwell, who helped pioneer hydrofracture research on ice shelves.\nQ&A\nBroken ice shelves themselves don’t add much to sea level. So, why care?\nIce shelves float in the ocean, where they already contribute to sea level, so when they break up or melt, they don’t add much more to it. But many ice shelves push back against glaciers on land that do drive up sea level when they enter the ocean.\nWith the shelf gone, the speed of glacial flow can jump four- to tenfold. Glaciologists were not aware of this until Larsen B, which was a kilometer (0.62 miles) thick with a surface of 3,250 square km (1,250 square miles), splintered within weeks, and glacial flow behind it surged.\n“Our research field thought ice shelves weren’t too important, then Larsen B showed us that was incorrect. Buttressing by ice shelves really is the thing that stabilizes the glaciers. Few issues are more significant than those that this study addresses,” said Brent Minchew, an  assistant professor of geophysics at the Massachusetts Institute of Technology .\nMinchew was not involved in the study but recently co-published another study that relates to it. The MIT study rules out one absolutely nightmarish scenario of rapid glacier fracture due to the disappearance of ice shelves. But he and the other researchers reiterated that glacial flow nonetheless speeds up strikingly when ice shelves disappear.\nAlso, most Antarctic ice shelves probably formed in the last ice age, and it could take another ice age to replace them.\n[Ready for graduate school?  Here's how to apply to Georgia Tech. ]\nHow does hydrofracturing work, and how did the study model its effects?\nWhen meltwater ponds on top of cracks in the ice grow heavy, they can hydrofracture the ice.\n“The water pressure concentrates down to a point called a crack tip. It tries to push the crack apart and make it deeper, and the ice pushes back. When the water gets deep enough, it can win out and propagate the crack to the bottom of the ice shelf,” Robel said.\nThe water drains down the crack, into the ocean, then the ice hops back up, making new cracks that can trigger neighboring ponds to hydrofracture, too. The study showed that this would encompass only small numbers of ponds.\nConveniently for Robel, who explores ice dynamics with math, physics, and computer science, as ice shelves form, regimented matrices of surface dents appear in them, and that’s where the ponds collect.\nRobel could apply computer science modeling called  cellular automata  – known from pixelated matrix-like  video games  – to model hydrofracture chain reactions. The model even outputs animations that the researchers named “minesweeper plots” after the  classic 1990s computer game .\nDoes the study mean there is less danger than before of glacial flow accelerating?\nNo, the study simply adds to scientific knowledge, and actually, the flow of some glaciers on Antarctica has already sped up a lot.\n“Maybe this mechanism is not something we have to worry as much about. But we shouldn’t breathe a sigh of relief because there are plenty of other ways of getting a whole lot of ice out of West Antarctica quickly,” Minchew said.\nPerhaps the greatest potential for glacier loss is instability where glaciers rest on the ground next to seawater. A  study Robel published in July  projected that instability to be extremely likely to accelerate sea level rise.\nHow does this study help advance glacier research?\nIt makes it easier to look for harbingers of ice shelf damage.\n“Looking at the volume of water on the surface of the ice is much easier than looking for stress failures within the ice,” said Banwell, who will visit Antarctica in November to study melt ponds on the George IV ice shelf.\nAlso READ:  Instability in Antarctic Ice Projected to Make Sea Level Rise Rapidly\nThe research was funded by the National Science Foundation (grants NSF PLR-1735715 and NSF PLR-1841607) and by the Cooperative Institute for Research in Environmental Sciences at CU Boulder. Any findings, conclusions or recommendations are those of the authors and not necessarily of the funding agencies.\nWriter & Media Representative : Ben Brumfield (404-272-2780)\nEmail:  ben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nAdditional Images\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}