{"text": "Observatory Catches Neutrinos in a South Pole Block of Ice | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nObservatory Catches Neutrinos in a South Pole Block of Ice\nThe IceCube Neutrino Observatory is helping unravel one of the key scientific mysteries.\nFacebook\nTwitter\nEmail\nThe IceCube Observatory at the Amundsen-Scott South Pole Station, in Antarctica, hosts the computers collecting raw data. Due to satellite bandwidth allocations, only certain data can be sent to the University of Wisconsin-Madison for further analysis. (Credit: Sven Lidstrom)\nDec 17, 2013\n— Atlanta, GA\nScientists are using a one cubic kilometer block of ice at the South Pole to help unravel one of the great scientific mysteries of our time. The block is part of IceCube, an observatory built in one of the most inhospitable parts of the world to study neutrinos zipping through the Earth from outer space. These subatomic particles normally pass through the Earth as easily as light passes through a pane of glass.But a few of them crash into the ultra-clear ice of IceCube. When they do, they produce secondary particles that can create a faint bluish light called Cherenkov radiation. Scientists like Ignacio Taboada, an assistant professor in the Georgia Tech School of Physics, are using information from that glow to learn more about these neutrinos – including, perhaps, where in the universe they came from. Using data collected between May 2010 and May 2012, IceCube has measured 28 neutrinos that likely originated outside our solar system, the first time such very-high-energy cosmic neutrinos have been observed. As the IceCube Neutrino Observatory celebrates the third anniversary of the end of construction on Dec. 18th, it is receiving the “Breakthrough of the Year” award from the British journal\nPhysics World\nfor observing these cosmic visitors. “We now know that neutrinos from outside our planet are there, and we saw roughly as many as we had expected,” said Taboada, who has been part of the IceCube Collaboration team for 14 years and was a co-author of the Nov. 22 paper in the journal\nScience\nthat reported the neutrino findings. “We have learned some things about neutrinos, but there are still other things that we still don’t understand.” The centerpiece of IceCube is a matrix of 86 strings of basketball-sized optical detectors placed one and a half kilometers beneath the Antarctic snow. Each string includes 60 optical detectors that are so sensitive they can register a single photon. Dug into the ice by a special hot-water drill, the strings are arranged in a pattern designed to use the Cherenkov radiation to map the path of neutrinos through the ice. By observing the path of the particles through the ice block, scientists had hoped to learn where the particles originated in space. But from the 28 neutrino events observed, that hasn’t yet been possible. “So far, we are not seeing individual sources for the neutrinos,” said Taboada. “We are not seeing any place in the sky that we can point to and say that we see even three or four of the neutrinos coming from. It is very diffuse. It may be that the sources are very weak, or that we have a detector that is not large enough.” Neutrinos are nearly-massless particles that carry no electrical charge and originate from a variety of sources, including radioactive decay, our own Sun, cosmic rays and events such as exploding stars. From May 2010 to May 2012, IceCube recorded 28 neutrinos with very high energy levels – above 30 trillion electron volts – suggesting they were from beyond our own solar system. One challenge for the nearly 300 scientists involved in the program is separating cosmic neutrinos from those that originate on Earth. Cosmic neutrinos tend to have much higher energy levels, which can be measured by the amount of light they produce in the ice. Their direction also gives a clue; only cosmic neutrinos can pass through the Earth into the ice. Built with funds from the National Science Foundation and scientific organizations from three European countries, IceCube was also designed to measure cosmic rays, which accompany the formation of neutrinos. The existence of cosmic rays has been known for more than a hundred years, but their sources are also unknown. “This is essentially the birth of a new branch of astrophysics,” said Taboada. “We’ve observed the universe with photons, and now we can observe using neutrinos.” IceCube is also facilitating Taboada’s own research on gamma-ray bursts, which is being conducted with Ph.D. students James Casey and Jacob Daughhetee. “Gamma ray bursts are gigantic explosions that last for only a few seconds,” Taboada said. “Over those few seconds, they are so bright that they can outshine the rest of the universe combined. They are brief, but they are very powerful while they last.” Scientists believe that there are at least two kinds of gamma ray bursts: those associated with supernovas that eject jets of matter and radiation, and neutron stars that spiral together and eventually merge. Neutrinos from gamma ray bursts can also be detected by IceCube. IceCube was built at the South Pole to take advantage of the very clear ice available there and the darkness within the ice. “We used Antarctic ice because we needed a highly transparent material to observe the Cherenkov radiation,” explained Taboada. “The ice allows us to see evidence of these secondary particles.” But that transparency has a cost. The South Pole experiences extremely cold temperatures, and everything used there must be flown in. Taboada has been to the South Pole three times, each time for a month during the Antarctic summer – when temperatures can still be as low as 45 degrees below zero Celsius (minus 49 degrees Fahrenheit). “It’s a very work-oriented place,” he said. “Because it is so difficult to get there, you work every day, 12 and 15 hours a day. At the end of a month, you are exhausted.” During the summer – November through February – as many as 150 people work at the South Pole facilities, known officially as the Amundsen-Scott South Pole Station. During the Antarctic winter, only 50 or 60 people work there, and aircraft don’t land except in extreme emergencies. While space is tight, the station does have a music room, gymnasium and basketball court, along with a greenhouse for growing fresh vegetables. Water is precious because it is obtained by melting ice, so researchers are limited to two two-minute showers per week. Construction of IceCube began in 2005, and the facility – now managed by the University of Wisconsin – was turned on in December 2010. With participation from 41 institutions in 12 countries, IceCube is expected to operate for at least ten years. Already, however, there is discussion about enhancing its capabilities – and perhaps expanding it to capture more neutrinos. Basic science done in facilities like IceCube is really all about human curiosity – which often ends up having a more practical benefit. “Basic science is not always about finding a cure for cancer,” Taboada said. “But if you look at the last 400 years of basic scientific discovery, research and basic science have time and again resulted in a better life for humans. Satisfying that human curiosity often turns out to be a very long-term, very high-risk and very high payoff investment. That’s a basic reason to do science.” Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia  30332-0181  USA   Media Relations Contacts : John Toon ( jtoon@gatech.edu )(404-894-6986) or Brett Israel ( brett.israel@comm.gatech.edu )(404-385-1933). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}