{"text": "Informatics Accelerates Design of Hybrid Membrane Materials for Chemical Separations | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nInformatics Accelerates Design of Hybrid Membrane Materials for Chemical Separations\nA $1.7 million award from the National Science Foundation (NSF) will help a team at the Georgia Institute of Technology develop much cheaper ways to separate chemicals using membranes that could potentially replace energy-intensive distillation processes.\nFacebook\nTwitter\nEmail\nThis image shows an elemental map collected with electron microscopy of a fractured cross-section of hybrid hollow fiber membrane with a radius of about 500 μm. Green dots signify locations of the metal oxide within the membrane. This image shows that metal oxide infuses throughout the entire membrane. Microscopy was done by Fengyi Zhang at Georgia Tech’s Materials Characterization Facility.\nNov 08, 2019\n— Atlanta, GA\nVast amounts of energy are consumed each year for chemical separation processes – a precursor to the production of everything from gasoline to food.\nA $1.7 million award from the National Science Foundation (NSF) will help a team at the Georgia Institute of Technology develop much cheaper ways to separate chemicals using membranes that could potentially replace energy-intensive distillation processes.\n“Membranes have the potential to reduce energy consumption in chemical separation processes by as much as 90%,” said Mark Losego, an assistant professor in the School of Materials Science and Engineering, and the principal investigator for the project. “But most of today’s mass-manufactured membrane materials degrade under the chemical conditions required for many important chemical separations.”\nRecently, Losego’s research team in collaboration with Ryan Lively, an associate professor in Georgia Tech’s School of Chemical and Biomolecular Engineering and co-PI on the project, described a new process for taking a polymer-based membrane and infusing it with a metal oxide network. The resulting membrane is far more effective at standing up to harsh chemicals without degrading.\n“Plastic membranes are easy to mass manufacture, but they tend to dissolve when used with harsh chemicals, while inorganic membranes are more stable but are difficult to produce in large quantities,” Losego said. “This new process creates a membrane with the best characteristics of both types of materials, one that we call a hybrid membrane.”\nThe new process involves placing a prefabricated plastic membrane inside a reactor, which exposes the membrane to metal-containing vapors that infuse inside the material. This process is called vapor phase infiltration, and it creates a uniform network of metal oxide throughout the polymer membrane.\nThe new grant will enable researchers to use computer simulations and data analytics to speed up the process of finding new ways to infuse inorganic materials into polymer-based membranes, with the goal of developing a range of new membranes that could be used for a variety of separation tasks.\n“Atomic simulations and data-driven methods such as machine learning can significantly accelerate the design and discovery of new application-specific materials,” said Rampi Ramprasad, a professor in the School of Materials Science and Engineering and another co-PI on the project.\nThe machine learning process involves taking materials data that is already available and using powerful computers to automatically and progressively learn their strengths and weaknesses and how those materials might combine to form materials with new properties.\n“These methods allow us to virtually screen thousands of new materials before they are made to provide guidance for the specific types of materials that should be made and tested,” Ramprasad said.\nThis new NSF program will combine data collected from experiments with computational simulations to accelerate the development of these hybrid membrane materials, enabling new separation processes that lower production costs and are more environmentally friendly.\nThis new project will be funded through the National Science Foundation’s Designing Materials to Revolutionize and Engineer our Future, Award 1921873. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the National Science Foundation.\nAdditional Images\nContact\nJohn Toon\nResearch News\nEmail\njohn.toon@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}