{"text": "Lecture Series Highlights Georgia’s Role as 2024 Battleground State | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nLecture Series Highlights Georgia’s Role as 2024 Battleground State\nThe Ivan Allen College of Liberal Arts recently hosted a discussion examining Georgia’s rise to becoming one of the most intriguing political battlegrounds for 2024 and beyond.\nFacebook\nTwitter\nEmail\nThe Atlanta Journal-Constitution's Greg Bluestein speaks during Thursday's seminar at the Bill Moore Student Success Center.&nbsp;\nSep 18, 2023\nGeorgia and its 16 electoral votes will be highly sought-after in the 2024 presidential election. This will put Georgia at the forefront of the national conversation as the campaign cycle ramps up, cementing its status as a battleground state.\nHelping to examine the state’s place in the national landscape, the Ivan Allen College of Liberal Arts hosted the\nAtlanta Journal-Constitution 's Greg Bluestein at the Bill Moore Student Success Center on Sept. 14 as part of the\nMeg and Sam Flax Lecture Series on Public Policy . Bluestein has covered Georgia politics for more than 20 years and has documented the state's shift from Republican stronghold to its current battleground status.\nHe believes Georgia could be the center of attention for years to come. Starting with the 2024 election cycle, he urged everyone, especially students, to take advantage of this unique learning opportunity.\n\"Georgia is going to remain the center of the white-hot national spotlight for the next decade,” he said. “Students here at Georgia Tech who are studying public policy or whatever it may be can see how what they're doing is implemented on a national scale.\"\nWhy Georgia?\nBluestein explained how independent voters and those continuing a \"split-ticket\" trend across the state have decided recent elections, primarily the 2020 presidential election, a race that helped decide control of the U.S. Senate, and the most recent gubernatorial race. With this trend likely to continue, Bluestein, who wrote a book chronicling the events surrounding the 2020 election in Georgia, told the audience how that has affected candidates' view of the state heading into the future.\n\"Every Republican and most Democrats say there is really no path to victory for any Republican candidate without winning Georgia. So, whether you like it or not, we're about to be the center of national attention, even more than we already are, which is hard to believe.\"\nAddressing the students in the audience, he went on, \"That's the beauty of where you are. You'll have a chance in the coming months and years to work for candidates, campaigns, and causes. Be directly involved if you want. Cover them for the media. But also go to their rallies and events –– candidates you like and candidates you don't like. You'll be on the ground level to be able to see these candidates up close and personal.\"\nPolitics on Campus\nLike any campus around the country, Georgia Tech's student body is made up of Republicans, Democrats, independent voters, and those who stay out of the political fray. While politics can involve disagreement, the Institute has received recent praise for its efforts to\nprotect freedom of expression for all on campus .\nAssociate Professor\nRichard Barke\nbelieves the Institute’s policies and efforts in this regard empower students to seek out differing viewpoints and to learn from one another.\n“Any institution of higher learning has an obligation, both legal and intellectual, to encourage diverse political views to be held, discussed, and respected. It also must do something that no other institution can do: challenge students to test ideas, whether their own or those of others. At Georgia Tech we take these duties seriously,” he said. “Our students learn how political processes work, not which political values are superior or which outcomes should be dictated by individual preferences. They can, and do, use this knowledge to analyze and promote policies across the political spectrum.”\nSecond-year public policy student Luis Salazar attended Thursday's seminar and sees events such as this as a way to engage with his fellow Yellow Jackets about real-world issues.\n\"This is a place to come together, and the Institute's reputation makes it the perfect place for professionals and experts to interact with students who want to be involved in the political process. I appreciate how Tech facilitates these debates and conversations,\" he said.\nCountless questions remain unanswered for both parties ahead of 2024, but Bluestein emphasized that, as candidates vie for the approval of young voters, students will have the power to make their voices heard.\n\"You'll be in the middle of it here at Georgia Tech. Smart candidates will come to college campuses to try to attract young voters, not just to vote but to work on their campaigns. Students and faculty here will have a chance to ask questions that other folks might not be asking about, whether it be about higher education funding, student policies, student debt relief, or any other issues that are top of mind,” he said.\nThe first true litmus test for the state in the upcoming election will take place on March 12 during Georgia's primary elections.\nAdditional Images\nRelated links\nUSG Political Activity Policy\nContact\nSteven Gagliano\n- Communications Officer\nInstitute Communications\nEmail\nsteven.gagliano@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}