{"text": "Semiconductor Company Falcomm Raises $4M in Seed Funding to Advance Ultra-Efficient Power Amplifiers, Hires Industry Leaders | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nSemiconductor Company Falcomm Raises $4M in Seed Funding to Advance Ultra-Efficient Power Amplifiers, Hires Industry Leaders\nSeed round includes four investor partners\nFacebook\nTwitter\nEmail\nEdgar Garay is CEO and founder of Falcomm.\nNov 29, 2023\nSquadra Ventures\nled the round with participation from Cambium Capital, Draper Cygnus, and the Georgia Tech Foundation.\nFalcomm is built on breakthroughs made over six years in the lab of founder and CEO Edgar Garay to revolutionize the power amplifier, a semiconductor found in devices from satellites to IoT to cellphones, that conditions and blasts the 1s and 0s from software through an antenna. Falcomm’s Dual-Drive PA combines ultra-efficient performance with an architecture that lends itself to production at scale.\n“Power amplifiers are the workhorse of the modern electronic era, but improvement to this technology hasn’t kept pace with the rise of the innovation economy,” said Garay, who holds a doctorate in electrical engineering from Georgia Tech’s\nSchool of Electrical and Computer Engineering , where he conducted the research that led to the formation of his startup.\n“Falcomm’s ultra-efficient, silicon-proven technology will bring advances in power and efficiency to the semiconductor industry that help communications manufacturers to realize massive efficiency gains, while lowering costs. With urgent challenges in the environment and supply chain, we can’t wait another 90 years for change.”\nWith simultaneous transmission at each terminal of a transistor, the Dual-Drive PA delivers performance that is 1.8 times more efficient at 2 times higher power, with half of the silicon area requirements of traditional power amplifiers. For manufacturers, these gains will reduce thermal management and energy costs, while easing overall system requirements.\nA patented architectural design allows the product to be manufactured in high volume by semiconductor foundries in the United States. With fabless technology, the company is poised to grow a network of industry partners that catalyzes expansion in the $23 billion power amplifier market.\nBorn in Venezuela, Garay developed a passion for using science and engineering to solve problems while repairing machinery on a farm in his hometown. While pursuing doctoral studies at Georgia Tech, he recognized the opportunity to bring innovation to the power amplifier, which had not changed in decades despite the rapid advance of technology and its critical role in devices.\nGaray’s research resulted in multiple patents, spurring him to spin out the technology and create Falcomm through assistance from Georgia Tech resources, including  VentureLab   and  CREATE-X . Falcomm is the first company to receive investment from the Georgia Tech Foundation.\n“Georgia Tech is proud to support our academic innovators to help them ensure their inventions have real-world impact,” said Raghupathy Sivakumar, Georgia Tech’s vice president of Commercialization and chief commercialization officer. “The Office of Commercialization is rapidly expanding our programs and initiatives to build out the largest and most robust entrepreneurial ecosystem at any public university. I am happy to say that Falcomm is the recipient of the first equity investment out of our new Research Impact Fund targeted specifically at\nspinouts based on Georgia Tech  intellectual property.\"\nThe Falcomm team was recently bolstered by the addition of pioneering industry leaders who have demonstrated a track record of innovation in telecommunications, wireless, and semiconductors:\nThomas Cameron, Ph.D., chief strategy officer,   is a 35-year veteran of technology research and development in the wireless industry. During a 12-year stint at Analog Devices, Cameron served as chief technology officer of the Communications Business Unit and was a leading evangelist for the adoption of 5G connectivity. He held leadership and engineering roles in the RF industry at Bell Northern Research, Nortel, Sirenza Microdevices, and WJ Communications. Cameron has seven patents in wireless technology and has authored numerous papers and technical articles.\nNed Cahoon, director of Foundry and Customer Relationships,   brings more than 20 years of RF business development experience across the mobile and wireless infrastructure industries. He helped to stand up IBM’s $1 billion RF business before joining GlobalFoundries in 2016, where he served as a fellow in the office of the chief technology officer. A senior design and go-to-market leader, Cahoon brings experience building networks across foundries, academia, and technology companies.\nFor Falcomm, the funding follows quickly on the heels of the company’s selection to the TechCrunch Startup Battlefield 200 in 2023. The company is a graduate of the  Berkeley SkyDeck Accelerator   and the  EvoNexus incubator .\nBringing innovation to the tiny power amplifier can have a massive impact on some of the nation’s most pressing challenges. The energy efficiency gains resulting from an increase in power output come at a time of growing urgency around climate change. The ability to manufacture domestically comes at a time when nearshoring is a priority to address cost and supply chain challenges underscored by the global semiconductor shortage and resulting CHIPS Act.\n“Edgar and his team are just as inspiring as they are hard-working. They have shown that it’s possible to assemble the talent and operations to innovate on a foundational technology that hasn’t seen meaningful advances in decades anywhere in the country,” said Guy Filippelli, Squadra Ventures’ managing partner. “By boosting efficiency and manufacturing domestically in the critical semiconductor industry, Falcomm’s innovations will bolster American competitiveness.”\nThe funding will be used to accelerate go-to-market activities with satellite companies and wireless infrastructure manufacturers, advance the company’s patented technology, and expand the team. Falcomm is actively hiring for roles in operations, engineering, and design.  View job openings .\nAdditional Images\nContact\nFor Falcomm:\nStephen Babcock,  stephen@squadra.vc\nFor Georgia Tech:\nPéralte C. Paul\nperalte@gatech.edu\n404.316.1210\nEmail\nperalte@gatech.edu\nAdditional information\nAbout Falcomm\nFalcomm is a fabless semiconductor company on a mission to provide the most energy efficient power amplifier products and front-end modules for the wireless communication market. The company’s research-backed, patented Dual- Drive™ power amplifier is an ultra-efficient, silicon-based power amplifier for wireless communication applications. Learn more at  myfalcomm.com .\nAbout Squadra Ventures\nSquadra Ventures is a venture capital firm led by founder-operators that invests in early stage cyber and national security companies. Grounded in the belief that success is a combination of people, product, and planning, the Squadra team provides transformational support to startup leaders in the complex dual-use technology ecosystem. By applying a growth-stage mindset at the seed stage and a commitment to building alongside entrepreneurs, Squadra empowers extraordinary teams to win and leave a lasting positive impact on the world. Learn more at squadra.vc.\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}