{"text": "Buzzing the Vagus Nerve Just Right to Fight Inflammatory Disease | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nBuzzing the Vagus Nerve Just Right to Fight Inflammatory Disease\nAn electric buzz to the vagus can fight chronic inflammation -- this fine-tune makes it even better.\nFacebook\nTwitter\nEmail\nA vagus nerve implant with two electrodes - one to apply desired stimulation going down into the body, the other to block unwanted stimulation going up to the brain.  Georgia Tech / Rob Felt\nJan 05, 2017\n— Atlanta, GA\nIs a treatment only making things better or maybe also making some things a little worse?\nThat can be a nagging question in some medical decisions, where side effects are possible. But researchers at the Georgia Institute of Technology have figured out a way to keep what helps, while blocking what harms, in a type of therapy to fight serious chronic inflammatory diseases.\nIt’s simple and works a little like a pacemaker: An implanted device electrically stimulates the vagus nerve, but, in addition, inhibits unwanted nerve activity in a targeted manner.\nForms of vagus nerve stimulation treatment against chronic inflammation have already been\nsuccessfully tested in humans by private industry\nwith the intent to make them available to patients. But the\ninnovation by Georgia Tech researchers\nof adding an inhibiting signal could increase the clinical efficacy and therapeutic benefit of existing treatments.\nTemporarily snipping a nerve\n“We use an electrode with a kilohertz frequency that blocks unwanted nerve conduction in addition to the electrode that stimulates nerve activity,” said principal investigator\nRobert Butera, a professor jointly appointed in Georgia Tech’s School of Electrical and Computer Engineering\nand the\nWallace H. Coulter Department of Biomedical Engineering . “We’ve arranged the two near each other, so the blocking electrode forces the stimulation from the stimulating electrode to only go in one direction.”\nThe researchers’ innovation could theoretically by implemented relatively quickly by augmenting\nexisting clinical devices . So far, tests in rats have returned very encouraging results, and they have been achieved without taking more drastic measures notable in other experiments to optimize this kind of treatment – such as a vagotomy, the cutting of part of the vagus.\n“The original studies in animals on the anti-inflammatory benefits of vagus nerve stimulation resorted to nerve transections to achieve directional stimulation as well as boost effectiveness of nerve stimulation. But cutting the vagus is not clinically viable, due to the multitude of vital bodily functions it monitors and regulates. Our approach provides the same therapeutic benefit, but is also immediately reversible, controllable, and clinically feasible,” said\nlead researcher Yogi Patel , a bioengineering graduate student.\n“We call it a virtual vagotomy,” Butera said.\nPatel, Butera and former Georgia Tech researchers\nTarun Saxena\nand\nRavi V. Bellamkonda , published the results of\ntheir study in the journal\nScientific Reports , which is published by Nature Publishing Group, on Thursday, January 5, 2017. The research was funded by the National Institutes of Health and the Ian’s Friends Foundation.\nVagus nerve: What is it?\nTo understand how this new bioelectronic fine-tuning works, let’s start with the vagus nerve itself.\nIt lies outside the spinal column and runs in two parts down the front of your neck on either side. It’s easy to forget about because, though it does help you feel some limited sensations like pain and heat from a handful of internal organs, those sensations are not as blatant and common as when you reach out and touch something with your hand.\nYour voluntary, or somatic, nervous system is responsible for the reaching, touching, and feeling, and the vagus nerve belongs to your\nin voluntary nervous system – actually called the autonomic nervous system. Though you may experience the effects less consciously, you couldn’t survive without a vagus.\n“The vagus nerve conveys an incredible amount of information related to the state and function of the visceral organs – your digestive tract, your heart, your lungs, information about the nutrients you eat – anything required for homeostasis (physiological balance),” Patel said.\nThe vagus nerve is the lifeline between the vital function control centers of your brain and your visceral organs, passing messages constantly between your hypothalamus and organs to control things like pulse and respiration, certain secretions, and the limiting of immune response.\nInflammation: What role does the vagus nerve play?\nThat last one is where inflammation comes in, because it's part of the body's natural immune response. But when the immune system becomes hyperactive, it can attack not just pathogens but also uninfected tissue, as with patients suffering from diseases such as rheumatoid arthritis, irritable bowel syndrome or Crohn’s disease. Drug-based therapies often fail to significantly benefit them.\nThe two parts of the autonomic (involuntary) nervous system -- the sympathetic and the parasympathetic -- strongly influence your immune system. The vagus nerve belongs to the parasympathetic.\n“It’s like a seesaw system. Your sympathetic nervous system helps kick the immune system on, and the parasympathetic nervous system tempers it,” Patel said.\nElectrical stimulation is good: Any downsides?\nStimulating the vagus nerve supports that tempering effect, but it can also somewhat excite the part of the nervous system that stimulates the immune response, which is counterproductive if you're looking to calm it.\n“Every circuit has a path coming from the brain and one going to the brain, and when you stimulate electrically, you usually have no control over which one you get. You usually get both.” Patel said. These paths are often in the same nerve being stimulated.\nThe path leaving the brain and going toward other organs, called the efferent pathway, is the one to stimulate to temper the immune system and help relieve chronic inflammatory conditions. The one going to the brain, called the afferent pathway, if stimulated, leads eventually to the hypothalamus, a pea-sized region in the center of the brain. That triggers a chain of hormonal responses, eventually releasing cytokines, messaging molecules that promote inflammation.\n“You get a heightened inflammatory response when you stimulate the afferent pathways, which are actively conveying information about your internal state and trigger the immune system when necessary,” Patel said. “And if a patient is already in a hyperactive immune state, you don’t want to push that even more.\"\nStimulating downward (efferent), while blocking upward (afferent) vagus nerve activity keeps the good effect while preventing possible bad effects. In animals that received this treatment, blood tests showed that inflammation markedly decreased. Most importantly, this treatment can be turned on or off, and be tuned to the needs of each patient.\nNo additional authors were involved in the study, which was performed at Georgia Tech. Two of the authors, Saxena and Bellamkonda, are now at Duke University. Research was funded by the National Institutes of Health (grant 2R01EB016407) and Ian’s Friends Foundation. All findings, conclusions, and opinions are those of the authors and do not represent views of the funding agencies.\nAdditional Images\nContact\nWriter and media contact: Ben Brumfield\n404-660-1408\nben.brumfield@comm.gatech.edu\nEmail\nben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}