{"text": "Energy Regulation Rollbacks Threaten Progress Against Harmful Ozone | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nEnergy Regulation Rollbacks Threaten Progress Against Harmful Ozone\nThis is what could happen if all endangered regulations that help in the fight against harmful ozone go away.\nFacebook\nTwitter\nEmail\nThe Dave Johnson coal-fired power plant in central Wyoming. Credit: Wikimedia Commons CC 2.0 Generic Goebel\nOct 29, 2019\n— Atlanta, GA\nPollutants from coal-fired power plants help make ground-level ozone, and a warming world exacerbates that. Recent rollbacks of U.S. energy regulations may speed climate change, keep pollutants coming, and thus slow the fight against harmful ozone, according to  a new study .\nCurrently, 30% of the U.S. population lives with ozone levels that exceed government health standards. Though past environmental regulations have vastly helped clean the air and put the U.S. on a positive trajectory to reduce pollutants — including ozone — policy rollbacks back could slow the progress and even reverse it, researchers from the Georgia Institute of Technology said.\nContinuing progress against ozone would pay off in better health and finances: The more ozone in the air, the more cases of respiratory illness and the higher the cost of meeting ozone level targets.\n“Additional ozone is tough to control technologically. The costs would be very high — tens of billions of dollars,” said  Ted Russell, a principal investigator on the study . “In the meantime, more people would die than otherwise would have.”\nThe researchers  published their results in  One Earth,  a  Cell Press  journal on Friday, October 25, 2019 . The research was funded by the U.S. Environmental Protection Agency and by the National Science Foundation.\nThe study focuses on ground-level ozone people breathe to the detriment of their health, which should not be confused with the stratospheric ozone that protects us from the sun’s harmful radiation.\nGoodbye environmental policies\nIn the last three years, various energy policies have been loosened, which should result in raised CO 2  emissions and continued emissions of ozone precursors in years to come, the study’s authors said.\n“Incentives are being retired like production and investment tax credits, which have been very influential in solar and wind,” said Marilyn Brown,  a Regents Professor in Georgia Tech’s School of Public Policy  and a principal investigator on the study. “The Investment Tax Credit gives a 30% tax reduction for investments in solar or wind farms or the purchase of solar rooftop panels by homeowners. The Production Tax Credit for utilities reduces tax liabilities by 23 cents for each kilowatt-hour of electricity generated by solar, wind or other renewable energy sources.”\nBut one policy move in particular stands to keep more ingredients in the ozone-making cauldron: courts preventing the  Clean Power Plan (CPP)  from going into effect and its replacement with the Trump administration’s  Affordable Clean Energy  (ACE) plan.\nACE, which also has not been implemented, would make it easier to continue burning fossil fuels, particularly coal, according to Brown, who was a member of the Intergovernmental Panel on Climate Change,  which received a Nobel Peace Prize in 2007 . CPP would have phased out those generators, reducing nitrogen oxide gases, or NO X , key reactants in the production of ozone.\n[Ready for graduate school?  Here's how to apply to Georgia Tech. ]\nFrom NO X  to noxious\n“The major target of the CPP was CO 2 , but it had side effects on the reduction of NO X  because it shifted coal use to natural gas as well as to renewable sources,” said  Huizhong Shen , a postdoctoral researcher in Russell’s group and one of the study’s first authors.\nThe study modeled atmospheric chemistry that produces O 3  around  commonly predicted trajectories for greenhouse gas emissions  and climate change paired with anticipated pollutant emissions, particularly of NO X . The model’s output depicted “non-attainment” scores, which refer to the number of U.S. counties exceeding ozone targets and by how much.\nThe study modeled against official targets for ozone levels and in addition, against cleaner standards widely held to be attainable and much healthier for people. Models built around rolled-back environmental regulations and increased warming initially showed the current trajectory of progress against ozone levels continuing — but later reversing. Ozone levels then rose again, putting many more counties in non-attainment by or before 2050.\nNature’s surprise ingredient\nAlongside human-produced NO X , nature contributes ozone-making ingredients that aren’t harmful per se and often smell great, like the aroma of cut grass or of a pine tree. They are examples of volatile organic compounds (VOCs), of which nature produces hundreds.\nVOCs get into the air easily and react readily with other chemicals. The warmer the air and the sun, the more vegetation produces VOCs that meet with raised levels of NO X  emissions to make ozone. It forms downstream from emissions sources, making it hard to regulate.\n“There are no ozone emissions, just precursor emissions,” Shen said. “So, emission controls for ozone have to mainly target NO X  emissions.”\nFeedbacks and pile-ons\nKeeping ozone around as the world warms will be more than just the sum of power plants still emitting NO X  plus boosted VOC emissions.\n“If you heat up the air, it also speeds up photochemical reactions involved in ozone production,” Shen said.\n“Ozone is a greenhouse gas, so it adds some climate change feedback, too,” said Russell, who is  Howard T. Tellepsen  Chair and Regents Professor in Georgia Tech’s School of Civil and Environmental Engineering. “You can also have increased vegetation emissions of ammonia. Some of this goes on to form particulate matter, which is also harmful to the lungs.”\nPassing the buck\nWhen coal-fired power plants emit NO X , the ozone strikes miles away.\n“Ozone can occur hundreds of miles away, so if controls are loosened in one state to save industry money there, a state downstream may have to spend even more to try to meet ozone targets. You transfer the problem and the costs,” Russell said. “Most U.S. cities are already not in attainment, and this will likely make it harder for them to get there.”\nAlso READ the companion piece on policy:  U.S. Carbon and Pollution Emissions Policies are ‘Up in the Air’\nThe co-authors of the research are: Yilin Chen, Yufei Li, Yongtao Hu, Mehmet Odman, Momei Qin, Abiola Lawal, Gertrude Pavur, and Marilyn Brown of Georgia Tech; Zhihong Chen of Georgia Tech and the Chinese University of Hong Kong; Jhih-Shyang Shih and Dallas Burtraw of Resources for the Future; Lucas Henneman of Harvard University; Shuai Shao and Charles Driscoll of Syracuse University; and Haofei Yu of the University of Central Florida. The research was funded by the U.S. Environmental Protection Agency (grant R835880) and the National Science Foundation (grant 1444745). Any findings, conclusions, or recommendations are those of the authors and not necessarily of the funding agencies. Ted Russell served on the Clean Air Scientific Advisory Committee during the administration of President Barack Obama.\nDOI: https://doi.org/10.1016/j.oneear.2019.09.006\nWriter & Media Representative : Ben Brumfield (404-272-2780)\nEmail:  ben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nAdditional Images\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}