{"text": "Chemical Companion Evolves from Information Resource to Sophisticated Decision-Support System | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nChemical Companion Evolves from Information Resource to Sophisticated Decision-Support System\nResearchers have released a new version of the Chemical Companion Decision Support System (CCDSS), a software system that assists first responders.\nFacebook\nTwitter\nEmail\nA member of the Queensland Fire and Rescue Service in Australia uses Chemical Companion as part of a demonstration of hazardous material response.\nFeb 19, 2014\n— Atlanta, GA\nResearchers have released a new version of the Chemical Companion Decision Support System (CCDSS), a software system that provides first responders with detailed and easy-to-access information about chemicals that may be associated with hazmat incidents. The update enhances the software, which now features more than a dozen tools and information about more than 550 chemicals and 3,838 chemical synonyms. What’s more, the new version will enable Apple iOS and Google Android mobile devices to run the software. Previously, the software worked only on Windows-based desktop and laptop computers. The Chemical Companion Decision Support System can be downloaded at ( www.chemicalcompanion.org ). Although Chemical Companion originally targeted first responders in fire and rescue departments, today forensic teams and bomb squads also use it. Funded by the U.S. federal government’s Technical Support Working Group, U.S. Marine Corps Systems Command and Australia’s Department of the Prime Minister and Cabinet (now managed by the country’s Defence Science and Technology Organisation), the software is free to the military, law enforcement and fire departments. More than 1,200 active accounts are registered at ChemicalCompanion.org, with users in the United States, Australia, Canada, the United Kingdom, the Netherlands and Israel. Whether the hazmat scene is due to a gas explosion, chemical spill, terrorist incident or bomb threat, the Chemical Companion helps mitigate risk. For example, a bomb squad can use it to determine potential scene blast, fragmentation and personnel standoff distances. It helps first responders decide how to decontaminate the scene and provide medical aid to victims. It also helps them determine what kind of protective equipment they need to wear and how long they can stay in a hot zone. From E-reader to Integrated Toolkit “When we first introduced the Chemical Companion, it functioned as an information portal with basic e-reader functionality that enabled first responders to access information without lugging a dozen or more books around with them,” said Gisele Bennett, director of the\nGeorgia Tech Research Institute’s\n(GTRI) Electro-Optical Systems Lab and Chemical Companion’s principal investigator. By entering details about a substance’s physical appearance or victims’ medical symptoms, the software allowed users to identify unknown chemicals at a hazmat scene and obtain information about their effects. “Today, however, Chemical Companion is more than just an information resource,” she said. “It has become a sophisticated decision-support system.” Indeed, in the last two years, GTRI researchers have been developing a series of unique tools to enhance the Chemical Companion’s capabilities. These include, for example: The respiratory protection tool\n– Released in August 2012, the respiratory protection tool takes users through a series of questions about environmental conditions and hazardous materials that may be present at a hazmat scene. The final screen delivers a recommendation on what type of respiratory protection is required. Respiratory protection comes in many forms, ranging from a half-face mask to a self-contained breathing apparatus (SCBA). “Selection of the right equipment for a given environment can be confusing, so most first responders default to an SCBA which is heavy and restrictive,” explained Heyward Adams, a GTRI research scientist who serves as technical lead on the project. “The Chemical Companion’s respiratory protection tool allows users to determine the appropriate equipment to wear – providing full protection from the airborne threats with the minimum amount of equipment.” The detection tool\n– First responders carry a variety of detector devices to help determine what chemical, biological and radiological threats may be present at a hazmat scene. The Chemical Companion’s detection tool augments the performance of these detectors by: Determining which detectors to use – and in what order. Aggregating the results of multiple detectors and performing checks for cross-sensitivities. Providing an easy-to-read output of what threats are present. (It also establishes what isn’t present, and what first responders may not be able to detect but shouldn’t rule out.) Giving recommendations on how to react, such as what kind of standoff zones to establish or what kind of protective equipment to wear – critical to getting on the scene faster and being able to remain longer. Taking measurements at a hazmat scene is no easy task, Adams said, noting that different detectors deliver readouts in different formats, such as a series of bars, parts per million or a color. “Unless you’re an expert in chemistry, these readouts are not easy to decipher,” he observed. “The Chemical Companion’s detection tool helps you know how to interpret the results and what to do with that information.” Currently the Chemical Companion has more than 19 tools that have either launched or are being tested. Many of these tools complement each other, prompting researchers to investigate their integration. “The output of one tool could be the input for another,” Adams said. “Yet users might not realize that, so we’re creating links to make overlaps more intuitive.” Users Drive New Features Working closely with users has been critical to the Chemical Companion’s success. In addition to rigorous testing and user trials before any new release, GTRI researchers host an annual workshop for users. This week-long event is instrumental in collecting feedback about the software’s structure and usability – whether it’s for developing a brand new tool or improving an existing feature. “The workshops allow us to go through calculations of situations with different user groups,” said Bennett. “A forensics officer will approach a scene very differently than a first-responder or a firefighter.” With that in mind, GTRI researchers have developed user preferences for three different audiences, along with country preferences that automatically populate national standards and units of measurement for the United States and Australia. Another recent development sparked by the annual workshops is a tool for generating reports. Introduced in 2012, Chemical Companion’s Report Builder exports a PDF file that includes situational information, calculations and outputs performed by the software – even custom notes. “In some cases, this file becomes the actual after-action report that users turn in to their departments,” said Adams. Beyond the Hazmat Scene Because the Chemical Companion’s tools comprise multiple screens posing various questions and considerations, it has become an important training tool, points out Michael Logan, chief superintendent and scientific branch director of the Queensland Fire and Rescue Service in Brisbane, Australia. “It assists exercise writers with both the construction and accuracy of training scenarios,” explained Logan, who provides GTRI with research data and serves as a subject matter expert. The tool also helps with emergency pre-planning, Logan said, explaining that the Chemical Companion can help estimate resources required or the effects of actions on an incident. “It enables users to challenge assumptions about incidents and the approaches that might be adopted to manage the emergencies.” “The Chemical Companion’s combination of information and tools in one easy-to-use package makes a huge difference to users,” he continued. “It provides confidence to first responders about their safety and the communities they serve – as well as their actions. The software delivers consistent results no matter what the experience or expertise of the user during a very stressful time.” Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contacts : Lance Wallace (404-407-7280) ( lance.wallace@gtri.gatech.edu ) or John Toon (404-894-6986) ( jtoon@gatech.edu ).  Writer : T.J. Becker\nAdditional Images\nContact\nJohn Toon Research News (404) 894-6986 jtoon@gatech.edu\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}