{"text": "GTPD’s Operations Center Answers the Call | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGTPD’s Operations Center Answers the Call\nThe dispatchers inside the Georgia Tech Police Department's Emergency Communications and Operations Center take pride in being the voice behind the call when an emergency arises.\nFacebook\nTwitter\nEmail\nRemote video URL\nJan 19, 2024\nAs the voice on the other end of the phone in campus emergencies, the dispatchers at the Georgia Tech Police Department’s (GTPD) Emergency Communications and Operations Center are standing by 24 hours a day, seven days a week.\nServing as a liaison between the community and responding officers, command center staff monitor calls, emails, and texts from Georgia Tech students, faculty, and staff. They also provide background information on suspects, research license plate numbers and warrants, and monitor the cameras on campus to provide video support for criminal investigations and to ensure officer safety during traffic stops.\nShireka Graham, director of emergency communications, reminds all members of the Georgia Tech community not to hesitate to reach out to the operations center.\n\"We want students, faculty, and staff to know that we are the heartbeat of the operation — they might not see us, but we are here for them,” she said. “We are the voice behind the call, and just like the police officers and other field responders, we're there with them.”\nSometimes, she noted, people are reluctant to call because they don't think their situation is an emergency or that it's important. “But if they're in doubt, call us and let us get someone out there to evaluate the situation and get them the help they need,\" Graham said.\n\"Our students are our top priority,” she said. “We know there is a lot of pressure” at Tech, especially during finals, “so we encourage our students to call us if they need someone to talk to. We can connect them with the Center for Mental Health Care and Resources, and if they call us, we will send a responder and remain on the line with them until help arrives.\"\nThe operations center can be reached through a 911 call, the LiveSafe app (calls, texts, and audio and video messages), the center's administrative line for non-emergencies (404.894.2500), emergency elevator buttons, and 555 blue light emergency phones across campus. For those reaching out to the command center, Graham said it's important to share as much information as possible to help dispatchers provide the best response.\nTrained to Assist\nBefore assuming their duties, dispatchers complete a rigorous 12-week training program, and ongoing training is required annually. The law enforcement arm of GTPD earned Commission on Accreditation for Law Enforcement Agencies (CALEA) accreditation in 2013, and Graham challenged her staff with earning the same accreditation — which they accomplished in 2022. The Operations Center is Georgia's only university or college communications center to receive it.\n“Being CALEA-accredited provides the best practices and standards to enhance our commitment to better serve and build trust within the Georgia Tech community,” Graham said. “The intensive process comprises 207 standards and 20-plus annual continued education training hours” for each dispatcher. “It's important to us to provide the highest level of customer service, process each call effectively and efficiently, and assure we're skilled to handle critical incidents regarding our students and the community we serve.\"\nWorking alongside the dispatchers in the command center is a group of student assistants, and giving them an opportunity to see the inner workings of GTPD as video technicians is one of many outreach efforts to connect with the campus community.\n\"Who knows the campus better than the students? They're the ones walking it every single day, so having them collaborate with us is very beneficial in meeting our common goal of ensuring safety for our campus,\" she said.\nIn 2022, the team became the first university Public Safety Communications agency in the state to be recognized by the National Center for Missing and Exploited Children's\nMissing Kids & 9-1-1 Readiness Program .\nAdditional Media\nContact\nSteven Gagliano\n- Institute Communications\nEmail\nSteven.gagliano@gatech.edu\nAdditional information\nWhen placing a wireless 911 call in the area of the GT campus, the call will go directly to the Atlanta 911 Communications Center and transfer to the GTPD Operations Center for assistance.\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}