{"text": "Miniature Gas Chromatograph Could Help Farmers Detect Crop Diseases Earlier | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMiniature Gas Chromatograph Could Help Farmers Detect Crop Diseases Earlier\nResearchers are developing a micro gas chromatograph for early detection of diseases in crops.\nFacebook\nTwitter\nEmail\nMilad Navaei, a graduate research assistant, holds the micro gas chromatograph, which is being developed by GTRI researchers for early detection of diseases in crops. The technology’s portability could allow farmers to quickly evaluate the health of their crops and address possible threats immediately, thus reducing crop losses. (Georgia Tech Photo: Rob Felt)\nMay 28, 2014\n— Atlanta, GA\nResearchers at the Georgia Tech Research Institute (GTRI) are developing a micro gas chromatograph (GC) for early detection of diseases in crops. About the size of a 9-volt battery, the technology’s portability could give farmers just the tool they need to quickly evaluate the health of their crops and address any possible threats immediately, potentially increasing yield by reducing crop losses. “It’s estimated that each year U.S. farmers lose 12 percent of their crops to pests and another 12 percent to diseases,” said Gary McMurray, division chief of GTRI’s Food Processing Technology Division. To identify potential threats to crop health, farmers typically look for physical symptoms of disease, such as discolored or wilting leaves. However, in many cases, by the time these symptoms are visible, the plant is already dead or dying. And the culprit pathogen may have already spread to nearby plants, threatening the health of the entire crop. “The key is to give farmers the ability to get early diagnostic results, which allows them to take action before it’s too late,” said McMurray. GTRI’s micro gas chromatograph is a GC-on-chip device. Its separation column, where the gas interacts with the polymer coated on the interior walls, is about the size of a quarter, and the thermal conductive detector is about half the size of a penny. When the two are combined, the device itself is about the size of a 9-volt battery. McMurray said the goal is to be able to fit dozens of micro GCs on a ground robot that a farmer could then use in crop fields to take samples from plant to plant and get results in minutes. “The idea is to have the robot be a mobile chemical laboratory that provides real-time data to the farmer. The robot provides a simple way to collect the data in an unstructured environment like a farm,” said McMurray. Because all plants and pathogens emit volatile organic compounds (VOCs), these emissions can be used as chemical markers for rapid detection. Building the micro GC was the easy part, said Jie Xu, GTRI senior research scientist. The challenge now, she explained, is correlating the VOCs emitted from plants to their health status. “It’s relatively easy to detect VOCs, but we still have a long way to go to interpret changes in plant VOC mixtures,” said Xu. The difficulty lies in understanding how plants react to local environmental conditions. For example, changes in temperature, humidity, and soil moisture and nutrient levels, all have an effect on VOC emissions. To determine if the emissions are due to a pathogen, a chemical signature has to be established by studying VOCs released under these different environmental conditions. Researchers plan to conduct field tests using a benchtop model of the micro GC in summer 2014. Working with colleagues at the USDA’s Agricultural Research Service, they will test peach trees for Peachtree Root Rot disease at the Southeastern Fruit and Tree Nut Research Laboratory in Byron, Ga. The goal is to collect air and soil samples that can be analyzed to identify the disease’s chemical signature. McMurray said a portion of the collected samples will be retained for additional laboratory tests with a traditional GC-MS to confirm the effectiveness of the micro GC. The team will then pursue efforts to integrate it into an autonomous robotic platform for crop field sampling and VOC data analysis. “Real-time data from sensing technologies like the micro GC, when used in conjunction with other data collected on the farm, could revolutionize the ability of farmers to identify sick plants before any physical symptoms appear,” added McMurray. Earlier detection also means earlier intervention, which could ultimately translate into a boon for America’s farmers. “If we could cut in half the 12 percent of crop losses due to diseases, farmers could potentially realize billions of dollars more in revenue each year,” said McMurray. In addition to agricultural applications, the micro GC could potentially be used for homeland security monitoring to detect chemical threats, such as gases in subways and dangerous explosives in vehicles. The micro GC project is being conducted in collaboration with researchers at GTRI, Georgia Tech’s George W. Woodruff School of Mechanical Engineering and the Parker H. Petit Institute for Bioengineering and Bioscience, the Department of Plant Pathology in the University of Georgia’s College of Agricultural and Environmental Sciences, and the USDA’s Agricultural Research Service.\nResearch News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia  30332-0181 Media Relations Contacts : Lance Wallace ( lance.wallace@gtri.gatech.edu ) (404-407-7280) or John Toon ( jtoon@gatech.edu ) (404-894-6986). Writer : Angela Colar\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}