{"text": "FireHUD Advances to ACC InVenture Prize Finals | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nFireHUD Advances to ACC InVenture Prize Finals\nStudent inventors from Georgia Tech, Boston College, Duke University, University of North Carolina and University of Virginia will compete in the ACC InVenture Prize finale.\nFacebook\nTwitter\nEmail\nThe Atlantic Coast Conference InVenture Prize rewards student entrepreneurs with cash prizes for their innovations. Georgia Tech hosts the competition.\nApr 06, 2016\n— Atlanta, GA\nTwo Georgia Tech students who invented a device to help keep firefighters safe advanced to the final round of the inaugural ACC InVenture Prize competition. Zack Braun, a computer engineering major, and Tyler Sisk, an electrical engineering major, will compete against students from for four other universities. The ACC InVenture Prize awards cash prizes to undergraduate students whose innovations aim to solve world problems and make our lives more comfortable. Each of the 15 universities in the Atlantic Coast Conference selected a team of student entrepreneurs for the competition, which is taking place at Georgia Tech. A preliminary round held Tuesday evening narrowed the field to five finalists. Besides FireHUD, the other finalists are: BioMetrix from Duke University. This team, led by two women, invented a way to keep athletes and sports teams healthier. Their wearable sensor adheres to the skin, collects data and uses cloud services to quantify rehabilitation progress and provide real-time feedback to reduce athletic injuries.  CommuniGift from University of North Carolina. This three-member team created a gift-purchasing platform that enables children celebrating their birthday to invite their guests to give to a child in need instead of buying something for the birthday boy or girl. Gifts are sent directly from retail sites to sponsoring non-profits, which distribute the items. Contraline from University of Virginia. This five-member team is developing a male contraceptive that is long-lasting, non-hormonal and reversible. The non-surgical process is safe, effective and more appealing than condoms or vasectomies, inventors said. Mocean from Boston College. This three-person team developed a real-time music application that allows an unlimited number of people to play a song at the exact same time. It enables anyone with a smart device to become a live radio station. The five teams will pitch their inventions before a live audience and panel of judges tonight starting at 8 p.m. in the Ferst Center for the Arts. Georgia Public Broadcasting will air the show live and\nstream it here . The winner will receive $15,000 and the second-place finisher will take home $10,000. A $5,000 People’s Choice Award will go the fans’ favorite invention. The competition is sponsored by the ACC Academic Consortium, which supports academic initiatives among member universities. The tournament is modeled after Georgia Tech’s InVenture Prize, which started in 2009 to leverage the maker culture and encourage students to push their ideas even further. Braun and Sisk -- who are both from Newnan, Ga. -- advanced to the ACC contest after winning Tech’s InVenture Prize last month. The first-place prize in that competition included $20,000 and a free U.S. patent filing. Their\ninvention is a heads-up-display\nthat attaches to a firefighter’s mask and measures heart rate, respiratory rate, blood oxygen level, body temperature, external temperature and other vital signs. This information will help firefighters determine whether they are overexerting themselves and are at risk for cardiac arrest. The device also transmits data to the incident commander on the scene, who can view it on a computer through an app.\nAdditional Images\nRelated links\nACC InVenture Prize\nContact\nLaura Diamond  Media Relations  404-894-6016 @LauraRDiamond\nEmail\nlaura.diamond@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}