{"text": "Culture Initiative Seeks to Strengthen Institute Values | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nCulture Initiative Seeks to Strengthen Institute Values\nSupporting and empowering everyone — students, faculty, staff, alumni, and affiliates — to embed the values in their daily interactions is a core objective of L.O.V.E. GT.\nFacebook\nTwitter\nEmail\nPreliminary results from the 1,877 faculty and staff survey responses are trending positively for these four values: demonstrating that students are our top priority, striving for excellence, acting ethically, and championing innovation.\nMar 02, 2022\n— Atlanta, GA\nIn Fall 2020, Georgia Tech introduced a new\n10-year strategic plan , grounded in a new mission statement and\nnine strategic values\nthat describe who we are and who we aspire to be as a community. To help accomplish the ambitious goals of the strategic plan, numerous Tech employees devoted much of the last year to launching the Living Our Values Every Day (L.O.V.E. GT) culture initiative — a series of values-focused workshops, pilot programs, and leadership conversations across campus.\nL.O.V.E. GT seeks to help the entire Georgia Tech community bring our values to life in our everyday work. “These values represent what we want Georgia Tech to be,” said Frank Neville, senior vice president for Strategic Initiatives and chief of staff.  Neville said that supporting the values is like watering new plants in the garden. “These values are authentic to who we are and they are already growing on this campus, but we need to nurture and strengthen them in order to make them flourish.”\nSupporting and empowering everyone\n—\nstudents, faculty, staff, alumni, and affiliates\n—\nto embed the values in their daily interactions is a core objective of L.O.V.E. GT.  “Understanding the connection between values and our everyday work is critical to being able to truly live our values.  L.O.V.E. GT is intended to be the framework that helps all of us make this connection,” Neville said.\nThe initiative is organized into three components: leadership, communication, and structures and processes. The first component will help leaders model Georgia Tech values through a combination of leadership training, 360-assessments, and team exercises. The communication work focuses on engaging the entire community in cultural expectations and norms. Finally, the structures and processes component is intended to ensure that the rules, rewards, and incentives existing in Tech’s policies and procedures align with Tech’s values.\nOver the past year, the L.O.V.E. GT initiative has made important progress. One significant step was incorporating the values into performance goal setting. As employees prepared to set their goals last year, Georgia Tech Human Resources and its strategic partners developed a values-based goal setting template that includes Tech’s nine strategic values. The new template includes details on the difference between expectations and goals, examples of creating values-based S.M.A.R.T. (Specific, Measurable, Achievable, Relevant, and Time-based) goals, and the responsibilities of both employee and supervisor in the process.\nAnother key effort is the Leadership 360 Feedback and Development Program currently being rolled out. Under this program, a new workshop, Leading Congruently, has been developed, focusing on aligning practices with our values and creating an environment of psychological safety. In addition to the workshop, a 360-assessment program is being piloted with Administration and Finance leaders. Pilot participants requested feedback from peers, direct reports, their supervisor, and others at the Institute while also completing a self-evaluation. The participants then worked closely with coaches over the course of three months to develop and implement action plans based on feedback received. Additional pilots are scheduled to occur in the upcoming fiscal year before the program is released more broadly to the campus community.\nIn order to refine current efforts and inform future steps, a L.O.V.E. GT culture survey was developed and distributed to faculty and staff in late 2021 while the student portion of the survey was launched this spring. Senior leadership received preliminary high-level results of the faculty and staff responses at their semiannual retreat in early February and held a discussion on areas of needed focus and action for 2022.\nOverall, our preliminary results from the 1,877 faculty and staff responses are trending positively for these four values: demonstrating that students are our top priority, striving for excellence, acting ethically, and championing innovation. We see opportunities to strengthen our community culture in our values of cultivating well-being, thriving on diversity, safeguarding freedom of inquiry and expression, and celebrating collaboration.\nSurvey results will be used to identify strengths and opportunities for improvement and establish a baseline for measuring progress. The data will inform action planning and highlight best practices where the culture is healthy and thriving.\nRegister for the monthly Leading Congruently workshops\nbeing offered March 17, April 21, May 19, June 16, July 21, Aug. 18, Sept. 15, Oct. 20, Nov. 17, and Dec. 15.\nFor more about S.M.A.R.T. goals, visit\nhttps://hr.gatech.edu/news/georgia-tech-introduces-values-based-goal-setting .\nAdditional Images\nContact\nVictor Rogers\nInstitute Communications\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}