{"text": "Georgia Tech uses data science to promote social good | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech uses data science to promote social good\nThe Data Science for Social Good internship program is sponsored by Georgia Tech and Oracle.\nFacebook\nTwitter\nEmail\nJun 30, 2014\n— Atlanta, GA\nWith the Atlanta city skyline behind them, three students in a new Georgia Institute of Technology summer internship program harvested spinach at the Truly Living Well farm. The students talked with farmers and volunteers about the crops, planting schedules, harvest requests, visitor demographics and other data crucial to the daily operation. Urban agriculture, the students realized, is a complex undertaking. Their challenge is to create a streamlined data management system for the farm and move them away from pencil and paper. Ideally, this system will allow the farm to increase productivity and move toward financial sustainability. The student team is one of five working with non-profits and government agencies as part of the Data Science for Social Good internship program, sponsored by Georgia Tech and Oracle. Sixteen students from around the country are participating in a 10-week paid internship program showing non-profits and government agencies how they can use data to tackle social and societal problems. The program allows students to solve real-world problems instead of relying on sample data sets, said Ellen Zegura, the program director. It also educates local non-profits on the need for better data systems, said Zegura, a professor in the School of Computer Science in the College of Computing at Georgia Tech. “We are connecting those who collect data with the people who know how to turn the data into something meaningful that can have a positive impact,” she said. The projects deal with safety, criminal justice, transportation and sustainability. The student teams are collaborating with the Atlanta Police Department, the city’s Community Courts, Cycle Atlanta, Georgia Tech Office of Information Technology and Truly Living Well. Georgia Tech is piloting the program this year and hopes to grow it next year. The Atlanta internship is modeled after a similar program the University of Chicago started last year. Raj Bandyopadhyay, principal data scientist with Pindrop Security, heard about the Chicago program at a conference and led the charge to bring it to Atlanta. “So often when people hear of big data, they don’t understand how it can be used to improve their lives,” he said. “We are showing future data scientists how they can use their skills to address social issues.” More than 80 students applied for the internship. The selected students come from eight colleges including: Carnegie Mellon University, Southern Methodist University, Emory University and Georgia Tech. Umashanthi Pavalanathan, a Ph.D. student in computer science at Georgia Tech, is working with 911 data collected by the city. They are looking at the response time between calls and how to best use the dispatchers. “I’m so used to dealing with abstract concepts and situations that it’s exciting to work with real clients on real issues,” she said. “You get a good feeling knowing that what we’re doing can help save somebody.” Students from all five projects will present their findings and recommendations during a public demonstration and reception scheduled to begin at 6:30 p.m. on July 17 at Atlanta Tech Village. More information about the event and internship program can be found here:\nhttp://dssg-atl.io The internship ends July 18, although the data will continue to reap benefits.\nContact\nLaura Diamond  Georgia Tech Media Relations 404-894-6016\nEmail\nlaura.diamond@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}