{"text": "Boron Nitride Separation Process Could Facilitate Higher Efficiency Solar Cells | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nBoron Nitride Separation Process Could Facilitate Higher Efficiency Solar Cells\nA boron nitride separation layer is the basis for a new technique for producing photovoltaic cells.\nFacebook\nTwitter\nEmail\nRows of photovoltaic panels are shown atop a building on the Georgia Institute of Technology campus in Atlanta. A new technique under development could potentially improve the efficiency of solar cells. (Credit: John Toon, Georgia Tech)\nAug 30, 2018\n— Atlanta, GA\nA team of semiconductor researchers based in France has used a boron nitride separation layer to grow indium gallium nitride (InGaN) solar cells that were then lifted off their original sapphire substrate and placed onto a glass substrate.\nBy combining the InGaN cells with photovoltaic (PV) cells made from materials such as silicon or gallium arsenide, the new lift-off technique could facilitate fabrication of higher efficiency hybrid PV devices able to capture a broader spectrum of light. Such hybrid structures could theoretically boost solar cell efficiency as high as 30 percent for an InGaN/Si tandem device.\nThe technique is the third major application for the hexagonal boron nitride lift-off technique, which was developed by a team of researchers from the Georgia Institute of Technology, the French National Center for Scientific Research (CNRS), and Institut Lafayette in Metz, France. Earlier applications targeted sensors and light-emitting diodes (LEDs).\n“By putting these structures together with photovoltaic cells made of silicon or a III-V material, we can cover the visible spectrum with the silicon and utilize the blue and UV light with indium gallium nitride to gather light more efficiently,” said\nAbdallah Ougazzaden , director of\nGeorgia Tech Lorraine\nin Metz, France and a professor in Georgia Tech’s\nSchool of Electrical and Computer Engineering\n(ECE). “The boron nitride layer doesn’t impact the quality of the indium gallium nitride grown on it, and we were able to lift off the InGaN solar cells without cracking them.”\nThe research was published August 15 in the journal\nACS Photonics . It was supported by the French National Research Agency under the GANEX Laboratory of Excellence project and the French PIA project “Lorraine Université d’Excellence.”\nThe technique could lead to production of solar cells with improved efficiency and lower cost for a broad range of terrestrial and space applications. “This demonstration of transferred InGaN-based solar cells on foreign substrates while increasing performance represents a major advance toward lightweight, low cost, and high efficiency photovoltaic applications,” the researchers wrote in their paper.\n“Using this technique, we can process InGaN solar cells and put a dielectric layer on the bottom that will collect only the short wavelengths,” Ougazzaden explained. “The longer wavelengths can pass through it into the bottom cell. By using this approach we can optimize each surface separately.”\nThe researchers began the process by growing monolayers of boron nitride on two-inch sapphire wafers using an MOVPE process at approximately 1,300 degrees Celsius. The boron nitride surface coating is only a few nanometers thick, and produces crystalline structures that have strong planar surface connections, but weak vertical connections.\nThe InGaN attaches to the boron nitride with weak van der Waals forces, allowing the solar cells to be grown across the wafer and removed without damage. So far, the cells have been removed from the sapphire manually, but Ougazzaden believes the transfer process could be automated to drive down the cost of the hybrid cells. “We can certainly do this on a large scale,” he said.\nThe InGaN structures are then placed onto the glass substrate with a backside reflector and enhanced performance is obtained. Beyond demonstrating placement atop an existing PV structure, the researchers hope to increase the amount of indium in their lift-off devices to boost light absorption and increase the number of quantum wells from five to 40 or 50.\n“We have now demonstrated all the building blocks, but now we need to grow a real structure with more quantum wells,” Ougazzaden said. “We are just at the beginning of this new technology application, but it is very exciting.”\nIn addition to Ougazzaden, the research team includes Georgia Tech Ph.D. students Taha Ayari, Matthew Jordan, Xin Li and Saiful Alam; Chris Bishop and Simon Gautier from Institut Lafayette; Suresh Sundaram, a researcher at Georgia Tech Lorraine; Walid El Huni and Yacine Halfaya from CNRS; Paul Voss, an associate professor in the Georgia Tech School of ECE; and Jean Paul Salvestrini, a professor at Georgia Tech Lorraine and adjunct professor in the Georgia Tech School of ECE.\nCITATION : Taha Ayari, et al., “Heterogeneous Integration of Thin-Film InGaN-Based Solar Cells on Foreign Substrates with Enhanced Performance,” (ACS Photonics 2018)\nhttps://pubs.acs.org/doi/abs/10.1021/acsphotonics.8b00663\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : John Toon (404-894-6986) (jtoon@gatech.edu).\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}