{"text": "B.S. in Neuroscience Takes Off at Georgia Tech | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nB.S. in Neuroscience Takes Off at Georgia Tech\nNew undergraduate program builds on strength of research across campus, from neurons to behavior .\nFacebook\nTwitter\nEmail\nJun 26, 2017\n— Atlanta, GA\nUPDATED 10/25/2017 —  When Georgia Tech’s College of Sciences created a prospectus for a new Bachelor of Science in Neuroscience, it estimated 25 to 50 students would enroll the first year.  Wrong.\nSince the new degree program was approved by the Board of Regents on Valentine’s Day 2017, nearly 200 students clamored to sign on.\nThis enthusiastic response was surprising — but then again, not, says Tim Cope, chair of the Undergraduate Neuroscience Curriculum Committee and professor in the School of Biological Sciences and the Wallace H. Coulter Department of Biomedical Engineering.\n“Hardly a day goes by that there’s not something in the news — a health concern or a recent breakthrough or societal challenge — that doesn’t involve neuroscience,” he says. “It’s a growing field with so many opportunities, and it’s inspired a lot of interest from our students.”\nOne of them is  Yeseul Heo .\n“I got really excited when I learned about the new major,” the rising second-year student says. “I think I was one of the first to turn in my paper to switch.”\nHeo’s original major was psychology — and she is keeping that as a minor, along with a double major in international affairs — but she sees neuroscience as a way to put her studies on a more quantitative footing.\n“Along with psychology, I wanted to focus more on hard research, specifically on brain activity, and working with quantitative data,” she says.\nHeo has gotten a taste of neuroscience already as a student assistant in the lab of Associate Professor of Psychology Eric Schumacher, whose research uses functional magnetic resonance imaging (fMRI) and other experimental techniques to investigate the neural mechanisms for vision, attention, memory, learning, and cognitive control.\nA Research Community\nSchumacher is one of more than 50 faculty members from disciplines across Georgia Tech who are involved in  neuroscience research  — and have been for years. But however collaborative, widespread, and even world-renowned these neuroscience efforts have been, what they have lacked, Cope suggests, is “community.”\nHe and many others anticipate this new undergraduate degree will build that necessary component, for both faculty and students. “It’s a very important, symbolic event in the development of neuroscience on this campus,” he says.\nNeuroscience is “the perfect incarnation of an interdisciplinary subject,” says College of Sciences Dean and Sutherland Chair Paul M. Goldbart.\n“It’s also a subject of deep intellectual interest. Who couldn't be curious about how the brain and nervous systems work at the most basic level?”\nGoldbart “couldn’t be more excited” about the new degree, because “It opens up a marvelous new channel to a wide variety of career paths and will make Georgia Tech even more appealing to prospective undergraduates in the sciences.”\n“I am grateful to everyone who worked so hard to create a program that defines 21 st -century neuroscience education for a 21 st -century technological research university.”\nNeuroX Factor\nGetting from neuroscience activity to neuroscience community at Georgia Tech has been something of a journey, starting with the formation of a “NeuroX” committee back in 2014 and ending with Board of Regents approval for the new undergraduate degree in February 2017.\nTo reach this place, certain boxes had to be checked. It was not enough that faculty were engaged in neuroscience and students wanted it, although that was clearly the case.\nEvery time the Institute offered a neuroscience course, it maxed out, and professors were constantly asked if there would be more courses, or if they could open up another section.\nStill, Cope points out, “It’s a legitimate thing for the administration to think about these things exceedingly carefully. No university can be everything — there’s a limit to resources and we have to be strategic with our planning.”\nBasically, the key questions were: Is there a demand for this major from employers? Is there a demand for this degree from students? How would a neuroscience degree program advance Georgia Tech’s strategic plan? And would the program be redundant within the University System of Georgia?\nThis last question sent Cope over to Georgia State University — the only other USG school with an undergraduate neuroscience degree — to meet with the leadership of their  Neuroscience Institute .\n“I said, ‘Here’s what we’re planning to do,’” Cope recalls.\n“They said, ‘Oh, this is fantastic, with Georgia Tech’s traditions and resources, you bring something unique to the table,’ and they wrote a letter for me right on the spot — they endorsed our plan 100 percent.”\n'Kind of Pulsing'\nWhile every neuroscience program has its “multiplication tables,” as Cope terms them — certain facts every neuroscientist has to know — the bigger challenge is, where do students take it from there?\nHeo eventually wants to take her neuroscience focus into the study of first impressions. “You develop this first impression within two seconds in your brain, and you don’t control that, ever,” she says.\n“So, I want to figure what’s the reason behind it, and if we learn the reason, is there a way to, not eliminate it, but maybe try to understand each other better, avoid racism and discrimination, and bring about more peace.”\nAs a neuroscience undergraduate, Heo will learn what Cope calls “the three flavors of neuroscience” — cell and molecular, behavioral, and systems.\nBeyond these basics, Heo can branch out into one of 10 different specializations — biochemistry, biology, chemistry, computer science, engineering, health and medical, physics, physiology, or psychology.\nIn her case, completing the psychology specialization will qualify her for a minor in that field.\nStudents are coming into the program from disciplines all over campus, and all these areas can and do intersect with neuroscience, notes Cope. “To have a degree in neuroscience means you have to be conversant in wide-ranging concepts,” he says.\n“In my mind’s eye, I have the sense of neuroscience kind of pulsing — it borrows concepts and technologies from all the fields, but it doesn’t only take, it gives back.”\nThe undergraduate neuroscience degree will — as with all Georgia Tech disciplines — culminate in a senior research or capstone project.\n“We want to leave our students with an experience that really gets their creative juices going and gives them a tantalizing view of what they might do next,” Cope says.\nThe  program website  lists 50 occupations for which neuroscience can serve as preparation or grad school foundation, and then, of course, there’s entrepreneurship.\nAmong the many other student startup and business incubators in and around Georgia Tech, there’s even one called  NeuroLaunch , which introduces itself as “the world’s first neuroscience startup accelerator.”\nProving It\nGeorgia Tech’s Bachelor of Science in Neuroscience launched this fall.\nAs the community builds and the degree program gains visibility, Cope expects Georgia Tech to carve its niche among neuroscience programs as only Georgia Tech can.\n“We’re especially mindful of active learning here, of inquiry-based education, where the students are led to discovery, not just have the discovery dumped in their laps,” he says.\n“What we’d like to bring to neuroscience is the strong analytical, deep understanding of concepts and methods that Tech brings to its curriculum in all fields.”\nDown the road, Cope sees the undergraduate degree program leading to more and bigger grants for neuroscience research at Tech, and ultimately a Ph.D. program.\nIn the meantime, he says, there’s much to learn and do, quoting a fortune cookie slip he’s kept in his wallet for more than 25 years now: “It says, ‘You are respectable, you are intelligent, you are creative — prove it.’\nI think that applies here. We’ve got a lot of what we need to do some really great things in neuroscience. Now we’ve got to prove it.”\nNeuroscience Research in the College of Sciences\nNeuroscience is “the perfect incarnation of an interdisciplinary subject,” says College of Sciences Dean and Sutherland Chair Paul M. Goldbart. “It’s also a subject of deep intellectual interest. Who couldn’t be curious about how the brain and nervous systems work at the most basic level?”\nNeuroscience majors interested in research have a broad array of options. Researchers at Tech seek to understand the mechanics of brain function and the emergence of normal, aberrant, or developmental behavior from the components of the nervous system at multiple scales of complexity.\nThe details of every faculty member’s research are diverse, but they all aim to address one or more of the following overarching questions:\nHow does the brain perceive the world, learn new information, express emotions, and produce behaviors?\nHow does the nervous system cooperate with the body it lives in?\nHow does the brain compute responses and commands?\nHow do behaviors emerge from molecules, cells, and systems?\nHow can genetic and environmental factors impact neural functions?\nHere are examples of research led by College of Sciences faculty members.\nThe Reorganization Problem of Neurons: Addressing the neurotoxicity of chemotherapy\nBy A. Maureen Rouhi\nEven as a child, Tim Cope was fascinated by how physically disabled people move. Why can’t they move normally? That fascination led to scientific curiosity about why it can be so difficult to recover normal movement after disease or damage.\nOne path of inquiry Cope has pursued is the organization of sensory signals to the spinal cord. Over more than two decades of research, he and others have shown that sensory signals can be restored to normal  when damaged sensory nerves regenerate and reconnect with muscle; however, their connections in the central nervous system reorganize.\nCentral reorganization changes the flow of sensory information, so some neurons completely lose sensory signals, while others receive twice as much input. Thus, regeneration is not synonymous to recovery, says Cope, a  professor in the School of Biological Sciences  and in the  Wallace H. Coulter Department of Biomedical Engineering  and member of the Parker H. Petit Institute for Bioengineering and Bioscience (IBB).\nAnother condition that may cause peripheral nerve damage, and subsequent reorganization is chemotherapy. “We have peripheral nerve regeneration after chemo, but we don’t regain normal function,” Cope says. “Maybe it’s this reorganization problem again.”\nTo explore this possibility, researchers in Cope’s lab recorded sensory signals of rats after chemotherapy. In this case, the sensory signal itself showed long-lasting abnormality. However, they also found that even when nerves are not structurally damaged by chemotherapy, the sensory signal remains atypical.\nThese puzzling findings led to the discovery that chemotherapy affects cellular mechanisms responsible for translating mechanical stimuli — for example, muscle stretch — into sensory signals. As with peripheral nerve trauma, sensory information changes, but for a very different reason.\nCope relishes this unexpected turn of the research. “Our chemo studies led us to a way of restoring the signals to normal, and I think our findings may have some translation to humans,” he says. “We believe if we can fix the signal, then we can improve the daily movement activity in patients who otherwise might experience disability long after chemotherapy is discontinued.”\nFixing the signal means restoring the damaged proteins, or just bypassing them. Cope’s team has identified a drug to do the latter. “But a better solution is to find out exactly what protein is damaged and restore it through genetic therapy or other molecular techniques.”\nNext, Cope hopes to do genetic screening to try to get a comprehensive list of the proteins damaged by chemotherapeutic neurotoxicity, particularly those involved in generating sensory signals. This work would be in collaboration with  John McDonald , a cancer expert, professor in the School of Biological Sciences and member of IBB.\nMeanwhile, other work goes on in the Cope lab. “If you’re interested in how we generate movement and how sensory information is required to generate that movement, and what goes wrong in various disease and damage situations, then whether you’re a chemist, an engineer, or interested in behavioral science, there is an entry level for you in my lab to study those things,” he says.\nMemory, Emotion, and Aging: Exploring “memory clutter” and the neuroscience of human cognition\nBy Renay San Miguel\nForget where you parked your car? Misplaced your keys? Can’t remember what a restaurant dinner companion  just  said to you? All signs of early-onset dementia, right?\nNot quite, says  Audrey Duarte , associate professor in the School of Psychology and principal investigator in Georgia Tech’s  Memory and Aging Lab . “There are memory changes we think of as being associated with dementia, and that’s very concerning, but that’s not really what we’re talking about,” Duarte says. “Just by getting older, we experience more memory impairment.”\nTake that restaurant dinner, for example. When you’re younger, people coming in and out of the dining room, nearby conversations, and any other distractions are easier to tune out. “As we get older and we have that impaired ability to ignore distracting information, it gets incorporated into our memories,” Duarte says. “That information is there even at the subconscious level, and that creates what we call memory clutter.”\nThat clutter gums up the brain and forces older adults to work harder than before to recreate that restaurant experience in their minds in the hopes of remembering information.\nDuarte’s 2016  study  on memory clutter is the latest example of her focus on human cognition. How does the brain process new information, and how is that tied to emotions and behaviors?\n“I’m a memory person, so I always think memory is the most important thing,” she says. The information we take into our brains has to be processed by our sensory systems — what we see, hear, etc. — and then filtered through our past experiences. “Those memories have emotional associations with them, some positive, some negative. If it comes down to why a particular emotion is stronger than others, we don’t really understand why the brain is organized that way.”\nDuarte’s research involves exploring which areas of the brain are necessary for emotional processing. She and her team in the Memory and Aging Lab use electroencephalography (EEG) and functional magnetic resonance imaging (fMRI) to determine which parts of the brain make those connections between memory and emotion.\nIt’s known that the amygdala, located within the brain’s medial temporal lobes, is associated with processing emotions. Duarte says her research shows that “if you see something that’s negative, the amygdala is sensitive to that.” But she emphasizes that other brain regions also seem to process stimuli associated with bad emotions such as disgust, sadness, anger, etc.\nDuarte is determined to discover how disease, injury and aging effect all aspects of human cognition. She believes the future of her field will bring an interdisciplinary focus, folding in computational modeling, biology, genetics and biomedical engineering.\nThe research tools she’s using now are noninvasive. “We’re not implanting electrodes in people.” But to get a complete picture of neural communications — how that supports human cognition and what happens when that communication breaks down — “we’re going to have to drill down to the neuron level itself.”\nProtective Responses: Neurons linked to itch and bronchoconstriction\nBy A. Maureen Rouhi\nItch. Just seeing the word makes you feel itchy. The sensation that makes you want to scratch your skin does the same to other mammals, amphibians, reptiles and birds. “Itch sensation is an evolutionarily conserved way used by many animals to sense environmental irritations and respond accordingly,” says  Liang Han , an assistant professor in the School of Biological Sciences.\nHan’s laboratory strives to understand how the nervous system receives, transmits, and interprets stimuli to induce responses. In particular, she is interested in the mechanisms of nocifensive — or protective — responses. She wants to know how alterations in neural pathways that mediate these responses lead to chronic disease. For now, she’s focusing on two protective responses: itch and constriction of the lungs’ airways, or bronchoconstriction.\n“Everyone experiences itchy feelings — when they get a mosquito bite or are wearing a prickly wool sweater.” Han says. In these cases, the itch is relieved by scratching. But imagine if the itchiness goes on and on!\n“Chronic itch accompanying disease can be devastating,” Han says. More than 40 percent of patients receiving dialysis for end-stage renal disease suffer from severe itching, as do 60 to 70 percent of patients with advanced liver disease, according to Han. Persistent itching can lead to sleep deprivation and depression. Despite the clinical importance of itch sensation, Han says, the mechanisms governing it are largely unknown.\nA long-standing question is whether itch-sensing neurons are itch specific or also signal other sensations such as pain. In earlier work using molecular genetic approaches, Han discovered a  subpopulation of sensory neurons specifically linked to itch sensation . When those neurons are removed from experimental mice, the animals do not sense itch from multiple stimuli, but they continue to sense pain or pressure. Conversely, when these neurons are activated by painful stimuli, they elicit itch, not pain. “The data demonstrate the existence of the dedicated itch-sensing neurons,” Han says, “and advances our understanding of the cellular mechanisms of itch sensation.”\nNow at Georgia Tech, Han aims to discover the mechanisms of chronic itch and find therapeutic targets for treatment, while also advancing understanding of bronchoconstriction.\nThe lungs’ sensory nerves help regulate the respiratory system, for example, by controlling breathing patterns and evoking airway-protective behavior such as coughing, airway constriction, and mucus secretion. Han’s lab recently discovered a subpopulation of sensory neurons that, when stimulated, induce bronchoconstriction and airway hyperresponsiveness, both of which are hallmarks of asthma.\n“Current investigations of the pathogenesis of asthma have largely focused on immune responses,” Han says. “However, anti-inflammatory treatment only partially controls asthma symptoms. We need to understand the involvement of non-immune systems in the disease.”\nRecent studies, including Han’s, indicate an important role for the nervous system in the pathogenesis of asthma. “We are currently using molecular genetic tools to investigate whether blocking those neurons can inhibit asthma in a mouse model,” she says. “We hope to obtain insights into the neural mechanisms of asthma and identify neuronal targets for management of asthma symptoms.”\nMuscle-Neuron Connections: Maintaining contact as aging occurs\nBy A. Maureen Rouhi\nYoung C. Jang  aspires to understand the aging process, particularly as it relates to muscle loss. An assistant professor in the School of Biological Sciences and the Wallace H. Coulter Department of Biomedical Engineering, and member of the Parker H. Petit Institute for Bioengineering and Bioscience, Jang hopes that therapeutic interventions could be developed to treat muscle loss, whether from aging or disease.\nIn considering scientific questions, Jang’s approach is to look at the forest. “You can be interested in muscle,” he says, “but you can’t just work on muscle to understand the whole biological process.”\nMotor neurons connect muscles to the nervous system; however, the muscle-neuron connection can be severed by injury or disease. When the muscle is restored to function, the junction can be reconnected.\nWith age, the reconnection between muscle and neuron becomes increasingly difficult. When contact disappears, Jang explains, “muscles cannot communicate with the spinal cord and brain, and they start to degenerate.” Jang studies how to keep these connections going in hopes of developing ways to prevent or treat muscle loss.\nAging and disease have some common pathways, Jang says. One is oxidative stress. When the body has an excess of reactive, oxidizable species, aging occurs faster than usual.\nJang’s work has shown that oxidative stress contributes to disconnection of the muscle-neuron junction. Oxidative stress is a well-accepted theory of aging, Jang says. It posits that when the body’s balance of antioxidant enzyme and oxidizing free radicals tilts in favor of free radicals, aging accelerates.\nJang’s early work showed that, in mice, removing the antioxidant enzyme — which increases reactive oxygen species — promotes severance of the muscle-neuron junction. In humans, Jang notes, genetic mutation of the same enzyme leads to amyotrophic lateral sclerosis (ALS) or Lou Gehrig’s disease, a motor neuron disease.\n“We’ve found one mechanism that promotes detachment,” Jang says. “Can we reverse the process or slow it down?” Looking for ways to halt or reverse muscle-neuron detachment has taken Jang to multiple paths of inquiry, including caloric restriction, parabiosis, and organs-on-a-chip.\nJang’s caloric restriction research showed that mice receiving only 60 percent of the normal caloric requirement  form fewer reactive oxygen species, and the treatment promotes muscle-neuron attachment . Furthermore,  caloric restriction rejuvenates muscle stem cells , which help restore the function of muscles degenerated by aging or disease. With aging, these stem cells’ number and viability diminish, thus making muscle more prone to damage, a trend that slows with caloric restriction.\nIn physiological research, parabiosis is the physical joining of two individuals. Jang turned to this approach because blood is a way for cells, tissues, and organs to communicate. When Jang joined a young mouse to an old one so that they share the same circulating blood, he found that the muscle-neuron junction in the old animal is rejuvenated. However, “if you put two old animals together, that junction detaches,” Jang says. “Something in young blood is helping preserve the muscle-neuron junction.”\nIndeed, Jang has reported  a circulating protein in the blood that seems to be an important factor in connecting the muscle-neuron junction . However, this protein “is not the only one,” Jang says. “We need more research.”\nMeanwhile, how could parabiosis be applied to humans? “Obviously, we can’t put two humans together,” Jang says. But it is possible to faithfully mimic parabiosis of organs on microfluidic chips. Jang is collaborating with  YongTae (Tony) Kim , an assistant professor in the George W. Woodruff School of Mechanical Engineering, to design organ-on-a-chip systems for parabiosis of human organs.\nSensory Input, Neural Networks, and Locomotion: Creating a new rehabilitation paradigm\nBy A. Maureen Rouhi\nSo you think walking across a room is easy, peasy? Think again.\n“Walking across the room is one of the most complicated things we do,” says  T. Richard Nichols,  a professor in the School of Biological Sciences and the Wallace H. Coulter Department of Biomedical Engineering and a member of the Parker H. Petit Institute for Bioengineering and Bioscience. Locomotion is complex, he says, the result of networks of nerve cells communicating, processing information, and integrating myriad sensory signals.\nIn studying how sensory information from muscles helps regulate movement, Nichols has focused on the Golgi tendon organs (GTOs). These sensory receptors in the muscle tell the central nervous system — which consists of the brain and the spinal cord — the amount of force generated by muscles. The spinal cord then distributes the information to different muscles in the limb. The feedback of muscular forces is thought to help determine how the body responds to obstacles or unexpected circumstances.\nSo far, what we know about GTOs comes from research on animal subjects. Injury to the spinal cord disrupts communication between the central nervous system and the muscles and causes malfunctioning of the spinal cord’s neural circuits, Nichols says. “Muscle weakness or paralysis can result, as well as loss of balance and stability.”\nWorking with  Dena Howland at the University of Louisville , Nichols has discovered a link between the disruption of the force-regulating system and motor disorders from partial spinal cord injury in animal models. They recently started two projects based on the GTO research.\nOne project, funded by the National Institutes of Health (NIH), aims to discover how the brain stem controls the GTO-generated neural circuits in the spinal cord to meet the needs of different movement tasks. The other project, funded by the Department of Veterans Affairs, will help define the extent to which malfunction in the force-regulating system contributes to motor dysfunction in partial spinal cord injury. It will also test the efficacy of a potential new treatment for spinal cord injury in humans that would not require special equipment.\nThe potential new treatment is based on the force-regulating neural networks of cats walking up — or down — hill. Researchers in the Nichols lab have shown that these networks are organized for propulsion when cats walk uphill and for suspension and braking when cats walk downhill.\n“It turns out that in spinal cord injury, the downhill pathway becomes extreme” Nichols says. “Animals with spinal cord injury tend to crouch; it’s like an exaggeration of walking downhill.”\nSuppose animals with spinal cord injury are rehabilitated by exercising under downhill-walking conditions? The idea is counterintuitive but, Nichols thought, “maybe the central nervous system has some internal wisdom that will say, okay, now we need to repair this injury.” Could training in this particular way promote recovery from partial spinal cord injury?\nNichols and Howland proposed this rehabilitation treatment to Veterans Affairs and received funding. “At the same time, because of our work at Tech, we can find whether the same exercise causes a change in the neural networks of the spinal cord,” Nichols says. Through the NIH grant funding, Howland and Nichols aim to mechanistically connect the recovery with restoration of normal function in the spinal network.\nBiomechanics of Locomotion: Toward next-generation artificial limbs\nBy A. Maureen Rouhi\nResearch in the  lab of Boris I. Prilutsky  aims to understand the biomechanics and control of locomotion, which comprises the movements that take two- and four-footed animals from place to place.\nDuring locomotion, sensations from the limbs (called sensory feedback) inform the nervous system about the state of the movement. Prilutsky studies how this sensory feedback affects locomotion. In particular, he investigates feedback from foot pressure and limb motion.\nDisrupting the feedback, through injury for example, can lead to instability and falls during locomotion. “We modify sensory pathways in experimental animals and in computational models and observe the effects on locomotion,” says Prilutsky,  a professor in the School of Biological Sciences  and a member of the Parker H. Petit Institute for Bioengineering and Bioscience.\nA key research tool is a  neuromechanical model  the Prilutsky group developed in collaboration with the group of  Ilya A. Rybak , at Drexel University. This model accurately reproduces the walking mechanics and muscle activity of cats. Computational experiments have pinpointed the sensory feedback pathways that produce mild and severe locomotion defects when interrupted. These predictions have been experimentally tested.\nIn a recent study, for example, Prilutsky’s team injected local anesthetic to the paw pads on one side of a cat to block the sense of touch. Under this condition, the animal loses the symmetry of its gait and becomes less stable. The effect can be reversed, however, by electrically stimulating the nerves that convey the sense of touch to the central nervous system. When that happens, the cat’s walk becomes symmetric and stable again.\nIn other experiments, they removed muscle stretch feedback – or stretch reflex – from selected muscles and investigated the effects. “We found that this feedback is task- and muscle-dependent,” Prilutsky says. For example,  loss of feedback from certain muscles of the ankle causes problems only in downslope walking . More recently, they found that removing the stretch reflex from hip flexors causes profound changes in locomotion, as predicted and explained by their computational model.\n“From our experimental and computational studies, we gain insight into how spinal circuits cooperate with the moving body segments during locomotion,” Prilutsky says.\nThose insights are now propelling Prilutsky and others toward prosthetic devices that behave like natural limbs. For example, Prilutsky is applying discoveries about sensory pathways, feedback loops, and natural control signals from the nervous system in the field of osseointegrated — or bone-anchored — limb prostheses. In this approach to attaching prosthetic devices, the artificial limb is directly anchored to the bone through a titanium rod, similar to a dental implant. Potentially this implant can be used as a neural interface between the prosthesis and nerves in the stump.\nAlthough used in Europe, bone-anchored limb prostheses are not approved in the U.S. because of the high rate of skin infections, which develop when skin fails to form a close connection with the bone implant. However, Prilutsky and others have shown that, in rats,  use of porous titanium  allows skin to grow into the implant, thereby reducing infections.  Recently they experimented with cats to test this implant in natural walking conditions to see whether it forms a tight bond with skin and bone and whether and how the animals use a bone-anchored prosthesis for walking.  “It works,” Prilutsky says.\nNow the stage is set for the next phase: using the implant as a neural interface between the prosthetic device and the nerves in the residual limb so that the nerves and prosthesis talk to each other, and the prosthesis is controlled naturally without the person’s attention. If the promise of this approach is fulfilled, it could revolutionize prosthetics.\nMoving in a Complex World: How do insects do it?\nBy A. Maureen Rouhi\nHow do animals navigate their environments? That question motivates the research of Simon Sponberg. An  assistant professor in the School of Physics  with a  joint appointment in the School of Biological Sciences , Sponberg studies animals to discover how they move around in a complex world.\n“Perceiving and then navigating the irregular terrain of Earth requires sophisticated processing by the brain,” says Sponberg, who received a  National Science Foundation Early-Career Award in 2016  in recognition of his promise as a teacher-scholar and is a member of the Parker H. Petit Institute for Bioengineering and Bioscience. “It also demands that the brain work in conjunction with an animal’s body and the environment surrounding it.”\nAnimals have evolved to negotiate almost every environment on this planet. To do this, Sponberg says, their nervous systems acquire, process, and act upon information. “Yet their brains must operate through the mechanics of the body’s sensors and actuators to both perceive and act upon the environment,” he adds.\nIn  Sponberg’s lab , researchers are studying how muscles operate as soft, living matter. They’re trying to understand the physics of moving animal bodies and the computational principles implemented in the sensors — such as eyes or antennae — of animals in motion.\n“Our research investigates how physics and physiology enable animals in motion to achieve the remarkable stability and maneuverability we see in biological systems,” Sponberg says. “We explore how animals fly and run stably even in the face of repeated perturbations, how the multifunctionality of muscles arises from their physiological properties, and how the tiny brains of insects organize and execute movement. We study how the grace and agility of animal movement arises from the synthesis of its parts. Among these is the brain — a crucial part, but not the only one.”\nThe hawkmoth is a frequent subject of Sponberg’s investigations. The swift-flying insect typically imbibes nectar while hovering over a flower. Feeding usually takes place at dusk, when light is limited. It’s hard enough to see in dim light and even more when it gets dimmer with time. Yet hawkmoths also hover in air while following a flower that’s swaying with the wind. How do they do it?\nSponberg’s group has shown that hawkmoths slow their brain down to improve vision in dim light, much like increasing the exposure on a camera.   However, this adjustment can cause their motion to blur, so they only slow down to the point where they can still track the wind-blown motions of the flowers they prefer in nature. The behavior demonstrates that their neural circuits adapt exquisitely to the environment.\nMore recent work on three hawkmoth species  tracking the group’s “roboflowers” suggests that simple models of neuronal processing can account for interspecies differences in adapting to different light intensities, and the moths actually use touch sensors on their proboscis to help feel the flower’s movements.\n“Behavior, especially movement, arises from the context in which the brain acts,” Sponberg says. “We start by asking questions like, “If we know something about the biophysics of how muscles works, how might the brain activate and control muscle to enable an animal to be most agile and versatile?\n“What we are finding is that how brains process sensory input and program motor output is intimately coupled to the physics of the surrounding systems and the features of the environment the animal most cares about. Figuring out these coupling principles is a huge task but one that we are confident will help us better understand how we think and act.”\nIntent and Action: Unpacking a little-understood aspect of skilled movement\nBy A. Maureen Rouhi\nLewis A. Wheaton  wishes to play golf like a pro. He could raise his game by watching videos of star players like Rory McIlroy. But Wheaton knows from experience — and his research — that observation alone doesn’t always help motor learning.\nResearch in Wheaton’s lab is explaining why observing people who are highly skilled at motor tasks may not be helpful to those who are far less proficient. Wheaton is interested in unpacking how the brain integrates information to effect motor behavior, particularly highly skilled tasks that involve hands and tools. His findings underscore the importance of intent.\nConsider an array of objects on a table: pens, paper, mug, stapler. “You need intent to use things together,” Wheaton says. “If you decide to write a note, you’ll focus attention on the pen and paper.”\nThat’s obvious, yet some people with certain neurological injuries have trouble understanding what they need to do to write a note. “It’s not automatic that you can string the information together,” Wheaton says. “Part of our work is understanding the relationship between intent and action and how that falls apart in case of neurological injury.”\nUsing brain-imaging techniques, Wheaton identifies neural signals that capture intent.\nRecently he conducted an experiment with people with sound limbs wearing artificial limbs. The participants were asked to learn how to use the prosthetic limbs by watching a video of another prosthetic-device user.\n“The norm in prosthetic limb rehabilitation is to let people figure it out themselves, with help from physical therapists,” Wheaton says. “But most physical therapists have two hands. They don’t know what it’s like to be an amputee.”\nThe study showed that people who watched other prosthetic-device users became more efficient than those who watched people with sound limbs.\nAnother tool is eye-tracking, based on the well-known correlation of eye and arm movements. “Particularly in tasks that involve reaching, the eyes precede the hand,” Wheaton says. Can we see intent from what the eyes are doing?\nNew research suggests that a key to rehabilitation gains might be rooted in visual strategies that capture specific action intent. The eyes see differently when observing different people do the same task, like bringing an object from one side of a barrier to the other side. When watching a person with sound limbs, the prosthetic-device user’s eyes look only at the task itself: The object starts on one side and ends on the other, Wheaton says.\nWhen watching another prosthetic-device user, the subject’s eyes go over the barrier and are paying attention to the shoulders, which power the prosthetic limb. “They are paying attention to the motor intent instead of just the task,” Wheaton says. “Instead of training execution, which we do a lot in rehabilitation, perhaps we should be training intent.”\nBack to golf, Wheaton suggests, “Its’ hard to understand the intent of a professional when you are an amateur, until you develop more skill. Instead of watching Rory, take a different approach. You may be more like Joe, who will help you progress to the next step. Then you’ll meet Mary, who’s a bit better than Joe. She’ll take you farther.”\nWhen to Make a Decision: Accumulating and evaluating evidence\nBy A. Maureen Rouhi\nWhat was your dinner last night? How about the previous night? How about the week before?\nMark E. Wheeler  is interested in memories and what happens in the brain that allows us to remember. Part of what he studies is how we make decisions about the accuracy of what we retrieve. “You can’t remember immediately what you had for dinner a week before because you lack information,” he says. “If you think about it a bit more, you may remember. How can you evaluate the accuracy of your memory? What is happening in the brain when we decide whether our memories are accurate or not?”\nMemory is difficult to study, however. “People are often not good at describing how they remember,” says Wheeler, a professor in the School of Psychology. “Some retrieved information may not be easy to communicate, people may ignore some memories, or they may be unaware of other memories.”\nTo get at memory, Wheeler studies perception, which is easier to manipulate and measure. The hope is that understanding how we evaluate evidence in making decisions based on perception can help us understand what happens when retrieving memories.\nWhen viewed from the brain’s perspective, even simple tasks — such as deciding whether an object is green or yellow — consist of a sequence of processing stages, Wheeler says. These stages can be represented by different patterns of brain activity. “If we understand the process as a system,” Wheeler says, “then we can ask: What parts of this system are involved when things break down or don’t function well?”\nCentral to Wheeler’s work is the concept of an accumulation-to-boundary mechanism. “In the midst of gathering evidence, you reach some threshold of evidence: Okay, now I’m going to decide,” Wheeler explains. “The idea is that brain activity that is thought to reflect evidence builds up, and when it crosses that threshold, that is the signal that you have enough information to commit to a decision. We don’t understand precisely how that works, which is why we’re studying it, but there’s a lot of data that this happens at the neural level.”\nInstead of asking experimental subjects to remember what they had for dinner, Wheeler asks them to lie still while being scanned by a functional MRI (fMRI) machine at the  Georgia State University/Georgia Tech Center for Advanced Brain Imaging . Amid the constant beeping of the scanner, participants receive visual stimuli and make decisions about what they see.\nBrain activity data reveal how much evidence participants accumulate before they decide.  The basis for this approach was developed a decade ago, when Wheeler and others showed that fMRI allows identification of distinct neural processes that work together when people make decisions based on perception .\nCurrently Wheeler is interested in how aging affects the way decision-making evidence accumulates and how that manifests in brain activity. His recent work, funded by the National Science Foundation and Georgia Tech, examines how noise — anything that degrades information — affects the accumulation of evidence and decision-making as we get older.\n“Perception and decision-making,” Wheeler says, “can involve a series of stages, where you take in sensory information, analyze the information, and accumulate evidence, until you can make a decision. Suppose that aging affects the first stage most significantly, but the latter two are fine. You could target interventions more precisely, if you know where the problem lies.”\nThe experimental approach, Wheeler notes, can apply to other conditions, such as drug addiction or alcoholism. If one can deconstruct how the brain of an alcoholic takes in and processes information, it may be possible to develop better ways to train alcoholics to avoid that first drink.\nAdditional Images\nContact\nA. Maureen Rouhi, Ph.D.\nDirector of Communications\nCollege of Sciences\nEmail\nmaureen.rouhi@cos.gatech.edu\nAdditional information\nB.S. in Neuroscience\nDegree program website.\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}