{"text": "NASA Chooses Georgia Tech For New Solar System Research Project | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNASA Chooses Georgia Tech For New Solar System Research Project\nA Georgia Tech-led research project is one of four chosen by NASA to broaden knowledge of the Solar System.\nFacebook\nTwitter\nEmail\nMar 23, 2017\n— Atlanta, GA\nThe year is 2030, and U.S. astronauts are living and working on the Martian moon Phobos. Their underground habitats, equipment, and spacesuits are protected from radiation and micrometeorites, thanks to an innovative mix of sturdy polymers and nanomaterials. In fact, a special coating allows portions of the suits to double as real-time radiation detectors.\nMeanwhile, the solar wind streaming onto Phobos’ surface holds the promise of life for those astronauts.\n“ Does the solar wind, which is mostly protons and electrons, produce water when it interacts with the regolith?”\nasks\nThomas Orlando , professor in the School of Chemistry and Biochemistry. “Astronauts want water. They\nneed\nwater. They’re not going to carry jugs of distilled water. Is there enough water there for on-site use or, to go even further, to transform into fuel?”\nThose are questions that Orlando and a large multidisciplinary research team, with specialists from across the U.S., Germany, and Italy, will soon try to answer, thanks to\nNASA\nfunding.\nNASA announced on March 17\nthat Orlando’s team– Radiation Effect on Volatiles and Exploration of Asteroids and Lunar Surfaces (REVEALS) – is one of four chosen by the space agency for inclusion in\nSSERVI\n– the Solar System Exploration Research Virtual Institute. NASA created SSERVI to work with scientific institutions around the world to learn more about the lunar surface, near-Earth asteroids, and the Martian moons Phobos and Deimos. REVEALS has requested a $5.5 million budget over five years.\nA Global Team\nWithin Georgia Tech, Orlando’s team include\nPhillip First\nand   Zhigang Jiang\nin the School of Physics,\nPeter Loutzenhiser\nin the George W. Woodruff School of Mechanical Engineering,\nCarol Paty\nand\nJames Wray\nin the School of Earth and Atmospheric Sciences,\nJohn Reynolds\nand\nJoseph Perry\nin the School of Chemistry and Biochemistry, and\nJud Ready\nin the Georgia Tech Research Institute.\nOther institutions working with Georgia Tech on REVEALS are the University of California, Davis; Jackson State University;\nJohns Hopkins University Applied Physics Lab ; University of Notre Dame;\nFlorida Space Institute ; and the University of Central Florida (UCF).\nInternational collaborators include the\nUniversity of Stuttgart Institute of Space Systems , the\nIstituto Nazionale di Astrofisica Catania Astrophysical Observatory\nin Italy, and the\nSapienza University of Rome .\nAll the collaborations are important because they provide the correct mix of expertise, Orlando says.  As an example, the leadership team involves a former astronaut, Stephen Robinson (UC-Davis), and a flight physician, Esther Beltran (UCF).\nA Giant Leap for Georgia Tech Space Research\nREVEALS is an important step in the well-established relationship between Georgia Tech and NASA. It also validates Tech’s interdisciplinary approach in solving big-science problems, Orlando says.\nA veteran of applying for NASA requests for proposals, Orlando says the REVEALS win is his biggest yet, because of its interdisciplinary approach. “It’s probably the most important because it links many entities on campus that haven’t been linked before,” he says. For example, Orlando will be working with the Georgia Tech’s aerospace engineers some who have launched experiments in shoebox-sized satellites, called\nCubeSats .\n“Then it links us across the country, and it links us to groups in Germany and Italy, so we have this pretty strong team that’s global.” REVEALS is a worldwide project, Orlando says, “but it’s based at Georgia Tech, and we’ll manage the budget and science directions.”\nREVEALS also spotlights the role of the Institute’s\nCenter for Space Technology and Research\n(C-STAR). Its goal is to bring more space science enterprise projects to Georgia and the Southeast. “C-STAR is a very strong entity on campus,” Orlando says. “REVEALS now gives some immediate higher visibility to CSTAR nationally and internationally.”  Currently, Orlando also serves as the Director of CSTAR.\nWhat REVEALS Hopes to Reveal\n“If you want to go into space and understand what you find there,” says School of Chemistry and Biochemistry Chair\nM.G. Finn , “you have to understand the chemistry under your feet, no matter what world you are standing on!”\nREVEALS has two research themes: understanding the interaction of radiation and micrometeorites with the surfaces of airless bodies like Earth’s moon and Mars’ moons and developing and testing new materials for improved safety and health during human exploration.\nFrom those starting points, the REVEALS team hopes to answer these questions:\nWhat are the primary mechanisms, such as solar wind, that produce, transport, or destroy volatiles – substances that readily vaporize, like water and hydrogen – on airless celestial bodies?\nDoes micrometeorite bombardment contribute to the evolution of volatiles?\nIs there an operationally useful inventory of resources on these airless bodies that can support human exploration? Could water and other elements be mined somehow on site?\nCan nanocomposite materials reduce the risks associated with radiation on the lunar surface or on Mars’ moons so that astronauts can spend more time exploring?\nCan the novel properties of new materials be exploited to develop real-time radiation monitors?\nCan new polymer-based flexible materials be incorporated into spacesuits and/or vehicles to enhance human safety during surface operations?\nRadiation Assault and Better Spacesuits Through Chemistry\nTo help answer those questions, the REVEALS team will conduct experiments that simulate what happens when small dust grains and micrometeorites smash into regolith, the top layer of soil and broken rocks found on Earth’s moon and near-Earth asteroids.\nPrevious experiments at other institutions have correctly simulated momentum and impact, but not the chemistry, Orlando says. “We are setting up a laser to accelerate actual dust grains to the right velocities before shooting them into regolith-like materials,” Orlando explains. “There is nobody in the world doing this. Even NASA says that this experiment could change the landscape.”\nAnother point NASA liked about the REVEALS project, Orlando says, is the goal of providing astronauts with radiation detectors. Astronauts currently have no way to find out in real-time how much radiation they’re receiving in airless environments. REVEALS wants to develop a passive device or a way to coat future spacesuits with materials that can also read radiation charge. “So the material or suit itself is not only hardened against radiation, but it’s also a real-time monitor of the charges produced by the impacting radiation,” Orlando says. “We want to try to spin this capability into a protective coating, not just for a space suit, but also a habitat.”  Some of the work toward radiation detectors has evolved from projects that Orlando and First have been involved in for more than a decade dealing with graphene.\n“REVEALS will further establish Georgia Tech, the College of Sciences, and the Southeast region of the U.S. as leaders in this most human of scientific endeavors,” Finn says.\nAdditional Images\nContact\nRenay San Miguel\nCommunications Officer/Science Writer\nCollege of Sciences\n404-894-5209\nEmail\nrenay.san@cos.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}