{"text": "Anuj Mehrotra Named Dean of Scheller College of Business | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nAnuj Mehrotra Named Dean of Scheller College of Business\nMehrotra will assume the role on Jan. 1, 2024.\nFacebook\nTwitter\nEmail\nAnuj Mehrotra\nJun 06, 2023\nFollowing a national search, Georgia Tech alumnus Anuj Mehrotra has been selected to be the Stephen P. Zelnak Jr. Dean's Chair of Georgia Tech’s Scheller College of Business, effective Jan. 1, 2024.\nMehrotra is currently the dean of The George Washington University School of Business (GWSB) and has held that position since 2018. He is also a professor of Decision Sciences in the school. Under his leadership, GWSB has reimagined graduate business education by introducing modularity and flexibility through industry-driven certificates that help create customizable master’s degrees. The school has also invested in making its programs more accessible by expanding the portfolio of online offerings. With Mehrotra at the helm, the school converted all undergraduate business degrees to B.S. degrees featuring new majors in business analytics, entrepreneurship, information systems, international business, and marketing. These changes have enabled students to obtain double majors. The school also created 4+1 combined degree pathways for both business and nonbusiness students to pursue interdisciplinary education opportunities and earn a specialized master’s degree at GWSB — in addition to the undergraduate degree — in five years.\n“Anuj Mehrotra’s vision of entrepreneurship, and interdisciplinary and experiential education, aligns seamlessly with Georgia Tech’s goal of expanding access and our commitment to our Progress and Service motto,” said Steven W. McLaughlin, provost and executive vice president for Academic Affairs. “His experience with building a culture of collaboration, transparency, and trust will build upon the Scheller community’s trajectory as a leader in business education and research. We are excited to welcome him back to his alma mater.”\nDean Mehrotra is credited with engaging alumni, industry, and government leaders through creative programming and partnerships, including the Dean’s Corporate Council and George Talks Business speaker series. In Spring 2023, Dean Mehrotra led the launch of the inaugural business and policy forum that convened leaders from industry, government, and academia to address the most significant issues related to the evolving landscape of emerging technology and cybersecurity with a focus on policy and regulation. He also established the GWSB Entrepreneurial Hall of Fame to recognize individuals who have made significant contributions to entrepreneurial excellence.\nDuring his tenure, Dean Mehrotra appointed the school's first chief diversity officer and led the Dean's Diversity Council in widening partnerships and deepening engagement with various stakeholders to cultivate and support a sense of belonging within the community. The school earned recognition across MBA rankings for leadership in diversifying enrollment in the full-time MBA program, notably achieving majority women enrollment as well as the highest percentage of women in the program nationwide for three years in a row.\nPreviously, Mehrotra served as senior vice dean and vice dean of Faculty Development and Research at the University of Miami School of Business Administration. He also served as the school's interim dean, as vice dean of Graduate Business Programs and Executive Education, as vice dean for Faculty Affairs, and as chairperson of the Department of Management Science. Overall, Mehrotra has 30 years of teaching, administrative, and research experience.\nIn 2022, Mehrotra addressed the United Nations and implored business schools to prioritize recruiting and empowering a diverse and inclusive community so that classroom makeups look more like the U.N. itself. He said one of his missions is to cultivate ethical leaders who focus on innovation to make a positive impact.\n“I am particularly excited about the opportunity to serve the Georgia Tech Scheller College of Business community and continue a sustained effort in advancing diversity, equity, inclusion, and belonging as a key strategic area,” Mehrotra said. “As an alum, I am looking forward to this homecoming and working with Scheller’s world-class faculty and its diverse stakeholders at a top public research university to further promote inclusive innovation and excellence in research and business education that best prepare our students for the shifting market demands.”\nHis research interests are in large-scale optimization and interdisciplinary applications. His work has been published in top-tier academic journals, including\nManagement Science, Mathematical Programming, Naval Research Logistics,\nand the\nInforms Journal on Computing . Mehrotra has worked with more than two dozen Fortune 500 companies, and his previous experience includes visiting positions at the Tepper School of Business at Carnegie Mellon University and at the T. J. Watson Research Center. In 2022, his expertise in his field was honored with a chaired professorship in his name from Woxsen University in Hyderabad, India.\nMehrotra received his doctoral degree in operations research from the Georgia Institute of Technology, his master’s degree from Virginia Tech, and his bachelor’s degree in mechanical engineering from the Birla Institute of Technology and Science in India.\nJonathan Clarke Named Interim Dean of Scheller College of Business\nScheller College of Business Associate Professor Jonathan Clarke has been named interim dean. He will assume the position on July 1, following the departure of Dean Maryam Alavi. Since 2020, Clarke has served as the Sr. Associate Dean of Programs and has helped guide Scheller’s undergraduate and MBA programs to record high placement rates and starting salaries.\n“We are grateful to Jonathan for his willingness to step into the role of interim dean,” said Steven W.  McLaughlin, provost and executive vice president for Academic Affairs. “He’s a dedicated, decorated member of the Scheller community, and the College of Business could not be in better hands during this transition.”\nClarke's work has been published in the\nJournal of Finance ,\nJournal of Financial Economics ,\nManagement Science ,\nInformation Systems Research , the\nJournal of Financial and Quantitative Analysis , the\nJournal of Business , the\nJournal of Banking and Finance ,\nAnnals of Finance ,\nJournal of Empirical Finance , and the\nJournal of Corporate Finance . His paper titled \"Long-Run Performance and Insider Trading in Completed and Canceled Seasoned Equity Offerings\" won the 2001 William F. Sharpe award for best published paper in the\nJournal of Financial and Quantitative Analysis.\nClarke is an award-winning educator. He was named to the\nPoets and Quants\n2018 list of Top 50 Undergraduate Business Professors. He was also voted the 2009, 2013, and 2021 MBA Core Professor of the Year, was a 2009 Hesburgh Award teaching fellow, and received the 2010 James F. Frazier Jr. Award for Teaching Excellence. He has taught in custom programs for leading companies like NCR, Clorox, Coca-Cola, Georgia Pacific, The Home Depot, Lockheed Martin, and the National Football League. Clarke is a past president of the Eastern Finance Association and serves on the editorial board of\nThe Financial Review .\nClarke received his Ph.D. from the Katz Graduate School of Business at the University of Pittsburgh. His undergraduate degrees are in mathematics and economics from Indiana University in Bloomington.\nWritten by: Michelle Azriel\nAdditional Images\nContact\nSusie Ivy, Institute Communications\nEmail\nprovostsoffice@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}