{"text": "The Sustainability Next Task Force Delivers Vision and Launches Implementation | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nThe Sustainability Next Task Force Delivers Vision and Launches Implementation\nThe Sustainability Next Plan features six key priorities that touch nearly every aspect of the Institute, each with specific objectives and strategies for implementation.\nFacebook\nTwitter\nEmail\nOct 24, 2022\n— Atlanta, GA\nThis October, Georgia Tech celebrates Campus Sustainability Month by showcasing the new\nSustainability Next Plan . Following the completion of Georgia Tech’s strategic plan, the Institute’s executive leadership team formed the Sustainability Next Task Force and charged it with proposing an implementation roadmap for sustainability at Georgia Tech over the next 10 years that emphasizes coordination across the research, education, operations, and economic development activities of the Institute.\nFor more than 30 years, Georgia Tech has promoted sustainability initiatives ranging from teaching sustainability principles in the classroom, to building one-of-a-kind campus facilities to meet environmental and energy standards, to conducting groundbreaking research. What’s different about the Sustainability Next Plan is that it presents a newly unified vision for coalescing, implementing, and measuring cross-cutting sustainability initiatives at Tech. It will also serve to advance key strategic goals of the\nstrategic plan , including amplify impact, connect globally, and lead by example.\n“The plan leverages our diverse and unique strengths to address the most challenging problems of our time,” said Georgia Tech President Ángel Cabrera. “It draws a campuswide consensus around well-defined steps that, in addition to moving our campus operations further toward sustainability, will equip students with the skills to recognize and solve sustainability challenges in their careers, and support research that will establish Georgia Tech as a global leader in the development of innovative solutions for a sustainable future.”\nKey Priorities of the Institute Sustainability Plan\nThe  Sustainability Next Plan features six key priorities that touch nearly every aspect of the Institute, each with specific objectives and strategies for implementation.\nInstitute Operations\nEducation for Sustainable Development\nLeading Sustainability Research\nCulture and Organization\nClimate Solutions\nLiving Learning Campus\nThe projects launching in the 2022 – 23 academic year include:\nClimate action plan\nLiving learning campus initiative\nInterdisciplinary graduate degree scoping and instructional design\nSeed funding programs for cross-disciplinary climate research and teaching with the U.N. Sustainable Development goals\nSustainable-X, a student entrepreneurship program\nThese projects will be supported by new positions in Infrastructure and Sustainability, the Office of Development, the Brook Byers Institute for Sustainable Systems, and the Center for Teaching and Learning (in collaboration with Serve-Learn-Sustain). Their shared governance will be strengthened through an Institute sustainability governance project steered by Strategic Consulting.\nAbout Sustainability Next\nThe\nSustainability Next Plan\nis a mission-critical deliverable of the\nSustainability Next Task Force . For more than six months, the task force conducted an exhaustive review of sustainability data gathered from campus programs, units, and partners. The task force also hosted several town halls for students, faculty, and staff and met one-on-one with leaders representing nearly all facets of campus operations to synthesize recommendations that make up the objectives and strategies of the plan. Overall, the process involved engaging with more than 200 key stakeholders and coordinating across all 20 Georgia Tech strategic plan  implementation teams , with a particular emphasis on Research Next; Institute Diversity, Equity, and Inclusion; Anchor Institution; Comprehensive Campus Plan; and International Education.\n“The most exciting thing about this plan is that it is so cross-cutting,” said Anne Rogers, associate director of the Office of Campus Sustainability and co-chair of the Sustainability Next Task Force. “Sustainability is inherently collaborative, and we can only achieve our goals when we have buy-in from across campus stakeholders and departments. We’ve had sustainability plans in the past, but never one that matches the scale or scope of this one. We’re excited about what we can accomplish with this new commitment.”\nClick here\nto explore the Sustainability Next Plan, including its objectives and strategies — and visit the site frequently as the plan progresses. For more information, including how you can get involved, contact any of the following Sustainability Next co-chairs:\nMaria Cimilluca , vice president for Infrastructure and Sustainability\nAnne Rogers , associate director for Office of Campus Sustainability, Infrastructure and Sustainability\nLaura Taylor , chair and professor, School of Economics, Ivan Allen College of Liberal Arts\nBeril Toktay , professor of operations management, Brady Family Chair, and Regents’ Professor; interim executive director, Brook Byers Institute for Sustainable Systems; and faculty director, Ray C. Anderson Center for Sustainable Business, Scheller College of Business\nAdditional Images\nRelated links\nSustainability Next Plan\nCampus Sustainability Month\nContact\nJordan Barron\nProject Manager\nOffice of Campus Sustainability\nAdditional information\nAbout Campus Sustainability Month\nHeld each October, Campus Sustainability Month is an international celebration of sustainability in higher education. Throughout the month, colleges and universities organize events to raise the visibility of campus sustainability and provide campus sustainability advocates with a platform to deepen campus engagement around sustainability.\nClick here\nto view the October 2022 events and programs at Georgia Tech.\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}