{"text": "New International Center Will Support Collaborative Solutions to Improve Health of World’s Oceans | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNew International Center Will Support Collaborative Solutions to Improve Health of World’s Oceans\nOcean Visions – UN Decade Collaborative Center for Ocean-Climate Solutions (OV – UN DCC) will be headquartered at Georgia Aquarium\nFacebook\nTwitter\nEmail\nOct 12, 2022\nIn a significant response to urgent climate-related threats, a new international center headquartered at Georgia Aquarium, endorsed by the UN Decade of Ocean Science for Sustainable Development, will support versatile, collaborative solutions to improve the health of the world’s oceans.\nThe Ocean Visions ­­– UN Decade Collaborative Center for Ocean-Climate Solutions (OV – UN DCC), a partnership with\nOcean Visions ,\nGeorgia Aquarium , and\nGeorgia Institute of Technology , is the only center of its kind in the United States.\nThe climate crisis is one of the greatest threats facing public health, natural resources and the economy worldwide, and ocean ecosystems are not only at risk, but also offer the potential of climate mitigation solutions.\nThe primary focus of the Center is to help co-design, develop, test, fund and deliver scalable and equitable ocean-based solutions to reduce the effects of climate change and build climate-resilient marine ecosystems and coastal communities. There are also tremendous opportunities to accelerate carbon clean-up and advance sustainable ocean economies.\n“A diverse approach is critical to address today’s serious threats to ocean health,” said\nBrian Davis , Ph.D., president and CEO of Georgia Aquarium. “As a mission-focused conservation leader, Georgia Aquarium is keen to host this multinational center that will connect innovative researchers with the resources to create and launch projects that may solve ocean-climate issues.”\nIn affiliation with the Ocean Decade, run by the Intergovernmental Oceanographic Commission (IOC) of the UN Educational, Scientific and Cultural Organization (UNESCO), the Center’s work will contribute to the UN’s Sustainable Development Goals to achieve by 2030 that are a blueprint to achieve a better and more sustainable future for all.\n“In response to the need for partnership and investment in ocean science, and to help urgently mitigate the impact of climate change on the ocean, the Ocean Decade movement thanks Ocean Visions, Georgia Aquarium, and Georgia Institute of Technology for this generous support and long-term commitment,” said\nJulian Barbière , Ocean Decade Global Coordinator and Head of the Marine Policy and Regional Coordination Section, IOC-UNESCO. “Such exemplary leadership by our Decade Collaborative Centers, spearheaded by the OV – UN DCC in the U.S.  is an important step towards developing effective ocean-climate solutions.”\nThe ocean nurtures 80% of all life on Earth. Billions of people rely on food from the ocean, and world economies depend upon it for fishing, tourism, shipping, energy and more. It is the world’s largest carbon sink, vital to curbing the impacts of climate change. Healthy marine habitats defend coastal communities from intensifying storms and flooding.\n“The ocean crisis and the climate crisis are two sides of the same coin, and we cannot have a healthy ocean without resolving the climate crisis and the greenhouse gas pollution causing it,” said\nBrad Ack , executive director and chief innovation officer at Ocean Visions, a nonprofit that develops solutions to complex ocean challenges.\n“This work will take bold imagination, greatly expanded innovation, and many more people from around the world engaged in this effort collectively. This new Center will give us a framework to build the innovation ecosystem we desperately need,” said\nEmanuele Di Lorenzo , Ph.D., chairman and co-founder of Ocean Visions.\nThe ocean has buffered humanity from the worst effects to date of climate disruption by directly absorbing about 30 percent of humanity’s carbon dioxide (CO2) emissions and trapping more than 90 percent of the excess heat in the biosphere caused by CO2 pollution. However, both of these climate-buffering functions have come at a high cost – unraveling marine ecosystems and crippling the ability of the ocean to support the billions of people and other creatures dependent upon it.\nThe Ocean Visions – UN Decade Collaborative Center will work with an emerging global network of experts and collaborators associated with projects and programs to design, test and deploy viable solutions, such as Ocean Visions’\nGlobal Ecosystem for Ocean Solutions ,\n1000 Ocean Startups\nand\nStride .\nFor example, one issue being solved is securing investment in ocean solutions. The Center is helping advance the development of a new open-source tool called The Ocean Impact Navigator, which consists of 30 prioritized key performance indicators (KPIs), grouped in six main impact areas. It captures effects that innovators are driving across ocean health, climate change, human wellbeing and equity.\n“This Center signals an urgent, strategic commitment to finding climate solutions,” said  Susan Lozier , Ph.D., dean of the College of Sciences and Betsy Middleton and John Clark Sutherland Chair at Georgia Tech and President of the American Geophysical Union (AGU). “Ocean health is also human health, and we must find effective ways to protect waters around the planet.”\n“At this Center, the best and brightest minds—including our researchers, staff and students—will ensure that our ocean will remain vital for generations to come,” added\nTim Lieuwen , Ph.D., executive director of the Strategic Energy Institute at Georgia Tech who also serves as Regents’ Professor and David S. Lewis Jr. Chair in the Institute's Daniel Guggenheim School of Aerospace Engineering. “The solutions are there, and we look forward to working alongside Georgia Aquarium and Ocean Visions to find them, with the support of the Ocean Decade movement.”\nFor more information about the Ocean Visions ­­– UN Decade Collaborative Center for Ocean-Climate Solutions, visit the website at\noceanvisions.org/undcc/ .\n###\nAbout\nOcean Visions –\nUN Decade Collaborative Center for Ocean-Climate Solutions\nThe\nOcean Visions –\nUN Decade Collaborative Center for Ocean-Climate Solutions is an innovative partnership between Ocean Visions, Georgia Tech and Georgia Aquarium, with headquarters at the Aquarium in Atlanta. The Center, endorsed by the United Nations Decade of Ocean Science for Sustainable Development, leads and supports processes to co-design, develop, test, fund and deploy scalable and equitable ocean-based solutions to reduce or reverse the effects of climate change, enhance food security and build climate-resilient marine ecosystems and coastal communities. The Center’s work contributes to United Nations Sustainable Development Goals to achieve by 2030 that are a blueprint to achieve a better and more sustainable future for all.\nAbout the Ocean Decade:\nProclaimed in 2017 by the United Nations General Assembly, the UN Decade of Ocean Science for Sustainable Development (2021-2030) (‘the Ocean Decade’) seeks to stimulate ocean science and knowledge generation to reverse the decline of the state of the ocean system and catalyse new opportunities for sustainable development of this massive marine ecosystem. The vision of the Ocean Decade is ‘the science we need for the ocean we want’. The Ocean Decade provides a convening framework for scientists and stakeholders from diverse sectors to develop the scientific knowledge and the partnerships needed to accelerate and harness advances in ocean science to achieve a better understanding of the ocean system, and deliver science-based solutions to achieve the 2030 Agenda. The UN General Assembly mandated UNESCO’s Intergovernmental Oceanographic Commission (IOC) to coordinate the preparations and implementation of the Decade.\nAbout Georgia Aquarium\nGeorgia Aquarium is a leading 501(c)(3) non-profit organization located in Atlanta, Ga. that is Humane Certified by American Humane and accredited by the Alliance of Marine Mammal Parks and Aquariums and the Association of Zoos and Aquariums. It is also a Center for Species Survival by the International Union for the Conservation of Nature. Georgia Aquarium is committed to working on behalf of all marine life through education, preservation, exceptional animal care, and research across the globe. Georgia Aquarium continues its mission each day to inspire, educate, and entertain its millions of guests about the aquatic biodiversity throughout the world through its hundreds of exhibits and tens of thousands of animals across its eight major galleries. For more information, visit georgiaaquarium.org.\nAbout Georgia Tech:\nThe Georgia Institute of Technology, or Georgia Tech, is a public research university developing leaders who advance technology and improve the human condition. The Institute offers business, computing, design, engineering, liberal arts and sciences degrees. Its nearly 44,000 students representing 50 states and 149 countries, study at the main campus in Atlanta, at campuses in France and China and through distance and online learning. As a leading technological university, Georgia Tech is an engine of economic development for Georgia, the Southeast and the nation, conducting more than $1 billion in research annually for government, industry and society.\nThis press release is shared jointly with the Georgia Aquarium and Ocean Visions newsrooms.\nLearn more:\noceanvisions.org/undcc\nAdditional Media\nContact\nJess Hunt-Ralston\nDirector of Communications\nCollege of Sciences at Georgia Tech\nEmail\njess.hunt@cos.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}