{"text": "Georgia Tech Admission Delivers Early Action 1 Decisions | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Admission Delivers Early Action 1 Decisions\nGeorgia Tech invited 2,330 Georgia students to join the next class.\nFacebook\nTwitter\nEmail\nTwo students were admitted from Troup County Comprehensive High School in LaGrange, Georgia.\nDec 07, 2020\n— Atlanta, GA\nMore than 6,000 Georgia students (an increase of more than 20% from the state compared to last year) who applied to Georgia Tech in Early Action 1 received their admission decisions on Friday evening. All six of Georgia Tech’s colleges saw an increase in applications.\nA total of 2,330 Georgia students were admitted, for an overall admit rate of 38%. Admitted students hail from 90 counties and 366 high schools around the state. Of the Early Action 1 admit pool 50% are men, 50% are women; 12% come from rural areas of Georgia; and 18% identify as Black or Hispanic. Through the Georgia Tech Scholars program, Tech offers admission to valedictorians and salutatorians who apply from any accredited Georgia high school with more than 50 graduates, and 16% of the admitted students are predicted to be honored as such.\n“Numbers could never tell the entire story that we read in these students’ applications,” said Rick Clark, director of Undergraduate Admission. “In their families, schools, and local communities they have demonstrated amazing impact and influence. It is truly an honor to offer them admission, and we hope they will ultimately choose to continue their education at Tech.”\nOn Friday Undergraduate Admission staff members virtually surprised students with their acceptances at a dozen high schools across the state. President Ángel Cabrera joined the effort at Maynard Holbrook Jackson High School in Atlanta. And Provost Steven W. McLaughlin virtually congratulated students at Bowdon High School in Bowdon, Georgia.\n“What an exciting time to celebrate with students across the state as they are admitted to Georgia Tech,” said McLaughlin, provost and executive vice president for Academic Affairs. “These decisions are long-awaited and the result of a lot of hard work and dedication on the part of these students. I was absolutely delighted to play a part.”\nBeginning with the 2021 admission cycle, first-year applicants could select from one of three admission plans: Early Action 1, Early Action 2, and Regular Decision.\nThe first cycle of admission is reserved specifically for Georgia students, including Georgia residents attending high school out of state. The application deadline for Early Action 1 was Oct. 15.\nEarly Action 2 will be announced in January, and the Regular Decision announcement will be in March.\n“Our president’s new strategic plan clearly calls for recruiting and enrolling the top talent from around the state, nation, and globe. I genuinely believe Tech’s best days are ahead, and this admitted group of students is great step toward achieving that mission,” Clark said.\n“At this point, our team is not only focused on reading the more than 21,500 Early Admit 2 applications we received but also convincing our newly admitted students to choose Tech from among their other amazing college options,” he said.\nView the full EA-1 profile\nAdditional Images\nContact\nVictor Rogers\nInstitute Communications\nEmail\nvictor.rogers@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}