{"text": "New Research May Improve Communications During Natural Disasters | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNew Research May Improve Communications During Natural Disasters\nNew research from Georgia Tech Research demonstrates the ability to gather and share data during natural disasters during internet outages.\nFacebook\nTwitter\nEmail\nSep 08, 2017\n— Atlanta, GA\nStorms like Hurricane Irma and other natural disasters bring with them lots of uncertainty: where will they go, how much damage will they cause. What is certain is that no matter where they strike, natural disasters knock out power.\nAnd, no power means no internet for thousands of people in affected areas.\nHowever, Georgia Tech researchers are proposing a new way of gathering and sharing information during natural disasters that does not rely on the internet.\nUsing computing power built into mobile phones, routers, and other hardware to create a network, emergency managers and first responders will be able to share and act on information gathered from people impacted by hurricanes, tornados, floods, and other disasters.\n“Increasingly, data gathered from passive and active sensors that people carry with them, such as their mobile phones, is being used to inform situational awareness in a variety of settings,” said\nKishore Ramachandran , computer science professor at Georgia Tech.\n“In this way, humans are providing beneficial social sensing services. However, current social sensing services depend on internet connectivity since the services are deployed on central cloud platforms.”\nCommunicating on the 'edge'\nIn a\npaper\npresented earlier this year at the\n2 nd\nInternational Workshop on Social Sensing , the Georgia Tech research team detailed how it may be possible to access these centralized services using a decentralized network that leverages the growing amount of computing power at the “edge” of the internet.\nThis ability will give a huge advantage to first responders.\nIn a flooded area, for example, search and rescue personnel using a geo-distributed network would be able to continuously ping enabled phones, sensors, and other devices in an area to determine their exact locations. The data is used to create density maps of people in that search region. These maps are then used to prioritize and guide emergency response teams.\nThe Georgia Tech proposal takes advantages of edge computing. Also known as fog computing, edge computing places more processing capabilities in sensing devices – like surveillance cameras, embedded pavement sensors, and others, as well as in consumer devices like cell phones, readers, and tablets – in order to improve network latency between sensors, apps, and users.\nRather than just being able to communicate through the internet with central cloud platforms, the Georgia Tech team has demonstrated that by harnessing edge computing resources, sensing devices can be enabled to identify and communicate with other sensors in an area.\nDecentralizing social sensing services\n“We believe fog computing can become a potent enabler of decentralized, local social sensing services that can operate when internet connectivity is constrained,” said Ramachandran.\n“This capability will provide first responders and others with the level of situational awareness they need to make effective decisions in emergency situations.”\nThe team has proposed a generic software architecture for social sensing applications that is capable of exploiting the fog-enabled devices. The design has three components – a central management function that resides in the cloud, a data processing element placed in the fog infrastructure, and a sensing component on the user’s device.\nThe researchers say that it is not enough to simply run a centralized social sensing service on a number of parallel fog nodes.\n“Rather, the social sensing service has to become a distributed service capable of discovering available fog nodes and building a network that aggregates and shares information between social sensors that are connected to different fog nodes,” said computer science Ph.D. student\nHarshit Gupta .\nWhat's next?\nBeyond emergency response during natural disasters, the team believes its proposed fog architecture can also benefit communities with limited or no internet access. These include applications for public transportation management, job recruitment, and housing.\nAnother possible application of the new approach is monitoring sensing devices in remote areas.\nTo monitor far-flung devices in areas with no internet access, a bus could be outfitted with fog-enabled sensing capabilities. As it travels in remote areas it would collect data from sensing devices. Once in range of internet connectivity, the “data mule” bus would upload the information to the centralized cloud-based platforms.\n“In places that did not benefit from the first wave of cloud-based social sensing services, our hope is that these communities can leapfrog having to rely solely on the internet and directly use fog-based services,” said Ramachandran.\nAdditional Images\nContact\nAlbert Snedeker, Communications Manager\nalbert.snedeker@cc.gatech.edu\nEmail\nalbert.snedeker@cc.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}