{"text": "Metagenomics Unlocks Unknowns of Diarrheal Disease Cases in Children | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMetagenomics Unlocks Unknowns of Diarrheal Disease Cases in Children\nResearchers have found that conventional culture-based lab tests may misdiagnose as many as half of the microbial causes of diarrheal diseases in children.\nFacebook\nTwitter\nEmail\nUsing advanced metagenomics techniques, researchers have found that conventional culture- based lab tests may often misdiagnose the microbial causes of diarrheal diseases in children. The study, based on samples from Ecuadorian children, also found that a common strain of the E. coli bacterium may be more virulent than previously believed.\nNov 18, 2019\n— Atlanta, GA\nUsing advanced metagenomics techniques, researchers have found that conventional culture-based lab tests may misdiagnose as many as half of the microbial causes of diarrheal diseases in children. The study, based on samples from Ecuadorian children, also found that a common strain of the\nE. coli\nbacterium may be more virulent than previously believed.\nThe research, which used multiple lines of evidence to determine the microbe causing changes in the gut microbiome during a diarrheal episode, may be significant for applying new diagnostic technologies that could enable personalized medical treatments of intestinal diseases.\nThe project, led by researchers from the Georgia Institute of Technology, the Emory Rollins School of Public Health, and Universidad San Francisco de Quito, is part of a study funded by the National Institute of Allergy and Infectious Diseases (NIAID) that integrates epidemiological, molecular, and metagenomic data to understand how enteric (food and waterborne) pathogens and the gut microbiome vary across an urban-rural gradient in Ecuador. Frequent illness can affect the growth and development of children during their critical early years.\n“We wanted to understand where the illnesses are coming from and what the consequences are for the development of the children,” said\nKostas Konstantinidis , a professor in the\nSchool of Civil and Environmental Engineering\nat Georgia Tech. “Knowing more about the causative agent may allow us to prevent infections. This would be relevant not just for the developing world, but for children everywhere.”\nThe findings were reported Oct. 4 in the journal\nApplied and Environmental Microbiology . The research team also included researchers from the Universidad Central del Ecuador.\nInformation the study provided on the likely causative agent of enteric diseases raises questions about long-held definitions of pathogenic agents, said\nKaren Levy , an associate professor at Rollins. Many so-called “pathogenic\nE. coli ” infections are asymptomatic — not causing diarrhea — she noted. If a microbe considered a pathogen can be detected in a stool sample, but it is not causing disease, is it a pathogen?\n“The approach we used in this analysis helps to not only detect whether or not the pathogenic\nE. coli\nis present in the stool, but also if it is the likely cause of diarrhea experienced by study subjects,” she said.  “This holds promise that, in the future, we could use metagenomic approaches to diagnose not just the presence of the so-called ‘pathogenic\nE. coli ,’ but also of the actual pathogenicity of these organisms.”\nEnteric infections often go undiagnosed in children, though they can in some circumstances be fatal. For the study, researchers collected more than 1,000 samples from infected children in Ecuador and analyzed them using traditional culture-based methods in which samples are placed onto selective cell culture media, allowed to grow, and then studied to determine the pathogen present.\nA subset of 30 samples were also sent to the Konstantinidis lab at Georgia Tech, where his team has been developing new culture-independent genomics testing that can identify microbes that may not be detectable using standard culture techniques. The researchers examined the total gut microbiome and its shifts during diarrheal infections to assess the effects of three specific pathogenic genotypes of\nE. coli\non the indigenous gut microbiota.\n“We looked at the microbes in stool samples using culture-independent genomic techniques,” said Konstantinidis, who also has a faculty position in the Georgia Tech School of Biological Sciences. “We took the DNA out of the samples, sequenced it, and used bioinformatics tools to see what microorganisms were there. By looking at the entire microbiome, we can get more precise information about the pathogens that are causing disease and their effects on the commensal microbes of the gastrointestinal tract: the microbiome. We found that the effects were different for different\nE. coli\npathogens, which is important for diagnosis and distinguishing among them.”\nOne major finding was that the metagenomics technique disagreed with the culture-based study. “In 50% of the cases where the lab suggested\nE. coli\nwas the agent, we didn’t see evidence from metagenomics that this was the case,” Konstantinidis said. “We saw evidence that it was something else, potentially an enteric virus.”\nThe researchers were able to combine different diagnostic approaches in a way that could provide a more complete picture of the microbiome, creating signatures that could potentially identify the microbial agent of the disease. “Compared to the traditional approach, our technique uses multiple lines of evidence, including relative pathogen abundance, population clonality level and detection of virulence factors, and effects on the gut’s natural microbiome that haven’t been used together before,” Konstantinidis said.\nThe researchers also discovered that a strain known as diffuse adherent\nE. coli\n(DAEC) was accompanied by large amounts of co-eluted human DNA in the stool sample. Though DAEC is not generally considered a particularly virulent strain, the presence of human DNA suggests that the DAEC may have been damaging epithelium cells in the gastrointestinal tract.\n“Understanding changes in the gut microbiome can help us understand how different strains cause distinct pathogenicity and symptoms such as the elution of high amount of human DNA and changes in the abundance of commensal microbiota,” Konstantinidis said. “If infections like this happen often, that could have implications for a child’s growth and development.”\nThe metagenomics technique could help provide a foundation for personalized medicine that would select therapies based on the specifics of the microbe – including its virulence and antibiotic resistance profiles. The study shows that the technology works and can be done quickly, but trained personnel are needed to make it more widely available.\n“In the next five or 10 years, we are going to see some big changes in which these new methodologies are adopted in the clinic, and that could lead, in the long term, to innovation in diagnosis and treatment,” he added.\nFuture work as part of another NIAID award will examine how environmental factors – such as water quality, presence of animals in the home, and the chemical environment – affect the microbiomes of small children. In this cohort of children from different geographic areas, the team will examine additional enteric pathogens, and follow children for their first two years of life. This will offer the opportunity to understand whether infections are cleared from the body – or if they continue to lurk in low levels.\nIn addition to those already mentioned, the authors included recent Georgia Tech School of Biological Sciences graduates Angela Peña-Gonzalez and Maria J. Soto-Girón, Shanon Smith, Jeticia Sistrunk, Lorena Montero, Maritza Páez, Estefanía Ortega, Janet K. Hatt, William Cevallos, and Gabriel Trueba.\nFunding for the study was provided by the National Institute of Allergy and Infectious Diseases through grant 1K01AI103544. The contents are solely the responsibility of the author and do not necessarily represent the official views of the NIH.\nCITATION : Angela Peña-Gonzalez, et al., “Metagenomic signatures of gut infection caused by different Escherichia coli pathotypes” ( Applied and Environmental Microbiology , 2019).\nhttps://aem.asm.org/content/early/2019/10/01/AEM.01820-19\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : John Toon (404-894-6986) (jtoon@gatech.edu).\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}