{"text": "“First Arrival” Hypothesis in Darwin’s Finches Gets Some Caveats | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\n“First Arrival” Hypothesis in Darwin’s Finches Gets Some Caveats\nResearchers have extended the hypothesis for how early arriving species gain an ecosystem advantage through adaptive radiation.\nFacebook\nTwitter\nEmail\nImage shows blue-green colonies of Pseudomonas fluorescens SBW-25 and red colonies of competitor Serratia marcescens on plates. (Credit: Rob Felt, Georgia Tech)\nApr 26, 2017\n— Atlanta, GA\nBeing first in a new ecosystem provides major advantages for pioneering species, but the benefits may depend on just how competitive later-arriving species are. That is among the conclusions in a new study testing the importance of “first arrival” in controlling adaptive radiation of species, a hypothesis famously proposed for “Darwin’s Finches,” birds from the Galapagos Islands that were first brought to scientific attention by the famous naturalist.\nResearchers at the Georgia Institute of Technology tested the importance of first arrival with bacterial species competing in a test tube. Using a bacterium that grows on plant leaves, they confirmed the importance of first arrival for promoting species diversification, and extended that hypothesis with some important caveats.\n“We wanted to understand the role of species colonization history in regulating the interaction between the rapidly-evolving bacterium\nPseudomonas fluorescens SBW-25\nand competing species and how that affected\nP. fluorescens\nadaptive radiation in the ecosystem,” said Jiaqi Tan, a research scientist in Georgia Tech’s\nSchool of Biological Sciences . “The general pattern we find is that the earlier arrival of P. fluorescens allowed it to diversify to a greater extent. If the competing and diversifying species are very similar ecologically, we find a stronger effect of species colonization history on adaptive radiation.”\nThe research is reported April 26th in the journal\nEvolution\nand was supported by the National Science Foundation. The study is believed to be the first rigorous experimental test of the role colonization history plays in adaptive radiation.\nEvolutionary biologist David Lack studied a group of closely-related bird species known as Darwin’s Finches, and popularized them in a book first published in 1947. Among his hypotheses was that the birds were successful in their adaptive radiation – the evolutionary diversification of morphological, physiological and behavior traits – because they were early colonizers of the islands. The finches filled the available ecological niches, taking advantage of the resources in ways that limited the ability of later-arriving birds to similarly establish themselves and diversify, he suggested.\n“The bird species that arrived after the finches could only use the resources that the finches weren’t using,” Tan explained. “The other birds could not diversify because there weren’t many resources left for them.”\nTan and other researchers in the laboratory of Georgia Tech Professor\nLin Jiang\ntested that hypothesis using\nP. fluorescens , which rapidly evolves into two general phenotypes differentiated by the ecological niches they adopt in static test tube microcosms.  Within the two major phenotypes – known as “fuzzy spreaders” and “wrinkly spreaders” – there are additional minor variations.\nThe researchers allowed the bacterium to colonize newly-established microcosms and diversify before introducing competing bacterial species. The six competitors, which varied in their niche and competitive fitness compared to\nP. fluorescens , were introduced individually and allowed to grow through multiple generations. Their success and level of diversification were measured by placing microcosm samples onto agar plates and counting the number of colonies from each species and sub-species.\nThe study also included the reverse of the earlier colonization history, allowing the competitor bacteria to establish themselves in microcosms before introducing the\nP. fluorescens.\nThe competitors included a broad range of organisms common in the environment, some of them retrieved from a lake near the Georgia Tech campus.\nThe experiment allowed the scientists to extend the hypothesis that Lack advanced 70 years ago.\n“If the diversifying species and the competing species are very similar, you can have a strong priority effect in which the first-arriving species can strongly impact the ability of the later species to diversify,” said Jiang, a professor in Georgia Tech’s School of Biological Sciences. “If the species are different enough, then the priority effect is weaker, so there would be less support for the first arrival hypothesis.”\nAdaptive radiation has important implications for new ecosystems, particularly with organisms that evolve rapidly.\nP. fluorescens\nproduces as many as ten generations a day under the reported experimental conditions, which allowed the Georgia Tech scientists to study how they evolved over 120 generations – changes that would have taken hundreds of years in finches.\nThe bacterial population studied in Jiang’s lab included as many as 100 million organisms, far more than the number of birds on the Galapagos Islands. The asexual reproduction of the bacteria meant the mutation rate likely also differed from that of the birds. Still, Jiang and Tan believe their study offers insights into how different species interact in new environments based on historical advantages.\n“From the perspective of evolutionary biology, scientists often focus only on the particular species that interest them,” said Jiang, who studies community ecology. “We also need to think about the surrounding ecological context of the evolutionary process.”\nIn future work Jiang hopes to study how the introduction of predators may combine with species competition to affect adaptive radiation. In addition to those already mentioned, the research team also included Georgia Tech Ph.D. student Xi Yang, who conducted the data analysis.\nThis research was supported by the National Science Foundation under grants DEB-1257858 and DEB-1342754.  Any opinions, findings, and conclusions or recommendations expressed in this material are those of the author(s) and do not necessarily reflect the views of the National Science Foundation.\nCITATION : Jiaqi Tan, Xian Yang and Lin Jiang, “Species ecological similarity modulates the importance of colonization history for adaptive radiation,” (Evolution 2017).\nhttp://dx.doi.org/ 10.1111/evo.13249\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contacts : John Toon (404-894-6986) (jtoon@gatech.edu) or Ben Brumfield (404-385-1933) (ben.brumfield@comm.gatech.edu).\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}