{"text": "Class Notes: Literature and Medicine | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nClass Notes: Literature and Medicine\nLiterature and medicine might seem like separate worlds with litte in common. But a class in LMC is exploring their intersection.\nFacebook\nTwitter\nEmail\nHassan says, \"The humanities and the sciences are not as far apart as we may think.\"\nAug 26, 2019\n— Atlanta, GA\nLiterature and medicine might seem like separate worlds with little in common. But Narin Hassan, associate professor in the School of Literature, Media, and Communication, is interested in exploring their intersection.\n“The humanities and the sciences are not as far apart as we may think. There are a lot of interdisciplinary connections when we bring literature and medicine together,” said Hassan, who teaches LMC 3219: Literature and Medicine and does research on the relationship between medicine, gender, and global culture.\n“Questioning what medicine is, and having students break down those boundaries, is important,” she said. “Being a physician means observing patients, knowing how to read them, how to work with language, and how to be careful with your own language. There are so many layers. The qualities of observation and analysis in the way we read a book are similar to the way doctors read a body.”\nLanguage is integral to medicine. Doctors and patients search for words and ways to convey their respective viewpoints and to reach an understanding. Hassan’s course includes narratives by physicians, describing what it means to perform surgery and practice medicine, and by patients, sharing their experiences of being hospitalized.\nThe syllabus includes the work of writer Susan Sontag, who wrote about cancer and AIDS and how diseases are represented culturally, as well as Margaret Edson’s\nWit , a play that was made into a film about a woman’s battle with ovarian cancer. The central character, an English professor, is an ambitious scholar and prolific researcher. As a cancer patient, she finds herself for the first time as the\nsubject\nof research.\n“The doctors are using terms she doesn’t understand,” said Hassan. “And she had been impatient and harsh with her own students who may not have always understood her lectures.” This experience makes her see how a lack of empathy and making assumptions about language can hamper people’s interactions. In particular, it illustrates the importance of language in medicine and how it can enhance or stifle understanding.\nThe course also examines the popularity of advocacy campaigns for certain diseases, corporate support in those areas, and the politics of that support.\n“For example, breast cancer is sometimes represented as a ‘darling’ disease in corporate marketing, and everybody wants to support breast cancer patients,” she said. “Readings in the class explore how, because it is so common, breast cancer treatment is almost a strange rite of passage. And you’re supposed to be OK with it.”\nHassan points to lung cancer and the assignment of blame that often accompanies it.\n“People say, ‘Oh you must have been a smoker. You must have done something wrong [to get lung cancer],’” she said, acknowledging how the conversation can differ depending on the disease.\nOther Systems of Medicine\nAnother topic in Literature and Medicine is the ethics and politics surrounding western medicine.\n“Western medicine has a particular way of thinking about the body and healing. It’s different from some other systems of medicine,” said Hassan, who discusses Chinese medicine and Ayurvedic medicine (originating in India) in the class.\nHer class combined theory and practice as she asked students to analyze medical settings and also consider ways to enhance their own physical and mental well-being through immersive experiences in nature or through exploring a yoga class or meditation. Student projects included a research paper comparing pre- and post-natal care in different countries and a Java program giving users information about alternative treatments for cardiovascular disease.\n“The students were very interested in examining other systems of medicine, and many of them were from other countries or had experienced other health care systems,” Hassan said. “This was the perfect class to do this.”\nAn interest in other systems of medicine comes naturally to Hassan, who was born in Pakistan and grew up with access to a wide range of health care and doctors. Her father was a diplomat, so the family moved frequently — to Turkey, Iraq, the former Yugoslavia and Czechoslovakia, Greece, Saudi Arabia, Syria, Nepal, and Sweden.\n“I never really had one family doctor,” she said. “And, I don’t like going to the doctor. It was one of those things where, when you’re queasy about something, you start looking into why.”\nShe studied historical travel writing and women who embraced different systems of medicine as a result of their travels.\n“I became interested in the cross-cultural history of medicine in the 19th century,” said Hassan, whose first book examined the relationship between medicine and gender in the British Empire.\nHassan encourages her students to think about how language and communication matter in all situations, but especially in medical environments. She also wants them to understand how the global health humanities and medical humanities are important areas of study that will help them understand health and medicine as cultural constructs.\n“I want them to come away with critical thinking skills — how to analyze the situation and advocate for yourself when you are a patient and get what you need,” she said. “I want them to be more aware, and also kinder and more empathetic, when it comes to issues of illness.”\nAdditional Images\nRelated links\nSchool of Literature, Media, and Communication\nIvan Allen College of Liberal Arts\nContact\nVictor Rogers\nInstitute Communications\nEmail\nvictor.rogers@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}