{"text": "Atomic-level imaging could offer roadmap to metals with new properties | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nAtomic-level imaging could offer roadmap to metals with new properties\nA team of researchers at the Georgia Institute of Technology has developed a new process that could help gain new insights into individual high-entropy alloys.\nFacebook\nTwitter\nEmail\nThis schematic illustration of the new palladium-containing high entropy allow shows how new alloy contains large palladium clusters (blue atoms).\nOct 09, 2019\n— Atlanta, GA\nHigh-entropy alloys, which are made from nearly equal parts of several primary metals, could hold great potential for creating materials with superior mechanical properties.\nBut with a practically unlimited number of possible combinations, one challenge for metallurgists is figuring out where to focus their research efforts in a vast, unexplored world of metallic mixtures.\nA team of researchers at the Georgia Institute of Technology has developed a new process that could help guide such efforts. Their approach involves building an atomic resolution chemical map to help gain new insights into individual high-entropy alloys and help characterize their properties.\nIn a study published Oct. 9 in the journal  Nature , the researchers described using energy-dispersive X-ray spectroscopy to create maps of individual metals in two high-entropy alloys. This spectroscopy technique, used in conjunction with transmission electron microscopy, detects X-rays emitted from a sample during bombardment by an electron beam to characterize the elemental composition of an analyzed sample. The maps show how individual atoms arrange themselves within the alloy, allowing researchers to look for patterns that could help them design alloys emphasizing individual properties.\nFor example, the maps could give researchers clues to understand why substituting one metal for another could make an alloy stronger or weaker, or why one metal outperforms others in extremely cold environments.\n\"Most alloys used in engineering applications have only one primary metal, such as iron in steel or nickel in nickel-based super alloys, with relatively small amounts of other metals,\" said Ting Zhu, a professor in the George W. Woodruff School of Mechanical Engineering at Georgia Tech. \"These new alloys that have relatively high concentrations of five or more metals open up the possibility of unconventional alloys that may have unprecedented properties. But this is a new compositional space that has not been explored, and we still have a very limited understanding of this class of materials.\"\nThe name \"high entropy\" refers to the lack of uniformity in the mixture of metals as well as how many different and somewhat random ways the atoms from the metals can be arranged as they are combined.\nThe new maps could help researchers determine whether there are any unconventional atomic structures that such alloys take that could be leveraged for engineering applications, and how much control researchers could have over the mixtures in order to \"tune\" them for specific traits, Zhu said.\nTo test the new imaging approach, the research team compared two high-entropy alloys containing five metals. One was a mixture of chromium, iron, cobalt, nickel, and manganese, a combination commonly referred to as a \"Cantor\" alloy. The other was similar but substituted palladium for the manganese. That one substitution resulted in much different behavior in how the atoms arranged themselves in the mixture.\n\"In the Cantor alloy, the distribution of all five elements is consistently random,\" Zhu said. \"But with the new alloy containing palladium, the elements show significant aggregations due to the much different atomic size of palladium atoms as well as their difference in electronegativity compared to the other elements.\"\nIn the new alloy with palladium, the mapping showed that palladium tended to form large clusters while cobalt seemed to collect in places where iron was in low concentrations.\nThose aggregations, with their sizes and spacings in the range of a few nanometers, provide strong deformation resistance and could explain the differences in mechanical properties from one high-entropy alloy to another. In straining tests, the alloy with palladium showed higher yield strength while keeping similar strain hardening and tensile ductility as the Cantor alloy.\n\"The atomic scale modulation of element distribution produces the fluctuation of lattice resistance, which strongly tunes dislocation behaviors,\" said Qian Yu, a coauthor of the paper and a professor in Zhejiang University. \"Such modulation occurs at a scale that is finer than precipitation hardening and is larger than that of traditional solid solution strengthening. And it provides understanding for the intrinsic character of high-entropy alloys.\"\nThe findings could enable researchers to custom design alloys in the future, leveraging one property or another.\n“We believe that this work is really important, as local chemical ordering in these extremely high profile, high-entropy alloys is critical to dictating their properties.” said Robert Ritchie, another coauthor and a professor at the University of California, Berkeley. ”Indeed, this presents a way to tailor these materials to attain optimal properties by atomic design.”\nThe team also included researchers from the University of Tennessee, Knoxville; Tsinghua University; and the Chinese Academy of Sciences.\nThis research was supported by the National Science Foundation through grant No. DMR-1810720, the Department of Energy through contract No. DE-AC02-05CH11231, the National Natural Science Foundation of China through grant No. B16042, and the State Key Program for Basic Research in China under grant No. 2015CB659300. The content reflects the views of the authors and does not necessarily represent the official views of the sponsoring agencies.\nCITATION : Qingqing Ding, Yin Zhang, Xiao Chen, Xiaoqian Fu, Dengke Chen, Sijing Chen, Lin Gu, Fei Wei, Hongbin Bei, Yanfei Gao, Minru Wen, Jixue Li, Ze Zhang, Ting Zhu, Robert Ritchie, and Qian Yu, \"Tuning Element Distribution, Structure and Properties by Composition in High-Entropy Alloys,\" ( Nature , October 2019).  http://dx.doi.org/ 10.1038/s41586-019-1617-1\nAdditional Images\nContact\nJohn Toon\nResearch News\nEmail\njohn.toon@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}