{"text": "Event Marks History While Embracing the Future | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nEvent Marks History While Embracing the Future\nEcoCommons space honors three young men who challenged racial segregation.\nFacebook\nTwitter\nEmail\nThe site, near the intersection of Hemphill Avenue and Ferst Drive, is part of the campus EcoCommons. Photo by Allison Carter.\nApr 21, 2021\n— Atlanta, GA\nGeorgia Tech students, administrators, and guests gathered yesterday to commemorate the transformation of a site once known as a haven for segregationists into an environmental restoration project now known as\nthe EcoCommons .\nThe site, near the intersection of Hemphill Avenue and Ferst Drive, is the former location of the Pickrick Restaurant, which opened in 1948 and was owned by segregationist Lester Maddox, who later became the governor of Georgia. After the passage of the Civil Rights Act In 1964, three Black theology students from the Interdenominational Theological Center — George Willis Jr., Woodrow Lewis, and Albert Dunn — attempted to be served at the restaurant on three occasions. Each time they were forced out by Maddox and white patrons wielding a handgun and pickaxe handles.\nThe students hired Black attorney Constance Baker Motley, who filed the first federal lawsuit under the Civil Rights Act. The court ordered Maddox to desegregate the Pickrick. Instead of complying, he closed the restaurant. Georgia Tech purchased the building when campus expanded and used it as a job placement center for many years. The building was razed in 2008.\nArchie W. Ervin, Georgia Tech’s vice president for Institute Diversity, Equity, and Inclusion, welcomed guests to the event.\n“Today, we want to commemorate, celebrate, and honor the bravery of three young men, whose courage allowed them to alter the course of history by challenging racial segregation in the Deep South, our beloved city of Atlanta, and in the state of Georgia,” he said. “Their acts of courage helped to pave the way for progress addressing some of the many challenges to Black equality in America, which allowed for an eventual path toward healing the hurt and harm perpetrated on Black Americans under racial segregation laws and practices.”\nKarcheik Sims-Alvarado, assistant professor of Africana studies at Morehouse College and a member of the committee that helped create the space, talked about the history behind the site, including the legal battle over desegregation. Matthew Wesley Williams, president of the Interdenominational Theological Center, spoke about the three students who participated in the sit-ins. And Jeanne Kerney, president of the Georgia Tech Black Alumni Organization, discussed Black student success at Georgia Tech.\nAndre Dickens, Atlanta city council member who also serves on the Georgia Tech Alumni Association board of trustees, spoke about the historical significance of the events that took place here.\n“It’s important to be able to put a marker down to say that something happened here that led to allowing people to gather together, integrated. I think this is the right thing to do, and this institution continues to get it right,” Dickens said. “Atlanta has always been at the height of the civil rights movement, and this place will be added to the legacy of Atlanta. We will make sure that people come see this place and know the story of what happened.”\nUndergraduates Kemuel Russell and Shelbe Johnson spoke on behalf of the Georgia Tech African American Student Union.\n“I hope that the evolution of this space, intended to inspire reflection and connection, is purposefully dedicated to the community that was previously harmed here years ago,” he said. “I also hope that Georgia Tech utilizes opportunities like this to remove barriers to success for minority students, in order to build a community where people of all backgrounds have the opportunity to learn and thrive.”\nJohnson noted that the African American Student Union was founded after the assassination of Martin Luther King Jr.\n“Today, we carry on the legacy of legends such as Dr. King and the seminary students honored here this afternoon,” she said. “We encourage you to join us in taking up the mantle, helping to ensure that their legacies live on.”\nGeorgia Tech President Ángel Cabrera was the closing speaker.\n\"This beautiful element of the EcoCommons that we officially open today will help us remember our past, the struggle for civil rights in our city and our nation, and will inspire us to build a better future. It celebrates three courageous students who put themselves at risk to tear down walls and create opportunity for all of us,\" he said. \"This garden, this unity garden, creates an opportunity for us to come together, to heal and to continue on our journey to build an inclusive community where everyone can thrive.\"\nAdditional Images\nRelated links\nVideo: Event Marks History\nGrand Opening of the EcoCommons\nContact\nVictor Rogers\nInstitute Communications\nEmail\nvictor.rogers@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}