{"text": "Navigational View of the Brain Thanks to Powerful X-Rays | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNavigational View of the Brain Thanks to Powerful X-Rays\nHow the brain computes can arguably be best studied on the \"meso\" scale, and new imaging makes brain tissue visible on that level.\nFacebook\nTwitter\nEmail\nA \"navigational map view\" of a section of a mouse brain. Like the map view of an Earth imaging program, this image of a brain section takes cues from actual imaging performed with highest-energy X-rays at a synchrotron and turns them into a graphic depiction. The imaging concentrates on a mesa-scale of the brain analogous to the map view of Google Earth. The scale could be useful in studying how the brain computes.\nOct 17, 2017\n— Atlanta, GA\nIf brain imaging could be compared to Google Earth, neuroscientists would already have a pretty good “satellite view” of the brain, and a great “street view” of neuron details. But navigating how the brain computes is arguably where the action is, and neuroscience’s “navigational map view” has been a bit meager.\nNow, a research team led by\nEva Dyer, a computational neuroscientist and electrical engineer , has imaged brains at that\nmap-like or “meso” scale using the most powerful X-ray beams in the country . The imaging scale gives an overview of the intercellular landscape of the brain at a level relevant to small neural networks, which are at the core of the brain’s\nability to compute .\nDyer, who recently joined the Georgia Institute of Technology and Emory University, also studies how the brain computes via its signaling networks, and this imaging technique could someday open new windows onto how they work.\nHighest-energy X-rays\nA powerful\nX-ray tomography scanner\nallowed the researchers to image particularly thick sections of the brains of mice, which afforded them views into intact neural areas much larger than are customary in microscope imaging. The scanner operated on the same basic principle as a hospital CT scanner, but this scan used high-energy X-ray photons generated in a synchrotron, a facility the size of dozens of football fields.\n“Argonne National Laboratory (ANL) generates the highest-energy X-ray beams in the country at its synchrotron,” said Dyer, who co-led the study with\nANL’s Bobby Kasthuri\nat\nthe Advanced Photon Source synchrotron . “They’ve studied all kinds of materials with really powerful X-rays. Then they got interested in studying the brain.”\nThe technique also revealed capillary grids interlacing brain tissues. They dominated the images, with cell bodies of brain cells evenly speckling capillaries like pebbles in a steel wool sponge.\n“Our brain cells are embedded in this sea of vasculature,” said Dyer, an assistant professor in the\nWallace H. Coulter Department of Biomedical Engineering at Georgia Tech and Emory .\nThe study on the new images\nappeared in the journal eNeuro on Tuesday, October 17, 2017 . The team included researchers from Johns Hopkins University, the University of Chicago, Northwestern University, the Argonne National Laboratory, and the University of Pennsylvania. The work was funded by the U.S. Department of Energy, the National Institutes of Health, the Intelligence Advanced Research Projects Activity, and the Defense Advanced Research Projects Agency.\nNeural forest for the trees\nElectron microscopy already captures neuronal details in impressive clarity. Functional magnetic resonance imaging (fMRI) makes great visuals of brain structures and broad neural signaling.\nSo, why do researchers even need mesoscale imaging?\n“FMRIs image at a high level, and with many microscopes, you’re zoomed in too far to recognize the forest for the trees,” Dyer said. “Though you can see a lot with them, you also can miss a lot.”\n“If you look at brain signaling on the level of individual neurons, it looks very mysterious, but if you take a step back and observe the activity of a population of hundreds of neurons instead, you might see simpler, clearer patterns that intuitively make more sense.”\nIn an earlier study, Dyer discovered that\nhand motion directions corresponded with reliable neural signaling patterns in the brain’s motor neocortex . The signals did not occur across single neurons or a few dozen but instead across groups of hundreds of neurons. Mesoscale imaging reveals a spatial view on that same order of hundreds of neurons.\nAlso READ: The Brain – Cosmos in the Cranium\nMegamap dreams\nThe researchers have also been able to couple their new meso-level imaging technique with extremely detailed electron microscopy. And that has the potential to take them closer to a kind of Google Earth for the brain by combining mesoscale or map-like views with zoomed-in or street-like views.\n“We have begun doing X-ray tomography on large brain tissues, then we’ve gone deeper into specific tiny regions of interest in the same tissue with an electron microscope to see the full connectome there,” Dyer said. The connectome refers to the total scheme of the hundreds of individual connections between neurons.\nThe researchers hope to someday be able to switch from a mesoscale view to close-up view, a bit like Google Earth.\nZeroing in then zooming in\n“I think what we’re going to need in neuroscience is this ability to traverse across different scales,” Dyer said. She envisions a future multi-scale imaging technology that is useful in understanding neurological diseases.\n“We want to be able to tell somebody researching a disease what the underlying anatomy of their lab sample is in an automated way,” she said. “You could navigate using this mesoscale view to get the context of where the damage is.”\nThen the user could zoom in on a\nblocked artery\nor destroyed tissue analogous to the way satellite imagery can zoom in on traffic jams to see what’s causing them.\nFrom X-ray to graphic image\nLike a navigational map, the final images in the study were colorful, clear, mesoscale graphic depictions. They were based on the\nX-ray tomography , but a lot was involved in getting from the X-ray to the image.\nFirst, the thick section of brain rotated in the high-energy X-ray beam, which was transformed into an image analogous to the output of a CT scanner. Then structures and characteristics were identified by humans and algorithms before they were computed into three-dimensional, color-coded vasculature and cell bodies.\nThe details of individual cells were very basic. In neurons, often the nuclei were visible in the X-ray tomography image, and axons wrapped in\nmyelin\n(white matter) sometimes appeared as well.\nPragmatic computation\nThe new mesoscale imaging of brain samples also has pragmatic advantages.\nIt may be possible to examine minuscule brain regions piece by piece with electron microscopes then compute them together into a complete image of the brain, but it’s hardly practical. “Producing a three-dimensional map of just a\ncubic millimeter of the brain\nwith an electron microscope requires processing\npetabyte s of data,” Dyer said.\nBy contrast, the researchers need 100 gigabytes of data to compute a one-cubic-millimeter image of brain tissue using mesoscale X-ray tomography scans of thicker brain sections. But the researchers’ goal is to not have to slice the tissue at all.\n“Eventually, we want to be able to image whole brains, as is, with this method to see the entirety of their neural networks and other structures.\"\nAlso read: Alzheimer’s: Killing the Mind First\nThis study was co-authored by William Gray Roncal and Joshua T. Vogelstein of Johns Hopkins University, Judy Prasad of the University of Chicago, Hugo L. Fernandes of Northwestern University; Doga Gürsoy, Vincent De Andrade, Kamel Fezzaa and Xianghui Xiao of Argonne National Laboratory; Chris Jacobsen of Argonne and Northwestern, and Konrad Körding of the University of Pennsylvania. Research was funded by the U.S. Department of Energy Office of Science User Facilities operated by Argonne National Laboratory (contract DE-AC02-06CG11357), the National Institute of Mental Health at the National Institutes of Health (grant U01MH109100), the Intelligence Advanced Research Projects Activity MICrONS project, the Defense Advanced Research Projects Agency SIMPLEX program (contract N66001-15-C-4041) and DARPA GRAPHS program (contract N66001-14-1-4028).\nWriter : Ben Brumfield\nAdditional Images\nContact\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : Ben Brumfield (404-660-1408)\nEmail\nben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}