{"text": "Ivan Allen Jr. Prize for Social Courage to be Awarded March 15 | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nIvan Allen Jr. Prize for Social Courage to be Awarded March 15\nDr. Anthony S. Fauci will be awarded Georgia Tech's Ivan Allen Jr. Prize for Social Courage.\nFacebook\nTwitter\nEmail\nDr. Anthony S. Fauci (top), with (L-R): Dr. Rochelle Walensky, Pinar Keskinocak, Joshua Weitz, Dr. Carlos del Rio, and Ann W. Cramer.\nMar 10, 2021\n— Atlanta, GA\nGeorgia Tech’s Ivan Allen Jr. Prize for Social Courage — the Institute’s premier award — will be presented to Dr. Anthony Fauci on Monday, March 15, at 3 p.m. and livestreamed at\nivanallenprize.gatech.edu . The annual award honors individuals who have stood up for moral principles at the risk of their careers, livelihoods, and even their lives.\nPrevious honorees include the late Rep. John Lewis; Dr. William Foege, who led the strategy to eliminate smallpox; African civil rights advocate Beatrice Mtetwa; United Nations Ambassador Andrew Young; activist Nancy Parrish; former U.S. President Jimmy Carter and first lady Rosalynn Carter; Dr. Hamilton E. Holmes and Charlayne Hunter-Gault, the first Black students enrolled at the University of Georgia; and former Georgia Senator Sam Nunn.\nDr. Fauci, director of the National Institute of Allergy and Infectious Diseases, has been at the forefront of the fight against Covid-19, one of the most significant public health challenges in a century. He became a household name as he sought to deliver information, in the face of public criticism from skeptics and the Trump administration, about how best to protect each other from the highly transmissible virus that causes Covid-19.\nGeorgia Tech President Ángel Cabrera will present the award. Dr. Fauci and Dr. Rochelle Walensky, director of the Centers for Disease Control and Prevention (CDC), will make remarks.\nThe virtual presentation will be followed by an in-person panel discussion on lessons learned from the pandemic, preparing for the next pandemic, and social courage. Panelists are Dr. Carlos del Rio, Distinguished Professor of Medicine in the Division of Infectious Diseases at Emory University School of Medicine and executive associate dean for Emory at Grady Health System; Pinar Keskinocak, William W. George Chair and professor in the H. Milton Stewart School of Industrial and Systems Engineering at Georgia Tech; and Joshua Weitz, Patton Professor and director of the Interdisciplinary Ph.D. in Quantitative Biosciences at Georgia Tech. Ann W. Cramer, senior consultant with Coxe Curry and Associates, will serve as moderator.\nThe Ivan Allen Jr. Prize for Social Courage is named for former Atlanta Mayor Ivan Allen Jr., a graduate of Georgia Tech, who at great personal and political risk was the only southern white elected official to testify before Congress in support of the Civil Rights Act of 1964.\nKaye Husbands Fealing, dean of Georgia Tech’s Ivan Allen College of Liberal Arts, said, “Our College was founded on Ivan Allen Jr.’s legacy of transformative urban leadership and socially and ethically conscious action. We take pride in those values, which continue to be integral in our teaching, research, and public engagement. I look forward to hearing from Dr. Fauci and each of the panelists on how their work exemplifies social courage for the good of others.”\nWatch the livestream at\nivanallenprize.gatech.edu .\nAsk questions prior to the event by emailing\nevents@comm.gatech.edu.\nFor inquiries regarding the event, please contact Stephanie Sigler at\ns.sigler@gatech.edu.\nAdditional Images\nContact\nVictor Rogers\nInstitute Communications\nEmail\nvictor.rogers@comm.gatech.edu\nAdditional information\nGeorgia Tech’s Fight Against Covid-19\nOne year ago this month the global coronavirus outbreak reached the U.S. — and Georgia Tech’s campus. Over a two-week period the Institute converted classes, programs, and services to remote delivery. That was only the beginning of Tech’s efforts to combat the pandemic. Below is a snapshot of work done across campus and in collaboration with public health officials in the fight against Covid-19.\nLast summer Georgia Tech launched an\nasymptomatic surveillance testing program\nto aid in returning safely to campus safely in Fall 2020. To date more than 250,000 samples have been tested, keeping the rate of\npositive results relatively low on campus .\nThe Institute collaborated with the CDC to develop Covid-19 information dashboards, including one made\navailable to the public .\nResearchers developed a\ncounty-level risk exposure tool\nas part of an interactive dashboard that estimates Covid-19 incidence at gatherings in the U.S.\nTech researchers are working with Emory University and the National Institutes of Health on the Rapid Acceleration of Diagnostics (RADx) initiative\nto develop better testing for Covid-19 . The campus community is now providing samples for this study on campus at the Couch Building testing site.\nGeorgia Tech also recently began collecting samples for serological antibody testing in campus community.\nFor more on Georgia Tech’s response to Covid-19, see Helping Stories at\nhelpingstories.gatech.edu .\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}