{"text": "Nationwide Wave of Change Coming to Role of College and University Presidents | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNationwide Wave of Change Coming to Role of College and University Presidents\nThe role and expectations of the college president are undergoing substantial change, according to a new report.\nFacebook\nTwitter\nEmail\nThe \"Pathways to the University Presidency: The Future of Higher Education Leadership\" explores varying pathways of college presidents. Study by Deloitte’s Center for Higher Education Excellence and Georgia Tech’s Center for 21st Century Universities\nApr 19, 2017\n— Atlanta, GA\nAs higher education faces demographic and financial challenges in the decade ahead, the role and expectations of the college president are also undergoing substantial change, according to a new report by Deloitte’s Center for Higher Education Excellence and Georgia Tech’s\nCenter for 21st Century Universities . The report, “ Pathways to the University Presidency: The Future of Higher Education Leadership ,” identified several key takeaways:\nVaried Pathways:\nWhile the provost’s office has long been the most frequent stopover point on the way to the presidency, academic deans are increasingly moving right to the top job and bypassing the provost’s office altogether.\nA New Role for the Provost:\nThe provost is no longer simply regarded as the No. 2 person on campus. Rather, today’s provosts often have a set of skills that complement the president, rather than replicate them.\nPresident as Fundraiser-In-Chief:\nFundraising is essential from a president’s first day in office, according to the survey, and only grows in importance over time in the position. Despite the attention given to this issue over the past several years, preparing presidents to cultivate donors hasn’t improved much, if at all.\nA Need for Formal Leadership Development:\nInvestments in leadership often lag behind its importance to presidents. While nearly two-thirds of presidents said they had coaches or mentors to help them “prepare” for the role, only one-third of leaders indicated in the survey that they still receive coaching to “succeed” in the job.\nEmphasis on Short-Term Wins at the Cost of Long-Term Planning:\nThere is increasing pressure on presidents to look for quick wins. As a result, many are looking for the proverbial “low-hanging fruit” on their campuses where they can show fast results, not only for their own boards but also search committees for their next job.\n“There is increasing pressure for presidents to learn on the job and find quick wins,” said Jeffrey J. Selingo, a visiting scholar at Georgia Tech’s Center for 21 st\nCentury Universities and one of the authors of the report. “Unless higher education creates more deliberate training programs for future leaders and helps align short-term tactics and long-term strategies, we’re likely to face a leadership crisis in the coming years.”\nThe report was compiled after a 10-month study that included the first-of-its-kind data mining of more than 800 curricula vitae (CVs) of sitting presidents of four-year institutions, in addition to an extensive survey of 150 presidents.\nThe report also highlights five ways college and university governing boards and stakeholder groups can improve the pipeline to their institution’s presidency:\nDevelop intentional training and leadership development opportunities aimed at prospective college presidents.\nAlign short-term tactics and long-term strategies.\nPromote better understanding of the role of presidents among search committees and a transition team to onboard the president.\nEmbrace a willingness to look beyond traditional backgrounds.\nBuild relationships with various stakeholders both on and off campus.\n“Now is the time for colleges and universities to prepare for an upcoming wave of retirements,” said Cole Clark, executive director, higher education, Deloitte Consulting LLP and national director of higher education client relations. “Today’s and tomorrow’s colleges and universities need presidents with an even more diverse set of leadership skills and experience. Financial acumen, planning and fundraising are just a few areas of specialization necessary to effectively lead a college or university.”\nThe report methodology included three different aspects:\nData mining:\nCV analysis in which data was collected on 840 presidents, gleaned from publicly available information on institutional websites and through other sources, such as professional networking sites.\nSurvey:\nA survey sent via email to 1,031 presidents of four-year colleges and universities (16 percent response rate).\nStructured interviews:\nMore than 24 in-depth interviews with current presidents and board of trustee members were conducted.\n“The data mining aspect of this report is unique as we were able to uncover trends in how the traditional pathway to the college and university presidency is changing,” said Sonny Cheng, principal, Deloitte Consulting LLP and human capital leader, higher education. “While the provost’s office remains the most common launching pad for presidencies, there is evidence that many provosts no longer aspire to the top job, nor in some instances have the broad set of skills necessary for the changing demands of the president’s role.”\nAdditional Images\nRelated links\nRead the Study\nCenter for 21st Century Universities\nContact\nJason Maderer\nNational Media Relations\nmaderer@gatech.edu\n404-660-2926\nEmail\nmaderer@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}