{"text": "Q&A on Information Technology With Daren Hubbard | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nQ&A on Information Technology With Daren Hubbard\nDaren Hubbard talks about the role of IT at a research university.\nFacebook\nTwitter\nEmail\nDaren Hubbard is Tech's CIO and vice president for Information Technology. (Photo by Allison Carter)\nOct 22, 2020\n— Atlanta, GA\nDaren Hubbard is Georgia Tech’s new chief information officer (CIO) and vice president for Information Technology. He came from Wayne State University, where he was the CIO and associate vice president for Computing and Information.\nAt Tech Hubbard provides vision, leadership, and oversight in the development and implementation of information technology. He also is a member of the Institute’s Recovery Task Force and he was recently asked to direct all Covid-19-related infrastructure and technology activities.\nAt his office in the Coda Building, Hubbard recently sat for a conversation that ranged from how he views the role of IT at a research university to his love of Corvettes, novelty socks, and donuts.\nWhat attracted you to Georgia Tech?\nThe reputation of the institution, at a national and international level, is attractive in and of itself. It’s the kind of place where you want to take your career.\nThe whole interview process really got me excited about the opportunity. Knowing where you're going to be working and who you’re going to be working with is more important to me than some of the other environmental aspects. After talking to Kelly Fox [executive vice president for Administration and Finance] and to President Cabrera — I don’t think there’s anybody who can talk to President Cabrera and not get excited about Georgia Tech — and meeting everyone else on the search committee virtually, it was a done deal.\nI also had the benefit of visiting Atlanta probably every summer for the last 25 years. I have friends here, and my godsons attended Centennial Place Elementary School. I remember Atlantic Station being built, and I had a membership to the Georgia Aquarium prior to moving here. No one had to sell me on Atlanta. Also, you can’t ask anybody from the state of Michigan if they are sad about leaving the Michigan winters.\nYou have only been at Georgia Tech for about five weeks. Is it what you expected, or is it different?\nAny early takeaways regarding opportunities or challenges?\nI have reflected on this a lot. It is both new and strangely familiar. Some of the problems may be a little different in a scale, obviously, but challenges at Georgia Tech are the same as at Wayne State — really trying to align the mission of the institution with the conditions on the ground. People have many competing ideas about how to do things. Resources may not necessarily be distributed equitably, leaving our team working to balance that out.\nThe early takeaways are the consistent themes that have really forged my career. I have been doing this type of work for more than 20 years. During that time, I have developed a personal set of core values that work really well, and I am able to apply them over and over again.\nAt Georgia Tech I am trying to build great partnerships across campus. We are coming to the table to support you, not necessarily to create something that’s just cool and has a wow factor. It’s about creating an excellent experience. I think that applies to everyone on the campus, entire communities of students, faculty, and staff — making sure that the work they need to do is as effortless as possible.\nI want to make sure we have a great work environment for our team. If you feel good about what you’re doing, it shows in your work and enables you to create an excellent experience for the people you support.\nThe last thing we do is to really focus on continuous improvement. Make sure that people don’t see the same problem again, and try to make the experience better the next time. We want to make sure that people have the tools to do what they do.\nYou started at Tech during the coronavirus pandemic\n—\nwhen the majority of students, faculty, and staff were working remotely and depending on Tech’s technology infrastructure to stay connected. How was that experience?\nOur ability to transition from having a fully on-campus experience to a remote experience didn’t happen the day the pandemic started. Those are investments that were made over time. It was the good work of people in this division and across campus, making those choices, investing in tools, and really getting folks up to speed before the pandemic. We didn’t know everyone was going to have to work from home. But we did know that some people would need to be able to collaborate and have meetings in a remote fashion, so we were building the infrastructure just in case. Tech is now seeing the dividends of investments made three or four years ago. We have to continue to make investments and strategically select tools that are going to be here today and hopefully here for us tomorrow.\nOne thing that we’re going to see coming out of this pandemic is that our workforce may not need to be physically here in Atlanta. That means we can compete with either coast or globally for the best talent. It presents a new opportunity for universities.\nIT is often seen as a support function. How do you view IT?\nI don’t believe it’s necessarily a bad thing to be a support function. For example, this building has big pillars that support the floors. They have to be here or the building will fall. However, another way to view IT is as a facilitator of some of the innovation that’s coming from the subject matter experts who we are fortunate to work with. IT always has the opportunity to help people accelerate what they’re doing at its core. That is what all this stuff is intended to do — to enable people to be more productive, creative, and innovative. As long as we have an opportunity to be a partner with folks, to listen to what they want to do and what they can do, we can bring all the different tools and capabilities we have to the table.\nWhat keeps you awake at night?\nThere is always a — and it’s not even existential anymore — real and present danger surrounding data security of the intellectual property assets that a place like Georgia Tech generates on a daily basis. I wrote a paper in graduate school about how the very nature of universities makes them a target for bad guys. If you are looking to steal something, you want something new. Universities literally create new ideas and opportunities every day. That data has a high value, and it’s part of our job to help facilitate the protection of those assets. But, in general, the thing that keeps me up at night is the question of whether we are doing enough. Are we communicating well enough? Are we creating a culture that enables people to collaborate.\nWhat do you enjoy doing when you’re not working?\nBeing from Detroit, I grew up following the auto industry the way some people follow sports. So, there’s an automotive enthusiast lurking inside of me. I drive a practical car now, but right before I moved down here I sold my 2017 Corvette Stingray. While it was fun, that car is not just a car. It’s a whole lifestyle.\nI did a little photography in high school and college, and I recently started getting back into it, mainly photographing cars and buildings. I had initially gone to college to become an architect. I still love buildings and studying the use of space, but now I just photograph them.\nTell me something that most people don’t know about you.\nI have been collecting and wearing novelty socks for 30 years. I have all kinds, for every occasion. Yesterday was ‘Taco Tuesday’ so I wore my taco socks.\nIt began in college. I wanted to express myself beyond wearing the standard ‘preppy’ clothes. I bought a pair of fun socks, and I started saving them for a special occasion. But once you start saving something it becomes this mythical thing, so you can’t just pull them out and wear them any time. About three years after I bought the socks I still had not worn them. Then I met someone and had a date planned for the weekend. I told my friends I was excited about the date, and they asked if I thought she was worthy of my socks. I said yes. I wore my special socks, and the date was great. My date, Tanya, later became my wife. We just celebrated our 25th wedding anniversary in August.\nAnother thing most people don’t know is that I really love donuts. But donuts don’t love me, so I have constructed a framework for how I can enjoy them. I call it Oktoberfest because my birthday is Oct. 3. So, for the month of October I eat as many donuts as I want, but I don’t eat them the rest of the year. Last weekend I went to Revolution Donuts, and I also like Sublime Donuts. I want to live as long as I can, so this framework allows me to enjoy donuts while minimizing the health risk.\nAdditional Images\nContact\nVictor Rogers\nInstitute Communications\nEmail\nvictor.rogers@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}