{"text": "Georgia Tech Will Help Manage DOE’s Savannah River Laboratory | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Will Help Manage DOE’s Savannah River Laboratory\nGeorgia Tech is part of a team that has been selected to manage the DOE's Savannah River National Laboratory\nFacebook\nTwitter\nEmail\nGeorgia Tech is part of a team that has been selected to manage the Savannah River National Laboratory (SRNL).\nDec 28, 2020\n— Atlanta, GA\nThe Battelle Savannah River Alliance (BRSA) – which includes Georgia Tech – has been selected by the Department of Energy to manage one of the country’s premier environmental, energy, and national security research facilities—the Savannah River National Laboratory (SRNL).\nEmploying approximately 1,000 staff, SRNL conducts research and development for diverse federal agencies, providing practical, cost-effective solutions for the nation’s environmental, nuclear security, energy, and manufacturing challenges. As the U.S. Department of Energy’s (DOE’s) Environmental Management Laboratory, SRNL provides strategic scientific and technological support for the nation’s $6 billion per year waste clean-up program.\nAs part of the BRSA, Georgia Tech will help manage the SRNL and guide the future growth of the lab’s core competencies while expanding collaboration with Tech’s $1 billion-per-year research program. The laboratory is located near Aiken, S.C., across the Savannah River from Augusta and Richmond County.\n“We are pleased to support the national interests of the Department of Energy and the impact that the SRNL has on the Augusta area,” said Ángel Cabrera, Georgia Tech’s president. “We look forward to expanding our collaborations with the Savannah River National Laboratory, other members of the Battelle Savannah River Alliance, and the Department of Energy.”\nBSRA is led by and wholly owned by Battelle, one of DOE’s leading laboratory management contractors. The BSRA Team includes five universities from the region—Clemson University, Georgia Institute of Technology, South Carolina State University, University of Georgia, and University of South Carolina—as well as small business partners, Longenecker & Associates and TechSource.\n“Our collaboration with the Battelle Savannah River Alliance and the Savannah River National Laboratory will provide new opportunities for our faculty and students in unique areas of research and education,” said Chaouki Abdallah, Georgia Tech’s executive vice president for research.\nThe contract includes a five-year base with five one-year options. The estimated value of the contract is $3.8 billion over the course of 10 years if all options are exercised.\n“We are honored by DOE’s decision to award the Savannah River National Laboratory management and operations contract to our team,” said Battelle President and CEO Lou Von Thaer. “We have the lab management experience to make a difference and we’re committed to ensuring the success of this important national resource.”\n“We’re honored and excited to have this opportunity,” said Ron Townsend, Battelle’s Executive Vice President for Global Laboratory Operations. “BSRA’s approach will ensure the delivery of high-impact science, technology and engineering solutions into the future through a significant expansion of SRNL’s core competencies. Our team offers an exciting, compelling vision for the future of SRNL and provides DOE a leadership team that will deliver with excellence.”\nBattelle currently has a management role at seven DOE national labs including Pacific Northwest National Lab, Brookhaven National Lab, Oak Ridge National Lab, National Renewable Energy Lab, Idaho National Lab, Los Alamos National Lab and Lawrence Livermore National Lab. It also operates the National Biodefense Analysis and Countermeasures Center for the Department of Homeland Security.\nAdditional Images\nContact\nJohn Toon\nResearch News\n404-894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}