{"text": "Study Probes Gender Pay Gaps in U.S. Federal Science Agencies | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nStudy Probes Gender Pay Gaps in U.S. Federal Science Agencies\nThe researchers, including Kaye Husbands Fealing, set out to understand the reasons behind gender pay gaps at U.S. federal science agencies.\nFacebook\nTwitter\nEmail\nKaye Husbands Fealing\nOct 23, 2019\n— Atlanta, GA\nBy Michael Pearson\nMen make more than women at seven U.S. federal science agencies, but the reasons for these gender-based pay gaps differ by organization, according to new research involving Kaye Husbands Fealing of the Georgia Institute of Technology’s School of Public Policy.\nHusbands Fealing , chair and professor in the School of Public Policy, and researchers from the University of Massachusetts Amherst, University of Toronto and University of Minnesota analyzed 15 years of federal employment data from 1994 to 2008 for seven U.S. science-based agencies: the National Oceanic and Atmospheric Administration (NOAA), the National Institutes of Health (NIH), the Department of Agriculture (USDA), the National Science Foundation (NSF), the Centers for Disease Control and Prevention (CDC), the Environmental Protection Agency (EPA), and the Department of Energy (DOE).\nThe researchers found that the pay gaps at organizations such as NOAA and the DOE—agencies focused on traditionally masculine fields such as engineering and physical sciences—were largely the result of men being paid more than women for the same jobs.\nAt more gender-neutral agencies—those focused on life sciences and interdisciplinary sciences—the differences were due to agencies systematically hiring more women than men for low-paying jobs, according to the researchers. The result, they said, is “persistent pay stratification in organizations that otherwise embrace practices intended to increase equity.” The NIH, CDC, EPA, NSF and USDA fell into this category.\n“When the findings of this study are shared with members of the scientific community, there is typically surprise that measurable disparities in earnings are persistent between women and men even at federal agencies that use the General Schedule,” said Husbands Fealing, referring to the standardized pay schedule for most federal jobs. “Our study shines a bright light on the persistence of earnings disparities between women and men, even when there is an appearance that the Federal system is designed to avoid these pay gaps.”\nAccording to the research, the overall gender gap fell between 1994 and 2008, apparently as a result of federal hiring practices. Significant disparities remained, however. In 1994, women earned on average 73 cents for every dollar earned by a man at agencies with a masculine focus and 77 cents for every dollar at the other agencies. The data show the gap closed by 2008, with women earning 83 cents per dollar earned by men at life sciences agencies and 90 cents per dollar at interdisciplinary agencies.\nResearchers said the strong pay gap in male-oriented agencies was the result of substantial numbers of employees being paid outside of the General Schedule system in a classification more often held by men than women.\nThe explanations for pay gaps also varied widely among agencies. For instance, hiring women more often into lower-paying jobs accounted for about 84% of the gender pay gap at the NSF but 47% at NOAA. Meanwhile, practices that led to men being paid more than women for the same job accounted for less than 9% of the pay gap at the NSF, but about 33% at the USDA.\nOrganizational culture plays a strong role in perpetuating such pay gaps, said Laurel Smith-Doerr of the University of Massachusetts Amherst, lead author of the research co-authored with Husbands Fealing; Sharla Alegria, an assistant professor of sociology at the University of Toronto; Debra Fitzpatrick, co-director of the University of Minnesota Center on Women, Gender and Public Policy; and Donald Tomaskovic-Devey, professor of sociology and director of the Center for Employment Equity at UMass Amherst.\n“It is very easy for us in the U.S. to think in terms of individuals and to think about people making decisions, but actually it is really important to look at how organizations make decisions, and a lot of times that’s less visible to us,” Smith-Doerr said. “Therefore, you need to have this kind of population-level data and statistical analyses in order to be able to see these trends, and that’s what we have here.”\nThe paper, “ Gender Pay Gaps in U.S. Federal Science Agencies: An Organizational Approach ,” is published in the September edition of the American Journal of Sociology.\nThe\nSchool of Public Policy\nis a unit of the\nIvan Allen College of Liberal Arts .\nAdditional Images\nContact\nMichael Pearson\nmichael.pearson@iac.gatech.edu\n404.894.2290\nEmail\nmichael.pearson@iac.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}