{"text": "Durability Vs. Recyclability: Dueling Goals in Making Electronics More Sustainable | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nDurability Vs. Recyclability: Dueling Goals in Making Electronics More Sustainable\nResearch released by a team at Georgia Institute of Technology looked into the impact of government policies put in place to reduce the amount of electronics waste filling up landfills.\nFacebook\nTwitter\nEmail\nAtalay Atasu, a professor at the Scheller College of Business\nApr 15, 2019\n— Atlanta, GA\nThe falling cost of solar power has led to a boom in recent years, with more and more photovoltaic panels popping up on rooftops and backyard solar farms around the world.\nBut what happens to all of those solar panels in a couple of decades when they reach the end of their useful life? And what about electronic devices with even shorter life spans?\nThose questions are at the heart of new research released by a team at Georgia Institute of Technology, where researchers looked into the impact of government policies put in place to reduce the amount of electronics waste filling up landfills.\n“There is a lot of concern in sustainability circles that manufacturers are making things with shorter and shorter life spans, and products are perhaps even intentionally made to become obsolete to induce replacement purchases,” said Beril Toktay, a professor at Georgia Tech’s Scheller College of Business.\nThe study, which was published April 4 in the journal\nManagement Science , focused on government policies used to encourage electronics makers to put more thought into what happens at the end of the product life cycle. Those programs, which are called extended producer responsibility (EPR) laws and are already in use in some states, have two common objectives: to have producers design their products to be easier to recycle or to boost their durability for increased device life span.\nHowever, the researchers reported that those goals are often at odds.\n“What we have found is that sometimes when you design for recyclability, you give up on durability, and when durability is the goal, recyclability is sacrificed,” Toktay said.\nIn theory, a product that is both easy to recycle and more durable would be the pinnacle of environmentally responsible product design. The researchers pointed to automobiles with thicker metal frames that last longer and also have more recyclable materials. In such a scenario, EPR policies emphasizing durability and recyclability work hand in hand.\n“Sometimes simple choices that product designers make, such as using glue or fasteners to put together a device, really impact recyclability at the end of life,” said Natalie Huang, a former graduate student at Georgia Tech and now an assistant professor at the University of Minnesota.\nMore often than not, however, there is no such synergy. In the case of photovoltaic panels, the researchers highlighted how thin-film panels are much more cost effective to recycle than other panels because they contain precious metals. Meanwhile, crystalline silicon panels, which aren’t as cost effective to recycle, have much longer life spans because their components degrade much more slowly.\n“These kinds of trade-offs are common, and so from a policy-making perspective, there’s not a one-size-fits-all approach that will work,” said Atalay Atasu, a professor at the Scheller College of Business. “You really have to distinguish between different product categories to consider the recyclability and the durability implications and make sure that your policy isn’t conflicting with the objective.”\nThe researchers said that in some cases, EPR policies could actually lead to increased waste generation if product designers make products more recyclable but less durable, or lead to increased greenhouse gas emissions if products are made more durable but less recyclable.\nTo help determine how government policies could impact individual products, the researchers built a mathematical model to help predict the impact those policies would have on products based on their materials and design characteristics. Among the factors the model takes into account are the base production cost of the product, the degree of difficulty in increasing recyclability and durability, the degree of interaction between recyclability and durability in the product design, and the recycling properties of the product.\n“Ultimately what we’re after is to find a way to do scenario analyses to determine what would be the best policy for different product categories,” Toktay said. “Fifteen to 20 years from now, a lot of panels are going to be coming off of roofs. Are they being designed with the end of life in mind and with consideration of what’s the best way to reduce the impact of producing those panels?”\nCITATION : Ximin (Natalie) Huang, Atalay Atasu and L. Beril Toktay, “Design Implications of Extended Producer Responsibility for Durable Products,” (Management Science, April 2019). http://dx.doi.org/10.1287/mnsc.2018.3072\nAdditional Images\nContact\nJosh Brown, Research News, (404) 385-0500\nEmail\njosh.brown@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}