{"text": "Georgia Tech Diversity, Equity, and Inclusion Council Gets To Work | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Diversity, Equity, and Inclusion Council Gets To Work\nThe Georgia Tech Diversity, Equity, and Inclusion Council has launched three working groups comprised of Council members and issue-area experts from across the campus.\nFacebook\nTwitter\nEmail\nThe Georgia Tech Diversity, Equity, and Inclusion Council is made up of over 50 faculty, staff, and students.\nMar 03, 2021\n— Atlanta, GA\nLast November, more than 50 Institute faculty, staff, and students gathered for the initial meeting of the Georgia Tech Diversity, Equity, and Inclusion Council (GTDEIC). The campus representatives were appointed by President Ángel Cabrera, and the group was tasked with monitoring and assessing the Institute’s progress toward becoming a model campus community for diversity, equity, and inclusion (DEI). In the months ahead, it will also submit recommendations to Cabrera and the Institute’s executive leadership team for consideration in developing strategic actions.\nEnhancing diversity has been one of Cabrera’s top priorities. “Our Diversity and Inclusion Council is one of several action steps announced this past summer to deliver on our promise of inclusion,”\nCabrera said in 2020 . “As outlined in our  new strategic plan , we are striving to remove barriers to access and success, and to build an inclusive community where people of all backgrounds have the opportunity to learn and contribute to our mission.”\nSince that initial November meeting, the GTDEIC has launched three working groups comprised of Council members and issue-area experts from across the campus: Diversity, Equity, and Inclusion Plan; Campus Climate Assessment; and Covid-19 Impacts on Faculty.\n“A diverse and inclusive campus is an empowered and engaged campus,” said Archie Ervin, vice president for\nInstitute Diversity, Equity, and Inclusion\nand GTDEIC chair. “A focus on diversity helps improve productivity, recruitment, and retention. Through these working groups, we will address immediate areas for DEI improvement.”\nPearl Alexander, executive director of Staff Diversity, Inclusion, and Engagement and GTDEIC vice chair, added, “One of our groups is crafting a comprehensive DEI plan that will be a blueprint with actionable strategies for implementation within the next five years. Another is redesigning our climate assessment to align with Institute goals for culture transformation, while the third is addressing the impacts of Covid-19 on women faculty and faculty of color. Each working group’s co-leads are working methodically and inclusively to identify strategies that will close gaps and deliver the greatest DEI impact possible. There will be many opportunities for leading, modeling, and living our values to make significant and lasting change.”\nThe Working Groups\nThe Diversity, Equity, and Inclusion Plan Working Group is developing a blueprint that mobilizes the DEI-related objectives of the new strategic plan, which include: amplify our impact, champion innovation, connect globally, expand access, cultivate well-being, and lead by example. The group will work across three focus areas: creating an inclusive and equitable community; recruiting, retaining, and developing a diverse community of students, faculty, and staff; and supporting innovative and inclusive scholarship and teaching. The final draft of the blueprint will be submitted to Cabrera for review by the beginning of June. The group’s efforts will be supported by\nGeorgia Tech Strategic Consulting\n(GTSC).\n“Diversity today unlocks innovation tomorrow and creates unlimited opportunities for our students, faculty, and staff,” said Rashaad Owens Sr., GTSC consultant. “I believe Georgia Tech is poised for a brighter future with its renewed commitment to diversity, equity, and inclusion in the new strategic plan.”\nThe Campus Climate Assessment Working Group will be led by Keona Lewis, associate director of Institute Diversity Research, and Joseph Ludlum, assistant director for Academic Effectiveness.\n“One of the most enlightening tools we have for identifying racial and gender disparities is our campus climate survey,” Lewis said. Originally developed between 2011 and 2013, the survey has provided valuable information on individual and community experiences and their impact on people’s sense of belonging at Tech. “Over the past eight years, we have used what we have learned to address issues such as racial discrimination and bias and the lack of opportunities for the professional development of women staff — and launching Leading Women@Tech, the Inclusive Leader's Academy, and workshops to address bias in hiring promotion retention.”\nThe group’s goal is to create new research questions to capture data needed to measure the strategic plan’s DEI goals as well as the impact of current initiatives and programming. The Campus Climate Assessment group has formed three sub-teams for survey revisions: faculty, staff, and students. “This will allow us to measure our progress on achieving many of the new DEI objectives in the strategic plan through an exploration of the lived experiences of the Georgia Tech community,” Lewis said.\nThere are many reasons to be concerned about the short-and long-term impacts of Covid-19 on the well-being and advancement of faculty. “Data strongly suggest that the pandemic might exacerbate existing structural inequities in academia, as the burden of caregiving, differential access to resources, and mental health challenges exact a higher toll on women and underrepresented minority groups,” said Dana Randall, ADVANCE Professor for the College of Computing. “For this reason, the\nADVANCE Professors\nformed this working group to develop a systemic approach to mitigating the impacts of the pandemic on the well-being and career progression of women faculty at Tech.”\n“The overarching themes and outcomes we expect from a working group are twofold,” Kim Cobb, ADVANCE Professor for the College of Sciences, added. “First, our effort will aim to prevent the impending loss of women and underrepresented minority faculty from Georgia Tech, either through recruitment elsewhere, negative tenure or promotion outcomes, or by choice due to dissatisfaction with current working conditions and opportunities for advancement. Second, we will aim to improve the well-being and support for those faculty most negatively affected.”\nThe Covid-19 Impacts on Faculty Working Group will be co-chaired by an ADVANCE Professor and another member of the GTDEIC, with approximately 10 additional tenure-track faculty members. Specific areas the group plans to tackle include: campus climate and workplace satisfaction, promotion and tenure, retention, and the coordination of research and activities around Covid-19 and its impact on faculty.\n“Establishing the GTDEIC represents the Institute’s commitment to engage all sectors of the Tech community,” Ervin said. “By identifying opportunities to achieve our aspirations for an inclusive community, and by demonstrating our value to be a community that thrives on diversity as a critical element of campus culture and climate, we are doing just that.”\nAdditional Images\nContact\nCourtney Hill\nCommunications Manager\nInstitute Diversity, Equity, and Inclusion\ncourtney.hill@gatech.edu\nEmail\ncourtney.hill@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}