{"text": "What is New @ GT in Packaging? Ultra-thin Dry Film Polymer Materials and Processes for High Density 2.5D and Fanout Packages | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nWhat is New @ GT in Packaging? Ultra-thin Dry Film Polymer Materials and Processes for High Density 2.5D and Fanout Packages\nGeorgia Tech and its industry partners are developing the next generation of ultra-thin polymers to form 20-40µm pitch RDL for 2.5D and fan-out packages.\nFacebook\nTwitter\nEmail\nDec 01, 2016\n— Atlanta, GA\nGeorgia Tech and its industry partners are developing the next generation of ultra-thin polymers to form 20-40µm pitch RDL for 2.5D and fan-out packages.\nAdvanced polymer materials are the key to high density packaging by enabling ultra-small vias and wiring layers to achieve 50 ohm impedance RDL wiring layers.\nTraditional polymer dielectrics are thicker films (>20µm) and thus are unsuitable to RDL wiring layers at fine pitch and at 50 ohm impedance. Although liquid spin-on polymers such as Polyimide and PBO have been used widely in wafer level packaging, such materials are difficult to apply as thin dry films on large panels.\nIn contrast to these materials, Georgia Tech and its industry partners have been developing ultra-thin (3-10µm) dry film polymer materials and associated RDL via and line formation processes. Ultra-thin polymer dry films provide added benefits of better thickness control, improved planarization on underlying copper, large panel processing, and environmental friendliness. The Georgia Tech program involves a number of material partners in photo-sensitive from TOK Japan, dry film BCB from Dow Chemical, as well as non-photo dry film dielectrics from Ajinomoto Japan. The Georgia Tech programs that benefit from these polymer dielctrics include all digital applications using glass, advanced laminates and ceramic substrates.\nThe Georgia Tech team has demonstrated wafer and panel substrates with 2µm lines and spaces by advanced semi-additive processes (SAP) using 7µm thin dry film photo resists and projection lithography tool provided by Ushio Japan. Wafer and panel metallization was performed using a 300 mm panel plating line at Georgia Tech installed by Atotech, Germany. Various approaches are being investigated to demonstrate ultra-small micro-vias below 10µm including solid state UV laser, using a CornerStone™ system installed at Georgia Tech by ESI, excimer laser ablation supported by Suss Photonic Systems, photo lithography processes with advanced dry films provided by TOK Japan, Dow Chemical and other partners. By combining these materials and processes, multi-layer structures with 10µm vias and 2.5µm lines and spaces were successfully demonstrated to fabricate a 2.5D logic-HBM emulator designed with guidance from IBM/GlobalFoundries, AMD, Intel and others (top figure).\nTo address the limitations of SAP processes in pitch scaling,a novel via-in-trench (VIT) and via-in-line (VIL) embedded trench+via methods have been invented and demonstrated to achieve ultra-small liness and vias on large panels. Advantages of the embedded approach are the elimination of seed etching processes and the formation of conductive wires with higher aspect ratios for better electrical conductivity. Two different approaches are studied in the Georgia Tech program; excimer laser ablation by Suss Photonic Systems with non-photo polymer dielectrics and photolithography with photo-polymers. After the trench and via formation, trench and via fill plating from Atotech and a low-cost surface planarization process (tool installed at Georgia Tech by Disco Japan) to remove copper overburden were used to metallize the fine pitch RDL. Using this approach, 2µm lines and spaces with embedded vias have been successfully demonstrated (bottom figure).This is one of the first demonstrations of silicon-like RDL that Georgia Tech team achieved using glass panels with potential for lower cost Cu-polymer RDL materials and processes.\nThis research is being performed in partnership with a large global team of material and tool companies and with support from several on-site industry engineers at Georgia Tech.\nThis project is part of Georgia Tech industry consortium in System Scaling which includes about 40 end-user and supply chain companies.\nAbout the Authors\nYuya Suzuki is a PhD student under the advisement of Prof. Rao Tummala. His research focus is on thin film dielectrics and small micro-vias.\nysuzuki3@mail.gatech.edu .\nFuhan Liu is the Assistant Program Manager for Electronic and Photonic Substrates at Georgia Tech PRC.\nfliu@ece.gatech.edu\nDr. Venky Sundaram is the Program Manager of Substrate Programs and Associate Director of Industry Programs at Georgia Tech PRC.\nvs24@mail.gatech.edu\nProf. Rao Tummala is Joseph. M. Pettit Chair Professor in ECE and MSE and Director of Georgia Tech’s Packaging Research Center.\nrao.tummala@ece.gatech.edu .\nAdditional Images\nContact\nKaren May\nMarketing & Communications Coordinator\nPackaging Research Center\nkaren.may@ece.gatech.edu\n(404) 385-1220\nEmail\nkaren.may@ece.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}