{"text": "Reck Club Establishes Intercollegiate Spirit Network | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nReck Club Establishes Intercollegiate Spirit Network\nThe Collegiate Spirit Organization Network boasts over 15 teams from 5 NCAA conferences.\nFacebook\nTwitter\nEmail\nFeb 24, 2021\n— Atlanta, GA\nLast summer, as uncertainty about the fall semester and the status of sporting events raged on, so did that of the Ramblin’ Reck Club’s role on campus. Since 1930, Reck Club has maintained school traditions and spirit, largely through their presence at athletic events.\nIn figuring out how to handle sports during a pandemic, Reck Club reached out to other schools with similar spirit organizations. They started with a few in the Atlantic Coast Conference (ACC), including Clemson, Miami, Duke, and UNC. Together, these spirit groups started meeting and discussing best practices for the upcoming fall. Over the next few months, the network of spirit organizations grew into what is now known as the Collegiate Spirit Organization Network, or CSON. As it stands, CSON includes more than 15 schools spanning five NCAA Division I conferences.\nThroughout the fall, CSON member schools would send one representative to each meeting, where they’d help each other figure out how to handle anything from navigating Covid-19 to getting students out to athletic events. Ranging from brand new to decades old, from large schools to small ones, the spirit organizations were able to draw from each other’s wide range of experiences with ease. While there's no formal parliamentary structure to CSON meetings, Reck Club, as its founder, steps in as the de-facto leader when necessary.\nAdam Lederer, CSON chair within Reck Club, credits the network with helping Reck Club figure out how to make its own internal changes.\n“It’s been a convenient time to be able to take a step back and critically analyze all the systems that we use to engage students with athletics,” he said. “It’s great to be able to take lessons from other schools and apply them at Georgia Tech.”\nWhile the pandemic has made it difficult to implement new initiatives at sporting events right now, Reck Club now has the perspectives of several other schools at its disposal when the opportunity arises. When that time comes, they’ll be able to use the information gained from CSON in discussions with Georgia Tech Athletics. They’ve learned about an incentive system used at UNC for basketball games that involves attendance at non-revenue sports, and about Duke’s “dirt sheets,” which include facts about opposing teams’ players that fans can use to throw them off their rhythm.\nEven once sporting events return to normal, CSON will still be there to help schools across the country maintain school spirit and get students engaged with campus athletics. It will also continue to serve as a way for members to connect and provide tips when visiting each other’s’ campuses for away games.\n“In the future, I hope that we’ll be able to transition more of our focus toward athletic marketing tactics and cool traditions that other schools have implemented to get their students engaged,” Lederer said.\nClick\nhere\nto learn more about the Ramblin’ Reck Club.\nAdditional Images\nContact\nGrace Wyner\nInstitute Communications\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}