{"text": "School of Earth and Atmospheric Sciences to Offer Three New Undergraduate Degrees — Including Interdisciplinary Environmental Science Major | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nSchool of Earth and Atmospheric Sciences to Offer Three New Undergraduate Degrees — Including Interdisciplinary Environmental Science Major\nThe expanded undergraduate degree offerings are designed to continue Georgia Tech’s reputation for academic rigor — and also reflect trends in student interests, as well as current and forecasted needs in the job marketplace.\nFacebook\nTwitter\nEmail\nJan 23, 2023\nBeginning Summer 2023, prospective and current Georgia Tech students will have three new Bachelor of Science degrees to choose from in the\nSchool of Earth and Atmospheric Sciences . The expanded undergraduate offerings target a wider range of job and research opportunities — from academia to analytics, NASA to NOAA, meteorology to marine science, climate and earth science, to policy, law, consulting, sustainability, and beyond.\nThe\nBoard of Regents of the University System of Georgia\nhas approved two new specific degrees within the School: Atmospheric and Oceanic Sciences (AOS) and Solid Earth and Planetary Sciences (SEP). Regents also approved Environmental Science (ENVS) as an interdisciplinary College of Sciences degree between the School of Earth and Atmospheric Sciences and the\nSchool of Biological Sciences . The existing Earth and Atmospheric Sciences B.S. degree will sunset in two years for new students.\n“We are really excited to be able to offer this new interdisciplinary undergraduate degree program in Environmental Science,” said\nJean Lynch-Stieglitz,\nADVANCE Professor in Earth and Atmospheric Sciences (EAS). “While it was developed jointly between the Schools of Earth and Atmospheric Sciences and Biological Sciences, it brings together Georgia Tech’s broad expertise and course offerings related to the Earth’s environment from across the Institute.”\n“We are excited to see these new programs develop,” added\nAndrew Newman , professor and the School’s undergraduate coordinator, “as these degrees highlight the quantitative and computational skills of Georgia Tech students, and align better with their interests in global understanding of problems related to environmental impact and sustainability, natural hazards and landscape development, as well as planetary evolution, habitability, and exploration.”\n“Students looking for specific types of programs will also be more understanding of what their program offers,” Newman said. “Under our current degree, a student interested in ocean science, planetary science, and environmental chemistry all would be looking at the same degree that doesn’t define their interests. Now, having programs with those interests in their name, and described well on the upcoming webpage, will greatly increase their interest in our program.”\nThe Evolution of EAS at Georgia Tech\nNewman also shared that, in Fall 2021, the School surveyed current EAS undergraduate students and recent alumni for feedback and thoughts on the potential degrees. Responses from the community highlighted that the plan for transitioning the existing major could not only help new students hone their academic and career plans, but also help them communicate beyond EAS about their chosen major.\n“These degrees make it more clear what the student is studying,” shared one student. “Before, people would ask what my major ‘even is’ and what kinds of jobs I could get with it. I think the new majors make it more clear.”\n“Finally, Planetary Science!” said another student. “This degree would go well with a Physics or AE (Aerospace Engineering) certificate or dual degree.”\nAll about the new Georgia Tech EAS degrees\nThe expanded undergraduate degree offerings are designed to continue Georgia Tech’s reputation for academic rigor — and also reflect trends in student interests, as well as current and forecasted needs in the job marketplace.\n“A key aspect of the new Environmental Science degree program will be its flexibility,” said Lynch-Stieglitz. “Students will be able to focus their study to support their interests and career goals whether those be in conservation, climate change, or environmental health. We’ve also left space in their program to encourage participation in especially impactful experiences such as study abroad and research projects. Georgia Tech students are fantastic — well prepared, diverse, smart, hard-working, and passionate. This flexible approach will allow them to become the broadly educated leaders who will envision the solutions to environmental problems that are so urgently needed.”\nMore on the new undergraduate degrees and what they will require:\nB.S. Atmospheric and Oceanic Sciences (AOS) Degree\nAOS\nuses the current Meteorology track as its foundation and will include aspects of Atmospheric Sciences, Oceanography and Climate Sciences.\nEAS will continue to offer courses needed for\nAmerican Meteorological Society (AMS)\ncertifications as well as those required for\neligibility for National Weather Service meteorology jobs .\nSome courses will be reduced and others added (e.g. the existing course Physics of Weather will now be formally required instead of Earth Processes; the National Weather Service Practical Internship course in partnership with NWS Peachtree City will continue).\nThe AOS degree is designed to take advantage of Atlanta as a “hotspot” for major meteorological organizations including The Weather Channel, CNN, local stations in a top 10 TV market, and the National Weather Service (NWS) Peachtree City, Georgia office. The degree also builds on Georgia Tech’s existing expertise in Atmospheric Chemistry, Oceanography, Climate Dynamics, Paleoclimatology and Paleoceanography, and meteorological research.\nAOS degree recipients\nlooking for jobs\nor graduate research can target the energy sector, insurance risk modeling, broadcast meteorology, consulting, data analytics, aviation, military, and K-12 education, among other positions.\nB.S. Environmental Science (ENVS) Degree\nENVS\nwas developed by a joint committee involving EAS and the School of Biological Sciences.\nENVS requires core content in mathematics, physics, chemistry, biology, Earth sciences, and public policy.\nUpper level coursework allows students to customize their program of study based on interest.\nStudents will complete a capstone research project that integrates the knowledge they have gained through the program.\nThis degree takes advantage of Georgia Tech’s expertise in Environmental Chemistry, climate science, marine science, Aquatic Chemical Ecology, microbial dynamics, and Environmental Policy. Newman added that there is a critical emerging market need for scientists with expertise in the Earth’s environmental systems.\nThe ENVS degree will provide a strong base for students pursuing graduate programs and careers in environmental policy, environmental law, medicine, and other master’s and Ph.D. programs in environmentally related disciplines.\nB.S. Solid Earth and Planetary Sciences (SEP) Degree\nSEP\nbuilds on the existing Earth Science track to include Planetary Sciences.\nThere is an opportunity to reduce some courses.\nSome courses will now be required (e.g. Physics II, Physics of Planets, Introduction to Geophysics).\nAccording to an SEP prospectus, “the degree will support Georgia Tech’s mission to develop leaders who advance technology and improve the human condition, through developing holistically minded students that can put human development in context of the environment for which we live, including resource availability, hazards that affect sustainability, and our exploratory nature to understand our place on the planet and solar system.”\nCareer and graduate opportunities include energy sector positions, NASA, NOAA, U.S. Geological Survey, environmental remediation, hazard assessment and data analytics.\nLearn more, contact EAS Undergraduate Advising, and apply:\neas.gatech.edu/undergraduate\neas.gatech.edu/aos\neas.gatech.edu/envs\neas.gatech.edu/sep\nRelated links\nGeorgia Tech School of Earth and Atmospheric Sciences Undergraduate Program\nB.S. Atmospheric and Oceanic Sciences (AOS) Degree\nB.S. Environmental Science (ENVS) Degree\nB.S. Solid Earth and Planetary Sciences (SEP) Degree\nContact\nWriter:\nRenay San Miguel\nCommunications Officer II/Science Writer\nCollege of Sciences\n404-894-5209\nEAS Undergraduate Program Contacts:\neas.gatech.edu/undergraduate\nEditor and Media Contact:\nJess Hunt-Ralston\nDirector of Communications\nCollege of Sciences at Georgia Tech\nEmail\njess@cos.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}