{"text": "Researchers Discover Potential Drug Targets for Early Onset Glaucoma | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nResearchers Discover Potential Drug Targets for Early Onset Glaucoma\nScientists have for the first time identified molecules with the potential to block the accumulation of a toxic eye protein that can lead to early onset of glaucoma.\nFacebook\nTwitter\nEmail\nRaquel Lieberman, an associate professor in the School of Chemistry and Biochemistry at the Georgia Institute of Technology in Atlanta, whose lab led the research.\nJan 23, 2014\n— Atlanta, GA\nUsing a novel high-throughput screening process, scientists have for the first time identified molecules with the potential to block the accumulation of a toxic eye protein that can lead to early onset of glaucoma. Glaucoma is a group of diseases that can damage the eye’s optic nerve and cause vision loss and blindness. Elevated eye pressure is the main risk factor for optic nerve damage.\nResearchers have implicated a mutant form of a protein called myocilin as a possible root cause of this increased eye pressure. Mutant myocilin is toxic to the cells in the part of the eye that regulates pressure. These genetically inherited mutants of myocilin clump together in the front of the eye, preventing fluid flow out of the eye, which then raises eye pressure. This cascade of events can lead to early onset-glaucoma, which affects several million people from childhood to age 35.\nTo find molecules that bind to mutant myocilin and block its aggregation, researchers designed a simple, high-throughput assay and then screened a library of compounds. They identified two molecules with potential for future drug development to treat early onset glaucoma.\n“These are really the first potential drug targets for glaucoma,” said\nRaquel Lieberma n, an associate professor in the School of Chemistry and Biochemistry at the Georgia Institute of Technology in Atlanta, whose lab led the research.\nLieberman presented her findings on January 20 at the Society for Laboratory Automation and Screening conference in San Diego, Calif. The study was published on Nov. 26, 2013, in the journal\nACS Chemical Biology . The National Institutes of Health and the Pew Scholar in Biomedical Sciences program provided support for the research. The work was a collaboration involving Georgia Tech, Emory University and the University of South Florida. At the heart of the study was an assay that Lieberman’s lab created to take advantage of the fundamental principles of ligand binding. In their assay, mutant myocilin is mixed with a fluorescent compound that emits more light when the protein is unwound. When a molecule from the library screen binds to myocilin, the pair becomes highly stable – tightly wound – and the fluorescent light emitted decreases. By measuring fluorescence, researchers were able to identify molecules that bound tightly to mutant myocilin. The researchers then added these molecules to cultured human cells that were making the toxic aggregating myocilin. Treating the cells with the newly identified molecules blocked the aggregation and caused the mutated version of myocilin to be released from the cells, reducing toxicity. “We found two molecules from that initial screen that bound to our protein and also inhibited the aggregation,” Lieberman said. “When we saw that these compounds inhibited aggregation then we knew we were onto something good because aggregation underlies the pathogenesis of this form of glaucoma.” In a separate study, Lieberman’s lab characterized the toxic myocilin aggregates. That study was published in December 2013 in the\nJournal of Molecular Biology . The study found that myocilin aggregates are similar to the protein deposits called amyloid, which are responsible for Alzheimer’s disease and other neurodegenerative diseases.\n“In Alzheimer’s disease, the deposits are extracellular and kill neurons. In glaucoma the aggregates are not directly killing neurons in the retina to cause vision loss, but they are cytotoxic in the pressure-regulating region of the eye,” Lieberman said. “It’s parallel to all these other amyloids that are out there in neurodegenerative disease.” The researchers are now focusing on mapping the structure of myocilin to learn more about what myocilin does and why it is in the eye in the first place.\n“The underlying problem with myocilin is that for 14 years it has been studied and still nobody really knows what its biological role is inside the eye,” Lieberman said.\nThis research is supported by the National Institutes of Health (NIH) under award numbers RO1EY021205 and RO1NS073899, and the Pew Scholar in Biomedical Sciences program. Any conclusions or opinions are those of the authors and do not necessarily represent the official views of the sponsoring agencies. CITATION : Susan D. Orwig, et al., \"Ligands for glaucoma-associated myocilin discovered by a generic binding assay,\" ( ACS Chemical Biology , November 2013). ( http://dx.doi.org/10.1021/cb4007776 ). CITATION : Shannon E. Hill, et al., “The glaucoma-associated olfactomedin domain of myocilin forms polymorphic fibrils that are constrained by partial unfolding and peptide sequence,” ( Journal of Molecular Biology , December 2013). ( http://dx.doi.org/10.1016/j.jmb.2013.12.002 ). Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA @GTResearchNews Media Relations Contacts:\nBrett Israel ( @btiatl ) (404-385-1933) ( brett.israel@comm.gatech.edu ) or John Toon (404-894-6986) ( jtoon@gatech.edu ) Writer:\nBrett Israel\nAdditional Images\nContact\nBrett Israel 404-385-1933 brett.israel@comm.gatech.edu @btiatl\nEmail\nbrett.israel@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}