{"text": "Georgia Tech Hosts Notable Names During Black History Month | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Hosts Notable Names During Black History Month\nIn recent weeks, Georgia Tech has hosted several poignant discussions and candid conversations about race on campus and beyond.\nFacebook\nTwitter\nEmail\nCheneé Joseph, Doug Hooker, Nikole Hannah-Jones, John Onwuchekwa, Kamau Bobb, Al Vivian, Jennifer Abrams, Frank Brown, Angela Davis\nFeb 24, 2021\n— Atlanta, GA\nIn recent weeks, Georgia Tech has hosted several poignant discussions and candid conversations about race on campus and beyond. Though most have been virtual, they have offered the Tech community opportunities to hear many Black voices, both local and national. In celebration of Black History Month, we’ve rounded up some of the speakers from recent campus events.\nNikole Hannah-Jones\nOn Jan. 14, the 10th Annual MLK Lecture was delivered by keynote speaker Nikole Hannah-Jones, acclaimed investigative journalist. Hannah-Jones spearheaded\nThe New York Times\n1619 Project , for which her introductory essay won her a 2020 Pulitzer Prize for Commentary. The 1619 Project shares work from Black creatives and acts as a portal to the past, present, and future with Black history at the forefront. During the lecture, Hannah-Jones highlighted the ways American history has erased Black history and the importance of reclaiming that past. She also highlighted how Black history has shaped the current American landscape, arguing that through writing and storytelling it will not be erased for future generations.\nRead a full recap of the event\nFrank Brown\nOn Jan. 16, the Engage Symposium showcased a variety of speakers whose work aims to enhance the communities they live in. The first speaker was Frank Brown, CEO of Communities in Schools of Atlanta, which works to provide community support for students. Through his leadership in establishing youth programming, civic engagement, and assistance to children and families, Brown has become a key leader in Atlanta. The purpose of his interview with Taylor Gray was to answer the question, “How is a community of support built?” Brown highlighted the importance of relationships and urged students to join student government and other campus and social groups.\nView the full lecture\nCheneé Joseph\nThe second session of the Engage Symposium brought Cheneé Joseph, the executive director of the Historic District Development Corporation (HDDC), back to Tech. The Tech alumna is currently working to provide affordable housing in Atlanta through the Beltline Affordable Housing Advisory Board and revitalize Martin Luther King Jr.’s historic district. The question of the session was, “What if I was in charge?” Throughout the lecture, Joseph talked about the revitalization efforts of the HDDC and explained the steps taken to increase community engagement with the project.\nView the full lecture\nDoug Hooker\nThe third speaker of the Engage Symposium was Doug Hooker, executive director of the Atlanta Regional Commission, which aids local government and community members to improve the region’s quality of life through the arts, community development, transportation, and homeland security. His session aimed to answer the question, “Do people know you care?” Throughout the interview, the Tech alumna wove in his experiences in various community boards over the years.\nView the full lecture\nJennifer Abrams\nIn a conversation between Dean of Students John Stein and Tech alumna Jennifer Abrams, the last Engage Symposium session focused on the lessons learned throughout their careers. Abrams is part of the Piedmont Healthcare Corporation and helped lead the response to the coronavirus pandemic through her support of infectious disease physicians. During the conversation, she talked about how her experience at Tech was shaped by her involvement in student orientation and leadership roles in several student groups. The motivation behind her leadership is thinking of the people who don’t have the opportunity to be in that space.\nView the full lecture\nJohn Onwuchekwa\nOn Jan. 18, the MLK Day of Service 2021 closing speaker, John Onwuchekwa, co-founder of Portrait Coffee, shared the story behind his business and his take on hope as a vessel for defiance and perseverance. This personal mantra has taken him on a journey of waking up at 4 a.m. and even starting a coffee shop during a pandemic. The key takeaway was why problems can feel more bearable with the mindset, in Onwuchekwa’s words, that “the state of my soul is not going to be affected by the circumstances I find myself in.”\nView the full lecture\nAl Vivian\nThe Georgia Tech: A Call to Action lecture series emerged from the Black Lives Matter protests last summer and hosts discussions with faculty members about the Black experience at Tech. This year, on Jan. 21, the keynote speaker was Al Vivian, CEO of Basic Diversity Inc. and son of Martin Luther King Jr.’s confidant, C.T. Vivian. Basic Diversity, an inclusion and diversity consultancy, works with businesses not only to encourage more diversity in their workforce but also to deal with the challenges that come with it.\nRead a full recap of the event\nKamau Bobb\nThe Inaugural Petit Institute Antiracism Distinguished Lecture was delivered by Kamau Bobb on Feb. 4. A widely respected scholar involved in STEM inclusivity and outreach programs, Bobb’s experience ranges from Google to President Barack Obama’s My Brother’s Keeper STEM + Entrepreneurship Taskforce. As a founding director of the Constellations Center for Equity in Computing at Georgia Tech, he stressed the importance of researchers recognizing the pivotal point the country is in right now regarding race relations and not getting lost in complacency.\nView the full lecture\nAngela Davis\nFor Georgia Tech’s 2021 Black History Month Lecture on Feb. 10, the highly anticipated keynote speaker was the legendary political activist and writer, Angela Davis. Over the course of an hour, students and faculty got to hear Davis’ perspective on the true meaning of political activism, what hope really means, and even going back to teaching at UCLA this spring. Undergraduate members of Tech’s African American Student Union moderated a question-and-answer session as well.\nRead a full recap of the event\nAdditional Images\nContact\nVanesa Vargas\nInstitute Communications\nEmail\nstucomm@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}