{"text": "Moths and Perhaps Other Animals Rely on Precise Timing of Neural Spikes | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMoths and Perhaps Other Animals Rely on Precise Timing of Neural Spikes\nResearchers have captured and analyzed nearly all of the brain signals sent to the wings of hawk moths.\nFacebook\nTwitter\nEmail\nResearch on the hummingbird-sized hawk moth (Manduca sexta) shows that millisecond changes in timing of its action potential spikes conveys the majority of information the moth uses to coordinate the muscles in its wings. (Credit: Rob Felt, Georgia Tech)\nDec 17, 2019\n— Atlanta, GA\nExtracting nectar from flowers that may be dancing in the wind requires precise, millisecond timing between the brain and muscles.\nBy capturing and analyzing nearly all of the brain signals sent to the wing muscles of hawk moths ( Manduca sexta ), which feed on such nectar, researchers have shown that precise timing within rapid sequences of neural signal spikes is essential to controlling the flight muscles necessary for the moths to eat.\nThe research shows that millisecond changes in timing of the action potential spikes, rather than the number or amplitude of the spikes, conveys the majority of information the moths use to coordinate the five muscles in each of their wings. The importance of precise spike timing had been known for certain specific muscles in vertebrates, but the new work shows the general nature of the connection.\n“We were able to record simultaneously nearly every signal the moth’s brain uses to control its wings, which gives us an unprecedented and complete window into how the brain is conducting these agile and graceful maneuvers,” said\nSimon Sponberg , Dunn Family Professor in the\nSchool of Physics\nat the Georgia Institute of Technology. “These muscles are coordinated by subtle shifts in the timing at the millisecond scale rather than by just turning a knob to create more activity. It’s a more subtle story than we might have expected, and there are hints that this may apply more generally.”\nThe research was reported Dec. 16 in the journal\nProceedings of the National Academy of Sciences . The work was supported by the National Science Foundation, the Esther A. & Joseph Klingenstein Fund, and the Simons Foundation.\nResearchers Joy Putney, Rachel Conn and Sponberg set out to study how the brain coordinates agile activities such as running or flying that require compensating for perturbations in the air or variations on the ground. While the size of the signals could account for gross control of the behavior, the fine points of choreographing the tasks had to come from elsewhere, they reasoned.\nRecording motor control signals in humans and other vertebrates would be a daunting task because so many neurons are used to control so many muscles in even simple behaviors. Fortunately, the researchers knew about the hawk moth, whose flight muscles are each controlled by a single or very few motor neurons. That allowed the researchers to study neural signals by measuring the activity of the corresponding muscles, using tiny wires inserted through the insect’s exoskeleton.\nPutney and Conn determined the location of each wing muscle inside the moth exoskeleton, and learned where to create tiny holes for the wires — two for each muscle — that capture the signals. After inserting the wires in the anesthetized moths, the graduate students closed the holes with superglue to hold the wires in place. Connections to a computer system allowed recording and analysis.\n“The first time I did the surgery by myself, it took six hours,” said Putney. “Now I can do it in under an hour.”\nWhile connected to the computer, the moths were able to fly on a tether as they viewed a moving 3D-printed plastic flower. To measure the torque forces the moths created as they attempted to track the flower, the wired-up moths were suspended from an accelerometer.\nThe torque information was then correlated with the spiking signals recorded from each wing muscle.\nThe importance of the work relates to the completeness of the signal measurement, which brought out the importance of the timing codes to what the moth was doing, Putney said.\n“People have recorded lots of muscles together before, but what we have shown is that all of these muscles are using timing codes,” she said. “The way they are using these codes is consistent, regardless of the size of the muscle and how it is attached to the body.”\nIndeed, researchers have seen hints about the importance of precision timing in higher animals, and Sponberg believes the hawk moth research should encourage more study into the role of timing. The importance and prevalence of timing across the moth’s motor program also raises questions about how nervous systems in general create precise and coordinated motor commands.\n“We think this raises a question that can’t be ignored any longer — whether or not this timing could be the real way that the brain is orchestrating movement,” Sponberg said. “When we look at specific signals in vertebrates, even up to humans, there are hints that this timing could be there.”\nThe study could also lead to new research on how the brain produces the agile motor control needed for agile movement.\n“Now that we know that the motor control is really precise, we can start trying to understand how the brain integrates precise sensory information to do motor control,” Sponberg said. “We want to really understand not only how the brain sets up signals, but also how the biophysics of muscles enables the precise timing that the brain uses.”\nThis material is based upon work supported by National Science Foundation Graduate Research Fellowships DGE-1650044 and DGE-1444932, an NSF CAREER award (1554790), and a Klingenstein-Simons Fellowship Award in the Neurosciences. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the author(s) and do not necessarily reflect the views of the sponsoring organization.\nCITATION : Joy Putney, Rachel Conn, and Simon Sponberg, “Precise timing is ubiquitous, consistent and coordinated across a comprehensive, spike-resolved flight motor program.” ( Proceedings of the National Academy of Sciences,\n2019.)\nhttps://www.pnas.org/content/early/2019/12/11/1907513116\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia 30332-0181  USA\nMedia Relations Contact : John Toon (404-894-6986) (jtoon@gatech.edu)\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}