{"text": "SGA IT Board Creates Student-Focused Solutions | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nSGA IT Board Creates Student-Focused Solutions\nMembers of the Student Government Association’s IT Board help students improve their digital experience and receive on-the-job training to jump-start their careers.\nFacebook\nTwitter\nEmail\nTyler Katchen, the outgoing SGA joint vice president of IT, works on his laptop on Tech Green.\nApr 19, 2024\nIn a competitive industry like information technology (IT), real-world experience can make all the difference as students prepare for jobs after Commencement.\nThe Student Government Association's IT Board\nallows students to enhance their skills while creating solutions that benefit the Georgia Tech community.\nMade up of software engineers, product managers, and UI (user interface) designers, the board assists campus partners with constructing and maintaining the Institute's technology infrastructure. Projects overseen by the board, including student-focused sites such as\nCourse Critique , are run through the Institute's AWS and Plesk platforms, mirroring industry trends.\n“The IT Board creates helpful products for students, but it also helps our members by giving them the tools to work within this professional setting. With so many companies using cloud-based systems, our students are getting hands-on experience with these tools, so they already have that on their resumé and are set up to find jobs when they leave Georgia Tech,\" said Tyler Katchen, the outgoing SGA joint vice president of IT (JVPIT).\nThe board is responsible for tweaking existing sites, but its members are always seeking innovative ways to improve the student experience. The board is close to completing an app that enhances the career fair queueing process by allowing students to secure their place in line to speak with major industry players. By simplifying this process, the board hopes that attendees can spend less time waiting and more time speaking with prospective employers.\nMuch of the IT Board's work is done behind the scenes, but Katchen and his team aren't in search of the spotlight.\n“When people see an app we develop, they may not realize how much work goes into it, but we feel the impact in other ways. The projects that are well received by students are ones where they maybe don't recognize the product; they just see themselves using it,” he said. For him, the reward is “seeing it all come together. A lot of it is just taking pride in your work.”\nSince the formulation of the JVPIT role — serving both undergraduate and graduate SGA — in 2020, the board has continued to expand membership and take on larger tasks, including rebuilding the Course Critique site, which originated in 1976 as a tool to help students plan their schedules. Looking ahead, Katchen identified improvements to security measures in GitHub, as well as streamlining surveying efforts for student organizations, as some of the board’s top priorities.\nThe third-year computer science student recently handed over a 28-page transition document to his successor, outlining the status of current projects and day-to-day responsibilities. While he enjoyed his time at the helm, Katchen is ready to return to the keyboard.\n\"I'm a computer science nerd through and through,\" he said. \"So, I'm ready to put my head down and code.\"\nAdditional Media\nContact\nSteven Gagliano\n- Institute Communications\nEmail\nSteven.gagliano@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}