{"text": "Georgia Tech Delivers $4 Billion in Economic Impact to the State of Georgia | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Delivers $4 Billion in Economic Impact to the State of Georgia\nGeorgia Tech is committed to putting research into action. In fiscal year 2021, the Institute brought in $1.2 billion in new grants and contracts for research and other sponsored activities. Of this amount, $781 million was granted to GTRI.\nFacebook\nTwitter\nEmail\nSep 26, 2021\n— Atlanta, GA\nRoughly 275. That’s how many jobs the company Stord has brought to the state of Georgia since it opened its doors in 2016. The startup was one of the first to go through Georgia Tech’s CREATE-X incubator, offering cloud-based software that has since revolutionized the supply chain sector. And as the company continues to grow, it has no plans to leave Atlanta.\n“One of the best things we've done to give back to Georgia is the way Stord has accelerated the overall technology ecosystem, mostly as it pertains to venture, and beyond that, just bringing more capital to the market,” said Sean Henry, CEO and co-founder of\nStord .\nIt’s not just Stord that’s giving back to the state. Georgia Tech’s economic impact on the state of Georgia was $4 billion in fiscal year 2020, according to data recently released by the University System of Georgia.\nCompanies like SalesLoft, Greenlight, and Pindrop all graduated from Georgia Tech’s\nAdvanced Technology Development Center\n(ATDC) — the state’s oldest technology incubator — and have stayed headquartered in Atlanta, infusing millions in capital and thousands of jobs into the state economy. Other startup programs on campus include\nVentureLab ,\nENGAGE , and the\nGlobal Center for Medical Innovation , to name a few, helping students and faculty set up companies based on creative ideas and technological innovation.\nGeorgia Tech’s reputation as a leader in producing successful startups is further solidified by faculty research commercialization.\nCarbice\nand\nSila Nanotechnologies\nwere developed directly from the research of faculty members Baratunde Cola and Gleb Yushin, respectively, and both companies focus on providing energy alternatives to businesses and consumers. Mark Prausnitz’s microneedle technology developed at Georgia Tech has led to four different companies in the Atlanta area, employing 40 people.\n“Georgia Tech provides fertile ground for inventing and developing technologies. The research provides excellent training for students, and the technologies have the promise of serving patients and growing the economy,” said Prausnitz, Regents’ Professor and J. Erskine Love Chair in the School of Chemical and Biomolecular Engineering. “As the biotech industry in Georgia continues to grow, there is an accelerating feedback loop that stimulates more research, more investments, and more successful companies.”\nTechnology transfer and research commercialization are a strategic focus for Georgia Tech, with Raghupathy “Siva” Sivakumar newly serving as the Institute’s chief commercialization officer.\n“As someone who's taken advantage of the Georgia Tech commercialization ecosystem in the past as a faculty entrepreneur, it still surprises me how rich it is, and that gives me great optimism for the road ahead,” said Sivakumar, who is also the co-founder and director of\nCREATE-X .\nGeorgia Tech is committed to putting research into action. In fiscal year 2021, the Institute brought in $1.2 billion in new grants and contracts for research and other sponsored activities. Of this amount, $781 million was granted to the\nGeorgia Tech Research Institute\n(GTRI), the applied research division of the Institute. The awards enable its eight labs to solve complex challenges for the U.S. federal government, the state, and industry. Some of that money goes toward innovations in agriculture across Georgia, including robots that assist with peach picking, poultry deboning, and crop monitoring, to name a few.\nWhile many rural areas of Georgia are benefiting from Georgia Tech’s technologies, Atlanta itself has emerged as one of the nation’s capital cities for technology and startup innovation. Part of the region’s success with its technology ecosystem is Midtown’s Technology Square, with the highest density of startups, corporate innovators, and academic researchers in the southeastern U.S.\nStord’s headquarters sit right next to Tech Square, and Henry’s office window looks across the street to the Scheller College of Business, where he took his first classes at Georgia Tech. Just this year, Stord opened a 386,000-square-foot warehouse 20 miles outside of Atlanta, where it employs about 75 people who gain the benefits of a startup, including equity and paid time off programs, as well as the corporate culture and engagement that doesn’t typically come in an industrial environment.\n“There’s a lot more employee loyalty in Georgia versus a place like Silicon Valley. They want to buy into a long-term mission and be part of something greater,” said Henry.\nLast week, Stord reached a major milestone —\na $1.1 billion valuation . For Henry, it’s a surreal moment, but mostly one colored by feelings of gratitude.\n“I think the main feeling is gratitude, and at the same time, the feeling that you have to do more in the sense of looking for ways to continue to give back,” he said. “The amount of trust, focus, and support the Georgia Tech ecosystem will give you is incredible, and can propel you far if you utilize it correctly. But ultimately, then you have a large responsibility and goal to try to give back as much as you can.”\nTo discover more about the vast research enterprise and technology ecosystem of Georgia Tech, visit\nreport.research.gatech.edu .\nAdditional Images\nContact\nGeorgia Parmelee\nEmail\ngeorgia.parmelee@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}