{"text": "Tech Student Brings Artificial Intelligence to Basketball Officiating | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nTech Student Brings Artificial Intelligence to Basketball Officiating\nBlock or charge? An AI-powered basketball official could help make the call.\nFacebook\nTwitter\nEmail\nAyush Pai's AI basketball official detects a traveling violation.\nJul 25, 2023\nEvery sports fan can recall a moment that had them screaming from their seat or their couch as their favorite team landed on the wrong end of an official’s crucial call. Now, artificial intelligence could offer assistance.\nAyush Pai, an avid NBA viewer, set out to create a solution as he watched fouls go uncalled and outcomes be decided by officials rather than the players.\nWith a self-taught knowledge of computer vision AI, he created the initial model for the official­­ –– dubbed version 1.0 –– in the summer of 2022 after graduating high school. With soccer's video assistant referee (VAR) system and the Hawk-Eye review system in tennis as a guide, Pai felt that basketball was missing an AI component to supplement referees on the court.\n\"The officials are running up and down the court constantly. Basketball in general, especially the NBA, is one of the most fast-paced sports, and the entire court is difficult for officials to see at all times. Why not implement a system that can enhance their ability to see the floor using multiple cameras with real-time processing and detection of the basketball and the players?\" he said.\nVersion 1.0 of Pai's system was trained to detect the color of the basketball and used a pedometer to track steps, but lighting issues and the use of a cumbersome step counter proved limiting. In June, the Denver Nuggets capped a 4-1 series victory over the Miami Heat to earn their first NBA championship, but officiating mistakes in the Heat's lone win propelled Pai to get back to work on his concept. By the end of the month, version 2.0 of the AI official was complete.\nTo improve accuracy, he used over 3,000 photos of basketballs to better train the model to track the ball's movement, and he also used pose estimation for tracking the position of a player's ankles and wrists to detect double dribbling and traveling violations. He is now working on version 3.0, which will include the capacity for multiple players, cameras, and the ability to detect shooting fouls and reach-ins. Pai is also developing a mobile app that he hopes will bring accurate officiating to youth leagues and pickup games worldwide.\nThe AI craze shows no signs of slowing down, and Pai sees his creation as a way to introduce the concept to new audiences. \"Everyone should see the potential of AI, and it's important that everyone has a basic understanding of its implications and how it can be used in different fields. You can use AI for ChatGPT, in Tesla's autonomous systems, and even in sports,\" he said.\nAn ongoing debate amid the rise of AI is its potential to displace people. Pai sees the benefit of his system as one of coexistence rather than a replacement for the human element of officiating.\n\"You don't want to make AI feel like a threat to the people in any industry. It's a much better approach to consider this a partnership between AI and officials. In basketball, there are so many physical aspects of the job that AI can't do,\" he said.\nThe Florida native will trade his University of Florida Gator blue and orange for Yellow Jacket white and gold this fall as a transfer student, and the incoming second-year student is eager to get started.\n\"One of the main reasons I transferred is because of the opportunities the Institute offers within AI and computer science,” he said. “The chance to participate in the\nCollege of Computing's Threads program\nwill help me with my projects, and I’m looking forward to exploring the entrepreneurial side of Tech with great programs that foster innovation.\"\nPai’s interest in the capabilities of AI isn’t limited to basketball. He has also created systems that attempt to\ndiscourage texting and driving\nand\nkeep students on task while studying .\nGeorgia Tech continues to cement itself as a leader in the emerging space, highlighted by the\nrecent launch of the AI Hub on campus , which will drive education and research while developing real-world, responsible applications for AI.\nAdditional Images\nContact\nSteven Gagliano - Communications Officer\nInstitute Communications\nEmail\nSteven.gagliano@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}