{"text": "As We Get Parched, Cognition Can Sputter, Dehydration Study Says | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nAs We Get Parched, Cognition Can Sputter, Dehydration Study Says\nSummer heat fuzzing your concentration? Making you fumble? It may be dehydration.\nFacebook\nTwitter\nEmail\nProfessor Mindy Millard-Stafford researches in exercise physiology, including studies on how dehydration and exertion can reduce physical and cognitive performance. In the background, a volunteer lies on a device that measures body composition (l.) and another volunteer sweats out fluids under exertion in a heated chamber (r.). Millard-Stafford is Past President of the American College of Sports Medicine. Credit: Georgia Tech / Christopher Moore\nJul 16, 2018\n— Atlanta, GA\nAnyone lost in a desert hallucinating mirages knows that extreme dehydration discombobulates the mind. But just two hours of vigorous yard work in the summer sun without drinking fluids could be enough to blunt concentration, according to\na new study .\nCognitive functions often wilt as water departs the body, researchers at the Georgia Institute of Technology reported after statistically analyzing data from multiple peer-reviewed research papers on dehydration and\ncognitive ability . The data pointed to functions like attention, coordination and complex problem solving suffering the most, and activities like reacting quickly when prompted not diminishing much.\n“The simplest reaction time tasks were least impacted, even as dehydration got worse, but tasks that require attention were quite impacted,” said\nMindy Millard-Stafford, a professor in Georgia Tech’s School of Biological Sciences .\nLess fluid, more goofs\nAs the bodies of test subjects in various studies lost water, the majority of participants increasingly made errors during attention-related tasks that were mostly repetitive and unexciting, such as punching a button in varying patterns for quite a few minutes. There are situations in life that challenge attentiveness in a similar manner, and when it lapses, snafus can happen.\n“Maintaining focus in a long meeting, driving a car, a monotonous job in a hot factory that requires you to stay alert are some of them,” said Millard-Stafford, the study’s principal investigator. “Higher-order functions like doing math or applying logic also dropped off.”\nThe researchers have been concerned that dehydration could raise the risk of an accident, particularly in scenarios that combine heavy sweating and dangerous machinery or military hardware.\nMillard-Stafford and first author Matthew Wittbrodt, a former graduate research assistant at Georgia Tech and now a postdoctoral researcher at Emory University, published their meta-analysis of the studies on June 29 in the journal\nMedicine & Science in Sports & Exercise .\nIt can happen quickly\nThere’s no hard and fast rule about when exactly such lapses can pop up, but the researchers examined studies with 1 to 6 percent loss of body mass due to dehydration and found more severe impairments started at 2 percent. That level has been a significant benchmark in related studies.\n“There’s already a lot of quantitative documentation that if you lose 2 percent in water it affects physical abilities like muscle endurance or sports tasks and your ability to regulate your body temperature,” said Millard-Stafford, a past president of the American College of Sports Medicine. “We wanted to see if that was similar for cognitive function.”\nThe researchers looked at 6,591 relevant studies for their comparison, then narrowed them down to 33 papers with scientific criteria and data comparable enough to do metadata analysis. They focused on acute dehydration, which anyone could experience during exertion, heat and/or not drinking as opposed to chronic dehydration, which can be caused by a disease or disorder.\nOne day to lousy\nHow much\nfluid loss\nadds up to 2 percent body mass loss?\n“If you weigh 200 pounds and you go work out for a few of hours, you drop four pounds, and that’s 2 percent body mass,” Millard-Stafford said. And it can happen fast. “With an hour of moderately intense activity, with a temperature in the mid-80s, and moderate humidity, it’s not uncommon to lose a little over 2 pounds of water.”\n“If you do 12-hour fluid restriction, nothing by mouth, for medical tests, you’ll go down about 1.5 percent,” she said. “Twenty-four hours fluid restriction takes most people about 3 percent down.”\nAnd that begins to affect more than cognition or athletic abilities and concentration.\n“If you drop 4 or 5 percent, you’re going to feel really crummy,” Millard-Stafford said. “Water is\nthe most important nutrient .”\nShe warned that\nolder people can dry out more easily\nbecause they often lose their sensation of thirst and also, their kidneys are less able to concentrate urine, which makes them retain less fluid. People with high body fat content also have lower relative water reserves than lean folks.\nDon’t overdo water\nHydration is important, but so is moderation.\n“You can have too much water, something called\nhyponatremia ,” Millard-Stafford said. “Some people overly aggressively, out of a fear of dehydration, drink so much water that they dilute their blood and their brain swells.”\nThis leads to death in rare, extreme cases, for example, when long-distance runners constantly drink but don’t sweat much and end up massively overhydrating.\n“Water needs to be enough, just right,” Millard-Stafford said.\nAlso, she warned that while salt avoidance may be good for sedentary people or hypertension patients,\nwhoever sweats needs some salt\nas well, or they won’t retain the water they drink.\nLike this article?  Get our email newsletter here.\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : Ben Brumfield (404-660-1408)\nWriter : Ben Brumfield\nAdditional Images\nContact\nResearch News\n(404) 894-6986\nEmail: ben.brumfield@comm.gatech.edu\nEmail\nben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}