{"text": "100 Campus Leaders Currently Engaged in 2021 Inclusive Leaders Academy Program | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\n100 Campus Leaders Currently Engaged in 2021 Inclusive Leaders Academy Program\nThe latest class of campus leaders began matriculation in the 2021 Inclusive Leaders Academy program at Georgia Tech on February 5.\nFacebook\nTwitter\nEmail\nThe 2021 Inclusive Leaders Academy Cohort\nApr 12, 2021\n— Atlanta, GA\nThe latest class of campus leaders began matriculation in the 2021 Inclusive Leaders Academy program at Georgia Tech on February 5. The participants represent the fifth cohort of the program and include more than 100 managers, directors, executives, senior researchers, and faculty administrators from across the Institute.\nThe Inclusive Leaders Academy is designed to support managers and leaders in developing and honing global competencies and to positively shape Tech’s culture towards inclusive excellence. Key learning benefits of the program and core curriculum topic areas facilitate social intelligence, self-awareness, resilience, and courage as leadership attributes. The curriculum provides an individualized path of self-guided learning as well as integration and practice techniques through virtual wisdom labs and dialogues.\nThis year’s program will span 12 weeks. Participants who complete the program will gain the equivalent of 18 hours of learning and practice and will receive a “Culture Champions” certificate. Since the Academy’s initiative, more than 300 have completed the program.\nThe program was launched in 2017 by\nInstitute Diversity, Equity, and\nInclusion ’s Staff Diversity, Inclusion and Engagement unit. Pearl Alexander, executive director of Diversity, Inclusion, and Engagement and Inclusive Leaders Academy director said, “The initiative was responsive to the need to cultivate skills to foster inclusivity and to meet the increasing desires for meaningful professional development. The Inclusive Leaders Academy offers practical guides and tools that help us ‘thrive on diversity,’ act ethically, nurture the wellbeing of our community, and more.\nCurriculum content has been curated from the NeuroLeadership Institute and  Dare to Lead,  the most recent book authored by and based on the research of Brené Brown. “Content is also inclusive of other research-based leadership practices that will support the Institute’s aspirational goals and ensure that we deliver on the mission of progress and service outlined in our 2030 Strategic Plan,” Alexander added.\nOne of the first instructor-led courses for the cohort was Stories We Live. Participants learned how stories shape individual identity and improve social intelligence and relational abilities.\nDuring the two-hour course, the cohort worked with Georgia Tech story coaches -- including Alexander; Emma Blandford, assistant director for Living Learning Communities for the College of Sciences; Lindsey Laney, academic program manager for Georgia Tech Professional Education; Kathleen Schaag, Brittan Fellow with the School of Literature, Media, and Communication (LMC); Stephanie Ray, associate dean of students and director of Diversity Programs for the Division of Student Life; and Wendy Truran, visiting lecturer with the School of LMC  -- who advised participants on how to excavate thought details and boost expression and creativity. Some stories may emerge for publication in Institute Diversity, Equity, and Inclusion’s growing digital story library, the\nTransformative Narratives .\nThe cohort have also completed the NeuroLeadership Institute’s Neuroscience of Smart Teams (INCLUDE) and Neuroscience of Breaking Bias (DECIDE) modules. Participants completed self-guided learning exercises and weekly reflections on the practices of creating inclusive team cultures and recognizing biases. Later into the program, NeuroLeadership’s Jeff Salters and Ric Oslin facilitated the cohort through 60-minute interactive webinars to hone the module teachings.\n“At this point in the program participants should have a good sense of how to identify and mitigate their unconscious biases, the power of vulnerability, and stories to create connected, collaborative, and engaging work environments,” Alexander said. “Additional sessions to come include instruction on antiracism empathy, creating a calling-in culture, and resilience. The session on resilience will be facilitated by Joi Alexander, director of Health Initiatives, and Sonia Alvarez-Robinson, executive director of Georgia Tech Strategic Consulting.\nAfter completing all of the basic certificate requirements, participants will be celebrated during a closing program in May. They will also be eligible for diversity, equity, and inclusion leadership and career coaching as part of a growing community of practice.\n“Through this award-winning initiative, we believe that Georgia Tech is leading by example,” Alexander added. “We are already developing staff and faculty leaders at all levels who are inclusive, accountable, and determined to be exceptional champions of a culture where all contributors can thrive. The challenge ahead is to scale this and similar opportunities to more leaders at Tech, higher education, and the world.”\nThe 2021 Inclusive Leaders Academy participants are: Rashidah Bahar-Graham, Lula Baker, Kathryn Ballou, Susan Belmonte, Kelley Bennett, Ashton Bettis, James Black, Scott Bleiweis, Ilana Blumenfeld-Gantz, Neil Bright, L. Renee Brown, Pam Buffington, Michele Burts, Karen Cannon, Mayumi Cole, Mysty Connelly, Malvenia Dasher, Jessica Tyler Davis, Aiesha Dawda, Harry Dewhurst, Debbie Dorsey, Jim Fortner, Dana Foster, Kelly Fox, Melissa Fralick, Andy Frazee, Ivy Gardner, Evan Goldberg, Tigiste Habtemariam, Robert Hampson, Casey Hampton, Jimmie Hardin, Kayli Harlan, Kim Harrington, Kasey Helton, Bryony Higgins, Courtney Hill, Brittany Hodges, Nasrin Hooshmand, Jessica Howard, Daren Hubbard, Gail Imoukhuede, Mitsuko Ito, Kristy Jennings, Monique Johnson, Amy Johnson, Shiraz Karaa, April Kelly, Bridgett Kemp, Kathleen Kirk, Anita Lamb, Season Lewis, Nicole Little, Chantal Manchester, Rachel Matthews, Keith McBride, Leigh McCook, Tammy McCoy, Cassy McInnis, Janise McKenzie, Melanie Megenity, Derrick Morse, Allison Noffsinger, Lorie Paulez, Rachael Pocklington, Elisha Quillen Smith, Kerry-Gaye Rainford-Creary, Victoria Razin, Tangirala Reddy, Elizabeth Reese, Franz Reneau, Kelci Reyes-Brannon, Jon Riling, Yelena Rivera, Arianna Robinson, Will Roddy, Kyla Ross, Tina Rousselot de Saint Ceran, Elizabeth Ryan, Lakeita Servance, Mike Shannon, Keisha Simmons, Andy Smith, Vincent Sollicito, Quinn Spadola, Tanesha Steward, Yevgenya (Jenny) Strakovsky, Diana Sutton-Fernandez, Janaki Tambe, Denise Thomas, John Thornton, Duc (David) Tran, Troy Walcott, Kerry Wallaert, Jeff White, Mark Whorton, Kristen Wingate, Shaunitra Wisdom, Leyu Wondwossen. Natalie Wood, Nazia Zakir, Nuyun Zhang, and Tony Zivalich.\nTo learn more about the Inclusive Leaders Academy, visit:  sdie.gatech.edu/programs-and-initiatives/leadership-development/inclusive-leaders-academy .\nAdditional Images\nContact\nCourtney Hill\nCommunications Manager\nInstitute Diversity, Equity, and Inclusion\ncourtney.hill@gatech.edu\nEmail\ncourtney.hill@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}