{"text": "Internet of Things Center Continues to Grow, Make Global Impact | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nInternet of Things Center Continues to Grow, Make Global Impact\nMembership in the Internet of Things research center has reached 18 companies\nFacebook\nTwitter\nEmail\nAlain Louchez, managing director of Georgia Tech’s Center for the Development and Application of Internet of Things Technologies housed at GTRI, presents to researchers at Center of Innovation in Internet of Things in Guadalajara, Mexico.\nJan 27, 2017\n— Atlanta, GA\nThe Center for the Development and Application of Internet of things Technologies (CDAIT) continues to expand in membership and impact.\nSince launching in 2014, CDAIT has grown from three founding members to eighteen, including the following companies from the United States, Asia, Australia and Europe:\nAIG\nAmazon\nAT&T\nBrambles\nCisco\nComcast\nCorning\nFlex\nGlobal Payments\nIBM\nInfor\nLandis+Gyr\nMerial (Boehringer Ingelheim)\nSamsung\nStanley Black & Decker\nVerizon\nVMware Airwatch\nWipro\nThe center, dedicated to Internet of Things (IoT) interdisciplinary research, education and industry outreach, has also grown in influence.\nA “green paper” released on January 12 by the National Telecommunications and Information Administration (NTIA) at the U.S. Department of Commerce titled “ Fostering the Advancement of the Internet of Things ” included input from CDAIT’s managing director, Alain Louchez. Reviewing the nature of IoT, the study  quoted Louchez as saying, “Of all the many facets of the Internet of Things as it is understood today, the one single groundbreaking element is not the connectivity… [but] the smartness of things.”\nAlso announced in January, CDAIT was named one of the best IoT blogs/websites by the\nInternet of More Things . CDAIT was commended for providing “informative analysis.”\nIn addition to corporate members, CDAIT has reached out to non-for-profit IoT-focused organizations and signed two memoranda of understanding; the first one with the International Telecommunication Union, a specialized agency of the United Nations and its Study Group 20 - Internet of Things (IoT) and its applications including smart cities and communities; and the second with the Centre of Excellence for Internet of Things of India’s National Association of Software and Services Companies.\nFurthermore, CDAIT’s managing director was recently selected by Instituto Tecnológico y de Estudios Superiores de Monterrey (Guadalajara) as an international advisor to “Centro de Innovación, Desarrollo Tecnológico y Aplicaciones de Internet de las Cosas” (a.k.a. “Center of Innovation in Internet of Things or CIIoT”) after bid approval by the government of Mexico in June 2016.\nAs CDAIT’s influence grows globally, Louchez has been invited to join the distinguished international panel of judges for the\nIoT Global Network\nAwards 2017.\n“These are small steps, but they are important steps,” Louchez said. “These recognitions show that we are having an impact and the world is beginning to take notice. Georgia Tech is a resource for all seeking to innovate in the Internet of Things space, and thanks to the forward-looking and forward-thinking companies and individuals who have joined us, we are having influence on how the Internet of Things will take shape.”\nSo far the CDAIT board members have met four times, with the next meeting scheduled for April. At that meeting, members will receive updates on various IoT-related activities, which are mostly conducted at CDAIT through five working groups that address critical IoT concerns such as education, startup ecosystem, thought leadership, research, and (latest addition) security and privacy.\n“We’re very pleased with the way we have evolved over time,” Louchez said. “Our members are not only providing financial resources, but they also get directly involved, giving along the way a very much needed connection with industry needs and perspectives. Also central to our work is the effective and remarkable support we are receiving from the many institutes and centers across Georgia Tech that are engaged in IoT-related domains.”\nHoused at the Georgia Institute of Technology in the Georgia Tech Research Institute, CDAIT (pronounced “sedate”) is a global, non-profit, partner-funded center located in Atlanta, Georgia, United States, that fosters interdisciplinary research and education while driving general awareness about the Internet of Things. It aims at efficiently identifying, understanding and solving for its sponsors challenges and problems that may arise along the whole IoT value chain. CDAIT bridges sponsors with Georgia Tech faculty and researchers as well as industry members with similar interests.\nAdditional Images\nRelated links\nCDAIT\nIoT Global Network\nBest IoT Blogs\nDepartment of Commerce IoT Report\nContact\nlance.wallace@comm.gatech.edu\nEmail\nlance.wallace@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}