{"text": "New Transplant Technology Could Benefit Patients with Type 1 Diabetes | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNew Transplant Technology Could Benefit Patients with Type 1 Diabetes\nCombining a new hydrogel material with a protein that boosts blood vessel growth could improve the success rate for transplanting insulin-producing islet cells.\nFacebook\nTwitter\nEmail\nJessica Weaver, a postdoctoral researcher in Georgia Tech’s Woodruff School of Mechanical Engineering, holds a multiwell plate containing hydrogels with pancreatic islet cells. (Credit: Christopher Moore, Georgia Tech)\nJun 04, 2017\n— Atlanta, GA\nCombining a new hydrogel material with a protein that boosts blood vessel growth could improve the success rate for transplanting insulin-producing islet cells into persons with type 1 diabetes. In an animal model, the technique enhanced the survival rate of transplanted insulin-producing cells, restoring insulin production in response to blood glucose levels and curing these diabetic animals.\nThe technology could also help patients who must have their pancreas removed because of severe pancreatitis, an inflammatory disease. Using the material and protein combination, the researchers evaluated multiple locations for implanting the islet cell clusters, the first time such a direct comparison of transplant sites has been made.\n“We have engineered a material that can be used to transplant islets and promote vascularization and survival of the islets to enhance their function,” said Andrés García, a Regents’ Professor in the Woodruff School of Mechanical Engineering at the Georgia Institute of Technology. “We are very excited about this because it could have immediate patient benefits if this proves successful in humans.”\nThe research, supported by the Juvenile Diabetes Research Foundation and the National Institutes of Health, was reported June 2 in the journal Science Advances.\nType 1 Diabetes Affects Millions\nAbout 1.25 million Americans have type 1 diabetes, also known as juvenile diabetes, a disease characterized by the body’s inability to produce insulin. To control the disease, patients must frequently test their glucose levels and inject insulin to maintain the proper balance. But some patients suffer life-threatening hypoglycemic episodes, and the disease has other serious health consequences.\nUsing cells from cadavers, doctors have been experimentally transplanting pancreatic islets into humans for decades, but as many as 60 percent of the transplanted islets die immediately because they are cut off from their blood supply and are killed by an immune response due to direct injection into the bloodstream, and those that survive the transplant usually die within several months. In testing done so far, the islets have been placed into the vasculature of the liver, which has significant blood supply – but might not be the ideal location because of the hostile immune environment.\nEngineering a New Solution\nSo García and collaborators, including Georgia Tech postdoctoral researcher and first author Jessica Weaver, set out to engineer a new approach to transplanting the cells. They developed a new degradable polymer hydrogel material used to deliver the cells as they are injected into the body. And they incorporated into the gel a protein known as vascular endothelial growth factor (VEGF), which encourages the growth of blood vessels into the transplanted cells.\n“The transplanted islets need a lot of oxygenation and a connection to the body’s circulatory system to sense the glucose levels and transport the insulin,” noted García, who is also the Rae and Frank H. Neely Endowed Chair in Mechanical Engineering. “In addition to protecting the islets, our engineered material promotes the formation of new blood vessels to nourish the cells.”\nVEGF has been tried before, but in quantities too large, it stimulates the growth of leaky blood vessels that don’t provide long-term oxygenation. Too little VEGF doesn’t grow vessels rapidly enough to maintain the transplanted islets, which are clusters containing hundreds of cells. Without sufficient vasculature in the clusters, the cells in the center don’t survive.\nWeaver used diabetic mice to compare locations in the body where the transplanted cells could be placed. She studied locations in the liver, under the skin, in the mesentery regions near the intestines and in an epididymal fat pad in the abdomen.\nPotentially Treating More Patients\n“We were able to study the transplant sites in parallel and really look at the pros and cons of each to compare the survival rates of the cells in each area,” said Weaver. “Islet cells are very precious because we get so few from each donor. We need them all to survive to help a patient with type 1 diabetes get off insulin.”\nIn the liver location, as many as three donors are now required to get enough transplantable islets to provide glucose control in a single patient. If researchers could reduce the loss of cells, they could one day treat two or even three times as many patients from the limited number of cadaver donors available, García noted.\nEvaluating the Technique\nWeaver studied the animal models for as long as 100 days, and found that the islet clusters transplanted with the hydrogel and VEGF developed many blood vessels and engrafted into their new locations. As expected, the hydrogel material disappeared and was replaced by new tissue which grew around the islets.\nTo track the long-term viability of the islet cells, she used cells with a gene that produces a green luminescence when excited by certain wavelengths of light. By measuring the signal returned from the transplant locations, she was able to determine how many of the cells survived. Introducing a dye into the bloodstream then allowed her to image the growing vasculature around the islets.\nThe abdominal fat pad turned out to provide the most optimal transplant location. In humans, the equivalent structure is called the omentum, a blood vessel-rich region that other researchers are evaluating as an islet transplant location. Should the technique be used in humans, the cells could be placed there laparoscopically in a minimally-invasive procedure. The hydrogel would be injected in liquid form and would polymerize in the transplant site, creating a flexible gel that would conform to bodily structures to improve both blood vessel connections and tissue integration.\nWhat’s Next\nAs a next step, García and Weaver would like to study the technique in larger animals. After that, human clinical trials would be required to show whether the combination of hydrogel material and protein will benefit patients with type 1 diabetes. Ultimately, the researchers hope stem cells might provide a source of islets that could be transplanted without the need of cadaveric donor islets and immune system suppression.\nWeaver, a researcher at the Diabetes Research Institute before joining Georgia Tech, said she was surprised at how well the new technology worked. The imaging provided a clear view of the growing vascular system surrounding the islet clumps.\n“When we first started doing the imaging, I’m pretty sure I screamed the first time I saw it,” said Weaver. “It was so beautiful to see the vasculature. I wasn’t expecting to see such perfect blood vessel growth into the islets.”\nThis research was supported by the Juvenile Diabetes Research Foundation (grant 2-SRA-2014-287-Q-R), the NIH Innovation and Leadership AQ37 in Engineering Technologies and Therapies Postdoctoral Training (grant T90-DK097787-03), and the Ruth L. Kirschstein National Research Service Award (F30AR069472) from the National Institute of Arthritis and Musculoskeletal and Skin Diseases. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the sponsoring organizations.\nCITATION : Jessica D. Weaver, et al., “Vasculogenic hydrogel enhances islet survival, engraftment, and function in leading extrahepatic sites, (Science Advances, 2017). http://advances.sciencemag.org/content/3/6/e1700184\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contacts : John Toon (404-894-6986) (jtoon@gatech.edu) or Ben Brumfield (404-385-1933) (ben.brumfield@comm.gatech.edu)\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}