{"text": "Climate Change: Potentially Good News on Methane and Peat Carbon | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nClimate Change: Potentially Good News on Methane and Peat Carbon\nSoil carbon stored in peat bogs may not convert to greenhouse gasses in the face of global warming.\nFacebook\nTwitter\nEmail\nA plot with enclosure at the SPRUCE peat bog climate change experiment in northern Minnesota. Credit: Georgia Tech / Ben Brumfield\nDec 13, 2016\n— Atlanta, GA\nScientists studying large, ancient carbon deposits in northern peat bogs to see if climate change might push them to emit methane, have discovered that they might not. The surprising result of a new study may be an early indicator that there is one less potentially large source of a powerful greenhouse gas in Earth’s future.\nThe researchers’ findings are early results from a long-range experiment and will need to stand the test of time and further study.\nScientists from\nFlorida State University , the University of Oregon, the Georgia Institute of Technology, Oak Ridge National Laboratory and the USDA Forest Service Northwest Station published a paper with the findings on Tuesday, December 13, 2016, in\nthe journal  Nature Communications .\nNightmarish hypothesis\nAs global warming progresses, a hypothesis has held that methane may rise into the atmosphere from ancient layers of dead peat in cold, northern bogs to make climate change even worse.\nThese underground carbon stores have built up for some 10,000 years, and hold about 30 percent of Earth’s total 1,500 billion tons of organic soil carbon. That total is as much carbon as is currently in Earth’s atmosphere.\nScientists have feared climate change may lead microbes to digest the carbon stores and belch out carbon dioxide, and also methane, a particularly potent greenhouse gas that traps about 45 times as much heat as carbon dioxide. That would significantly exacerbate global warming.\nBut these latest results appear to allay those fears, should the findings hold up over time.\nEcological conditions in boreal peat bogs have helped create these underground carbon stores by allowing peat moss, or\nSphagnum , and other plants to absorb more greenhouse gasses from the atmosphere than the rest of the bog ecosystem emits. But that could change, if rising temperatures boost greenhouse gas emissions, and the bogs could switch from sinks to sources or lesser sinks.\nMORE PHOTOS: Press handouts, all rights free for reporting on this project.\nTo get a picture of possible greenhouse gas consequences, the U.S. Department of Energy is\nmethodically heating parts of a bog in northern Minnesota for a 10-year period\nto mimic various climate change scenarios. The experiment is called the\nSPRUCE\nproject, which stands for Spruce and Peatland Responses Under Climate and Environmental Change.\nFindings from the experiment should not be confused with those from studies of thawing permafrost, which contains soil carbon with different potentials for producing methane.\nPleasant surprise\nAfter about the first year of heating bog plots, methane emissions did rise significantly, but they came from the thinner layer of peat at the bog’s surface. They did not come streaming out of the massive layers of deep peat soil carbon as had been hypothesized.\nThat came as a pleasant surprise to the scientists, including Georgia Tech’s Joel Kostka, a microbiologist studying the activity of microbes in the carbon cycle at SPRUCE.\n“If the release of greenhouse gasses is not enhanced by temperature of the deep peat, that’s great news,” Kostka said, “because that means that if all other things remain as they are, that the deep peat carbon remains in the soil.”\nTo mimic what was observed in the field, University of Oregon researchers tested deep peat under anaerobic conditions in the lab, and it tenaciously hung on to its solid carbon.\nQuiet microbes\nKostka, a professor at Georgia Tech’s\nSchool of Biological Sciences\nand\nSchool of Earth and Atmospheric Sciences , and postdoctoral assistant Max Kolton also heated samples to check for corresponding activity by microbes called methanogens that are known to produce methane under anaerobic conditions. The results will be submitted for future publication, but they add interesting depth to the current published results.\n“We took ancient peat out from different depths, incubated it in the lab, and at one to two meters’ depth, we saw very few changes in microbial activity and little methane coming out,” Kostka said. That concurred with the profiling of methanogen DNA in samples taken on site at SPRUCE in the deep peat, results that were published in the current paper.\nBut what makes the solid carbon in deep peat in boreal wetlands apparently so stable? Kostka and SPRUCE colleagues are researching to find out.\n“Is it mainly because it’s wet, and therefore there’s not much oxygen in the soil? Is it because it’s acidic?” Kostka asked. “Is it because it’s cold? Or is it, in large part, because of organic matter recalcitrance, meaning the type of carbon that is produced by the peat moss actually poisons microbial activity? Right now our hypothesis is it’s the last one.”\nA potentially nasty caveat\nEven with that good news, a rise in methane coming from top layers of peat could someday be harmful to Earth’s climate, if it’s more than a passing phenomenon. “That could contribute to climate change because methane has such a high warming potential,” Kostka said.\nLab experiments confirmed the rise in surface layer peat methane emissions observed at SPRUCE.\n“In the lab, our colleagues at the University of Oregon measured more methane at higher temperatures from the surface peat,” Kostka said. In the field, Kostka and Kolton also found a high number of genetic fragments associated with methane-producing enzymes in that upper layer of peat, corroborating methanogen microbes as the source of the methane.\nIt’s too early to tell if those emissions will continue and what net effect they will have. Scientists working at SPRUCE will glean more insights into warming’s possible generation of methane and also CO 2\nin northern bogs, as the 10-year experiment progresses.\nSPRUCE’s findings will be factored into computational climate simulations to increase their scope.\nREAD: Comprehensive background article on SPRUCE including Kostka’s work on the project\nAuthors of the research paper included: R.M. Wilson and J.P. Chanton from Florida State University; A.M. Hopple, L. Pfeifer-Meister and S.D. Bridgham from the University of Oregon; M.M. Tfaily from the Pacific Northwest National Laboratory; S.D. Sebestyen and R. Kolka from the USDA Forest Service; C.W. Schadt, L.A. Kluber, N.A. Griffiths and P.J. Hanson from Oak Ridge National Laboratory; C. Medvedeff and J.K. Keller from Schimd College of Science and Technology; and T.P. Guilderson from Lawrence Livermore National Laboratory. The research was funded by the U.S. Department of Energy (contracts DE-AC05-00OR22725, DE-SC0012088, DE-SC0008092, DE-SC0012088).\nAny opinions, findings and conclusions or recommendations expressed in this material are those of the author(s) and do not necessarily reflect the views of the sponsoring agencies\nAdditional Images\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}