{"text": "Saying Green Goodbyes: Sustainability & Student Support in Move-Out | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nSaying Green Goodbyes: Sustainability & Student Support in Move-Out\nThis spring Georgia Tech Housing and Residence Life is launching a new program encouraging donation of unwanted items.\nFacebook\nTwitter\nEmail\nMay 02, 2021\n— Atlanta, GA\nEach year as residents move out of campus housing, dumpsters fill with unwanted items that go to landfills. This spring Georgia Tech Housing and Residence Life is launching a new program to help combat needless dumpstering to ensure that no reusable item — or the opportunity to find new life for it — goes to waste.\nThe Green Goodbyes program will make it easier for students to donate items like clothing and household goods rather than throw them away. The impact of this effort will be measured not just in waste diverted from landfills, but also in the number of students who will benefit from donated items in the future. To highlight the potential value of this sustainability effort, two of the program founders sat down to discuss their views on how Green Goodbyes will amplify Georgia Tech’s impact.\n---\nSteve Fazenbaker is the director of the STAR (Students’ Temporary Assistance and Resources) program, which secures resources for students who are in need.\nThiago Esslinger is a third-year undergraduate student (BioChem/EAS). He currently works as the residential sustainability engagement assistant with Housing and Residence Life, where he leads the EcoReps sustainability ambassadors program.\nSteve Fazenbaker:  What got you interested in the Green Goodbyes program?\nThiago Esslinger:  I got involved through my job with Housing, and it’s one of those things I am passionate about.  I feel like we have this generic mindset that trash and waste need to be discarded in a linear fashion. That is the mindset I want to help change, and I think with our Green Goodbyes move-out program we can provide alternatives to on-campus residents’ end-of-semester waste. For some, this will be a new opportunity to divert their dorm waste, and for all, this is an opportunity to increase their personal awareness of the life cycle of purchased goods. Just because you’ve thrown away your trash doesn’t mean it’s gone forever. In fact, it usually contributes to pollution elsewhere.\nSF:  One of the biggest things that motivated this program was people throwing away things like microwaves and refrigerators because, apparently, it's cheaper to throw your refrigerator in a dumpster in the spring and buy another one in the fall than it is to ship it home or store it somewhere. And that is true waste.  So, if we can recover those things, they can still be used. That is far better than putting it in a landfill and then making another one.\nTE: And I think that is something I have seen grow in terms of awareness: the sustainability-mindedness of students. Yet, I don't know if that's just because I've become more involved in this space or if there really is a general attitude shift. I'm curious to hear how it was when you were a student at Georgia Tech.\nSF: Yes, back in the 1980s.  It was a very different time.\nTE: Was there a move-out program then and, if so, how was it different?\nSF: There was nothing like this back then. Everybody just packed their stuff up and took it home and that was it.\nTE: During your time at Tech, how did this program get started and how have you seen it grow? And how do you see it continuing to grow?\nSF: I see this program as another manifestation of this idea that everything you need to succeed at Georgia Tech is somewhere at Georgia Tech. I also work with Klemis Kitchen, the food pantry on campus, and many students will come to me and say, “I've got enough food to get through 11 out of 14 days. I get paid every two weeks and I can make it about 11 days, so I'm not really sure that I qualify for this program.” But my response is always that it is better for the student to take food that's going to end up in the landfill than to let it go into the landfill. And a lot of the food that we have in Klemis Kitchen is food that's recovered from the dining halls.\nI think we need to build that mindset into our society and into the way we function because there seems to be a belief that if it's repurposed it's not as good as something new, and that’s just not true. I mean, this stuff is here, and it is available, and there's no reason for anybody to go without. And there's no reason to be filling the landfills with it. I think the two things work together, and that's what excites me about this program. It ties into that mindset that there are more than enough resources available for everybody to get everything they need at Georgia Tech.\nTE: I admire your vision of what Georgia Tech has to offer, and this approach of providing for our students while diverting from the landfill. What excites me about this program is the idea that it is going to be associated with the fall rummage sale and students today can give to students tomorrow. It circles back to the idea you were discussing of repurposing items.\nSF: When we started working on this in Fall 2019, my little quip was it's not a flea market. It's a free market because we're not allowed to sell.\nTE:  In addition, we need to make sure our work encompasses and fulfills all three pillars of sustainability (environmental, economic, and social). Even when you think about Georgia Tech's recent endorsement of the United Nations Sustainable Development Goals and what those are, one of them is “zero hunger.” I think it’s pretty encouraging to see that we are making those changes on campus, and I really do hope more students can see that sustainability includes environmental action, but it is also so much more. You can still support the environment by supporting people, and I feel like that's the part that's not talked about a lot.\nSF:   We set a bar as to how much it costs to go to college, for example. And if your financial resources are under that bar then you fall into this “low-income” category. But that cost assumes brand new clothes, brand new refrigerator, and brand new microwave. If we start looking at stuff that we can re purpose and share, then the bar actually drops, so the definition of “low income” gets massaged a little bit.\nA perfect example of that is the Campus Closet. When the project started, it was to help low-income students have professional attire to wear to interviews and career fairs. As the closet became populated with professional attire, soon we had enough that every student at Georgia Tech is able to borrow out of there and return it. You don't have to be “low income.” There are more than enough resources in the Campus Closet to serve every single student on campus. It has nothing to do with being classified in any kind of socioeconomic status. There are some students who showed up at Georgia Tech and never had to wear a suit before and so it wasn't on their list of things to bring to school. Campus Closet is a perfect micro example of this idea of resources being available to everybody in the community.\nTE: One thing I have noticed about initiatives— like our Green Goodbyes move-out program, for example —is that one of the hardest parts is getting the message out and getting people to listen to it. How have you seen engagement evolve, especially during the pandemic?\nSF: I have noticed that the best approach to getting folks to buy in is offering them a chance to be helpful. When I first moved into this role, I would talk about resources for under-resourced students. That was the main message. Nine times out of 10, students’ eyes glaze over, and they’d say, “I'm not under-resourced, I'm never going to be under-resourced, so I don't need to know anything about this.” Then we shifted our marketing to, “You may not need it. You may never need it, but you're going to meet somebody who does, and we need you to know this so that when you meet the person who needs it, you are able to point them in the right direction.” And that led to students asking to volunteer, which has moved us into our current program. I'm really looking forward to being back in person in the fall so we can really develop that aspect of it.\nWe're not divided into the helpers and the helped, but we are all helping. We're all working together to take care of ourselves, and we're working to take care of the community.  The resources are there to get us through those times when we need a little bit beyond what's in our personal wheelhouse, but the goal is to get back into our wheelhouse and to start helping the other folks when they need a hand. That's how we move forward together.\nTE: I love the part about helpers versus those being helped. Specifically, I think that's something I can relate to in environmentalism. I often don't like calling people or being called an environmentalist because I think it puts us in a box and gives the impression that you either act for the environment or you can't do anything, and that’s just not true. We need to let people know that they can still take some actions here and there, and if everyone had imperfect environmentalism, so much change could happen. That’s something that is not often recognized or appreciated.\nWith the Green Goodbyes program, I think about the residents who may donate half of their items and the residents who may donate everything, in addition to the residents who see this program and aren’t sure if they can participate in it. Our outreach, however, not only helps get the word out for the program and let people know that we want everyone’s help, but hopefully also contributes to the growing environmental awareness of our residents. Labels can sometimes be limiting, and these programs are meant for everyone! It is just so heartwarming to know that our donations not only divert waste, but also provide for others.\n-----------------\nItems donated through Green Goodbyes will be available to students during Fall Week of Welcome activities – look for information about the Green Good “Buys” No-Cost Market later this summer.\nMore information and opportunities to volunteer for the Green Goodbyes move-out program are available on the  Housing Sustainability page . Information about Georgia Tech’s programs that support students in need is available at on the  STAR Services page .\nAdditional Images\nContact\nMalte Weiland malte.weiland@aux.gatech.edu\nEmail\nmalte.weiland@aux.gatech.edu\nAdditional information\nDrop locations will be available from May 3–9. For more information, visit\nhousing.gatech.edu/sustainability\n.\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}