{"text": "Research On Large Storm Waves Could Help Lessen Their Impact On Coasts | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nResearch On Large Storm Waves Could Help Lessen Their Impact On Coasts\nAn international team of researchers has analyzed months of data of large nearshore waves to provide new insights that could help improve the designs of a variety of coastal structures from seaports to seawalls to better withstand destructive waves.\nFacebook\nTwitter\nEmail\nWaves crashing against the Irish coast. (Credit: Frederic Dias)\nOct 28, 2019\n— Atlanta, GA\nWhen cyclones or other massive oceanic storms make landfall, their giant waves batter coastlines and sometimes cause widespread damage.\nNow, an international team of researchers has analyzed months of data of large nearshore waves to provide new insights that could help improve the designs of a variety of coastal structures from seaports to seawalls to better withstand destructive waves.\nIn the study published October 28 in the journal\nScientific Reports , the researchers report combining a mathematical model to describe the formation of large waves with real-world measurements taken in shallow waters just off of the coast of Ireland, where waves have been reported to hit the shore with enough force to move 100-ton rocks.\n“In this work we have analyzed real data in order to show that, over the course of several months measuring different storm events, we find that the extreme waves that we have observed in the coastal data tend on average to be smaller than the rogue waves we have observed in deep water, but they have similar characteristics,” said Francesco Fedele, a associate professor in the Georgia Tech School of Civil and Environmental Engineering.\n“These large nearshore waves are still caused by constructive interference – the effect of waves coming in all different directions and basically meeting at one point and piling up to form a large wave, and by second order nonlinearities that distort the sinusoidal shape of waves to have sharper crests and shallower troughs ” Fedele said.\nThe research team also included M. Aziz Tayfun, professor emeritus from Kuwait University, Frederic Dias, a professor at the University College Dublin, and James Herterich, a postdoctoral associate, aksi at the University College Dublin.\nIn the study, which was sponsored by Science Foundation Ireland, the researchers analyzed measurements captured by an acoustic doppler current profiler (ADCP) device that was deployed for several months on the ocean floor off Killard Point during Spring 2015 and off the Aran Islands during Spring 2017. During that time, the device was able to capture data from two intense storm events that produced large coastal waves.\nThe more recent storm, Doris, which hit the Irish coast in February 2017, produced waves as tall as 43 feet from peak to trough, and the earlier storm in 2015 caused waves even taller, as high as 73 feet, according to the measurements from the ADCP, which works by emitting sound pulses and measuring the strength of sounds bouncing off of floating particles to calculate the height of the water.\nThe researchers used that data to compare with the Tayfun-Fedele and Boccotti statistical models used to explain rogue ocean waves that occur in much deeper water. Those models were used in an analysis of the two famous real-world rogue waves, Andrea and Draupner, observed at oil platforms in the North Sea in 1995 and 2007, as well as the Killard rogue wave observed off the coast of Ireland in 2014.\n“We were able to extend these statistical models, which are largely validated for waves in deep waters, to describe coastal rogue waves,” Fedele said.\nComparing the simulated wave profiles of the deep-sea rogue waves and the wave profiles generated by the data collected for the nearshore waves showed a similar profile for all, suggesting that the nearshore waves a generated much in the same way as the deep water ones, Fedele said.\nBut for nearshore waves, the breaking of the waves bleeds away some of their energy, he said.\n“Once you get into shallow waters, the enhanced nonlinearities make waves less dispersive and the tendency for waves to break intensifies.,” Fedele said. “A lot of the energy is dissipated forming white caps that crash against the shore.”\nThe research could provide an underpinning for designs of coastal structures that are built to withstand the forces of waves over time.\n“For people who want to design coastal structures, you need to know what’s the largest wave that will break in a coastal area over the lifetime of the structure – what’s the largest wave out of however many millions of waves or more that will happen,” Fedele said. “And once you have this knowledge using these statistical methods, you can design the structure to withstand the highest wave.”\nFedele said the next steps of the research would involve studying more about the physical mechanics of the point when waves break, either against the shore as in the case of coastal waves, or when deep sea rogue waves break out in the open water.\nThis material is based upon work supported by the Science Foundation Ireland. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the sponsors.\nCITATION : Francesco Fedele, James Herterich, Aziz Tayfun, and Frederic Dias, “Large nearshore storm waves off the Irish coast,” ( Scientific Reports , 2019).  http://dx.doi.org/10.1038/s41598-019-51706-8\nAdditional Images\nContact\nJohn Toon\nResearch News\nEmail\njohn.toon@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}