{"text": "How a wedding engagement changes Twitter feeds | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nHow a wedding engagement changes Twitter feeds\nOnline personas change after people announce their wedding engagement on Twitter.\nFacebook\nTwitter\nEmail\nA Georgia Tech study discovers that people change their online persona after they announce their engagement on Twitter.\nFeb 13, 2015\n— Atlanta, GA\nA researcher at the Georgia Institute of Technology has used Twitter as a lens to look into the lives of nearly 1,000 people who used the site to announce their wedding engagement. By comparing tweets before and after, the study was able to determine how people changed their online personas following the proposal. Some differences were split along gender lines. Others identified how people alter the words they use on Twitter after they are engaged. The study followed 923 people who used “#engaged” to announce in 2011. The research team then looked at each person’s tweets in the nine-month period before the engagement and 12 months afterward (2 million total tweets). They were also compared to a random sampling of tweeters during the same time frame (12 million tweets). After people got engaged, tweets with the word “I” or “me” dropped by 69 percent. They were replaced with “we” and “us.” There was barely any change within the control group. “People began to paint themselves as a couple, rather than as individuals,” said Munmun de Choudhury, a Georgia Tech assistant professor in the School of Interactive Computing who led the study. “They’re going through a major change in life, and it shows on social media as they adapt to society’s expectations of their marital identity.” Similarly, tweets using familial words such as “future-in-laws” and “children” jumped by 219 percent after the proposal (although men tended to wait until after marriage to tweet family-based words). The study also noticed that men and women gush about each other differently. The most frequent terms used by females when tweeting about their significant other were tied to emotion (for example, they “love” their  “wonderful” fiancé). Men are more likely to use physical descriptors such as sexy, beautiful or gorgeous when talking about their fiancée.    De Choudhury and co-author Michael Massimi also noticed that engaged people are much more likely to think and tweet about the future. Instead of using past-tense verbs, future-tense verbs surged by 62 percent after engagement. “People are more likely to post that they ‘are going on a date night tonight’ rather than tweeting that they already did so,” said Massimi, a former postdoctoral fellow at Microsoft Research Cambridge. “They’re looking forward to the future in their real lives and boasting about it on social media too.” This is the first empirical study of engagement in social media. It centered on the anthropological concept of liminality – a phase people undergo when they transition from one role in society to another. “Twitter can be a powerful tool that can mirror our thoughts and how we’re actually feeling,” said de Choudhury, who has done similar social media studies on mothers and postpartum depression. “This isn’t based on what they told us they did. It’s a reliable record ­– it’s what they actually did.” The paper, “ She Said Yes!” Liminality and Engagement Announcements on Twitter ,” was accepted and will be presented at\niConference 2015\nin Newport Beach, California, March 24-27.\nAdditional Images\nRelated links\nRomance and social sharing\nRead the study\nContact\nJason Maderer National Media Relations maderer@gatech.edu 404-385-2966\nEmail\nmaderer@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}