{"text": "A Georgia Tech Expert in Afrofuturism Reflects on the 'Black Panther' Phenomenon | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nA Georgia Tech Expert in Afrofuturism Reflects on the 'Black Panther' Phenomenon\n\"Black Panther's\" Princess Shuri can be found at Georgia Tech.\nFacebook\nTwitter\nEmail\nPrincess Shuri, played by Letitia Wright, puts the technologically advanced weapons she helped design and build to use in helping her brother defend the kingdom of Wakanda in \"Black Panther.\" Marvel Films photo\nMar 14, 2018\n— Atlanta, GA\n“ I think Shuri represents not only a possibility model but is also a reflection of what I see every day at Tech: young black women who are curious, intellectual, ambitious, and hard-working,” says Susana Morris.\nBlack Panther\nis an international phenomenon. After nearly a month in the theaters, it has passed the $1 billion mark in global ticket sales and is now ranked as the fifth-biggest superhero film to date globally, according to Forbes. It has sparked discussion online, around dinner tables, and in classrooms around the country on issues ranging from black pop culture, to the legacies of colonialism and racism, to colorism, and the future of cinema. We talk with Susana Morris, an associate professor and expert on Afrofuturism in Georgia Tech’s School of Literature, Media, and Communication, about why the film resonates with black audiences, and why it is important for everyone.\nWhy is this movie important?\nThe phenomenon around\nBlack Panther\ngives the lie to the notion that black films don’t do well. It has just crossed into $1 billion worldwide. It’s been the No. 1 movie in the country since it came out. It had the 10 th -biggest opening weekend. It’s up there with your\nAvatars\nand so on, films that almost everyone has seen. The interesting thing is it’s also gotten a lot of critical acclaim. This is actually a solid film. The director, Ryan Coogler, is interesting. His two previous films were\nFruitvale Station\nand\nCreed.\nOne was an art house film, the other a boxing movie, and he elevated the genre in both. So, I wasn’t surprised when I watched the movie and thought it was good. It also didn’t hurt that the film explores Afrofuturism, which is a big part of the cultural zeitgeist right now.\nExplain Afrofuturism.\nAfrofuturism is a movement that understands blackness as integral to not only understanding the future, but our present and our past. It is concerned with the role of technology as it’s related to race. Think Sun Ra, Parliament Funkadelic, Janelle Monae, Outkast. These are all Afrofuturist musicians who think about what it means to be black in the future.\nBlack Panther\nis a good example of Afrofuturism because it is thinking about what are the tensions between tradition and innovation.\nBlack Panther\nis set in a mythical African nation named Wakanda, where they have all this technology, yet they masquerade as a third world country. Once you pass their façade, they are walking around wearing all this technology on their bodies. Rather than think about African art or African technology as primitive,\nBlack Panther\ninvites us to consider the ways in which technology is integral to the understanding of the African or African-American experience.\nHow does the current political and social climate play into the reception of this movie?\nWe are living in weird, divisive, hard, difficult political times. I’m not a comic book scholar, but I do know they often reflect our politics, our society. If you think about the\nBatman\nmovies of the early 90s, which were very campy and quirky, they say something about the early 90s and late 80s. Heath Ledger’s Joker is very different from Jack Nicholson’s. This imagining of Wakanda, a place that has never been colonized, with all this advanced technology, it’s like a Utopia. But they have these questions about isolationism versus globalism. The film reflects the questions we have in this country today, such as how do we interact with our neighbors? Do we share? What’s our obligation to our fellow human beings? There’s a refugee conversation happening in the movie, there’s a border conversation happening in the movie. These are questions we are asking right now. So, it’s absolutely connected. And it’s interesting that black people are at the center of that conversation.\nThe movie touches on many controversial themes: slavery, colonialism, colorism. How were the filmmakers able to broach such difficult subjects while keeping the film approachable to a mass audience?\nI think\nBlack Panther\ndoes this in a few important ways. One, it is able to discuss controversial issues by showing contrast. Because Wakanda has not experienced slavery, colonialism, or colorism, the audience can see the possibilities of what Africa might have been (and could become) without the legacy of these social ills. The film’s antagonist also explicitly voices the consequences of Wakanda’s isolation, and the audience has to weigh the role of Wakanda’s success (and its decision to not help other nations) and its isolation. The film also tackles controversial themes through humor, which both teaches and disarms. Characters such as Shuri, a tech whiz kid and princess, and M’Baku, leader of an opposing tribe in Wakanda, cut the seriousness in key moments to invite the audience in to laugh at the absurdities of stereotypes.\nIn addition to the strong male characters played by Chadwick Boseman (T’Challa/Black Panther) and Michael B. Jordan (Erik Killmonger),\nBlack Panther\nalso features a number of strong black female characters.\nYes, you have the elite fighting team, the Dora Milae. Their general is a woman. The queen mother is an important figure. You have Shuri, who is 16 years old and who does all the tech for the country. These women are bad asses, and they are intellectuals, and they are regular people, and they are important. It’s a society where women are fully integrated, and they don’t have to be a princess to be important.\nSocial media has been flooded with images of kids wearing costumes from the film, mimicking fighting poses and so on. The film really made a mark with a lot of young kids and their parents, hasn’t it?\nIt’s very important, especially to combat some of the stereotypes that often go with black characters in movies: the black character being killed first, being villains, not having speaking roles. Black women often don’t show up at all, or are expected to be hyper-sexualized. To have characters that are nuanced —even the antagonist, who part of the time you may be rooting for — it’s important for black people to see themselves that way. It’s not that you can’t see yourself as a character played by a white actor, but after a while, all those representations, along with the negative representations, become disheartening.\nA character like Shuri also has to be a great model to young women, especially African-American women, thinking about getting into tech fields. What would you say to a young woman thinking about coming to Georgia Tech to study a technology field, maybe even in your own department? What sets Tech apart from other schools?\nI think Shuri represents not only a possibility model but is also a reflection of what I see every day at Tech: young black women who are curious, intellectual, ambitious, and hard-working. They like to tinker and create, and they are building a dynamic future in fields from engineering, to medicine, to technical writing, and more. Tech is filled with many Shuris.\nSusana Morris, a professor in the School of Literature, Media, and Communication in the Ivan Allen College of Liberal Arts, specializes in Afrofuturism, Black Feminism, and Black Digital Media. She also is the co-founder of the popular feminist blog, The Crunk Feminist Collective.\nAdditional Images\nContact\nlance.wallace@comm.gatech.edu\nEmail\nlance.wallace@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}