{"text": "REMEMBERING OURSELVES | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nREMEMBERING OURSELVES\nMemories are essential for survival; understanding how the brain keeps these records is critical.\nFacebook\nTwitter\nEmail\nMay 10, 2018\n— Atlanta, GA\nThrough viewing vacation pictures, we can relive the scorching heat of the sand on the beach, the smell of sun block slathered all over our skin, and the cool breeze kissing our face as we take lazy bicycle rides just when the sun is disappearing from the horizon. Vacation pictures might also remind us of details that have nothing to do with a specific experience. For example, the picture of the bicycle ride might remind me that dusk is my favorite time of day.\nThese reminiscences are called autobiographical memories. They can be episodic, referring to experiences of events, or semantic, referring to personally relevant information that transcends any specific event.\n“Autobiographical memories are the mind’s record of our daily life,” says\nThackery Brown , an assistant professor in the School of Psychology. “These memories help define the very nature of who we are. Knowing how these distinct memories are processed differently across the brain can help us understand why we remember – or fail to remember – our lives with different degrees of detail.”\nIn a recent study published in\nScientific Reports , Brown and others advanced our understanding of autobiographical memories. Using brain imaging and an innovative memory test using images from people’s actual lives, they have shown that different regions of the brain process episodic and semantic autobiographical memories differently.\nThe findings open a window into the brain processes that give rise to memories with different degrees of detail. “This knowledge can help us understand what memory impairments to expect from different types of brain damage,” Brown says. “They advance our understanding how factors such as aging and disease can affect what we remember from our lives,” Brown says. “For example, when aging impacts some areas of the brain more than others, our ability to remember facts from our lives in a general way could be left intact, but our ability to vividly relive details of an experience could be impaired.”\nThe findings may have other relevance, such as in the use of neuroscience methods in lie detection or in evaluating the accuracy of courtroom testimony.\n“To study how memory works – and to ask questions like ‘How vivid is a memory?’ – our lab and others use tools from computer science and machine learning to get a read-out from patterns of brain activity  for signatures of the type of information people are remembering,” Brown says. “But these techniques have limitations, which we need to understand before they are used to, for example, support a criminal conviction.”\nIn fact the findings suggest that the ability to discriminate between semantic (dusk is my favorite time of day) and episodic (the sand was scorching that particular day on the beach) memories may be limited. “However, our work identifies areas of the brain where this distinction can be made,” Brown says. “Therefore, this study helps focus our lens on the brain regions where the different types of memories be teased apart with brain imaging.”\nINNOVATIVE EXPERIMENTAL DESIGN\nAccording to Brown, many laboratory studies of memory are limited in their ability to reveal the brain processes involved specifically in autobiographical memories because they require participants to create memories in the laboratory from experimental stimuli -- such as pictures, words, or sounds on a computer. How the brain processes these relatively simplistic and synthetic experiences may be different from how the brain handles detailed, real-world personal experiences that have personal significance to the participant.\nBrown and coworkers took a different approach. They combined brain imaging with memory tests using images of events from people’s lives that were captured by wearable camera technology.\nParticipants wore digital cameras around their necks for three weeks. During that period, the cameras automatically captured photographs when people were active. Then brain activity was measured by functional magnetic resonance imaging while participants made memory judgments about the photographs taken by the cameras they wore.\nThe experimental design allowed Brown and his colleagues to figure out which brain regions are involved in recognizing personal images and which ones enable people to remember events from their lives with different degrees of detail – that is, remembering personal facts (semantic) or remembering experiences as detailed events (episodic).\nWHY MEMORY RESEARCH\nThe ability to form and retrieve memories is essential for survival. “We flexibly draw on memories of our experiences to avoid repeating past mistakes and to plan for the future,” Brown says. “When memory fails, we may find ourselves hopelessly lost in the city streets, incorrectly planning an event, or even providing incorrect information to a jury.”\nAn overarching goal of Brown’s research is to understand the neural mechanisms that support human memory and goal-directed behavior and that enable avoidance of such errors. The recent study shows how memories can vary in specificity and detail.\n“We show that not all autobiographical memories are created equal,” Brown says. “From prior research, we know that knowledge of non-personal facts can be spared in many cases of amnesia. One future direction is to study when memory for personal facts can rely on brain systems that are different from those associated with amnesia and diseases like Alzheimer’s. Knowing those circumstances could tell us more about what memories could be spared.”\nAnother question is whether some forms of autobiographical memory are more susceptible to errors than others. When are we more likely to misremember someone else’s story as our own?\n“Data from our current study suggest that memory for both personal facts and experiences are resistant to being confused with other peoples’ facts or events,” Brown says, “but systematic work examining this issue is needed.”\nAdditional Images\nContact\nA. Maureen Rouhi, Ph.D.\nDirector of Communications\nCollege of Sciences\nEmail\nmaureen.rouhi@cos.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}