{"text": "When Firms Move to Appoint Sustainability Executives, Investors Take Notice | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nWhen Firms Move to Appoint Sustainability Executives, Investors Take Notice\nResearchers have studied the stock price impact of appointing corporate sustainability executives.\nFacebook\nTwitter\nEmail\nA new study examines the impact on companies that appoint corporate sustainability executives (CSEs). (Getty Images, not for republication)\nFeb 25, 2020\n— Atlanta, GA\nIn the past two decades, executives responsible for corporate sustainability (CSEs) have been showing up in a growing number of C-suites across the globe.\nThese executives are charged with implementing business practices that reduce a corporation’s negative impact on the environment and society while promoting initiatives that have a positive effect.\nWhile efforts to rein in unsustainable practices may in some cases lead to cost savings or other efficiencies, it turns out that investors have mixed reactions to the appointments of CSEs.\nIn a study published in December in the\nJournal of Operations Management , researchers at the Georgia Institute of Technology and University of Massachusetts Amherst found that in some situations, CSE appointments had a positive impact on stock prices. In other cases, it was less positive.\n“One of the biggest questions we had was whether the strategy of appointing CSEs is valued by investors,” said\nRavi Subramanian , associate professor in Georgia Tech’s\nScheller College of Business . “What we have found is that, in certain scenarios, there’s support for this strategy.”\nTo explore the question, the researchers identified 315 announcements of appointments of senior sustainability executives at U.S. corporations between 2000 and 2018 and subsequently narrowed that sample to 115 announcements that were not confounded by other events that could have affected stock prices.\n“On average, the hiring of CSEs has no discernable effect on stock prices,” said\nVinod Singhal , Charles W. Brady Chair and professor in the Scheller College. “However, we were able to identify certain scenarios where the data showed that such appointments could have a positive impact on stock prices.”\nThe first was for firms that in the prior year had experienced an adverse sustainability-related incident. The second scenario was when the announcement included specific and focused job responsibilities for the hire.\n“When a firm has an adverse sustainability-related incident, such as a chemical spill or an accident that results in death or significant property damage, it raises a clear question in investors’ minds about whether the company has a commitment to sustainable practices and, importantly, whether that company can be expected to have greater financial liability in the future,” said\nManpreet Hora , associate professor in the Scheller College. “Hiring a CSE signals that the company is taking that responsibility more seriously.”\nFor the second scenario, when a firm’s announcement of a CSE appointment has more specific details about that role’s responsibilities, the researchers said it could help alleviate concerns that the move is simply “greenwashing.”\n“When firms are more specific about the role of the CSE appointee, it shows that they’ve identified a clearer path to becoming more sustainable and it also helps reduce uncertainty among investors about some of the technical and managerial complexities involved with integrating sustainability objectives within the firms’ operations,” Subramanian said.\nMeanwhile, the researchers also found that in one situation – for firms in heavily fined industries – appointments of CSEs had a less positive impact on stock prices.\n“We suspect that for such industries, it’s harder to convince investors that this type of appointment is going to make a real difference, even if it’s well intentioned,” Hora said.\nCITATION : Priyank Arora, Manpreet Hora, Vinod Singhal, and Ravi Subramanian, “When Do Appointments of Corporate Sustainability Executives Affect Shareholder Value?” ( Journal of Operations Management , Dec. 8, 2019).\nhttp://dx.doi.org/10.1002/joom.1074\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : John Toon (404-894-6986) (jtoon@gatech.edu).\nWriter : Josh Brown\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}