{"text": "Methane-Munching Microorganisms Meddle with Metals | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMethane-Munching Microorganisms Meddle with Metals\nA pair of microbes on the ocean floor “eats” methane in a unique way, and a new study provides insights into their surprising nutritional requirements.\nFacebook\nTwitter\nEmail\nDr. Jennifer Glass, Assistant Professor, School of Earth and Atmospheric Sciences at Georgia Tech. Credit: Rob Felt\nNov 11, 2013\n— Atlanta, GA\nOn the continental margins, where the seafloor drops hundreds of meters below the water’s surface, low temperatures and high pressure lock methane inside ice crystals. Called methane hydrates, these crystals are a potential energy source, but they are also a potential source of global warming if massive amounts of methane were released during an earthquake or by rising ocean temperatures.  A pair of cooperating microbes on the ocean floor “eats” this methane in a unique way, and a new study provides insights into their surprising nutritional requirements. Learning how these methane-munching organisms make a living in these extreme environments could provide clues about how the deep-sea environment might change in a warming world. Scientists already understood some details about the basic biochemistry of how these two organisms consume methane, but the details of the process have remained mysterious. The new study revealed that a rare trace metal – tungsten, also used as filaments in light bulbs — could be important in the breakdown of methane.\n“This is the first evidence for a microbial tungsten enzyme in low temperature ecosystems,” said Jennifer Glass, an assistant professor in the School of Earth and Atmospheric Sciences at the Georgia Institute of Technology. The study was recently published online in the journal\nEnvironmental Microbiology . The research was sponsored by the Department of Energy, NASA Astrobiology Institute and the National Science Foundation. Glass conducted the research while working as a NASA Astrobiology post-doctoral fellow at the California Institute of Technology, in the laboratory of professor Victoria Orphan.\nThe methane-eating organisms, which live in symbiosis, consume methane and excrete carbon dioxide.\n“Essentially, they are eating it,” Glass said. “They are using some of the methane as a carbon source and most of it as an energy source.” Phylogenetically speaking, one microbial partner belongs to the Bacteria, and the other is in the Archaea, representing two distinct domains of life. The archaea is named ANME, or anaerobic methanotrophic archaea, and the other is a sulfate-utilizing deltaproteobacteria. Together, the organisms form “beautiful bundles,” Glass said.\nFor a close-up view of the action on the sea floor, the research team used the underwater submersible robot Jason. The robot is an unmanned, remotely operated vehicle (ROV) and can stay underwater for days at a time. The research expedition in which Glass participated was Jason’s longest continuous underwater trip to date, at four consecutive days underwater. The carbon dioxide excreted by the microbes reacts with minerals in the water to form calcium carbonate. As the researchers saw through Jason’s cameras, calcium carbonate has formed an exotic landscape on the ocean floor over hundreds of years. “There are giant mountains on the seafloor of calcium carbonate,” Glass said. “They are gorgeous. It looks like a mountain landscape down there.” While on the seafloor, Jason’s robotic arm collected samples of sediment. Back in the lab, researchers sequenced the genes and proteins in these samples. The collection of genes constitutes the meta-genome of the sediment, or the genes present in a particular environment, and likewise the proteins constitute a metaproteome. The research team discovered evidence that an enzyme used by microbes to “eat” methane may need tungsten to operate. The enzyme (formylmethanofuran dehydrogenase) is the last in the pathway of converting methane to carbon dioxide, an essential step for methane oxidation.\nMicroorganisms in low temperature environments typically use molybdenum, which has similar chemical properties to tungsten but is usually much more available (tungsten is directly below molybdenum on the periodic table). Why these archaea appear to use tungsten is unknown. One guess is that tungsten may be in a form that is easier for the organisms to use in methane seeps, but that question will have to be answered in future experiments.\n“We don’t know exactly why the organisms seem to be making a protein that binds the rare element tungsten instead of the more commonly used molybdenum,” Glass said. Glass is currently writing a grant proposal to study a similar process in northern peatlands, which are large expanses of water and dead organic material. These peatlands, found in large expanses of high-latitude Canada, Europe and Russia, are significant sources of methane and that flux may increase with warming temperatures. Glass also plans to expand her research into oxygen-minimum zones, where large amounts of nitrous oxide are produced. Nitrous oxide is an important greenhouse gas and degrades the ozone layer.\n“We want to understand on a gene level and on a chemical level, what’s going on in these processes, and then understand how this is going to change in the future with global warming and rising CO2,” Glass said. This research is supported by the Department of Energy under award number DE-SC0004949, the NASA Astrobiology Institute under award number OCE-0825791, and the National Science Foundation under awards MCB-0348492 and OCE-0825791. Any conclusions or opinions are those of the authors and do not necessarily represent the official views of the Department of Energy or NASA. CITATION : JB Glass, et al. 2013 “Geochemical, metagenomic and metaproteomic insights into trace metal utilization by methane-oxidizing microbial consortia in sulfidic marine sediments,”  (Environmental Microbiology, 2013).\nhttp://onlinelibrary.wiley.com/doi/10.1111/1462-2920.12314/abstract Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contacts:\nBrett Israel (404-385-1933) ( brett.israel@comm.gatech.edu ) or John Toon (404-894-6986) ( jtoon@gatech.edu ) Writer:\nBrett Israel\nAdditional Images\nContact\nBrett Israel 404-385-1933 brett.israel@comm.gatech.edu\nEmail\nbrett.israel@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}