{"text": "Study Examines Diversity in Research Publishing | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nStudy Examines Diversity in Research Publishing\nAnalysis of more than 5 million scholarly articles strengthens the case for diversifying research\nFacebook\nTwitter\nEmail\nThis graphic shows the representation of various racial, ethnic, and gender groups as published authors in various fields. It shows that Latino, Black, and white women are significantly underrepresented as authors in engineering and technology, mathematics, and physics publications and are heavily overrepresented in health fields. (Courtesy Diego Kozlowski/University of Luxembourg)\nJan 10, 2022\n— Atlanta, GA\nScience is often seen as a meritocracy, where the best work rises to the top along with the researchers who shepherd those advances. A new study co-authored by School of Public Policy Chair Cassidy R. Sugimoto tests that premise at the intersection of race and gender and finds cracks in that façade.\nAccording to the study’s bibliometric analysis of more than 5 million articles published between 2008 and 2019 — primarily by U.S.-based researchers — white and Asian male authors exert an outsized influence on the selection of research topics, publish on the broadest range of issues, and are more often listed as first authors. On the other hand, Black, Latino, and women authors are underrepresented in many STEM fields and often appear as authors only in less-cited fields.\n“The compound effect of different citation rates of topics and unequal distribution in topics by race and gender leads to negative effects for marginalized groups and for science itself, as some topics become systematically less studied,” the researchers wrote in their\npaper , which was published Jan. 2, 2022, in the\nProceedings of the National Academy of Sciences (PNAS).\nIn fact, the researchers assert that, had the distribution of authors matched the U.S. population over the last four decades, researchers would have produced 29% more articles on public health, 26% more on gender-based violence, 25% more on gynecology and gerontology, 20% more on immigrants and minorities, and 18% more on mental health.\n“This study highlights the importance of not only expanding gender and racial diversity among researchers in high-impact areas of study, but also promoting research in historically underrepresented areas through increased funding,” said\nSugimoto , the Tom and Marie Patton Chair in the\nSchool of Public Policy .\nThe research is the start of a line of work examining how the scientific enterprise affects — and is affected by — researchers of color, said Thema Monroe-White, an assistant professor at Berry College, a School of Public Policy alumna, and the study’s corresponding author.\n“Our research suggests that for minoritized scholars, what we study is framed by our racialized and gendered identities” said Monroe-White. “This finding pushes against idealized notions of meritocracy in science. Institutions and individual disciplines should take action by amplifying research produced by minoritized scholars, particularly on topics for which they have greater representation yet whose impact remains marginalized.”\nThe authors drew the study’s data from articles indexed in the Web of Science database. Papers with more than 1.6 million first authors were part of the analysis.\nThe researchers used data on the prevalence of last names in various racial and ethnic groups to determine the racial makeup of authors. Instead of assigning author names to the most probable racial or ethnic group, the researchers assigned the names to such groups fractionally. This was done to prevent issues with underestimating the number of Black authors that have cropped up in previous research.\nThey found that while papers with white first authors had the broadest range of topics, those authored by Black, Latino, and women authors were frequently more specialized. For instance, leading topics for black women researchers were “black women violation,” “equality promotion,” and “social identity.” Latino authors were more likely to publish on “racial disparities” and “English-Spanish.”\n“The ubiquity of white men in science and across topics implies that this demographic group has a wider range of possible strategies to follow and an advantage in the way their scientific capital can be invested, reinforcing inequalities in scholarly outcomes,” the authors wrote in the paper.\nThe article, “Intersectional Inequalities in Science,” is available at\nhttps://doi.org/10.1073/pnas.2113067119 .\nThe School of Public Policy is a unit of the Ivan Allen College of Liberal Arts.\nAdditional Images\nContact\nMichael Pearson\nmichael.pearson@iac.gatech.edu\nEmail\nmichael.pearson@iac.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}