{"text": "Engineer’s entrepreneurial passion fuels success in global farming and forestry manufacturing business | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nEngineer’s entrepreneurial passion fuels success in global farming and forestry manufacturing business\nEach month the Georgia Manufacturing Extension Partnership profiles Georgians who play a critical role in the industry.\nFacebook\nTwitter\nEmail\nMark Sauer, president and owner of Savannah Global Solutions, a leading forestry cultivation company in Pembroke, Georgia, launched his first business at 10 years old. Today, his company employs 30 people and has customers in more than 30 countries around the world. Sauer is the Georgia Manufacturing Extension Partnership's June 2016 Face of Manufacturing. (Photo Credit: Katie Takacs)\nJun 23, 2016\n— Pembroke, GA\nNot many businesspeople could lay claim to having launched their first business — while still in grammar school. But at 10 years of age, Mark Sauer convinced his dad to help him finance the acquisition of a tractor, so that he could start a lawn mowing business in his hometown of Schoolcraft, Michigan, a small farming community located 150 miles west of Detroit. “It was my first experience to understand what financing equipment was like, and I had borrowed money to buy a mowing tractor and was very active in the community, mowing as many yards as I could during the summers and going well into fall,” Sauer said. “That was my first foray into small business ownership and being an entrepreneur.” Today, Sauer is still in the farm equipment business, though his customer base has expanded quite a bit from the days of mowing neighbors’ lawns. As owner and president of Savannah Global Solutions, Sauer leads a 30-person company that makes equipment used in the forestry and agricultural industries in soil and site preparation work. Savannah Global has customers in more than 30 countries around the world. Sauer is the Georgia Manufacturing Extension Partnership’s (GaMEP) June Face of Manufacturing. He is one of more than 365,000 men and women who form Georgia’s manufacturing industry, a key segment of the state’s economy. Sauer’s life and career in manufacturing serves as just one example of how those in the industry play an integral part in helping to keep their local communities and the state overall economically competitive. Though tests he took as young man suggested he would be great at a career in forestry, the harsh winters of the Midwest had him considering other possibilities and interests. Having an aptitude for math and science, Sauer focused his energies on industrial engineering and mathematics, earning degrees in both from Western Michigan University. But he also had a love for machines. It was a discovery made in high school when he worked in a machine shop. He found that he liked to imagine parts, draw them on paper, and then make a physical product. That job, as well as others he subsequently held, allowed him to develop the skills he would need to run his company. Besides working as a machinist’s apprentice, Sauer also took positions as a millwright assistant, worked at an industrial paint company in payroll and estimating, and assisted on a preventative maintenance plan. He also learned about supervising processes and startup teams in a position he took at a cereal manufacturer upon graduating college. “Every job I’ve had gave me the experience to get me to where I am today,” Sauer said. Several companies later, Sauer had an opportunity to take a management position with a small forestry firm just outside Savannah. “It was clear I was going to have to wear a lot of hats,” Sauer said, explaining the company only had 10 employees at the time. “My experience in engineering, sales, and process and product management, coupled with my background in manufacturing, the paper industry, and growing up on a farm made the job at Savannah Forestry Equipment a perfect fit.” Two years later, the owner of the company, a native Australian, expressed a desire to return home, and Sauer saw it as an opportunity to put an investment team together to purchase the firm. After the acquisition, Sauer decided to expand and diversify the company to better address the cyclical issues of the forestry industry. The company fulfilled customized project orders and designed parts both on-site and in the field. He also changed the company’s name to Savannah Global Solutions to reflect its strategy of building an international customer base. That strategy was key, Sauer said, explaining 95 percent of the company’s business was in the Southeast. A self-described calculated risk taker, Sauer felt certain it was a gamble that would pay off: the firm now sells 50 percent of its products to overseas customers in more than 30 countries. That success has led to recognition for the company and its impact on the state economy. In 2014, Savannah Global Solutions was named Georgia Small Exporter of the Year. “As a kid, my domain was two miles on a lawnmower,” Sauer said. “Today, it’s the entire world.” About Savannah Global Solutions Based in Pembroke, Georgia, Savannah Global Solutions employs 30 people and is a leader in the forestry cultivation industry. Originally founded as Savannah Forestry Equipment, the company manufactures equipment to address soil and site preparation needs in forestry and agriculture. Located on the I-16 corridor 30 miles west of Savannah, the company has easy access to the Port of Savannah, which helps to support the growth of its exporting business, with sales in more than 30 countries across four continents. About the Faces of Manufacturing  Each month, GaMEP highlights a different person as the Face of Manufacturing. Selections are made by a committee composed of representatives from Georgia Tech, economic development groups, manufacturing companies, and related associations.\nAdditional Images\nRelated links\nFaces of Manufacturing: Mark Sauer\nContact\nFor media inquiries contact: Laura Diamond Georgia Tech Media Relations  laura.diamond@gatech.edu For more information about GaMEP contact: Katie Takacs GaMEP Marketing Manager katie.takacs@innovate.gatech.edu\nEmail\nperalte.paul@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}