{"text": "Natural Disasters Contribute to Holiday Travel Delays | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNatural Disasters Contribute to Holiday Travel Delays\nNatural disasters and severe weather are unusual factors in planning for travel around the Thanksgiving holiday.\nFacebook\nTwitter\nEmail\nTraffic on the highway in Atlanta.\nNov 22, 2019\n— Atlanta, GA\nBy Zoe Kafkes\nHoliday travel is stressful enough — we know we’re supposed to arrive at the airport early, give extra time to drive places, and expect delays. But what about checking the weather on the other side of the country, routing your drive based on smoke from wildfires, or coordinating preparing your Thanksgiving meal around planned rolling blackouts?\nNatural disasters and severe weather are unusual factors in planning for travel around the Thanksgiving holiday.\nCatherine Ross , Harry West Professor in the\nSchool of City and Regional Planning\nand director of the\nCenter for Quality Growth and Regional Development , explains that one of the first things people do before traveling is to identify local conditions.\nNatural disasters or weather events that have sufficient prior notice (such as hurricanes, wildfires, heavy rains, or blizzard conditions) allow people to take an abbreviated trip, to change the method of travel, or to not travel at all. Some are even forced to cancel travel due to circumstances out of their control.\n“During the holidays people tend to put more focus on getting to their destinations regardless of what they need to do to get there,” Ross said. “People have more determination to get to their families. They will spend more resources or consider other ways to travel they wouldn’t normally.”\nWildfires in California\n“California’s wildfires have greatly impacted the area a second year running,”\nSteven P. French , Dean of the College of Design said. He explained that in addition to evacuations, the California wildfires have created a lot of smog and disrupted whole communities.\nRoss explained that natural disasters often reoccur. Places like Northern California, where recovery hasn’t taken place from wildfires in 2018, can expect to get hit again. This will further impact their infrastructure systems and make travel — especially increased holiday travel — more difficult.\n“Significant events in one location, such as fires, earthquakes, tornados, or floods, can impact infrastructure systems, creating interruptions the travel network,” French said. “There is an influx of volunteers and materials traveling to the impacted area to respond to the disaster, which stresses the system.”\nAfter the\nutility company Pacific Gas & Electric’s infrastructure system contributed to the largest of the wildfires in 2018 , PG&E aimed to mitigate their impact on this year’s fires. The solution was to preemptively shut off the power — imposing rolling blackouts across Northern California, hoping to prevent the start or spread of fires.\n“It may be difficult if you do not have a natural gas stove to cook the family Thanksgiving turkey if the power is going to be out for four or five hours a day,” French said.\nAn Increase in Natural Disasters Nationwide\nAccording to Ross, Texas has had more natural disasters in recent history than any other state. She explained that in the last 10 years, Oklahoma has started to experience more earthquakes than ever before.\n“Earthquakes flip the travel envelope almost on its head,” Ross said. Earthquakes can disrupt electrical systems, water systems, roadways, communications, and more.\nAs the strength and frequency of natural disasters increases, the number of places they impact and how severely the people traveling through those areas feel the impacts also increases.\n“The kinds of natural disasters and where they occur is changing. They are occurring with different intensity and in different places than they have historically,” Ross said.\nThe changes fuel\nresiliency planning . Ross gave the example of changing zoning and building codes, allowing for regions to bounce back. “The standard has changed,” Ross said.\nPlaces like Oklahoma have to start looking at their mobility and safety systems much more critically, Ross suggested. They need to ensure that the ability to distribute food and make sure electricity is restored quickly is something that they are prepared for — something that they didn’t have to do 10 years ago.\nSevere Weather\nAn increase in extreme weather events causes change to how travelers plan for transportation spikes like Thanksgiving.\n“My children are coming here from all over the country, as far away as Seattle and the closest in Delaware. They’re all flying, so we’ll see if that all works,” French said.\n“The airline system is so interdependent that when you start cancelling flights in one area of the country, those planes are not available in the other parts not experiencing any sort of severe weather,” he said.\n“The whole airline system is impacted by disruptions in the part that is having the extreme weather. It looks like we may get some of that going into the Thanksgiving holiday coming up soon.”\nSnow, rain, and fog can impact travel by rail, and especially the highways. It doesn’t even need to be a severe weather event.\n“Even normal weather under certain conditions becomes problematic and gives people thought about whether or not their safety is going to be more of an issue during their trip,” Ross said.\nOther Stressors\nAmtrak train services expect a huge bubble in ridership over the Thanksgiving weekend. Airports become busier and roads become more congested. It isn’t just people making extended trips before and after Thanksgiving that contribute to this saturation, Ross explained.\n“If you can go on a short trip and get up Thursday morning, leave at 7 and be where you are going by 9, many people choose to make the trip back and forth in a day,” she said.\nFor those choosing to extend their stay and return home after the holiday, they can expect additional congestion on the roads from package delivery.\n“Black Friday and Cyber Monday become the kickoff of the holiday season,” Ross said. “It signals the time to be out and about. You see a surge there, and people are aware of that, so they try to plan accordingly.”\nAdditional Images\nContact\nZoe Kafkes , Marketing & Events Coordinator\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}