{"text": "NASSCOM of India signs agreement with Georgia Tech to drive innovation in Internet of Things | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNASSCOM of India signs agreement with Georgia Tech to drive innovation in Internet of Things\nNASSCOM latest to join Georgia Tech efforts in Internet of Things research and education.\nFacebook\nTwitter\nEmail\nGeorgia Tech's Advanced Technology Devleopment Center (ATDC) is one of the oldest and largest university-based startup incubators in the country. ATDC has graduated about 150 companies. The center is located in the Centergy Building in Technology Square. (Photo: Rob Felt)\nDec 19, 2016\n— Atlanta, GA\nThe National Association of Software and Services Companies (NASSCOM) announced Dec. 19 that it has signed a memorandum of understanding with the Georgia Institute of Technology to begin collaborating on advancing the Internet of Things (IoT) and fostering innovation through an IoT ecosystem.\nNASSCOM, which is India’s information technology and business process management sector industry association, operates the\nCentre of Excellence for Internet of Things\n(COE-IoT), which will work closely with Georgia Tech’s Atlanta-based Center for the Development and Application of Internet of Things Technologies (CDAIT). The main objective of NASSCOM’s COE-IoT is to create innovative applications and domain capability, which is similar to CDAIT’s mission of expanding and promoting the Internet of Things’ potential and transformational capabilities.\n“We are honored to collaborate with a premier high tech organization such as NASSCOM to promote the many benefits of the fast-growing Internet of Things,” said Alain Louchez, managing director of CDAIT. “In close cooperation with NASSCOM’s IoT center, we intend to explore ways to leverage IoT technologies to accelerate and optimize the pace of digital transformation throughout the economy.”\nThe agreement between NASSCOM and Georgia Tech will allow both organizations to combine their efforts to raise awareness of IoT and create IoT-related events for the purpose of developing a vibrant global IoT ecosystem facilitating the effective and efficient adoption of IoT technologies. The partnership will also prompt conversations around IoT that will promote interoperability across industry and geographic markets.\n“The disruptive nature of IoT will have a major impact in all areas of the consumer’s life – across all industries including industrial, healthcare, agriculture and smart homes,” said Sanjeev Malhotra, chief executive officer of COE-IoT. “IoT will also be used across these industries to improve productivity with minimum usage of natural resources. We are happy to be partnering with Georgia Tech, a leading institute with a focus on emerging technologies, leading to a mutually beneficial agreement that will help us combine Georgia Tech’s advanced technology research along with the thriving innovation ecosystem in India.”\nThrough its COE-IoT located in Bangalore, NASSCOM is focusing on systemically expanding the technology ecosystem, with the center providing a platform to address challenges such as the lack of understanding that leads to low adoption levels and security issues faced by the industry.\nCDAIT\n(pronounced \"sedate\") is a global, non-profit, partner-funded center located at Georgia Tech in Atlanta, Georgia, that fosters interdisciplinary research and education while driving general awareness about the Internet of Things. It aims at efficiently identifying, understanding and solving for its sponsors challenges and problems that may arise along the whole IoT value chain. CDAIT bridges sponsors with Georgia Tech faculty and researchers as well as industry members with similar interests.\nAbout Georgia Tech\nThe\nGeorgia Institute of Technology , also known as Georgia Tech, is one of the leading research universities in the United States, providing a focused, technologically-based education to more than 25,000 undergraduate and graduate students. Georgia Tech has many nationally recognized programs, all top-ranked by peers and publications alike, and is ranked in the nation’s top 10 public universities by U.S. News and World Report. It offers degrees through the Colleges of Design, Computing, Engineering, Sciences, the Scheller College of Business, and the Ivan Allen College of Liberal Arts. As a leading technological university, Georgia Tech has more than 100 centers focused on interdisciplinary research that consistently contribute vital research and innovation to American government, industry, and business.\nAbout NASSCOM NASSCOM ® is the premier trade body and the chamber of commerce of the IT-BPM industry in India. NASSCOM is a global trade body with more than 1800 members, which includes both Indian and multinational companies that have a presence in India. NASSCOM's member and associate member companies are broadly in the business of software development, software services, software products, consulting services, BPM, e-commerce and web services, engineering services and animation and gaming. NASSCOM’s membership base constitutes over 95 percent of the industry revenues in India and employs about 3.5 million professionals.\nAdditional Images\nRelated links\nCenter for the Development and Application of Internet of Things Technologies\nNational Association of Software and Services Companies\nCentre of Excellence for Internet of Things\nContact\nLance Wallace\nlance.wallace@comm.gatech.edu\nEmail\nlance.wallace@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}