{"text": "McCamish Foundation Commitment Funds Research of Parkinson’s Disease at Georgia Tech and Emory | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMcCamish Foundation Commitment Funds Research of Parkinson’s Disease at Georgia Tech and Emory\nResearchers at Georgia Tech and Emory have received a landmark commitment to study Parkinson’s disease.\nFacebook\nTwitter\nEmail\nSusan Margulies is the Wallace H. Coulter Professor and Chair in the Coulter Department of Biomedical Engineering.\nDec 07, 2020\n— Atlanta, GA\nApproximately 60,000 Americans are diagnosed with Parkinson’s disease every year, and more than 10 million people worldwide are living with the disease, according to the Parkinson’s Foundation (parkinson.org).\nResearchers at the Georgia Institute of Technology and Emory University have received a landmark commitment to accelerate the scope and impact of Parkinson’s disease studies and to position Georgia as a hub for collaborative research on this and other neurological diseases.\nThe multiyear commitment from the McCamish Foundation will drive transformational research that harnesses science, engineering, and technology at Georgia Tech and Emory to better analyze the complexities of the brain and transform the treatment of Parkinson’s and other disorders of the nervous system. The Wallace H. Coulter Department of Biomedical Engineering (BME), an academic collaboration between Georgia Tech and Emory, is uniquely positioned to lead this new kind of translational neuroscience discovery driven by engineering innovation.\n“For 22 years, Georgia Tech and Emory University have collaborated to improve the lives of individuals diagnosed with many of the world’s most challenging diseases. Through the sustained support of transformational philanthropy, the Coulter Department of Biomedical Engineering has become a national model for academic partnerships,” said Georgia Tech President Ángel Cabrera. “This visionary and generous commitment from the McCamish Foundation will allow us to expand and accelerate collaboration and discovery to the point that an exciting new treatment for Parkinson’s disease and other neurological disorders could be within our reach.”\nEmory President Gregory L. Fenves added, “This generous commitment will enable Emory and Georgia Tech to build on our powerful biomedical partnership as we work to combat Parkinson’s and other devastating neurological diseases. New treatments and cures require a deep commitment — I am grateful for our friends at the McCamish Foundation who will help us make the progress and find the answers that patients and families so urgently need.”\nGordon Beckham Jr. has felt the impact of Parkinson’s personally, with the loss of his father, Hank McCamish, to the disease. Beckham now sits on the board of directors of the Parkinson’s Foundation and works to raise awareness to beat the disease. He said his goal is to build a strong research community in Georgia that will create new frontiers in the treatment of the degenerative disease.\n“The McCamish Foundation has been in discussions on and off with Georgia Tech, since my dad’s passing, about innovative approaches to dealing with Parkinson’s,” said Beckham, CEO of the Atlanta-based McCamish Group LLC and president of the McCamish Foundation. “We have always been impressed by the amazing depth of talent at Tech.”\nThe McCamish name is well-known at Georgia Tech. Alumnus Hank McCamish, IM 1950, is the namesake of Tech’s basketball arena, McCamish Pavilion. Over the years, the family has supported numerous causes at Georgia Tech. This commitment is one of the largest in the Institute’s history and is the first of its kind for the Institute.\n“More recently, we met Susan Margulies and learned of the formal biomedical engineering collaboration between Tech and Emory, two of the top institutions in the country in their respective fields,” Beckham said. “At the same time, the University of Georgia (UGA) is making major investments in Parkinson’s research. Given all this momentum within the state of Georgia, with BME as a nexus, the McCamish Foundation felt the timing was right to try something new at Tech and Emory while also leveraging the existing powerful collaboration between Tech, Emory, and UGA.”\n“We already participate in robust research collaborations with Georgia Tech and Emory,” said UGA President Jere W. Morehead. “We look forward to expanding our partnerships in order to leverage the complementary strengths of our three institutions to bring new hope to those who suffer from this terrible disease.”\nBeckham said The McCamish Foundation dreams of a day when all Parkinson’s related conversations begin with, “Remember when.”\nThe McCamish commitment will support faculty research on neurological diseases, including establishing a seed fund to support high-risk, high-reward research ventures. It will also provide fellowships for graduate students and create regular interactions among researchers at Tech, Emory, and UGA, including an annual national conference focused on Parkinson’s disease. The idea is to give researchers space to collaborate and brainstorm unconventional ideas that hold the greatest promise for significant discoveries.\n“Our vision is to create the next frontier in neuroscience and neurotechnology by confronting the enormous complexities of the dynamic brain and nervous system,” said Susan Margulies, the Wallace H. Coulter Professor and Chair in the Coulter Department of Biomedical Engineering. “Our brains engage with, adapt to, and are influenced by the world around us. Studying the changing chemical and electrical brain dynamics is a direct path to detecting and treating Parkinson’s disease and other neurological disorders.”\n###\nAbout the Wallace H. Coulter Department of Biomedical Engineering\nThe Wallace H. Coulter Department of Biomedical Engineering is a partnership between Georgia Tech and Emory University. Combining the best of research and education, the department is dedicated to improving health and well-being by creating medical breakthroughs driven by engineering innovation and translational research. To learn more, visit  bme.gatech.edu\nAdditional Images\nContact\nDenise Ward\nInstitute Communications\nEmail\ndenise.ward@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}