{"text": "Georgia Institute of Technology selects Jennifer Bonnett to head the Advanced Technology Development Center | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Institute of Technology selects Jennifer Bonnett to head the Advanced Technology Development Center\nBonnett, a seasoned technology sector veteran, will shape the vision for the future of Georgia’s statewide technology startup incubator.\nFacebook\nTwitter\nEmail\nJennifer Bonnett, the acting general manager of the Advanced Technology Development Center since October 2015, has been named permanent general manager of the incubator.\nJul 19, 2016\n— Atlanta, GA\nThe Georgia Institute of Technology has named Jennifer Bonnett general manager of the Advanced Technology Development Center (ATDC), effective immediately. The announcement follows Bonnett’s tenure as ATDC’s acting general manager since October 2015. In taking the permanent appointment, Bonnett leads a team of 22 full- and part-time employees who run the program’s various initiatives, as well as coach entrepreneurs across the state. A unit of the Enterprise Innovation Institute (EI 2 ), Georgia Tech’s chief outreach and economic development arm, ATDC works with more than 800 technology startup entrepreneurs each year across Georgia. Founded in 1981, ATDC has grown to become one of the most successful, longest-running, and largest university-based startup incubators in the country. Bonnett will report directly to Chris Downing, vice president and director of EI 2 .  “Jen has been tireless champion of technology startup development in Georgia and an important voice and advocate for the community,” Downing said. “Under her steady and smart leadership, ATDC continues to grow and expand as Georgia’s technology incubator dedicated to serving the state and its economy by helping entrepreneurs learn, launch, scale, and succeed in their technology startup efforts.” Bonnett first joined ATDC as a community catalyst in October 2011, a role she held for three years before being named assistant director of education and curriculum in October 2014. She was named acting general manager in October 2015. She played a key role in developing ATDC’s Entrepreneurs Education Series, a curriculum designed to move “concept stage” entrepreneurs from idea through to angel funding. She is also the architect of the “ATDC @” program which delivers coaching and curriculum to entrepreneurs across the state, including Savannah, Athens, and Augusta. “I’m honored to accept this position and build on what we have done at ATDC, with the support of Georgia Tech and our fellow programs at EI 2 ,” Bonnett said. “We’re committed to entrepreneurs and working with startups all over the state to help them build and launch successful and sustainable, job-creating companies.” Bonnett is a technology entrepreneur with more than 25 years experience in the information technology and software development fields with a specialty in web and mobile technologies. She has served as founder or chief technology officer of several venture- and angel-backed firms, where she both served as lead architect and grew and managed the technology team, including eTour.com, which was acquired by Ask.com. She also is founder of StartupChicks, a 501c3 focused on empowering women entrepreneurs through education, community, coaching, connections, and investment. StartupChicks has touched more than 10,000 women globally through its content and events. — Péralte C. Paul\nAdditional Images\nRelated links\nAdvanced Technology Development Center\nStartup Chicks\nContact\nFor media inquiries about ATDC, contact: Laura Diamond 404.660.2927 laura.diamond@gatech.edu\nEmail\nperalte.paul@comm.gatech.edu\nAdditional information\nAbout ATDC: The Advanced Technology Development Center (ATDC) is Georgia’s technology incubator. Powered by Georgia Tech, ATDC works with entrepreneurs to help them learn, launch, scale, and succeed. Founded in 1981 and one of the longest-running and largest university-based startup incubators in the country, ATDC works with more than 800 technology startup entrepreneurs each year across Georgia. It has graduated nearly 170 companies from its core ATDC Signature program. Collectively, ATDC graduates have generated more than $12 billion in revenue in Georgia and have received about $2 billion in capital from angels and other investors. ATDC is a unit of the Enterprise Innovation Institute, Georgia Tech’s chief outreach and economic development arm. Visit  www.atdc.org  to learn more.\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}