{"text": "Lim, Milor, Qureshi Elevated to IEEE Fellows | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nLim, Milor, Qureshi Elevated to IEEE Fellows\nIEEE Fellow is a distinction reserved for select IEEE members whose extraordinary accomplishments.\nFacebook\nTwitter\nEmail\n(L-R) Sung Kyu Lim, Linda Milor, and  Moinuddin K. Qureshi. Georgia Tech's three faculty members elevated to fellow status in the Institute of Electrical and Electronics Engineers (IEEE) for 2023.\nJan 26, 2023\n— Atlanta, GA\nThree Georgia Tech faculty members have been elevated to fellow status in the Institute of Electrical and Electronics Engineers (IEEE), the world’s largest technical professional organization for the advancement of technology. They are\nSung Kyu Lim\nand\nLinda Milor , professors in the School of Electrical and Computer Engineering (ECE), and\nMoinuddin K. Qureshi , professor in the\nSchool of Computer Science\nwith an adjunct appointment in ECE.\nIEEE Fellow is a distinction reserved for select IEEE members whose extraordinary accomplishments in any of the IEEE fields of interest are deemed fitting of this prestigious grade elevation. Fellow is the highest grade of membership and conferred by the IEEE Board of Directors. It is recognized by the technical community as a prestigious honor and an important career achievement.\n“It's a very special honor to be named an IEEE Fellow because it means your peers have recognized your contribution's significance and impact,” said Professor and School Chair Arijit Raychowdhury, who became an IEEE Fellow in 2022. “It’s an honor to work alongside Sung Kyu, Linda, and Moinuddin. They have demonstrated to the rest of the world that our faculty and students are involved in cutting-edge, innovative research.”\nAbout this year’s Georgia Tech IEEE Fellows:\nSung Kyu Lim\nLim, who currently holds the Motorola Solutions Foundation Professor title in ECE, is being recognized “for contributions to electronic design automation and tradeoff for 3-dimensional integrated circuits (ICs).” He is the first Georgia Tech ECE researcher to be recruited and serve as a DARPA program manager while teaching at Georgia Tech, currently managing programs related to 3D ICs at the Microsystems Technology Office.\nLim’s research focus is on architecture, design, and electronic design automation (EDA) for 2.5D and 3D integrated circuits. He has published more than 400 papers on the topic and received the 2022 Best Paper Award from the IEEE Transactions on Electromagnetic Compatibility and the IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems.\nLinda Milor\nMilor is being recognized “for contributions to testing of analog circuits and bridging the design-manufacturing gap for integrated circuits (ICs).” Her research on yield and test of semiconductor ICs has been published in over 200 publications, nine papers have over 50 citations in google scholar, and eight papers have received “Best Paper” awards, including a best paper for the IEEE Transactions on Semiconductor Manufacturing.\nPrior to her career in academia, Milor served as vice president of process technology and product engineering at eSilicon Corporation and as a product engineering manager at AMD. She is a frequent speaker at conferences, including keynote addresses and presentations on women in STEM in industry and academia.\nMoinuddin K. Qureshi\nQureshi is being recognized “for contributions to scalable memory systems.” His research interests include computer architecture, hardware security, and quantum computing. Prior to joining Georgia Tech, he was a research scientist at the IBM T. J. Watson Research Center where he developed the caching algorithms for Power 7 Systems.\nHe is a Hall-of-Fame member of the three major computer architecture conferences: the International Symposium on Computer Architecture (ISCA), the International Symposium on Microarchitecture (MICRO), and the International Symposium on High-Performance Computer Architecture (HPCA). He recently received the Maurice Wilkes Award for contributions to high-performance memory systems from the Association for Computing Machinery Special Interest Group on Computer Architecture (SIGARCH).\nThe total number of fellows selected by IEEE in any one year cannot exceed one-tenth of one percent of the total voting IEEE membership. A complete list of the Class of 2023 fellows is available on the  IEEE site .\nAdditional Images\nRelated links\nIEEE Fellow Program\nSung Kyu Lim\nMoinuddin K. Qureshi\nLinda Milor\nContact\nDan Watson dwatson@ece.gatech.edu\nEmail\ndwatson@ece.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}