{"text": "The Dynamics of Deformable Systems: Study Unravels Mathematical Mystery of Cable-like Structures | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nThe Dynamics of Deformable Systems: Study Unravels Mathematical Mystery of Cable-like Structures\nA new theory allows researchers to create easy-to-solve mathematical models using cables, a previously challenging mathematical problem.\nFacebook\nTwitter\nEmail\nFeb 09, 2024\nAre our bodies solid or liquid? We all know the convention\n—\nthat solids maintain their shapes, while liquids fill the containers they’re in. But often in the real world, those lines are blurred. Imagine walking on a beach. Sometimes the sand gives way under feet, deforming like a liquid, but when enough sand grains pack together, they can support weight like a solid surface.\nModeling these kinds of systems is notoriously difficult — but\nZeb Rocklin , an assistant professor in the\nSchool of Physics\nat Georgia Tech, has written a new paper doing just that.\nRocklin’s study, “ Rigidity percolation in a random tensegrity via analytic graph theory ,” is published in the journal\nProceedings of the National Academy of Sciences (PNAS) . The results have the potential to impact fields spanning biology to engineering and nanotechnology, showing that these types of deformable solids offer a rare combination of durability and flexibility.\n\"I'm very proud of our team, especially Will and Vishal, the two Georgia Tech undergraduates who co-led the study,”\nRocklin says.\nThe lead author,\nWilliam Stephenson,\nand co-author\nVishal Sudhakar\nboth completed their undergraduate studies at the Institute during the time of this research. Stephenson is now a first-year grad student at the University of Michigan, Ann Arbor, and Sudhakar has been admitted to Georgia Tech as a graduate student. Additionally, co-author\nMichael Czajkowski\nis a post-doctoral researcher in the School of Physics, and co-author\nJames McInerney\ncompleted his graduate studies in the School of Physics under Rocklin. McInerney is now a postdoctoral researcher at the University of Michigan.\nConnecting the dots… with cables\nImagine building molecules in chemistry class\n—\nlarge wooden spheres connected with sticks or rods. While many models use rods, including mathematical models, biological systems in real life are constructed of polymers, which function more like stretchy strings.\nLikewise, when creating mathematical or biological models, researchers frequently treat all the elements as rods as opposed to treating some of them as cables, or strings. But, “there are tradeoffs between how mathematically tractable a model is and how physically plausible it is,” Rocklin says. “Physicists can have some beautiful mathematical theories, but they aren’t always realistic.”  For example, a model using connective rods might not capture the dynamics that connective strings provide. “With a string you can stretch it, and it'll fight you, but when you compress it, it collapses.”\n“But, in this study, we’ve extended the current theories,” he says, adding cable-like elements. “And that actually turns out to be incredibly difficult, because these theories use mathematical equations.\nIn contrast, the distance between the two ends of a cable is represented by an inequality, which is not an equation at all. So how do you create a mathematical theory when you aren't starting from equations? ” While a rod has a certain length in a mathematical equation, the ends of the string have to be represented as less than or equal to a certain length.\nIn this situation “all the usual analytic theories completely break,” Rocklin says. “It becomes very difficult for physicists or for mathematicians.”\n“The trick was to notice that these physical systems were logically equivalent to something called a directed graph,” Rocklin adds, “where different modes of deformation are linked to each other in specific ways. This allows us to take a relatively complicated system and massively compress\nit to a much smaller system. And when we did that, we were able to turn it into something that becomes extremely easy for the computer to do.”\nFrom biology to engineering\nRocklin’s team found that when modeling with cables and springs, the target range changed — becoming softer, with a wider margin for error. “That could be really important for something like a biological system, because a biological system is trying to stay close to that critical point,” says Rocklin. “Our model shows that the region around the critical point is actually much broader than what models that only used rods previously showed.”\nRocklin also points out applications for engineers. For example, since Rocklin's new theory suggests that even disordered cable structures can be strong and flexible, it may help engineers leverage cables as building materials to create safer, more durable bridges. The theory also provides a way to easily model these cable-based structures, to ensure their safety before they are built, and provide a way for engineers to iterate on designs.\nRocklin also notes potential applications in nanotechnology. “In nanotechnology, you must accept an increasing amount of disorder, because you can't just have a skilled worker actually go in and put segments there, and you can't have a conventional factory machine put segments there,” Rocklin says.\nBut biology has known how to lay down effective, but disordered, rod and cable structures for hundreds of millions of years. “This is going to tell us what sorts of machines we can make with those disordered structures when we're getting to the point of being able to do what biology can do. And that's a possible future design principle for the engineers to explore, at very small scales, where we can't choose exactly where each cable goes,” Rocklin says.\n“Our theory shows that with cables, we can maintain a combination of flexibility and strength with much less precision than you might otherwise need.”\nFunding:\nThis research was funded by the Army Research Office through the MURI program (#W911NF2210219).\nDOI:\nhttps://doi.org/10.1073/pnas.2302536120\nFigure caption:\nSystems of rigid rods acquire rigidity via the addition of random additional rods and cables, as captured via a graph theory. The research team's main object of study, shown here, is structures that consist of large numbers of pores — arranged in columns and rows with cables and rods added at random.\nContact\nWritten by Selena Langner\nEditor and Contact:\nJess Hunt-Ralston\nEmail\njess.hunt@cos.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}