{"text": "New Acoustic Technique Reveals Structural Information in Nanoscale Materials | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNew Acoustic Technique Reveals Structural Information in Nanoscale Materials\nResearchers have developed a new technique for investigating phase transitions in materials by examining the acoustic response at the nanoscale.\nFacebook\nTwitter\nEmail\nSchematic representation of the atomic force microscope interacting with the material surface in research on investigating phase changes in nanoscale materials. (Credit: Rama Vasudevan, ORNL)\nDec 28, 2015\n— Atlanta, GA\nUnderstanding where and how phase transitions occur is critical to developing new generations of the materials used in high-performance batteries, sensors, energy-harvesting devices, medical diagnostic equipment and other applications. But until now there was no good way to study and simultaneously map these phenomena at the relevant length scales. Now, researchers at the Georgia Institute of Technology and Oak Ridge National Laboratory (ORNL) have developed a new nondestructive technique for investigating these material changes by examining the acoustic response at the nanoscale. Information obtained from this technique – which uses electrically-conductive atomic force microscope (AFM) probes – could guide efforts to design materials with enhanced properties at small size scales. The approach has been used in ferroelectric materials, but could also have applications in ferroelastics, solid protonic acids and materials known as relaxors. Sponsored by the National Science Foundation and the Department of Energy’s Office of Science, the research was reported December 15 in the journal\nAdvanced Functional Materials . “We have developed a new characterization technique that allows us to study changes in the crystalline structure and changes in materials behavior at substantially smaller length scales with a relatively simple approach,” said Nazanin Bassiri-Gharb, an associate professor in Georgia Tech’s Woodruff School of Mechanical Engineering. “Knowing where these phase transitions happen and at which length scales can help us design next-generation materials.” In ferroelectric materials such as PZT (lead zirconate titanate), phase transitions can occur at the boundaries between one crystal type and another, under external stimuli. Properties such as the piezoelectric and dielectric effects can be amplified at the boundaries, which are caused by the multi-element “confused chemistry” of the materials. Determining when these transitions occur can be done in bulk materials using various techniques, and at the smallest scales using an electron microscope. The researchers realized they could detect these phase transitions using acoustic techniques in samples at size scales between the bulk and tens of atoms. Using band-excitation piezoresponse force microscopy (BE-PFM) techniques developed at ORNL, they analyzed the resulting changes in resonant frequencies to detect phase changes in sample sizes relevant to the material applications. To do that, they applied an electric field to the samples using an AFM tip that had been coated with platinum to make it conductive, and through generation and detection of a band of frequencies. “We’ve had very good techniques for characterizing these phase changes at the large scale, and we’ve been able to use electron microscopy to figure out almost atomistically where the phase transition occurs, but until this technique was developed, we had nothing in between,” said Bassiri-Gharb. “To influence the structure of these materials through chemical or other means, we really needed to know where the transition breaks down, and at what length scale that occurs. This technique fills a gap in our knowledge.” The changes the researchers detect acoustically are due to the elastic properties of the materials, so virtually any material with similar changes in elastic properties could be studied in this way. Bassiri-Gharb is interested in ferroelectrics such as PZT, but materials used in fuel cells, batteries, transducers and energy-harvesting devices could also be examined this way. “This new method will allow for much greater insight into energy-harvesting and energy transduction materials at the relevant length sales,” noted Rama Vasudeven, the first author of the paper and a materials scientist at the Center for Nanophase Materials Sciences, a U.S. Department of Energy user facility at ORNL. The researchers also modeled the relaxor-ferroelectric materials using thermodynamic methods, which supported the existence of a phase transition and the evolution of a complex domain pattern, in agreement with the experimental results. Use of the AFM-based technique offers a number of attractive features. Laboratories already using AFM equipment can easily modify it to analyze these materials by adding electronic components and a conductive probe tip, Bassiri-Gharb noted. The AFM equipment can be operated under a range of temperature, electric field and other environmental conditions that are not easily implemented for electron microscope analysis, allowing scientists to study these materials under realistic operating conditions. “This technique can probe a range of different materials at small scales and under difficult environmental conditions that would be inaccessible otherwise,” said Bassiri-Gharb. “Materials used in energy applications experience these kinds of conditions, and our technique can provide the information we need to engineer materials with enhanced responses.” Though widely used, relaxor-ferroelectrics and PZT are still not well understood. In relaxor-ferroelectrics, for example, it’s believed that there are pockets of material in phases that differ from the bulk, a distortion that may help confer the material’s attractive properties. Using their technique, the researchers confirmed that the phase transitions can be extremely localized. They also learned that high responses of the materials occurred at those same locations. Next steps would include varying the chemical composition of the material to see if those transitions – and enhanced properties – can be controlled. The researchers also plan to examine other materials. “It turns out that many energy-related materials have electrical transitions, so we think this is going to be very important for studying functional materials in general,” Bassiri-Gharb added. “The potential for gaining new understanding of these materials and their applications are huge.” This research was supported by the National Science Foundation (NSF) through grant DMR-1255379. A portion of this research was conducted at the Center for Nanophase Materials Sciences, which is a DOE Office of Science User Facility at ORNL. The content is solely the responsibility of the authors and does not necessarily represent the official views of the NSF or DOE. CITATION : Rama K. Vasudevan, et al., “Acoustic Detection of Phase Transitions at the Nanoscale,” (Advanced Functional Materials, 2015).\nhttp://dx.doi.org/10.1002/adfm.201504407 Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contact : John Toon (404-894-6986) ( jtoon@gatech.edu ). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}