{"text": "Efficiency Leap in Separating Para-xylene Using New Carbon Membranes | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nEfficiency Leap in Separating Para-xylene Using New Carbon Membranes\nResearchers at Georgia Tech have uncovered new insights into the fabrication of carbon membranes that have the potential to drive significant cost savings once the solution for xylene isolation separation is scaled for industrial use.\nFacebook\nTwitter\nEmail\nGeorgia Tech used these carbon membrane materials to separate para-xylene from o-xylene. (Photo credit: Christopher Moore, Georgia Tech)\nSep 07, 2021\n— Atlanta, GA\nThe petrol industry recognizes the importance of para-xylene, given its many uses in everyday products, from plastic soda bottles to polyester fiber.\nThe challenge is that xylenes travel in threes and are virtually identical, making it extremely difficult to efficiently separate and purify para-xylene from its less used siblings such as ortho-xylene. These molecules’ size differs by one-tenth of a nanometer. However, membranes with tiny pores engineered to differentiate these molecules can potentially enable this important separation.\nBuilding on long-term research with ExxonMobil, researchers at the Georgia Institute of Technology have uncovered new insights into the fabrication of carbon membranes that have the potential to drive significant cost savings once the solution for xylene isolation separation is scaled for industrial use.\nThe\nfindings\nwere reported in the September 6, 2021 issue of the\nProceedings of the National Academy of Sciences .\nThe work focuses on “carbon-based molecular sieves,” made by heating thin layers of materials in such a way as to drive off all the atoms other than carbon, resulting in a charcoal-like substance that has molecule-sized holes. In 2016 researchers at Georgia Tech and Exxon Mobil\nfirst demonstrated\nthat a new carbon-based molecular sieve membrane could successfully separate xylene molecules and extract the super-useful para-xylene from the pack.\nNow, Georgia Tech has advanced this work, devising improved carbon barriers that allows the skinnier p-xylene to slip through more rapidly, while rejecting the wider molecules. Importantly, the team discovered a powerful relationship between the bonding chemistry of the carbons and the mobility of xylenes through the carbon membranes.\nThe performance of the carbon membranes — if realized at industrial scales — could significantly lower energy costs compared with refining processes such as the standard crystallization method or adsorption-based method. The former approach involves freezing the xylene molecules in which only the para-xylene forms crystals, making it easy to isolate, but requiring substantial energy investment. The latter approach reduces energy consumption compared to crystallization but requires expensive and complex equipment to operate. The issue with membranes, according to Georgia Tech researchers, is the approach has only worked well in the lab environment, not in an industrial setting.\n“We have made more stable materials by changing the polymer precursor we use. Then by changing how we transform the polymer into the carbon, we’ve made the membranes more productive,” said\nRyan Lively , an associate professor in Georgia Tech’s  School of Chemical & Biomolecular Engineering  and the paper’s corresponding author.\nJust how much more productive? The team has shown the new materials can lead to purification systems that are estimated to be “three to six times lower cost than other state-of-the-art methods,” Lively said.\nLively estimates that separation and purification account for around half the energy consumed in producing commodity chemicals and fuels. Globally, the amount of energy used in conventional separation processes for aromatics, for example, benzene toluene, is equal to that produced by about 20 average-sized power plants.\nThis advancement could have a big impact on petrol chemical energy consumption. The research was funded by ExxonMobil and builds on more than 15 years of collaborative research effort between Georgia Tech and the global oil and gas leader.\n“Through collaboration with strong academic institutions like Georgia Tech, we are constantly exploring new, more efficient ways to produce the energy, chemicals, and other products consumers around the world rely on every day,\" said Vijay Swarup, vice president of research and development at ExxonMobil Research and Engineering Company.\nThe Georgia Tech researchers also uncovered new insights regarding the carbon structure itself. The team observed that subtle changes in the ratio of three dimensional to two-dimensional carbon centers in the membrane led to impressively large changes in the mobility of xylene isotherms within that material. They observed that a change in this ratio (the sp3/sp2 carbon ratio) from 0.2 to 0.7 led to a factor of 1000 increase in the productivity of the membrane. Surprisingly, the membrane largely maintained its selectivity, or its ability to do the xylene isomer separation, despite these changes in carbon structure.\n“The more three-dimensional carbons are in there, the higher the productivity,” said\nM.G. Finn , professor and chair of Georgia Tech’s School of  Chemistry and Biochemistry\nand co-corresponding author on the article. “The more you crank up productivity, while maintaining the same selectivity, the less membrane you need to handle the same amount of xylene feed. From a design perspective, it shows that you have this enormous control over how the membrane works by making very small changes in the carbon chemistry,” Finn concluded.\nExxonMobil Research & Engineering funded this research.\nCitation: Yao Ma, Nicholas C. Bruno, Fengyi Zhang, M. G. Finn, and Ryan P. Lively. “Zeolite-like performance for xylene isomer purification using polymer-derived carbon membranes.” PNAS (Proceedings of the National Academy of Sciences of the United States of America).\nhttps://doi.org/10.1073/pnas.2022202118\nAdditional Images\nContact\nAnne Wainscott-Sargent\nEmail\nasargent7@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}