{"text": "Black History Month Reading and Viewing Recommendations | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nBlack History Month Reading and Viewing Recommendations\nFaculty and staff members suggest books and feature films that explore race, identity, history, and memory.\nFacebook\nTwitter\nEmail\nJan 30, 2024\nFebruary is Black History Month, a time to reflect on the struggles and achievements of Black Americans, and their centrality to U.S. history. We asked several faculty and staff members for reading and viewing recommendations that explore race, identity, history, and memory. The recommendations range from the personal narrative of a daughter of the South to the story of a Pennsylvania community shared by Black and Jewish residents in the 1920s.\nSouth to America\nBy Imani Perry, Harper Collins (2022)\n“Perry’s presence as a preeminent scholar of African American studies at Princeton is well known, but\nSouth to America\nweaves a personal narrative of her lived experiences both past and present as a daughter of the South (Alabama). The book, a recipient of the National Book Award for nonfiction, recasts historical events state to state and juxtaposes the local culture, language, food, and even music with what we commonly associate as American. I loved this book because Perry served as an expert tour guide reframing the way I viewed the South and Black folks’ place in it. Her sharp prose is contemplative and had me reexamining my life experiences as a native northerner, southern transplant, and beneficiary of the groundwork my southern ancestors laid for me to resume advancing.”\n—Chris Burke, executive director, Community Relations\nThe 1619 Project\nHulu miniseries, released in 2023.\n“This is a miniseries presented by Nikole Hannah-Jones, the Knight Chair in Race and Journalism at Howard University and award-winning journalist who penned a book and the\nNew York Times Magazine’s\nproject (both with the same name). The series is not only deeply informative, but it also offers a beautiful weaving of storytelling and images about the history of the United States. Each episode explores aspects of American culture and life through topics such as democracy, capitalism, music, and fear. Through Hannah-Jones’ exquisite capacity to interview in humanizing and pointed ways, this six-episode series offers insight into how African Americans have contributed to American values and culture.”\n—Tiffany D. Johnson, associate professor, Organizational Behavior, Scheller College of Business\nA Thousand and One\nFeature film released in 2023, available on Prime Video.\n“A.V. Rockwell’s directorial feature-length debut is a defiant love song to a gentrifying Harlem in the Giuliani-Bloomberg decade.\nStrength and terror coexist in Teyana Taylor’s Inez, a mother whose love for son Terry (exquisitely portrayed, chronologically, by Aaron Kingsley Adetola, Aven Courtney, and Josiah Cross) saves them both, buoyed by their villages of care. Taylor’s talent as musician-choreographer-actor shines in this complex, teetering dance about parenting, loving, and living in a New York that may erect ‘a thousand and one’ roadblocks to building a home, but (in doubling as the family’s address) reminds viewers that home endures, always, in who and how we love.”\n—Nihad Farooq, associate professor, School of Literature, Media, and Communication\nThe Heaven and Earth Grocery Store\nBy\nJames McBride, Penguin Random House (2023)\n“McBride won the National Book Award for this work for good reason\n—\nand if you start with\nHeaven and Earth\nand let it lead to you to the rest of his jaw-dropping oeuvre then you’ll be well rewarded. The story is set in the 1920s in a community in Pennsylvania shared, ambivalently, by Pottstown’s Black and Jewish residents. The tale\n—\nabout physical and intangible resources, illnesses of the body and the spirit, and homeplaces both real and imagined\n—\nis rendered so carefully and delicately that by the time you are done, your attachment to Nate, Addie, Moshe, Chona, and especially their shared adoptive son, Dodo, is so deep that you simply reopen the novel and begin again.”\n—Ruthie Yow, associate director, Center for Sustainable Communities Research and Education, Brook Byers Institute for Sustainable Systems\nHidden Figures\nFeature film released in 2016, available on Hulu, Disney+, Prime Video, and Apple TV.\n“The film recounts the true story of Katherine G. Johnson, Dorothy Vaughn, and Mary Jackson — three brilliant Black mathematicians working at NASA during the space race in the early 1960s. These American heroes had to fight segregation in an industry designed to silence them. Their resilience and endurance helped save the space program  and  the life of astronaut John Glenn.”\n—Joi Alexander, director, Wellness Empowerment Center, Student Engagement and Well-Being\nRelated links\n2023 Black History Month Reading and Viewing Recommendations\n2022 Black History Month Viewing Recommendations\nContact\nVictor Rogers\nInstitute Communications\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}