{"text": "Lozier Elected to American Academy of Arts and Sciences | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nLozier Elected to American Academy of Arts and Sciences\nCollege of Sciences Dean Susan Lozier has been elected a member of the American Academy of Arts and Sciences.\nFacebook\nTwitter\nEmail\nMay 07, 2020\n— Atlanta, GA\nSusan Lozier, dean and the Betsy Middleton and John Clark Sutherland Chair in the College of Sciences, has been elected a member of the American Academy of Arts and Sciences. She is among 276 artists, scholars, scientists, and leaders in the public, non-profit, and private sectors who will be inducted Oct. 9-11.\nThe\nAcademy\nwas founded in 1780 by John Adams, John Hancock, and others to honor exceptionally accomplished individuals and engage them in advancing the public good. Lozier, an expert in physical oceanography with an interest in large-scale ocean circulation, is being recognized for decades of extraordinary work.\n“It’s incredibly humbling to be recognized by members of this arts and sciences community, given its rich history,” Lozier said. “I have always balked at the myth that science is the journey of a lone individual as I have enjoyed working with students, postdocs, and colleagues over the years and have gained immeasurably from those interactions. Since I view science as a community effort, building on the work that others have done and laying the foundation for the future, being recognized by the community is particularly gratifying.”\nRafael L. Bras, provost and executive vice president for Academic Affairs, said, “Susan Lozier is an extraordinary leader and scholar — very much the type of individual Georgia Tech wants in its ranks. When she accepted the position of dean of Sciences, I was extremely happy — I expected her to propel the College of Sciences to bigger and better things. After a few months, I am absolutely sure that Susan will be extremely successful at Georgia Tech. It is a true pleasure and honor to work with her.”\nLozier’s research focuses on the ocean’s role in climate variability and climate change. She is the international lead for a large ocean observing system — spanning from Labrador to Scotland — that measures the heat and freshwater exchange between the North Atlantic and the Arctic.\nShe received an NSF Early Career Award in 1996, was named an American Meteorological Society Fellow in 2008, a Distinguished Professor at Duke in in 2012, a Fellow of the American Geophysical Union (AGU) in 2014, a Fellow of the American Association for the Advancement of Science in 2015, and received AGU’s Ambassador Award in 2016 for leadership in the ocean sciences community. She became dean of Georgia Tech’s\nCollege of Sciences\non Sept. 1, 2019.\n“Like most everyone else, I have never focused on awards,” Lozier said. “I have always been very interested in my studies of the ocean, and in making sure that other people in the community have the same opportunities that I have had. I always thought that if you do good work the recognition will follow, but the main emphasis has been on the work and the people. I have a very strong interest in mentoring the younger generation.”\nLozier said she is proudest of the students she has worked with and mentored through the years.\n“I consider them the tendrils of my work,” she said. “I feel very much a part of their lives. They have gone on to have careers, families, and children, and for me that is the most satisfying part of my academic career.”\nLozier joins six other current Georgia Tech faculty who are members of the American Academy of Arts and Sciences: Randall Engle, 2018; Arkadi Nemirovski, 2018; Richard Lipton, 2014; Zvi Galil, 2005; James Meindl, 1992; and Mostafa El-Sayed, 1986.\nAdditional Images\nContact\nVictor Rogers\nInstitute Communications\nEmail\nvictor.rogers@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}