{"text": "Evidence found for granite on Mars | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nEvidence found for granite on Mars\nResearchers now have stronger evidence of granite on Mars and a new theory for how the granite – an igneous rock common on Earth -- could have formed there, according to a new study. The findings suggest a much more geologically complex Mars than pre\nFacebook\nTwitter\nEmail\nThe Nili Patera volcanic caldera contains some of the fastest-moving sand dunes on Mars. New spectral data and modeling reveal that they are racing across unusual Martian bedrock. Credit: NASA/JPL/University of Arizona.\nNov 18, 2013\n— Atlanta, GA\nResearchers now have stronger evidence of granite on Mars and a new theory for how the granite – an igneous rock common on Earth -- could have formed there, according to a new study. The findings suggest a much more geologically complex Mars than previously believed. Large amounts of a mineral found in granite, known as feldspar, were found in an ancient Martian volcano. Further, minerals that are common in basalts that are rich in iron and magnesium, ubiquitous on Mars, are nearly completely absent at this location. The location of the feldspar also provides an explanation for how granite could have formed on Mars. Granite, or its eruptive equivalent, rhyolite, is often found on Earth in tectonically active regions such as subduction zones. This is unlikely on Mars, but the research team concluded that prolonged magmatic activity on Mars can also produce these compositions on large scales. \"We're providing the most compelling evidence to date that Mars has granitic rocks,\" said James Wray, an assistant professor in the School of Earth and Atmospheric Sciences at the Georgia Institute of Technology and the study's lead author. The research was published November 17 in the Advance Online Publication of the journal\nNature Geoscience . The work was supported by the NASA Mars Data Analysis Program. For years Mars was considered geologically simplistic, consisting mostly of one kind of rock, in contrast to the diverse geology of Earth. The rocks that cover most of Mars's surface are dark-colored volcanic rocks, called basalt, a type of rock also found throughout Hawaii for instance. But earlier this year, the Mars Curiosity rover surprised scientists by discovering soils with a composition similar to granite, a light-colored, common igneous rock. No one knew what to make of the discovery because it was limited to one site on Mars. The new study bolsters the evidence for granite on Mars by using remote sensing techniques with infrared spectroscopy to survey a large volcano on Mars that was active for billions of years. The volcano is dust-free, making it ideal for the study. Most volcanoes on Mars are blanketed with dust, but this volcano is being sand-blasted by some of the fastest-moving sand dunes on Mars, sweeping away any dust that might fall on the volcano. Inside, the research team found rich deposits of feldspar, which came as a surprise. \"Using the kind of infrared spectroscopic technique we were using, you shouldn't really be able to detect feldspar minerals, unless there's really, really a lot of feldspar and very little of the dark minerals that you get in basalt,\" Wray said. The location of the feldspar and absence of dark minerals inside the ancient volcano provides an explanation for how granite could form on Mars. While the magma slowly cools in the subsurface, low density melt separates from dense crystals in a process called fractionation. The cycle is repeated over and over for millennia until granite is formed. This process could happen inside of a volcano that is active over a long period of time, according to the computer simulations run in collaboration with Josef Dufek, who is also an associate professor in the School of Earth and Atmospheric Sciences at Georgia Tech. \"We think some of the volcanoes on Mars were sporadically active for billions of years,\" Wray said. \"It seems plausible that in a volcano you could get enough iterations of that reprocessing that you could form something like granite.\" This process is sometimes referred to as igneous distillation. In this case the distillation progressively enriches the melt in silica, which makes the melt, and eventual rock, lower density and gives it the physical properties of granite. \"These compositions are roughly similar to those comprising the plutons at Yosemite or erupting magmas at Mount St. Helens, and are dramatically different than the basalts that dominate the rest of the planet,\" Dufek said. Another study published in the same edition of\nNature Geoscience\nby a different research team offers another interpretation for the feldspar-rich signature on Mars. That team, from the European Southern Observatory and the University of Paris, found a similar signature elsewhere on Mars, but likens the rocks to anorthosite, which is common on the moon. Wray believes the context of the feldspar minerals inside of the volcano makes a stronger argument for granite. Mars hasn't been known to contain much of either anorthosite or granite, so either way, the findings suggest the Red Planet is more geologically interesting than before. \"We talk about water on Mars all the time, but the history of volcanism on Mars is another thing that we'd like to try to understand,\" Wray said. \"What kinds of rocks have been forming over the planet's history? We thought that it was a pretty easy answer, but we're now joining the emerging chorus saying things may be a little bit more diverse on Mars, as they are on Earth.\" This research is supported by the NASA Mars Data Analysis Program under award NNX13AH80G. Any conclusions or opinions are those of the authors and do not necessarily represent the official views of the sponsoring agencies. CITATION : J Wray, et al. \"Prolonged magmatic activity on Mars inferred from the detection of felsic rocks.\" ( Nature Geoscience , 2013)\nhttp://dx.doi.org/10.1038/NGEO1994 . Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia  30332-0181  USA Media Contacts:\nBrett Israel (404-385-1933) ( brett.israel@comm.gatech.edu ) or John Toon (404-8946986) ( jtoon@gatech.edu ) Writer : Brett Israel\nAdditional Images\nContact\nBrett Israel 404-385-1933 brett.israel@comm.gatech.edu\nEmail\nbrett.israel@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}