{"text": "Educator finds fulfillment in bridging carpet industry, community, and workforce development needs | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nEducator finds fulfillment in bridging carpet industry, community, and workforce development needs\nEach month the Georgia Manufacturing Extension Partnership profiles Georgians who are involved in manufacturing.\nFacebook\nTwitter\nEmail\nBrian Cooksey is  director of operations training and development at Shaw Industries in Dalton, Ga.\nJun 17, 2015\n— Atlanta, GA\nDid you know that 85 percent of all carpet manufactured in the United States is produced in Georgia, and more than 70 percent comes from the Dalton region? Brian Cooksey, director of operations training and development at Shaw Industries, has made it his mission to show younger generations how different the industry is today from years past and that there are numerous exciting and challenging career choices in manufacturing. These include career opportunities people wouldn’t immediately connect with being part of manufacturing: chemists, interior designers, and advanced robotics programmers, among others. “It’s not your grandfather’s carpet mill,” he says, as he takes visitors through one of Shaw’s plants. “It’s an advanced manufacturing facility.” Cooksey is the Georgia Manufacturing Extension Partnership’s (GaMEP) June Face of Manufacturing. Manufacturing — which employs 365,000 across Georgia — remains a critical sector in the Peach State’s economy. The Faces of Manufacturing initiative is designed to show how individuals such as Cooksey and the companies where they work keep the communities in which they operate strong and thriving economically and socially. “Growing up in a small town that was supported by two large manufacturing plants, it was clear that manufacturing jobs provided for families and helped support my community,” he said. “I found that to be the same in Dalton and in Shaw.” Keeping the industry strong explains why Cooksey is committed to the Investing in Manufacturing Communities Partnership (IMCP) initiative, where he serves on the workforce development and steering committees for regional efforts in Northwest Georgia. IMCP’s goal is to sustain the region’s floorcovering industry and keep it competitive. It tackles workforce development by assessing skills gaps and creating training curriculums, expanding supplier networks, and making operational improvements. “The floorcovering industry is the backbone of our community,” Cooksey said. Cooksey’s job is twofold. He is charged with keeping the carpet and flooring giant’s current workforce ready and nimble for its needs. He also leads several key initiatives to get the next generation of potential workers interested in manufacturing. In 2010, he led efforts to create the Design, Engineering, and Manufacturing Camp for middle school students in Whitfield County. The camp, which has steadily grown from 24 in its inaugural year to this summer’s 125, shows youngsters how to solve problems and to think creatively and independently, but also to work as part of a team. The kids get to design and build racing cars, carpet squares, and rockets using the same machines, tools, and software used in manufacturing. Cooksey, the child of educators, also led a team in writing the Mechatronics Pathway curriculum, which is geared to high school students. The program, which has served as a model and is being adopted across Georgia, connects students’ interests and skills with manufacturers’ needs. The program also provides high school students who are interested in manufacturing with college credit, scholarships, internships, and apprenticeships. “Students need to experience a manufacturing plant firsthand and see if it’s something they want to do,” Cooksey said. “It’s about shifting the image that kids have about manufacturing, and in doing so, we will change the game in workforce development for our communities and Georgia.” By Péralte C. Paul\nAdditional Images\nRelated links\nBrian Cooksey\nFaces of Manufacturing\nContact\nFor media inquiries contact: Laura Diamond Georgia Tech Media Relations  laura.diamond@gatech.edu For more information about GaMEP contact: Katie Takacs GaMEP Marketing Manager katie.takacs@innovate.gatech.edu\nEmail\nperalte.paul@comm.gatech.edu\nAdditional information\nAbout the Faces of Manufacturing  Each month, GaMEP will highlight a different person as the Face of Manufacturing. Those chosen as the Face of Manufacturing will be selected by a 12-member committee composed of representatives from Georgia Tech, economic development groups, manufacturing companies, and related associations.\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}