{"text": "National Science Foundation Awards Georgia Institute of Technology’s VentureLab a 5-year I-Corps Grant | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNational Science Foundation Awards Georgia Institute of Technology’s VentureLab a 5-year I-Corps Grant\nGrant to fund four-school initiative that includes Tech, University of Alabama, University of Alabama at Birmingham, and University of Tennessee, Knoxville\nFacebook\nTwitter\nEmail\nVentureLab director Keith McGreggor (pictured, foreground) is I-Corps South Node co-principal investigator and executive director. The I-Corps program helps NSF-funded researchers learn how to commercialize their findings and determine if a market actually exists for what they developed.  This new NSF grant expands Georgia Tech’s efforts and creates the I-Corps South Node, which includes Tech, the University of Alabama in Tuscaloosa, the University of Alabama at Birmingham, and the University of Tennes\nSep 27, 2016\n— Atlanta, GA\nThe National Science Foundation (NSF) awarded a $3.4 million Innovation Corps (I-Corps) grant to the Georgia Institute of Technology’s VentureLab program to expand its work in teaching entrepreneurship, support research and innovation.\nThe NSF’s I-Corps program — a boot camp that shows what it’s like to form a startup — helps NSF-funded researchers learn how to commercialize their findings and determine if a market actually exists for what they developed.\n“I-Corps nodes support the national innovation ecosystem and help some of America’s brightest researchers test the commercial potential of their discoveries,” Grace Wang, acting assistant director for the NSF Directorate for Engineering, said in a statement. “We are thrilled to support these regional innovation hotbeds, which will help to foster local economic development and expand access to more researchers of all different backgrounds who seek entrepreneurship training.”\nThe grant, one of five the NSF awarded to schools across the country, supports innovation hubs called I-Corps nodes.\nThis new NSF grant expands Georgia Tech’s efforts and creates the I-Corps South Node, which includes Tech, the University of Alabama in Tuscaloosa, the University of Alabama at Birmingham, and the University of Tennessee, Knoxville, Haslam College of Business.\nBecause of its long experience with forming companies from university research, Georgia Tech — through its VentureLab incubator — was selected in 2012 to be among the first institutions to become “nodes” teaching the I-Corps curriculum. VentureLab is Georgia Tech’s technology commercialization incubator that primarily serves Tech faculty, staff, and students who seek to launch startup companies from the technology innovations they have developed.\n“This effort underscores Georgia Tech’s economic development mission and commitment to creating the next generation of entrepreneurial problem solvers,” said Chris Downing, who is the I-Corps South Node’s principal investigator and vice president of the Enterprise Innovation Institute (EI 2 ), Tech’s chief economic development and extension outreach arm. “Through our collective service efforts to entrepreneurs, business, researchers, and innovators, Georgia Tech and our partner schools in Alabama and Tennessee are working together to design a foundation of regional innovation in the Southeast.”\nSpecifically, the I-Corps South Node aims to:\nAccelerate the development of the South's entrepreneurial ecosystems\nProvide for increased partnership opportunities between academia and industry\nFocus on underrepresented minorities through programs at historically black colleges and universities and in Puerto Rico to increase the participation of individuals from those communities in research pursuits and entrepreneurship\n“We are extremely excited to partner with these three premier schools to collectively leverage our extensive industry relationships, partnerships, mentors, and funding connections to bring economic development through startup formation, workforce development, and entrepreneurial education,” said Keith McGreggor, VentureLab director and I-Corps South Node co-principal investigator and executive director.\n“Through this partnership, the I-Corps South Node has the potential to reach more than 500,000 graduate and undergraduate students, and many thousands of the nation's research faculty at research universities and historically black colleges and universities across the Southeast and the island of Puerto Rico.”\nNSF created the I-Corps program in 2011 and since then, more than 800 teams have completed the NSF curriculum, from 192 universities in 44 states. That’s resulted in the creation of more than 320 companies that have collectively raised more than $83 million in follow-on funding.\nAt Georgia Tech, more than 40 teams have finished the I-Corps program, leading to the creation of more than 20 spinouts that have collectively raised more than $4.5 million in follow-up funding.\nAbout VentureLab:\nVentureLab — ranked as North America’s No. 5 university-based startup incubator — is Georgia Tech’s technology commercialization program that provides comprehensive assistance to faculty, staff, and students who want to form startups. VentureLab helps those entrepreneurs turn their ideas into early-stage companies through business model development, making connections between the innovators and seasoned entrepreneurs, locating sources of early-stage financing, and preparing these fledgling startups for the business world. Since its 2001 founding, VentureLab — a program of the Enterprise Innovation Institute, Georgia Tech’s chief economic development arm — has launched more than 250 technology companies that have attracted more than $1.5 billion in outside funding. Visit\nventurelab.gatech.edu\nfor more information. For additional information about I-Corps South, visit\nicorpssouth.com .\nAbout NSF I-Corps:\nThe NSF I-Corps program, a public-private partnership program established in 2011, connects NSF-funded scientific research with the technological, entrepreneurial, and business communities to help create a stronger national ecosystem for innovation that couples scientific discovery with technology development and societal needs. Visit\nwww.nsf.gov/news/special_reports/i-corps/\nfor more information.\nAdditional Images\nRelated links\nI-Corps South\nGT VentureLab\nContact\nLaura Diamond\nGeorgia Tech Media Relations\n404-894-6016  Laura.diamond@comm.gatech.edu\n@LauraRDiamond\nEmail\nperalte.paul@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}