{"text": "Georgia Tech Examines Impact of Hurricane Katrina | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Examines Impact of Hurricane Katrina\nGeorgia Tech, National Academy of Engineering hosted a roundtable discussion on disaster readiness.\nFacebook\nTwitter\nEmail\nAug 06, 2015\n— Atlanta, GA\nAs the nation prepares to mark the 10th anniversary of Hurricane Katrina, a panel of experts discussed what this country has learned and how prepared U.S. cities are for the next natural disaster. The Georgia Institute of Technology and the National Academy of Engineers hosted a media roundtable Wednesday in Washington, D.C., on the topic: “10 Years after Katrina: Are American Cities Ready?” While Katrina remains one of the deadliest and costliest hurricanes in U.S. history, in the immediate aftermath many people thought the problem was isolated to New Orleans because it was built below sea level, said Georgia Tech President Emeritus G. Wayne Clough. Opinions have changed in recent years, said Clough, who led an independent panel investigation of the Department of Defense and response to the storm. “Hurricane Sandy was a wake-up call that this could happen to anyone,” Clough said. “Sandy changed people’s minds and … in many ways had more of an impact than Katrina did.” Panelists listed several cities at risk, including Miami, Tampa, Charleston and Norfolk. Some cities are at risk because of geography, rising sea levels and climate change. However, too many cities fail to have the needed discussions and preparations because they have not recently felt the impact of a natural disaster, said Reggie DesRoches, the Karen and John Huff School Chair of Georgia Tech’s School of Civil and Environmental Engineering. Increased emphasis on local communities is something government leaders, engineers and others should do to improve disaster resilience response, panelists said. While communities will receive help from their region, state and the federal government, there are many things local citizens must decide. “Will they move off a barrier island or elevate their homes or invest in communications?” asked Lt. General Thomas Bostick, commanding general of the U.S. Army Corps of Engineers. “How do you adapt and come out stronger than you were?” Since Katrina, the Corps is working more closely with stakeholders and is taking a more systematic approach that goes beyond infrastructure, Bostick said. This approach includes collaborating with local communities. During the recent flood season, the Tulsa district turned to social media and had more than 65 million hits, he said. During the nearly 90-minute discussion, the six panelists answered questions posed by reporters from the Associated Press, Science News and U.S. News & World Report. Audience members, including guests of Georgia Tech and the National Academy of Engineering, also participated in the discussion. While the panelists agreed much has been learned since Katrina and improvements have been made, they said deficiencies remain. For example, there needs to be a deeper understanding of the social science and behavioral component surrounding natural disasters, said Lauren Sauer, associate director of the National Center for the Study of Preparedness and Catastrophic Event Response at Johns Hopkins University. Alton Romig Jr., executive officer of the National Academy of Engineering, said there is a lack of clarity when it comes to communication and authority around natural disasters. A lot of tools fail to get “into the right hands at the right time,” he said. Reporters asked about the logic in designing the New Orleans levees and floodwalls to withstand a 100-year storm – one with a 1 percent chance of occurring in any year. While that design allowed the city to withstand Hurricane Isaac, there are questions as to whether something stronger should have been built. Greg Baecher, professor of civil engineering at the University of Maryland, explained the 100-year storm was based on protecting real estate. This country needs to come to an agreement as to what is an acceptable or tolerable risk for human life, said Baecher, who conducted inter-agency federal risk analysis after Hurricane Katrina. “What is the right level of protecting people,” he asked. “It’s probably less frequent than a 1 percent storm.”\nRelated links\n10 Years after Katrina: Are American Cities Ready?\nContact\nLaura Diamond  Georgia Tech Media Relations 404-894-6016\nEmail\nlaura.diamond@gatech.edu\nAdditional information\nRoundtable Initiative Georgia Tech’s national media roundtable initiative brings together thought leaders from different organizations to discuss important issues. This was Georgia Tech’s fourth roundtable. Others examined the\nfuture of online learning in higher education\nand how to attract more\nfemale engineers\nand\nAfrican-American men into STEM . This initiative is the result of a partnership between Georgia Tech’s Office of Development, Institute Communications, Office of Government and Community Relations and individual colleges.\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}