{"text": "Freeman Named Interim Associate Vice Provost for the Arts | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nFreeman Named Interim Associate Vice Provost for the Arts\nIn the new role, Freeman will promote the infusion of the arts into teaching, research, and service across Georgia Tech.\nFacebook\nTwitter\nEmail\nJason Freeman\nFeb 29, 2024\nJason Freeman, chair and professor in Georgia Tech’s School of Music, has been named the Institute’s interim associate vice provost for the Arts (AVP-Arts), effective March 15. The role is new and will report to Laurence Jacobs, senior vice provost for Education and Learning.\n“For decades, the arts have enriched our campus community through extracurricular, cocurricular, and curricular programs,” said Jacobs. “The strategic planning process identified even greater opportunities to integrate the arts into academics and research, and to create newly imagined experiences and educational offerings for our students. Jason Freeman brings a wealth of experience and vision to this new role, and I look forward to working with him.”\nFreeman has been part of the Georgia Tech faculty for nearly 20 years and has served as chair of the School of Music since 2018. Freeman’s scholarly research and creative work focus on using technology to engage diverse audiences in collaborative, experimental, and accessible musical experiences. He also develops educational interventions that integrate music and computing to broaden and increase engagement in STEM disciplines.\nFreeman is the co-creator of EarSketch, a free web-based learning platform that teaches Python and JavaScript coding through music composition and remixing. Freeman and Georgia Tech’s Professor of Digital Media, Brian Magerko, founded EarSketch in 2011 to create new pathways to STEM for students from historically underrepresented communities to learn computing skills. EarSketch has been used by more than 1 million students worldwide and has been translated into half a dozen languages.\nFreeman has also played an integral role in Georgia Tech’s Guthman Musical Instrument Competition, a one-of-a-kind competition that brings musical inventors from around the world to share their creations and ideas about the future of music. Under Freeman’s leadership, the annual competition has grown in visibility through collaborations with Atlanta-area musicians, a partnership with the Atlanta Science Festival, through the Guthman Music, Art, and Technology Fair showcasing the work of Georgia Tech students, and media coverage in\nThe New York Times\nand\nPopular Science , among others.\nAs chair of the School of Music, Freeman has facilitated rapid growth in music offerings, including a 50% jump in student credit hours and a 66% increase in music technology degree enrollment. Under Freeman’s leadership, the School of Music has grown the music faculty, improved and expanded curricular offerings, renovated music facilities, and strengthened community and industry partnerships. Prior to his appointment as chair of the School of Music, Freeman chaired Georgia Tech’s Arts Council and served as executive director of Sonic Generator, an ensemble-in-residence that showcased technology-infused contemporary chamber music in concerts that were routinely named to best-of-year lists by Atlanta arts journalists.\nIn the new role, Freeman will promote the infusion of the arts into teaching, research, and service across Georgia Tech while also creating spaces and experiences for students, faculty, staff, and the broader community to come together through the arts. He notes that Georgia Tech is uniquely positioned not only to transform the arts among the campus community but to accelerate the region’s reputation as one of the most innovative creative centers in the world.\n“This is the most exciting moment for the arts in all of my years at Georgia Tech. There is incredible momentum building from faculty, students, and staff across the campus to create new curricular offerings, embark on new research endeavors, build new partnerships, and construct new facilities that make the arts a central pillar of our mission and our institutional culture,” said Freeman. “At the same time, the arts ecosystem in Georgia is growing at an unprecedented rate, and in a way that is putting technology at the center of creative practice.”\nFreeman will liaise with College deans, School chairs, and faculty to design and lead the implementation of innovative programs that develop and incorporate the arts across the academic and research enterprises, including facilitating the creation of new interdisciplinary courses and degree programs that incorporate artistic elements. Freeman will also provide leadership to the Arts Square strategic planning initiative. In this role, he will act as Georgia Tech’s liaison to the Alliance for the Arts in Research Universities and foster other meaningful connections between the Institute and key stakeholders within the broader arts ecosystem.\nFreeman’s music has been performed at Carnegie Hall, exhibited at ACM SIGGRAPH, published by Universal Edition, broadcast on public radio’s\nPerformance Today , and commissioned through support from the National Endowment for the Arts. Freeman’s wide-ranging work has attracted funding from sources such as the National Science Foundation, Google, and Amazon, and has been disseminated through more than 100 refereed book chapters, journal articles, and conference publications.\nContact\nOffice of the Senior Vice Provost for Education and Learning\nEmail\nprovostsoffice@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}