{"text": "Engineered Bacteria Produce Biofuel Alternative for High-Energy Rocket Fuel | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nEngineered Bacteria Produce Biofuel Alternative for High-Energy Rocket Fuel\nResearchers are using engineered bacteria to produce a hydrocarbon that may be useful as a rocket fuel.\nFacebook\nTwitter\nEmail\nGeorgia Tech researchers examine the production of the hydrocarbon pinene in a series of laboratory test tubes. Shown are (l-r) Pamela Peralta-Yahya, an assistant professor in the School of Chemistry and Biochemistry and the School of Chemical and Biomolecular Engineering, and Stephen Sarria, a graduate student in the School of Chemistry and Biochemistry. (Georgia Tech Photo: Rob Felt)\nMar 26, 2014\n— Atlanta, GA\nResearchers at the Georgia Institute of Technology and the Joint BioEnergy Institute have engineered a bacterium to synthesize pinene, a hydrocarbon produced by trees that could potentially replace high-energy fuels, such as JP-10, in missiles and other aerospace applications. With improvements in process efficiency, the biofuel could supplement limited supplies of petroleum-based JP-10, and might also facilitate development of a new generation of more powerful engines. By inserting enzymes from trees into the bacterium, first author and Georgia Tech graduate student Stephen Sarria, working under the guidance of assistant professor\nPamela Peralta-Yahya , boosted pinene production six-fold over earlier bioengineering efforts. Though a more dramatic improvement will be needed before pinene dimers can compete with petroleum-based JP-10, the scientists believe they have identified the major obstacles that must be overcome to reach that goal. Funded by Georgia Tech startup funds awarded to Peralta-Yahya’s lab and by the U.S. Department of Energy’s Office of Science, the research was reported February 27, 2014, in the journal\nACS Synthetic Biology . “We have made a sustainable precursor to a tactical fuel with a high energy density,” said Peralta-Yahya, an assistant professor in the\nSchool of Chemistry and Biochemistry\nand the\nSchool of Chemical and Biomolecular Engineering\nat Georgia Tech. “We are concentrating on making a ‘drop-in’ fuel that looks just like what is being produced from petroleum and can fit into existing distribution systems.” Fuels with high energy densities are important in applications where minimizing fuel weight is important. The gasoline used to power automobiles and the diesel used mainly in trucks both contain less energy per liter than the JP-10. The molecular arrangement of JP-10, which includes multiple strained rings of carbon atoms, accounts for its higher energy density. The amount of JP-10 that can be extracted from each barrel of oil is limited, and sources of potentially comparable compounds such as trees can’t provide much help. The limited supply drives the price of JP-10 to around $25 per gallon. That price point gives researchers working on a biofuel alternative a real advantage over scientists working on replacing gasoline and diesel. “If you are trying to make an alternative to gasoline, you are competing against $3 per gallon,” Peralta-Yahya noted. “That requires a long optimization process. Our process will be competitive with $25 per gallon in a much shorter time.” While much research has gone into producing ethanol and bio-diesel fuels, comparatively little work has been done on replacements for the high-energy JP-10. Peralta-Yahya and collaborators set out to improve on previous efforts by studying alternative enzymes that could be inserted into the\nE. coli\nbacterium. They settled on two classes of enzymes – three pinene synthases (PS) and three geranyl diphosphate synthases (GPPS) – and experimented to see which combinations produced the best results. Their results were much better than earlier efforts, but the researchers were puzzled because for a different hydrocarbon, similar enzymes produced more fuel per liter. So they tried an additional step to improve their efficiency. They placed the two enzymes adjacent to one another in the\nE. coli\ncells, ensuring that molecules produced by one enzyme would immediately contact the other. That boosted their production to 32 milligrams per liter – much better than earlier efforts, but still not competitive with petroleum-based JP-10. Peralta-Yahya believes the problem now lies with built-in process inhibitions that will be more challenging to address. “We found that the enzyme was being inhibited by the substrate, and that the inhibition was concentration-dependent,” she said. “Now we need either an enzyme that is not inhibited at high substrate concentrations, or we need a pathway that is able to maintain low substrate concentrations throughout the run. Both of these are difficult, but not insurmountable, problems.” To be competitive, the researchers will have to boost their production of pinene 26-fold. Peralta-Yahya says that’s within the range of possibilities for bioengineering the\nE. coli . “Even though we are still in the milligrams per liter level, because the product we are trying to make is so much more expensive than diesel or gasoline means that we are relatively closer,” she said. Theoretically, it may be possible to produce pinene at a cost lower than that of petroleum-based sources. If that can be done – and if the resulting bio-fuel operates well in these applications – that could open the door for lighter and more powerful engines fueled by increased supplies of high-energy fuels. Pinene dimers, which result from the dimerization of pinene, have already been shown to have an energy density similar to that of JP-10. Co-authors from the Joint BioEnergy Institute included Betty Wong, Hector Garcia Martin and Professor Jay D. Keasling, co-corresponding author of the paper. CITATION : Stephen Sarria, et al., “Microbial Synthesis of Pinene,” (ACS Synthetic Biology, 2014). ( http://dx.doi.org/10.1021/sb4001382 ). This work was started at the DOE Joint BioEnergy Institute (JBEI) and finished at the Georgia Institute of Technology. The work at JBEI was funded by the U.S. Department of Energy, Office of Science, Office of Biological and Environmental Research through contract DE-AC02-05CH11231 between Lawrence Berkeley National Laboratory and the U.S. Department of Energy. The work at the Georgia Institute of Technology was funded by startup funds awarded to the Peralta-Yahya laboratory. Any opinions expressed are those of the authors and do not necessarily represent the official views of the DOE. Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia  30332-0181  USA Media Relations Contacts : John Toon ( jtoon@gatech.edu ) (404-894-6986) or Brett Israel ( brett.israel@comm.gatech.edu ) (404-385-1933). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}