{"text": "Looking Back 3.8 Billion Years into the Root of the “Tree of Life” | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nLooking Back 3.8 Billion Years into the Root of the “Tree of Life”\nResearchers are tapping information found in the cells of all life on Earth, and using it to trace life’s evolution.\nFacebook\nTwitter\nEmail\nImage shows Georgia Tech Professor Loren Williams (left) and Research Scientist Anton Petrov in front of a large tree that symbolizes the growth and accretion of the ribosome over time. (Credit: Rob Felt, Georgia Tech)\nNov 30, 2015\n— Atlanta, GA\nNASA-funded researchers at the Georgia Institute of Technology are tapping information found in the cells of all life on Earth, and using it to trace life’s evolution. They have learned that life is a master stenographer – writing, rewriting and recording its history in elaborate biological structures. Some of the keys to unlocking the origin of life lie encrypted in the ribosome, life’s oldest and most universal assembly of molecules. Today’s ribosome converts genetic information (RNA) into proteins that carry out various functions in an organism. But the ribosome itself has changed over time. Its history shows how simple molecules joined forces to invent biology, and its current structure records ancient biological processes that occurred at the root of the Tree of Life, some 3.8 billion years ago. By examining variations in the ribosomal RNA contained in modern cells, scientists can visualize the timeline of life far back in history, elucidating molecular structures, reactions and events near the biochemical origins of life. “Biology is a great keeper of records,” said\nLoren Williams , a professor in the Georgia Tech\nSchool of Chemistry and Biochemistry , and principal investigator for the\nNASA Astrobiology Institute’s\nGeorgia Tech Center for Ribosome Adaptation and Evolution from 2009-2014. “We are figuring out how to read some of the oldest records in biology to understand pre-biological processes, the origin of life, and the evolution of life on Earth.” The study was reported November 30 in the Early Edition of the journal\nProceedings of the National Academy of Sciences . Like rings in the trunk of a tree, the ribosome contains components that functioned early on in its history. The center of the trunk records the tree’s youth, and successive rings represent each year of the tree’s life, with the outermost layer recording the present. Just as the core of a tree’s trunk remains unchanged over time, all modern ribosomes contain a common core dating back 3.8 billion years. This common core is the same in all living organisms, including humans. “The ribosome recorded its history,” said Williams. “It accreted and got bigger and bigger over time. But the older parts were continually frozen after they accreted, just like the rings of a tree. As long as that tree lives, the inner rings will not change. The very core of the ribosome is older than biology, produced by evolutionary processes that we still don’t understand very well.” While exploiting this record-keeping ability of the ribosome reveals how biology has changed over time, it can also point to the environmental conditions on Earth in which that biology evolved, and help inform our search for life elsewhere in the Universe. “This work enables us to look back in time past the root of the tree of life – the ancestor of all modern cells – to a time when proteins and nucleic acids had not yet become the basis for all biochemistry,” said Carl Pilcher, interim director of the NASA Astrobiology Institute. “It helps us understand some of the earliest stages in the development of life on Earth, and can guide our search for extraterrestrial environments where life may have developed.” By rewinding, reverse engineering, and replaying this ancient ribosomal tape, researchers are uncovering the secrets of creation and are answering foundational, existential questions about our place in the Universe. By studying more additions to the ribosome, the research team – with key contributions by Georgia Tech Research Scientist Anton Petrov – found “molecular fingerprints” that show where insertions were made, allowing them to discern the rules by which it grew. Using a technique they call the Structural Comparative Method, the researchers were able to model the ribosome’s development in great detail. “By taking ribosomes from a number of species – humans, yeast, various bacteria and archaea – and looking at the outer portions that are variable, we saw that there were very specific rules governing how they change,” said Williams. “We took those rules and applied them to the common core, which allowed us to see all the way back to the first pieces of RNA.” Some clues along the way helped. For instance, though RNA is now responsible for creating proteins, the very earliest life had no proteins. By looking for regions of the ribosome that contain no proteins, the researchers could determine that those elements existed before the advent of proteins. “Once the ribosome gained a certain capability, that changed its nature,” Williams said. While the ribosomal core is the same across species, what’s added on top differs. Humans have the largest ribosome, encompassing some 7,000 nucleotides representing dramatic growth from the hundred or so base pairs at the beginning. “What we’re talking about is going from short oligomers, short pieces of RNA, to the biology we see today,” said Williams. “The increase in size and complexity is mind-boggling.” The researchers obtained their ribosomes from structure and sequence databases that have been produced to help scientists identify new species. Ribosomes can be crystallized, which reveals their three dimensional structures. Beyond understanding how evolution played out over time, this knowledge of the ribosome’s development could have more practical modern-day health applications. “The ribosome is one of the primary target for antibiotics, so understanding its architecture and consistency throughout biology could be of great benefit,” said Williams. “By studying the ribosome, we can start thinking about biology in a different way. We can see the symbiotic relationship between RNA and proteins.” As a next step, Williams and colleagues are now using experiments to verify what their model shows. “We have a coherent and consistent model that accounts for all the data we have going all the way back to a form of biology that is very primitive compared to what we have now,” Williams explained. “We plan to continue testing the predictions of the model.” In addition to those already named, the research included Burak Gulen, Ashlyn Norris, Chad Bernier, Nicholas Kovacs, Kathryn Lanier, Stephen Harvey, Roger Wartell and Nicholas Hud from Georgia Tech, and George Fox from the University of Houston. This research was funded in part by the NASA Astrobiology Institute under grant NNA09DA78A. The content is solely the responsibility of the authors and does not necessarily represent the official views of NASA. Founded in 1998, the NASA Astrobiology Institute (NAI) is a partnership between NASA, 12 U.S. research teams, and 14 international consortia. NAI’s goals are to promote, conduct, and lead interdisciplinary astrobiology research, train a new generation of astrobiology researchers, and share the excitement of astrobiology with learners of all ages. The NAI is part of NASA’s Astrobiology Program which supports research into the origins, evolution, distribution, and future of life in the Universe. http://astrobiology.nasa.gov/ Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 Media relations Contacts: Georgia Tech – John Toon (404-894-6986) ( jtoon@gatech.edu ). NASA Astrobiology Institute -- Daniella Scalice, Ames Research Center, Moffett Field, Calif.\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}