{"text": "Tech Welcomes Record Number of First-Year and Transfer Students | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nTech Welcomes Record Number of First-Year and Transfer Students\nThe Institute continues to expand access to students from a variety of backgrounds.\nFacebook\nTwitter\nEmail\nGeorgia Tech welcomes students at New Student Convocation in Bobby Dodd Stadium.\nAug 19, 2022\n— Atlanta, GA\nIn Spring, Summer, and Fall of 2022, Georgia Tech welcomed 5,131 new first-year and transfer students. Sixteen percent of incoming students come from a household where neither parent graduated from college — an increase of 2.5% over last year. Hailing from 47 states and 84 countries, 43% of the first-year class comes from a home in which a language in addition to English is spoken.\n“There has never been a more important time for our state and nation to produce talented, globally connected students than now, and Tech is responding by expanding access to more students from a wide variety of backgrounds,” said Rick Clark, assistant vice provost and executive director of Undergraduate Admission. “Last year, for the first time in Georgia Tech’s history, 40 % of our undergraduate population was comprised of women — a trend that will continue as our new first-year class is 42% female.”\nIn recent years, due in part to Tech’s global reputation and demonstrated value, popularity among high school students and college transfer students has increased dramatically. Nearly 27% of new students (1,400) are transferring from another university — the majority through Tech’s strategic pathway programs, including those designed for veterans, first-generation students, Pell-eligible students, and more.\nThis year, a record 50,568 students applied for first-year admission — a 25% increase in the past two years. The overall admit rate is 17%, with 35% of Georgia applicants and 13% of non-Georgia applicants being admitted.\n“We are particularly proud that while many schools nationally are declining in their underrepresented students on campus, our new class includes a record number of Black, Hispanic, and first-generation students,” Clark added. “There is no question companies like Google, Microsoft, and others, are moving to Atlanta and hiring on campus because they value the education, experience, perspective, and diversity our graduates provide.”\nThe most popular majors selected by first-year students are computer science, mechanical engineering, biomedical engineering, aerospace engineering, and business administration, with 89% planning to pursue an advanced degree. Outside the classroom, students plan to be involved in co-op or internship programs, undergraduate research, community service, study abroad, entrepreneurship, instrumental music, and fraternities or sororities.\nCampus Tours Move to John Lewis Student Center\nBeginning Aug. 29, the Undergraduate Admission daily visit program will move to the new John Lewis Student Center. These programs were previously held in the Bill Moore Student Success Center, where offices are located for the Undergraduate Admission team.\n“We are really excited about this change because it will allow visitors to be able to better experience student life on campus,” said Andrew Cohen, associate director for Guest Experience for Undergraduate Admission. “It will also allow us to show more of campus due to the central location.” Undergraduate Admission hosts around 40,000 visitors a year in the form of campus tours, visits, and other information sessions\nLearn more about planning a visit to Georgia Tech.\nAdditional Images\nContact\nVictor Rogers\nInstitute Communications\nEmail\nvictor.rogers@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}