{"text": "Scientists Demonstrate Basics of Nucleic Acid Computing Inside Cells | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nScientists Demonstrate Basics of Nucleic Acid Computing Inside Cells\nUsing strands of nucleic acid, scientists have demonstrated basic computing operations inside a living mammalian cell.\nFacebook\nTwitter\nEmail\nImage shows activation of “AND” gates in cells as observed by fluorescence microscopy. (Credit: Chiara Zurla, Georgia Tech)\nJan 19, 2016\n— Atlanta, GA\nUsing strands of nucleic acid, scientists have demonstrated basic computing operations inside a living mammalian cell. The research could lead to an artificial sensing system that could control a cell’s behavior in response to such stimuli as the presence of toxins or the development of cancer. The research uses DNA strand displacement, a technology that has been widely used outside of cells for the design of molecular circuits, motors and sensors. Researchers modified the process to provide both “AND” and “OR” logic gates able to operate inside the living cells and interact with native messenger RNA (mRNA). The tools they developed could provide a foundation for bio-computers able to sense, analyze and modulate molecular information at the cellular level. Supported by the Defense Advanced Research Projects Agency (DARPA) and the National Science Foundation (NSF), the research was reported December 21 in the journal\nNature Nanotechnology . “The whole idea is to be able to take the logic that is used in computers and port that logic into cells themselves,” said\nPhilip Santangelo , an associate professor in the\nWallace H. Coulter Department of Biomedical Engineering at Georgia Tech and Emory University . “These devices could sense an aberrant RNA, for instance, and then shut down cellular translation or induce cell death.” Strand displacement reactions are the biological equivalent of the switches or gates that form the foundation for silicon-based computing. They can be programmed to turn on or off in response to an external stimuli such as a molecule. An “AND” gate, for example, would switch when both conditions were met, while an “OR” gate would switch when either condition was met. In the switches the researchers used, a fluorophore reporter molecule and its complementary quenching molecule were placed side-by-side to create an “off” mode. Binding of RNA in one of the strands then displaced a portion of nucleic acid, separating the molecules and allowing generation of a signal that created an “on” mode. Two “on” modes on adjacent nucleic acid strands created an “AND” gate. “Demonstrating individual logic gates is only a first step,” said Georg Seelig, assistant professor of computer science and engineering and electrical engineering at the University of Washington. “In the longer term, we want to expand this technology to create circuits with many inputs, such as those we have constructed in cell-free settings.” The researchers used ligands designed to bind to specific portions of the nucleic acid strands, which can be created as desired and produced by commercial suppliers. “We sensed molecules and showed that we could respond to them,” said Santangelo. “We showed that we could utilize native molecules in the cell as part of the circuit, though we haven’t been able to control a cell yet.” Getting basic computing operations to function inside cells was no easy task, and the research required a number of years to accomplish. Among the challenges were getting the devices into the cells without triggering the switches, providing operation rapid enough to be useful, and not killing the human cell lines that researchers used in the lab. “We had to chemically change the probes to get them to work inside the cell and to make them stable enough inside the cells,” said Santangelo. “We found that these strand displacement reactions can be slow within the cytosol, so to get them to work faster, we built scaffolding onto the messenger RNA that allowed us to amplify the effects.” The nucleic acid computers ultimately operated as desired, and the next step is to use their switching to trigger the production of signaling chemicals that would prompt the desired reaction from the cells. Cellular activity is normally controlled by the production of proteins, so the nucleic acid switches will have to be given the ability to produce enough signaling molecules to induce a change. “We need to generate enough of whatever final signal is needed to get the cell to react,” Santangelo explained. “There are amplification methods used in strand displacement technology, but none of them have been used so far in living cells.” Even without that final step, the researchers feel they’ve built a foundation that can be used to attain the goal. “We were able to design some of the basic logical constructs that could be used as building blocks for future work,” Santangelo said. “We know the concentrations of chemicals and the design requirements for individual components, so we can now start putting together a more complicated set of circuits and components.” Cells, of course, already know how to sense toxic molecules and the development malignant tendencies, and to then take action. But those safeguards can be turned off by viruses or cancer cells that know how to circumvent natural cellular processes. “Our mechanism would just give cells a hand at doing this,” Santangelo said. “The idea is to add to the existing machinery to give the cells enhanced capabilities.” Applying an engineering approach to the biological world sets this example apart from other efforts to control cellular machinery. “What makes DNA strand displacement circuits unique is that all components are fully rationally designed at the level of the DNA sequence,” said Seelig. “This really makes this technology ideal for an engineering approach. In contrast, many other approaches to controlling the cellular machinery rely on components that are borrowed from biology and are not fully understood.” Beyond those already mentioned, the research team included Benjamin Groves, Yuan-Jyue Chen and Sergii Pochekailov from the University of Washington and Chiara Zurla and Jonathan Kirschman from Georgia Tech and Emory University. This material is based on work supported by the Defense Advanced Research Projects Agency (DARPA) under contract W911NF-11-2-0068 and by National Science Foundation CAREER award 1253691. The content is solely the responsibility of the authors and does not necessarily represent the official views of DARPA or the NSF. CITATION : Benjamin Groves, et al., “Computing in mammalian cells with nucleic acid strand exchange,” (Nature Nanotechnology, 2015).\nhttp://dx.doi.org/10.1038/nnano.2015.278 Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contact : John Toon (404-894-6986) ( joon@gatech.edu ). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}