{"text": "With a desire to invest in the future of Georgia’s workforce, the Face of Manufacturing orchestrates the approval of the first German apprenticeship model in the U.S. | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nWith a desire to invest in the future of Georgia’s workforce, the Face of Manufacturing orchestrates the approval of the first German apprenticeship model in the U.S.\nEach month the Georgia Manufacturing Extension Partnership profiles Georgians who play a critical role in the industry.\nFacebook\nTwitter\nEmail\nMartin Pleyer, chief operating officer at Grenzebach in Newnan, Georgia, is the Georgia Manufacturing Extension Partnership’s (GaMEP) May Face of Manufacturing, for his efforts in investing in the future workforce within Georgia. A native of Germany, Pleyer was instumental in getting state legislators to enact a law to the first German Apprenticeship model program in the country for high school students. They will learn applicable skills to industry, earn money, graduate high school on time, and receive\nMay 17, 2016\n— Newnan, GA\nLt. Governor Casey Cagle visited several locations on May 16 to officially launch the inaugural class of the Industrial Mechanic Apprenticeship Model for Coweta County high school students. Cagle also established the Georgia Consortium for Advanced Technical Training (GA CATT), a partnership of industry, education, government and economic development organization that will support future initiatives across the state.   Students selected to participate will be a part of the first German Apprenticeship model program in the country. They will work on the Industrial Mechanic focus program at one of nine participating local manufacturing companies beginning in August. They will learn applicable skills to industry, earn money, graduate high school on time, and receive technical college credit. The program sets the students up for long-term manufacturing careers. “Georgia is the first state to secure these kinds of dynamic workforce development opportunities in the nation and our students will see tremendous benefits from this revolutionary program,\" Cagle said. \"We will begin by selecting 11 10 th\ngrade students to take part in this world class program and I look forward to expanding this model across the state for years to come.” The initiative stems from the efforts of Martin Pleyer, who is chief operating officer at Grenzebach. The company’s global headquarters are in Germany, Pleyer’s native country, but its U.S. operations are headquartered in Coweta County. Pleyer is the Georgia Manufacturing Extension Partnership’s (GaMEP) May Face of Manufacturing, for his efforts in investing in the future workforce within Georgia. He and the other 365,000 Georgians who work in the manufacturing industry are critical to the success of the Georgia economy. His story is one example of how those who have made a career in manufacturing help their communities remain economically competitive. Having grown up in Germany, Pleyer was required to choose an apprenticeship program — as with all teens in the country — where high school students are trained in one of more than 340 occupational fields, based on their choosing. The model requires them to spend 80 percent of their time working in the field and the remaining 20 percent in the classroom. The 80-20 split is designed to allow them to graduate on time while gaining hands-on experience in their field of choice. Pleyer, who as a child enjoyed working with his hands and asked for tools for his birthday, naturally chose manufacturing. “I was hooked the moment I stepped onto the plant floor,” Pleyer said. “I know it’s odd, but I loved the smell of the machine room. It just told me that something was being made.” After taking on a series of roles in manufacturing as an adult, Pleyer took an opportunity in 2011 to join Grenzebach. He and his family made the move to Georgia and he immersed himself in the greater Newnan community. However, as he became more involved in the company, he realized that one quarter of the plant floor workforce at Grenzebach would be retiring in the next five years. That’s when he got the idea to bring the German-based apprenticeship program to the U.S., helping to feed the pipeline of talent starting at the high school level. Pleyer used his connections and his influence in the community to garner interest from partners and other manufacturers to help develop a similar apprenticeship program. In 2015, Georgia lawmakers enacted Senate Bill 2, allowing for the apprenticeship program to be implemented in the state. “Georgia Tech helped connect the manufacturers with the school systems and the group used National Manufacturing Day, an initiative from GaMEP’s national sponsor, NIST, as a platform to begin the conversations,” said Karen Fite, director of the GaMEP, which is a federally and state-funded program at the Georgia Institute of Technology. “We are proud to help support a program to fill the pipeline of talent in Georgia.” About Grenzebach Founded in 1920 in Bavaria, Germany, Grenzebach has grown from a small repair shop to an international solutions provider with 18 locations on four continents for production, automation, and logistics. At the North American headquarters in Newnan, Georgia, Grenzebach manufactures equipment for the glass, solar, and building materials industries, including providing material handling for float lines, complete solutions for the Gypsum wallboard industry, AGV vehicles for warehouse automation, and equipment for the trucking industry to automatically measure tire pressure and tread depth. About the Faces of Manufacturing  Each month, GaMEP will highlight a different person as the Face of Manufacturing. Those chosen as the Face of Manufacturing will be selected by a committee composed of representatives from Georgia Tech, economic development groups, manufacturing companies, and related associations.\nAdditional Images\nRelated links\nGeorgia Manufacturing Extension Partnership\nMartin Pleyer\nContact\nFor media inquiries contact: Laura Diamond Georgia Tech Media Relations  laura.diamond@gatech.edu For more information about GaMEP contact: Katie Takacs GaMEP Marketing Manager katie.takacs@innovate.gatech.edu\nEmail\nperalte.paul@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}