{"text": "Reflection Speakers Find Common Ground | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nReflection Speakers Find Common Ground\nFor the three students selected as reflection speakers for their fellow graduates, the task is one final challenge as well as a great honor.\nFacebook\nTwitter\nEmail\nJacques Crawford, Emily Farmer, and Narayan Shirolkar\nDec 16, 2021\n— Atlanta, GA\nGeorgia Tech students are accustomed to performing under pressure. For the three students selected as reflection speakers for their fellow graduates, the task is one final challenge as well as a great honor.\nAt each of Georgia Tech’s Commencement ceremonies (bachelor’s, master’s, and Ph.D.), a graduating student is given three minutes to deliver an inspiring message in front of an audience of graduates, families, and friends. This fall the bachelor’s speaker is Jacques Crawford, in electrical and computer engineering. The master’s speaker is Emily Farmer, also in electrical and computer engineering. And the Ph.D. speaker is Narayan Shirolkar in the School of Materials Science and Engineering.\nStudents must apply to become a reflection speaker. A panel of faculty, staff, and students selects a group of finalists who present a full version of their speech to the committee. The selected speakers are required to work with Tech’s Communication Center to prepare for the big day.\nJacques Crawford\nWhen Jacques Crawford applied to be a reflection speaker, he thought it would be a cool opportunity to share his experience at Georgia Tech.\n“I was definitely surprised that I was chosen as a finalist, but it felt good,” he said. He will talk about what his Georgia Tech experience has taught him, and he will acknowledge his support system of family and friends.\nCrawford, who was born in Tampa, Florida, and grew up in Alpharetta, Georgia, comes from a family of engineers. His mom is an industrial engineer. His dad is an electrical engineer. His sister Kaylyn is a 2018 Tech graduate in biomedical engineering, and his brother Joshua is a junior in chemical engineering.\n“Our parents guided us toward certain things like aerospace camp and AP classes,” he said, explaining the family’s penchant for engineering.\nCrawford completed his studies in August. In July, he began working for Google as a network engineer where he will do three rotations in the company over the course of two years. He is based in Sunnyvale, California, and works remotely.\nCrawford is expecting about 20 people to be there to help him celebrate his graduation.\nEmily Farmer\nTwo reasons drove Emily Farmer's decision to apply to be a reflection speaker — she loves public speaking, and she thought it would be a great way to celebrate her achievement.\n“I had a very difficult time starting at Tech, and I had to leave the school for several semesters to address my mental health,” she said. “I’m proud of myself for making it to this point.”\nThe main theme of Farmer’s speech is that we all have a lot in common at Georgia Tech, but our differences are what make Tech special, and make us better people moving forward. She also will talk about taking a break now and then.\n“I think that’s the most important part,” said Farmer, a native of Clarkesville, Georgia. “All of this has been based on my time here as a student, and what helped me find balance and happiness.”\nNext spring, she will move to Dallas, Texas to work at Texas Instruments as a semiconductor packaging engineer. She is hard of hearing and has worn hearing aids since age 11. Eventually she would like to go into the field of assistive hearing devices for the deaf and hard of hearing.\n“My parents and sister will be attending Commencement, along with some very close friends who have helped me along the way toward this degree.”\nNarayan Shirolkar\nWhen Narayan Shirolkar was considering topics for his speech, he had too many ideas for the allotted three minutes. Attending an information session for speakers provided clarity on what was expected and helped him streamline his thoughts.\n“I had to really self-reflect on my journey to the Ph.D. program at Tech and the last few years,” he said. “The speech is about acknowledging that we get where we are not just based on our merits but also because someone bets on our ability to become a force for positive change and gives us a chance. I chose this topic because it’s something I have experienced and have heard from a lot of my fellow Ph.D. students.”\nShirolkar has been involved in many student organizations over the years including graduate Student Government Association, Student Ambassadors, and the Yellow Jacket Flying Club.\n“This put me in a unique position to be able to reflect on the collective experience of my fellow Ph.D. students,” he said. “Plus, this is like a last hurrah before I officially become a Tech alumnus.”\nShirolkar’s parents will be watching the ceremony virtually from India, and he has invited a few Tech friends to celebrate with him in person. In January he will start work as a consultant with the Boston Consulting Group in Washington, D.C.\nAdditional Images\nContact\nVictor Rogers\nInstitute Communications\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}