{"text": "Genomic Study of 412 Anthrax Strains Provides New Virulence Clues | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGenomic Study of 412 Anthrax Strains Provides New Virulence Clues\nGeorgia Tech and CDC researchers have provided new information about the factors affecting the virulence of anthrax.\nFacebook\nTwitter\nEmail\nUnder high magnification, this digitally-colorized scanning electron microscope image depicts endospores from Bacillus anthracis bacteria. These endospores can live for many years, which enables these bacteria to survive in a dormant state. (CDC image)\nAug 29, 2018\n— Atlanta, GA\nBy analyzing genomic sequences from more than 400 strains of the bacterium that causes anthrax, researchers have provided the first evidence that the severity – technically known as virulence – of  specific strains may be related to the number of copies of certain plasmids they carry. Plasmids are genetic structures of the cell that can reproduce independently, and are responsible for producing the anthrax toxin and other virulence factors.\nThe research found that bacteria strains collected from humans and animals tended to have more copies of the virulence plasmids than those collected from environmental sources. The research, a collaboration between scientists at the Georgia Institute of Technology and the Centers for Disease Control and Prevention (CDC), used CDC’s collection of\nBacillus anthracis\nstrains gathered from around the world beginning in the 1950s.\n“There is a hypothesis that the copy number – number of copies of the plasmids – plays a role in how virulent each strain is,” said\nKostas Konstantinidis , a professor in the\nSchool of Civil and Environmental Engineering\nat the Georgia Institute of Technology. “We want to understand which are the more virulent strains, which are less virulent and what explains the difference. This study provides the first evidence that there is a significant difference in plasmid copy number that may be related to the virulence. But more research is needed to test this emerging hypothesis.”\nThe research, which was sponsored by the CDC and the National Science Foundation, was reported August 14 in the journal\nmSystems , an open access journal from the American Society for Microbiology. The study involved more than 600 gigabytes of data, which will be shared with other researchers working to understand anthrax.\nIn\nB. anthracis , two plasmids – known as pXO1 and pXO2 – are autonomous and independent pieces of DNA that encode the toxin and other virulence factors. In bacteria, plasmids like these tend to move around independently of the organisms’ main chromosomes, and can jump from one strain to another via genetic mechanisms of DNA transfer. Bacterial resistance to antibiotics can also be transferred through plasmid movement, for instance. Interestingly, this study found that the anthrax plasmids show limited genetic exchange between strains; rather, they are inherited from the ancestor, similar to the chromosomes.\n“This work and additional analyses performed at Georgia Tech and CDC on these genomes from strains of\nB. anthracis\nfrom around the world help further define the global diversity of this health threat,” said Alex Hoffmaster, chief of CDC’s Zoonotic Select Agent Lab and a co-author on the article. “Understanding more about the strains and their distribution can help us more easily determine whether anthrax cases were caused by natural or man-made sources so we can respond as needed to protect the public’s health.”\nThe research could also provide information about other organisms, Konstantinidis said. “Beyond\nB. anthracis , this work could help provide a better understanding of the virulence potential of other organisms carrying similar plasmids. Being able to distinguish between more virulent and less virulent strains is a broader challenge for microbiology.”\nThe study began with researchers from the CDC’s Division of High-Consequence Pathogens and Pathology, who used next-generation techniques to sequence diverse strains of\nB. anthracis . The agency provided its data to the Konstantinidis laboratory at Georgia Tech, where Graduate Research Assistant Angela Pena-Gonzalez led the bioinformatics analysis of the data.\n“We were able to use the sequencing data to calculate the correlation of the copy number with the source of each strain,” she explained. “We used the whole length of the plasmid to calculate the copy number, and our results were based on the analysis of hundreds of strains obtained from several sources – humans, animals and the environment – and not just a couple of them. This was an advantage of our study.”\nAnalytical techniques developed at Georgia Tech allowed the whole genome comparisons to be done on the more than 400 genomes – a substantial data science challenge. The research revealed that B. anthracis genomes carried, on average, 3.86 and 2.29 copies of the pXO1 and pXO2 plasmids respectively, and that there was a positive linear correlation between the copy numbers of the two plasmids.\n“The technology to do this whole genome sequencing is available, but the processing of the data and the interpretation is not yet very straightforward,” Konstantinidis said. “The very magnitude of the data requires a specific process and considerable experience. The way in which we analyzed this data was not even available two years ago when we started the study.”\nBeyond the possible correlation of copy number of virulence, the study also showed the genome of the strains was surprisingly consistent. “The work shows that these plasmids are relatively stable, though we found a few strains that had different varieties of the plasmids that seem to have attenuated the virulence,” he said.\nA next step would be to investigate further the possible correlation between copy number and virulence in animal studies.\nKonstantinidis hopes to continue collaborating with the CDC to gain a better understanding of virulence and other factors in anthrax and other organisms that have implications for public health.\n“The CDC has unique resources like this collection of anthrax strains, and we hope to continue this collaboration to further understand what is going on with this and other pathogens,” he said. “There are a lot of applications to public health and to improving our understanding of the basic biology behind these organisms.”\nIn addition to those already mentioned, the work included Luis M. Rodriguez-R from the Georgia Tech School of Civil and Environmental Engineering; and Chung K. Marston, Jay E. Gee, Christopher A. Gulvik, Cari B. Kolton, Elke Saile and Michael Frace from the CDC.\nThis work was supported by United States National Science Foundation (NSF) award number 1356288 and DHHS/PHS/CDC award number RF023, and by Colciencias—Colombian Administrative Department for Science, Technology. The findings and conclusions in this work are those of the authors and do not necessarily represent the official positions of the NSF or CDC.\nCITATION : Angela Pena-Gonzalez, et al., “Genomic Characterization and Copy Number Variation of Bacillus anthracis Plasmids pXO1 and pXO2 in a Historical Collection of 412 Strains,” (mSystems 2018)\nhttps://msystems.asm.org/content/3/4/e00065-18\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : John Toon (404-894-6986) (jtoon@gatech.edu)\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}