{"text": "Physics to Host Climate Talk with Former U.S. Secretary of Energy, Nobel Laureate | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nPhysics to Host Climate Talk with Former U.S. Secretary of Energy, Nobel Laureate\nPhysicist Steven Chu was the first person appointed to the U.S. Cabinet after having won a Nobel Prize. On April 26, he will deliver a public lecture at Georgia Tech on climate change and innovative paths towards a more sustainable future.\nFacebook\nTwitter\nEmail\nApr 20, 2023\nOn April 26, 2023, the\nSchool of Physics\nand\nCollege of Sciences\nat Georgia Tech will welcome Stanford University physicist\nSteven Chu\nto speak on climate change and innovative paths towards a more sustainable future. Chu is the 1997 co-recipient of the Nobel Prize in Physics, and in his former role as U.S. Secretary of Energy, became the first scientist to hold a U.S. Cabinet position.\nAbout the Talk\nThe event\nis part of the School of Physics “Inquiring Minds” public lecture series, and will be held at the\nFerst Center for the Arts .\nThe talk is free and open to campus and the Atlanta community, and no RSVP is required. Refreshments begin at 4:30, and the lecture will start at 5 p.m. ET.\n“The multiple industrial and agricultural revolutions have transformed the world,” Chu recently shared in an abstract for the lecture. “However, an unintended consequence of this progress is that we are changing the climate of our planet. In addition to the climate risks, we will need to provide enough clean energy, water, and food for a more prosperous world that may grow to 11 billion by 2100.”\nThe talk will discuss the significant technical challenges and potential solutions that could provide better paths to a more sustainable future. “How we transition from where we are now to where we need to be within 50 years is arguably the most pressing set of issues that science, innovation, and public policy have to address,” Chu added.\nThe event’s faculty host is\nDaniel Goldman , Dunn Family Professor in the School of Physics at Georgia Tech.\nAbout Steven Chu\nSteven Chu\nis the William R. Kenan, Jr. Professor of Physics and a professor of Molecular and Cellular Physiology in the Medical School at Stanford University.\nChu served as the 12 th\nU.S. Secretary of Energy from January 2009 until the end of April 2013. As the first scientist to hold a U.S. Cabinet position and the longest serving Energy Secretary, Chu led several initiatives including ARPA-E (Advanced Research Projects Agency – Energy), the Energy Innovation Hubs, and was personally tasked by President Obama to assist in the Deepwater Horizon oil leak.\nIn the spring of 2010, Chu was the\nkeynote speaker\nfor the Georgia Tech Ph.D. and Master's Commencement Ceremony.\nPrior to his cabinet post, Chu was director of the Lawrence Berkeley National Laboratory, where he was active in pursuit of alternative and renewable energy technologies, and a professor of Physics and Applied Physics at Stanford, where he helped launch Bio-X, a multi-disciplinary institute combining the physical and biological sciences with medicine and engineering. Previously he also served as head of the Quantum Electronics Research Department at AT&T Bell Laboratories.\nHe is the co-recipient of the 1997 Nobel Prize in Physics for his contributions to laser cooling and atom trapping. He is a member of the National Academy of Sciences, the American Philosophical Society, the American Academy of Arts and Sciences, the Pontifical Academy Sciences, and of seven foreign academies. He formerly served as president, and then chair of the American Association for the Advancement of Science.\nChu earned an A.B. degree in mathematics and a B.S. degree in physics from the University of Rochester, and a Ph.D. in physics from the University of California, Berkeley, as well as 35 honorary degrees.\nHe has published over 280 papers in atomic and polymer physics, biophysics, biology, bio-imaging, batteries, and other energy technologies. He holds 15 patents, and an additional 15 patent disclosures or filings since 2015.\nAdditional Media\nContact\nJess Hunt-Ralston\nDirector of Communications\nCollege of Sciences at Georgia Tech\nEmail\njess@cos.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}