{"text": "New Research Embodies Queer History Through Artifacts | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNew Research Embodies Queer History Through Artifacts\nNew research from the Georgia Institute of Technology offers a unique framework for understanding queer communities and their histories.\nFacebook\nTwitter\nEmail\nFeb 28, 2023\n— Atlanta, GA\n“Gay power.” “I Love You Susan B. Anthony.” “ERA Yes.” These are just a few buttons in the\nGeorgia State University Library LGBTQ Collection , an archive of the Georgia queer community. The buttons represent the politics, identities, causes, and humor of the 1970s Atlanta LGBTQ communities — in short, a snapshot of history.\nBut how do you archive and convey queer history? It’s a complex question for historians and LGBTQ people, who have been on the margins and often resist categorization. New research from the Georgia Institute of Technology offers a unique framework for understanding queer communities and their histories.\nThe buttons are from the personal collections of two local queer activists, Lorraine Fontana and Maria Helena Dolan. The researchers created replicas of the historic buttons and paired them with oral history recordings of Fontana and Dolan also in the archive. Participants of the study were encouraged to interact with the buttons through a wearable audio player — touching them, putting them on, and hearing these histories in the activists’ own words. The experience created a tangible connection to queer history and invited the participant into the narrative.\n“Buttons are important because not only are they signals of political and social causes, but they're also identity signifiers,” said researcher\nAlexandra Teixeira Riggs,\na\ndigital media\nPh.D. student. “When you're putting one on, you're signaling something that you believe in or some part of your identity to another person, and  this has historically been central to queer communities.”\nRiggs co-wrote “ Button Portraits: Embodying Queer History With Interactive Wearable Artifacts ” with advisor\nAnne Sullivan\nand\nNoura Howell,\nboth digital media assistant professors. The paper was published in\nInteractive Storytelling\nin December 2022.\nBringing Tangible Narratives to the Archive\nRiggs created a  tangible narrative — an experience that uses objects embedded with digital capabilities — to tell these stories. In this case, each button interacted with an audio player containing a Raspberry Pi, or small computer, with a near field communication (NFC) reader in it. When a participant placed the button on the NFC reader, it activated a fragment of Dolan or Fontana’s oral history related to that button. This direct engagement with the button effectively enables the participant to imagine themselves in the narrative and reflect on their connection to that history.\nButtons were the ideal object for tangible narrative because participants could pick them up and pin them on their clothes, creating a sense of intimacy. The button is no longer just a historical artifact, but a part of the participant. The archive’s buttons offered a direct connection to 1970s feminism and queer activism with their political slogans, identity markers, location-specific designs, and other areas that clearly place participants in the historical narrative. Buttons themselves are also often seen as ephemera, or objects usually not preserved in history.\n“There's this sense that some materials exist outside of the archive solely in personal collections of communities that don't necessarily consider their materials or stories to be worthy of a collection with a capital C,” Riggs said.\nThe researchers paired each button with clips from Fontana and Dolan’s oral histories that  corresponded to the buttons’ themes through keywords or contextual meanings. However, the researchers didn’t impose a linear narrative or any type of organization on the buttons. Participants were encouraged to explore the buttons on their own without guidance and experienced the fluidity of queer stories.\nQueering the Archive\nThe design of a nonlinear experience of the buttons is an application of queer theory to the creation of tangible narratives. The theory suggests that queer physical spaces are multidimensional — blurring the lines between past and present, historical figure and participant, and object and body. Tangible narrative invites the participant’s own experience, body, and identity into history and further complicates the idea of the archive.\nIt also challenges how archives are inherently organized. By inviting the participant to interact with the buttons on their own and without any discernible order, it effectively queers the experience of the archive or questions how archives are traditionally used and viewed as historic, canonical records fully in the past.\nRiggs hopes to expand the research to queer and trans communities of color and other marginalized groups in the future.\n“What I want to do with this project is to allow for a way of expressing design through queer means,” Riggs said. “I want there to be a way for us to relate to archives in a more embodied way than we would in a typical museum setting. Hopefully that leads to more accessibility of these stories and dialogue within queer communities about how we reflect on this history.”\nCITATION: Riggs, A.T., Howell, N., Sullivan, A. (2022). Button Portraits: Embodying Queer History with Interactive Wearable Artifacts. In: Vosmeer, M., Holloway-Attaway, L. (eds) Interactive Storytelling. ICIDS 2022. Lecture Notes in Computer Science, vol 13762. Springer, Cham.\nhttps://doi.org/10.1007/978-3-031-22298-6_2\nAdditional Images\nContact\nTess Malone, Senior Research Writer/Editor\nEmail\ntess.malone@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}