{"text": "HyPer-Tau Provides Spatially-resolved Hydrogen Peroxide Sensing in Cells | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nHyPer-Tau Provides Spatially-resolved Hydrogen Peroxide Sensing in Cells\nResearchers have developed a sensor to show the location of hydrogen peroxide inside living cells with high resolution.\nFacebook\nTwitter\nEmail\nThis super-resolution fluorescence microscopy image of HyPer-Tau shows the microtubular structure of a human (HeLa) cancer cell. The image was made using the new super-resolution microscope in the Georgia Tech Institute for Bioengineering &amp; Bioscience (IBB). (Credit: Emilie Warren, Georgia Tech)\nDec 03, 2015\n— Atlanta, GA\nBy attaching a hydrogen peroxide reporter protein to cellular microtubule structures, researchers have developed the first sensor able to show the location of the key cellular signaling chemical inside living cells with high resolution over time. Knowing the precise location of hydrogen peroxide within cells could help scientists gain a better understanding of oxidation-reduction reactions taking place there. The sensor was developed by researchers at the Georgia Institute of Technology, who have demonstrated several applications for its ability to spatially resolve the chemical’s presence inside cells. Known as HyPer-Tau, the new sensor modifies a commercially-available protein that alters its fluorescence properties in the presence of hydrogen peroxide. The research, which was supported by the National Institutes of Health, was reported November 20 in the journal\nScientific Reports . “The chemistry of cells, unlike more traditional chemistry in test tubes, is highly dependent on where a chemical reaction is occurring,” said\nChristine Payne , an associate professor in the Georgia Tech\nSchool of Chemistry and Biochemistry\nand one of the paper’s senior authors. “HyPer-Tau is a tool that will provide us with information on the ‘where’ and ‘when’ for hydrogen peroxide inside living cells.” Until development of the new technique, hydrogen peroxide sensors could only tag certain components of cells, or show that the cells contained the oxidant. To understand the role of hydrogen peroxide in signaling and oxidation, however, the researchers wanted to know the time-resolved location of the chemical. “We needed a tool that could discriminate between locations to provide more than a whole readout of oxidation,” said\nMelissa Kemp , an associate professor in the\nWallace H. Coulter Department of Biomedical Engineering\nat Georgia Tech and Emory University. “With very specific spatial information, we could be better informed about how cellular processes or therapies involving oxidation are going to operate.” Kemp and Payne realized that if they could anchor the reporter protein to microtubules – fibrous structures that crisscross cells like railroad tracks – they might obtain the location information they needed. Other researchers had already created variants of the HyPer reporter protein, so the researchers – with technician Emilie Warren, undergraduate researcher Tatiana Netterfield and postdoctoral researcher Saheli Sarkar – set out to create a new tool. They added a tubulin-binding protein known as Tau, that connects the HyPer protein to the microtubule structures. Fluorescence microscopy then allowed them to observe the real-time change in fluorescence as oxidation occurred in the cells they were studying. “Connecting the reporter protein allows us to get a grid-type readout of oxidation going on inside the cells,” said Kemp. “By having the protein tethered, we can get very specific sub-cellular information. You can readily see areas with more intense oxidation.” She used a traffic analogy to compare information provided by the new technique to that provided by the earlier one. Earlier sensors would have reported that traffic in a downtown area was congested, while the new sensor could pinpoint an accident on a specific street causing the delays. The latter information allows specific action to be taken, Kemp said. Kemp and Payne have already used the tool to visualize the signaling process that takes place as macrophages discover bacteria and move to engulf and destroy the invaders. “When the macrophages are activated, they begin shooting out tiny leg-like structures that seek the bacterial signal,” explained Kemp. “To do so, they require hydrogen peroxide to control the migration and other activities. We can see in these leading edges where the oxidation is occurring inside the cells, providing an unprecedented view of the behavior.” By combining multiple images, the researchers produced movies correlating the production of hydrogen peroxide to the activities of the immune system cells. In another application, the sensor was used to study how cells respond to the introduction of extracellular hydrogen peroxide, which produces a wave of oxidation as it moves through the cellular structures. “This provides a way to quantify both intracellular and intercellular variation that is occurring,” Kemp explained. “Our goal is to be able to monitor in real-time the events that are occurring. Because of the spectral features of the reporter, you can couple this with other types of dyes to monitor organelles and different types of production.” Kemp hopes to use the new sensor to better understand oxidation of another type of immune cell, T cells, as they form contact with other cells to recognize the presence of viruses. In studies that could be important to understanding the effects of nanoscale materials on living cells, the researchers are working to understand the suspected oxidative impacts of titanium dioxide nanoparticles. The new technique could also be useful in understanding how stem cells change oxidation properties during differentiation into other cell types. In current research, Netterfield is working with Kemp and Payne to combine the existing technique with other reporter proteins to gain additional information. Once thought to be a sign of disease processes, hydrogen peroxide is now understood to be a critical signaling chemical inside cells, Kemp noted. Cells purposely produce the chemical, which can quickly oxidize proteins to alter their functions. Hydrogen peroxide is also generated at sites of inflammation, and as macrophages destroy pathogens. Collaboration between Payne – a physical chemist – and Kemp – a biomedical engineer, demonstrates how innovation can occur at the intersections of disciplines. “Chemistry and biomedical engineering offer a pretty natural collaboration,” said Payne. “We both speak the same science language and have a shared interest in developing new tools to enable new science.” This research was supported by the National Institutes of Health Office of the Director and NIAID under grants DP2OD006483-01 and R01AI088023. The content is solely the responsibility of the authors and does not necessarily represent the official views of the National Institutes of Health. CITATION : Emilie A. K. Warren, Tatiana S. Netterfield, Saheli Sarkar, Melissa L. Kemp and Christine K. Payne, “Spatially-resolved intracellular sensing of hydrogen peroxide in living cells, (Scientific Reports, 2015).\nhttp://dx.doi.org/10.1038/srep16929 Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contact : John Toon ( jtoon@gatech.edu ) (404-894-6986) Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}