{"text": "Engage Celebrates 10th Cohort of Entrepreneurs | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nEngage Celebrates 10th Cohort of Entrepreneurs\nFive years after its founding, the first-of-its-kind innovation program is still going strong\nFacebook\nTwitter\nEmail\nFounders of the cohort 10 companies.\nNov 09, 2022\n— Atlanta, GA\nEngage  celebrated two milestones – five years since its founding and the introduction of the 10 th  cohort of enterprise technology startups – in October with its Executive Reception. The reception, held at Cox Enterprises, featured close to 300 people including executives from Fortune 500 companies, startup founders, and investors.\nEngage began in 2017 as the first-of-its-kind collaborative innovation program and venture fund to connect startups with leading corporations. It’s a formula that still works today, with active involvement from corporate behemoths including Delta Air Lines, The Home Depot, Invesco, and others that are giving tech entrepreneurs a place at the table.\n[caption id=\"attachment_10473\" align=\"alignleft\" width=\"300\"]Discussion by Engage founders, from left, Blake Patton, Marty Flanagan, and G.P. \"Bud\" Peterson, moderated by Metro Atlanta Chamber President and CEO Katie Kirkpatrick[/caption]\nTo kick off the event, Engage founders and board members Marty Flanagan, president and CEO of  Invesco , G.P. “Bud” Peterson, president emeritus of  Georgia Tech , and Blake Patton, managing partner of  Tech Square Ventures , discussed the program’s origin and the way they deliberately set out to meet the needs of both the tech startups and the corporate community.\n“What startups really need is access to customers and markets,” said Patton. “And so that's what we built the concept of Engage around.”\nAnd the corporations, what do they need that Engage can offer?\nThey need new ideas and the nimbleness of startups. “I think Engage has done a very nice job of identifying the innovation needs of the companies that are participating and then matching that with the entrepreneurs who are being creative and innovative in the community,” said Patton.\nSince its founding, Engage has mentored and invested in 10 startup cohorts, a total of 75 companies. Its portfolio companies have inked 116 customer contracts signed with corporate partners. Engage startups have raised more than $2.7 billion in capital after graduating from the program and employ more than 3,000.\nRachel Carpenter, co-founder and CEO of Intrinio, a financial technology startup from the second Engage cohort, hosted a discussion about enterprise data transformation and ways startups can work with major corporations on that, with Donie Lochan, the managing director, chief technology officer, and global head of technology for Invesco, and Chuck Adkins, senior vice president of information technology at Intercontinental Exchange (ICE).\nKeynote speaker Alex Taylor, chair and CEO of Cox Enterprises and Engage Board member, discussed the ways Cox is working with startups. The company has signed 12 contracts with Engage startups, including one with Engage graduate Help Lightning to solve a problem brought on by the pandemic.\n“Cox Communications has millions of customers around the country,” Taylor said, explaining that technicians of his company’s cable subsidiary could not go to customers’ homes during the pandemic. In normal times, customers would buy the hardware from Cox and install the television modems and other devices with the technicians’ help.\nNow, packets are being sent remotely.\n“Not a lot of these people are trained engineers, so they don't often do it right. When there's problems, we can't go into their homes and help them,” Taylor said.\nCox worked with Help Lightning, an Engage portfolio company that uses augmented reality video that enables the cable company to better serve its customers — during the pandemic through today.\n“It's a field services tool. A field services tech is out front of a customer's home with an iPad. There's a visual interface, and the customer is holding up the phone, showing the technician what they're looking at,” Taylor said. “The technician is walking the customer through a two-way interaction when they can't physically be present.”\nFollowing Taylor, Nammy Vedire, Engage’s director of platform and operations, announced the recipient of the Executive Champion Award, given to corporate partners who exemplify and help accomplish Engage’s mission. The award was presented to Jaimie Clark, head of innovation at Catalyst by Wellstar and the director of innovation and venture strategy for Wellstar Health System.\n“Jaimie met with several of our corporate executive teams, understood best practices, and incorporated them into the WellStar Catalyst program, which is this conduit to bring innovation to every corner of the Wellstar Health System,” Vedire said. “In doing so, in the last 12 months, Jaimie has helped five of our startups sign pilots, of which three have now converted to multi-year contracts. That's an incredible effort.”\nDaley Ervin, Engage’s managing director, who was celebrating his last Engage cohort before leaving the position, was also presented with an award to mark his service with Engage since 2018.\nTo wrap up the evening, Atlanta Mayor Andre Dickens — a Georgia Tech alum — spoke about his commitment to the city’s tech startup ecosystem. To illustrate the importance of the community, he introduced the city of Atlanta’s first Senior Technology Advisor Donald Beamer.  “He will be an ambassador for this ecosystem that helped catapult Atlanta. He will lift up the startup community and be able to answer the questions of venture capitalists,” Dickens said.\n[caption id=\"attachment_10474\" align=\"alignright\" width=\"300\"]Founders of the cohort 10 companies[/caption]\nEngage’s cohort 10 companies include:\nCivic Eagle : Gives policy professionals the tools to more effectively monitor, report, and collaborate on policy work.\nCoginiti : A collaborative intelligence company that democratizes access to data, fosters collaboration, and supports building, reusing, and sharing data and analytic assets.\nManifest Climate : Provides businesses with the tools, data, and support they need to identify climate risks and opportunities, track trends, and build competency around climate action.\nNameCoach : Uses artificial intelligence-enabled software to solve one problem that can help businesses promote inclusion, belonging, and rapport — name mispronunciation.\nQualytics : Delivers confidence in data with real-time automated anomaly detection and remediation to help improve the accuracy of enterprise decision making.\nTribute : A micro-mentorship platform enhances team collaboration, learning, and productivity in hybrid workplaces.\nWorkera:  This skills intelligence platform is redefining how enterprises understand, develop, and mobilize talent to drive innovation.\nWripple : An agency services platform that matches enterprises to individual freelancers and project teams.\nAbout Engage\nEngage is a first-of-its-kind innovation platform comprising category-leading corporations in the Southeast that have joined forces to support startups building the future of enterprise. Engage is designed to promote innovation through a network of connections between startups, corporations, university researchers, and the venture community.\nEngage’s corporate partners include Chick-fil-A, The Coca-Cola Company, Cox Enterprises, Delta Air Lines, Georgia-Pacific, Georgia Power Foundation, Georgia Tech, Goldman Sachs, The Home Depot, Honeywell Connected Enterprise, Intercontinental Exchange (ICE), Inspire Brands, Invesco, Invest Georgia, UPS, and Wellstar Health System. These corporate partners, along with Tech Square Ventures and the Georgia Institute of Technology's Advanced Technology Development Center (ATDC), provide tools, hands-on support, and resources that help startups develop go-to-market strategies, open doors faster, and transform strategies into action. For more information, visit  engage.vc .\nAdditional Images\nContact\nKaren Kirkpatrick\nkaren.kirkpatrick@innovate.gatech.edu\n770.364.0579\nEmail\nkaren.kirkpatrick@innovate.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}