{"text": "How A Frog Made a Dream Come True | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nHow A Frog Made a Dream Come True\nAlexis Noel, who figured out why a frog's tongue is sticky, reflects on a busy week with media.\nFacebook\nTwitter\nEmail\nA northern leopard frog catches a cricket (Courtesy: Candler Hobbs)\nFeb 10, 2017\n— Atlanta, GA\nAlexis Noel has loved frogs since she was in preschool. She remembers frequently pulling them off the screen porch of her childhood home in Chapel Hill, North Carolina. Now she’s telling the world about frogs.\nNoel, a Ph.D. mechanical engineering candidate, has just wrapped up a dizzying 12-day stretch surrounding her first ever published paper,\nwhich explained why frog tongues are sticky . Since it was released, Noel has spoken to more than a dozen reporters, including a live interview on National Public Radio (NPR). She appeared on London’s BBC TV. She even fulfilled a lifelong goal.\n“I’ve read Popular Science magazine ever since I was a little girl,” said Noel. “It was a childhood dream to someday be in that publication.\nI never knew it would be for frog tongues .”\nHer study has resulted in more than 60 stories around the world. Noel never saw it coming.\n“I just thought I would publish the article, move on to my next study, and no one would really care about frogs,” she said.\nShe was wrong.\nFor instance, her study was published last Tuesday. That morning she had back-to-back calls with a reporter from Scientific American and the deputy science writer at The New York Times. After working an hour on campus in the Invention Studio, she spoke to The Atlantic, Washington Post, and NPR that afternoon. How did she celebrate when the paper was officially published by the journal at 7 p.m.? She taught class: ME2110 Creative Decisions and Design.\n“It’s been a little overwhelming. But I think it’s an amazing experience going from one radio studio to the next, talking about my research,” Noel said. “It’s incredible how many people you can reach with such a versatile subject. I’ve had children send me emails of drawings of frog tongues because they learned something from an article. It made me feel happy that I was inspiring younger generations to maybe pursue science or a STEM career.”\nNoel learned a few things of her own along the way —  tips that can also be used by fellow students with upcoming published papers who may have a chance to do media interviews.\n“I’ve learned that you really have to be solid in your understanding of the core material of your research. You also have to be able to boil your results down to three sentences max using words that an eighth grader can understand.”\nThe media attention has quieted as the days have passed. She still hears from scientists and engineers around the world via email. Some of them hope to collaborate with Noel about lizard tongues.\n“We have had three offers, one from a chemist at Naval Research Laboratory in Washington, D.C., a rheologist at West Point Military academy, and a biologist at the American Museum of Natural History,” said her advisor David Hu, a professor in the George W. Woodruff School of Mechanical Engineering. “Part of this success is Alexis’ natural communication skills. She is poised, confident, and knowledgeable on the air or over a microphone.”\nFor now, Noel is turning her focus to the next paper: cat tongues.\n“I’ve been interested in frogs and cats my whole life. They’re my favorite animals,” she said. “Now they’re the two animals I’m studying. It’s fantastic.”\nNoel and 11 other students participated in a class during the fall semester that teaches\nprinciples such as webpage design, interviewing techniques, building press kits, and creating science publicity through social media. This course is funded by the Frank K. Webb Fund for Communication in Mechanical Engineering. Interested students can contact\nProfessor Hu .\nAdditional Images\nRelated links\nLearn More About the Study\nContact\nJason Maderer\nNational Media Relations\nmaderer@gatech.edu\n404-660-2926\nEmail\nmaderer@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}