{"text": "Successful SpaceX Launch Clears Way for Historic Georgia Tech Spacecraft | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nSuccessful SpaceX Launch Clears Way for Historic Georgia Tech Spacecraft\nThe first spacecraft built at Georgia Tech is expected to fly this summer.\nFacebook\nTwitter\nEmail\nA livestream of the Falcon Heavy launch is projected on a wall-to-wall, floor-to-ceiling screen in the Engineering, Science and Mechanics Building on February 6.\nFeb 07, 2018\n— Atlanta, GA\nThey clapped when it cleared the launch pad. They oohed in awe as the booster rockets separated, then roared when the pair landed in synchronicity.\nAnd they howled with laughter when they saw a car in space.\n“It was awesome! It was unbelievable to see something so historic,” said Swapnil Pujari.\nHe was one of 30 or so Georgia Tech aerospace engineering students who crowded into a lab in the Engineering Science and Mechanics Building Tuesday afternoon to watch a livestream of SpaceX’s first test flight of the world’s most powerful rocket — the Falcon Heavy.\nFrom the sound in the room, the launch was an unquestionable success.\n“I got goosebumps when I saw the two boosters land at the same time,” said William Jun, a fourth-year undergraduate in the Daniel Guggenheim School of Aerospace Engineering. “I feel like I’ve witnessed the beginning of a new era.”\nIt’s hard to imagine what he’ll feel the next time the Falcon Heavy launches.\nTuesday’s launch only carried one piece of cargo, a red Tesla Roadster that is expected to orbit the sun for the next billion years. The next Heavy rocket will be stuffed with satellites. One of them is scheduled to be Prox-1, a 154-pound, rectangular-shaped metal box that was built and tested by Jun, Pujari and other Georgia Tech students. It’s the first spacecraft built on campus that will fly in space.\n“This is the part of the space industry that we live for,” said Professor Glenn Lightsey, who watched the launch with the students. “Ultimately, there is a day when you find out if the thing you’ve thought about and planned for actually works or not. Today (Tuesday) it happened for SpaceX. Six months from now, it will happen for us at Georgia Tech.”\nProx-1 is a 24” by 22” by 12” satellite that will deploy a smaller spacecraft, LightSail 2, which will attempt the first controlled solar sail flight in Earth orbit.\nAs that sail unfurls, Prox-1 will move and observe LightSail from a short distance and acquire images of the glimmering structure in action. Georgia Tech will serve as mission control.\n“Our students are going to have their hardware in space, making measurements and sending their data back to Earth,” said Lightsey. “This is a really unique experience that wasn’t even possible before this century. It’s a new way of doing things in STEM (science, technology, engineering and mathematics) education.”\nProx-1 is currently at the Air Force Research Lab in New Mexico, undergoing a series of tests to make sure the satellite can withstand the rugged, violent ride inside the Falcon Heavy. It’s one of the final pre-flight steps for a six-year project that has included more than 400 Georgia Tech students. From there it will be shipped to Florida and await an official launch date from SpaceX.\nAlthough they enjoyed the experience together for Tuesday’s launch, don’t expect many of the same students to gather on campus to watch Prox-1 blast into space.\n“Oh, I will be in Florida for sure!” said Pujari.\nAdditional Images\nRelated links\nProx-1 Leaves Campus\nProx-1 Mission Website\nDaniel Guggenheim School of Aerospace Engineering\nContact\nJason Maderer\nNational Media Relations\nmaderer@gatech.edu\n404-660-2926\nEmail\nmaderer@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}