{"text": "Finally, a Robust Fuel Cell that Runs on Methane at Practical Temperatures | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nFinally, a Robust Fuel Cell that Runs on Methane at Practical Temperatures\nCheap fuel, cool temperatures, low material costs: This fuel cell could spread to homes and cars.\nFacebook\nTwitter\nEmail\nThis could actually become a practical, marketable energy solution. Practical to run at cooler temperatures and on cheap fuel: the new fuel cell in the lab of Meilin Liu at Georgia Tech. Credit: Georgia Tech / Christopher Moore\nOct 29, 2018\n— Atlanta, GA\nFuel cells have not been particularly known for their practicality and affordability, but that may have just changed. There’s a new cell that runs on cheap fuel at temperatures comparable to automobile engines and which slashes materials costs.\nThough the cell is in the lab, it has high potential to someday electrically power homes and perhaps cars, say the researchers at the Georgia Institute of Technology who led its development. In a\nnew study in the journal  Nature Energy   the researchers detailed how they reimagined the entire fuel cell with the help of a newly invented fuel catalyst.\nThe catalyst has dispensed with high-priced hydrogen fuel by making its own out of cheap, readily available methane. And improvements throughout the cell cooled the seething operating temperatures that are customary in methane fuel cells dramatically, a striking engineering accomplishment.\nMethane fuel cells usually require temperatures of 750 to 1,000 degrees Celsius to run. This new one needs only about 500, which is even a notch cooler than automobile combustion engines, which run at around 600 degrees Celsius.\nThat lower temperature could trigger cascading cost savings in the ancillary technology needed to operate a fuel cell, potentially pushing the new cell to commercial viability. The researchers feel confident that engineers can design electric power units around this fuel cell with reasonable effort, something that has eluded previous methane fuel cells.\n‘Sensation in our world’\n“Our cell could make for a straightforward, robust overall system that uses cheap stainless steel to make  interconnectors ,” said Meilin Liu, who led the study and is a  Regents Professor in Georgia Tech’s School of Materials Science and Engineering.  Interconnectors are parts that help bring together many fuel cells into a  stack , or functional unit.\n“Above 750 degrees Celsius, no metal would withstand the temperature without oxidation, so you’d have a lot of trouble getting materials, and they would be extremely expensive and fragile, and contaminate the cell,” Liu said.\n“Lowering the temperature to 500 degrees Celsius is a sensation in our world. Very few people have even tried it,” said Ben deGlee, a graduate research assistant in Liu’s lab and one of the first authors of the study. “When you get that low, it makes the job of the engineer designing the stack and connected technologies much easier.”\nThe new cell also eliminates the need for a major ancillary device called a  steam reformer , which is normally required to convert methane and water into hydrogen fuel.\nLiu, deGlee, co-first author Yu Chen, who is a postdoctoral researcher in Liu’s lab, and co-first author Yu Tang of the University of Kansas,  published the results\nof their research on October 29, 2018 . Their work was funded by the Office of Basic Energy Sciences and the Advanced Research Projects Agency-Energy (ARPA-E), both in the U.S. Department of Energy. It was also funded by the National Science Foundation’s Division of Chemistry.\n‘Distributed generation’\nThe research was based on a type of fuel cell with high potential for commercial viability, the  solid oxide fuel cell (SOFC) . SOFCs are known for their versatility in fuels they can use.\nIf it goes to market, though the new cell might not power automobiles for a while, it could land sooner in basements as part of a more decentralized, cleaner, cheaper electrical power grid. The  fuel cell stack  itself would be about the size of a shoebox, plus ancillary technology to make it run.\n“The hope is you could install this device like a tankless water heater. It would run off of natural gas to power your house,” Liu said. “That would save society and industry the enormous cost of new power plants and large electrical grid expansions.”\n“It would make homes and businesses more power independent,” Liu said. “That kind of system would be called distributed generation, and our sponsors want to develop that.”\nHomemade hydrogen\nHydrogen is the best fuel for powering fuel cells, but its cost is exorbitant. The researchers figured out how to convert methane to hydrogen in the fuel cell itself via the new catalyst, which is made with cerium, nickel and ruthenium and has the chemical formula Ce 0.9 Ni 0.05 Ru 0.05 O 2,  abbreviated CNR.\nWhen methane and water molecules come into contact with the catalyst and heat, nickel chemically cleaves the methane molecule. Ruthenium does the same with water. The resulting parts come back together as that very desirable hydrogen (H 2 ) and carbon monoxide (CO), which the researchers surprisingly put to good use.\n“CO causes performance problems in most fuel cells, but here, we’re using it as a fuel,” Chen said.\nMaking electricity\nH 2  and CO continue on to further catalyst layers that make up the anode, the part of the fuel cell that yanks off electrons, making the carbon monoxide and hydrogen positively charged ions. The electrons travel via a wire - creating the electricity flow - toward the cathode.\nThere, oxygen, which is very electron-hungry, sucks up the electrons, closing the electrical circuit and becoming O 2-  ions. Ionized hydrogen and oxygen meet and exit the system as water condensation; the carbon monoxide and oxygen ions meet to become pure carbon dioxide, which could be captured.\nFor the energy produced, fuel cell technology creates far, far less carbon dioxide than combustion engines.\nIn some fuel cells, the water in the initial reactions must be introduced from the outside. In this new fuel cell, it’s replenished in the last reaction phase, which forms water that cycles back to react with the methane.\nCatalysts converge\nThe new catalyst, CNR, manufactured by research collaborators at the University of Kansas, is the outer layer of the anode side of the cell and doubles as a protectant against decay, extending the life of the cell. CNR has strong cohort catalysts in inner layers and on the other side of the cell, the cathode.\nOn the cathode end, oxygen’s reaction and movement through the system are usually notoriously slow, but Liu’s lab has recently sped it up to raise the electricity output by using what’s called nanofiber cathodes, which Liu’s lab developed in a prior study. ( A tailored double perovskite nanofiber catalyst enables ultrafast oxygen evolution .)\n“The structures of these various catalysts, as well as the nanofiber cathodes, all together allowed us to drop the operating temperature,” Chen said.\nLike this article?  Subscribe to our email newsletter\nAlso read:  Turbocharging Fuel Cells with a Multifunctional Catalyst\nThe following people coauthored the research: B ote  Zhao,   L ei  Zhang,   S eonyoung  Yoo,  Kai Pei, Jun Hyuk Kim  and  Yong Ding of Georgia Tech; Yuechang Wei and Franklin  F eng  Tao of the University of Kansas, and Z iyun  Wang and P .  Hu of The Queen’s University of Belfast. The research was funded by the  U.S. Department of Energy under the following agencies and programs: Advanced Research Projects Agency-Energy (ARPA-E) REBELS program (award DE-AR0000502), and  SECA Core Technology Program (award DE-FE0031201) , the Catalysis program of the Office of Basic Energy Sciences (grant DE- SC0014561). It was also funded by the Division of Chemistry of the National Science Foundation (award 1462121). Any results, conclusions, and opinions are those of the authors and not necessarily of the funding agencies.\nDOI:   10.1038/s41560-018-0262-5\nWriter & Media Representative : Ben Brumfield (404-660-1408), ben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nAdditional Images\nEmail\nben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}