{"text": "Georgia Tech Envisions ‘Deliberate Innovation, Lifetime Education’ in New Report | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Envisions ‘Deliberate Innovation, Lifetime Education’ in New Report\nInstitute Commission report outlines commitment and new approach to lifelong engagement with learners of all ages\nFacebook\nTwitter\nEmail\nDeliberate Innovation, Lifetime Education: The final report of the Commission on Creating the Next in Education\nApr 25, 2018\n— Atlanta, GA\nThe Georgia Institute of Technology announces the official release of\nDeliberate Innovation, Lifetime Education ,\na report based on input and recommendations from the Commission on Creating the Next in Education, an Institute-wide commission of more than 50 faculty, staff, and students.\nUsing the year 2040 as a long-term vantage point, the Commission was asked to explore and evaluate innovative approaches to higher education, and address issues facing current and future students. The group was also tasked with making recommendations on alternative educational models that reduce costs, improve the effectiveness of current methodologies, and increase opportunities and accessibility to serve the needs of the next generation and beyond.\nThe Commission was convened in late 2015 by Provost Rafael L. Bras and co-chaired by Richard DeMillo, executive director of Georgia Tech’s Center for 21 st\nCentury Universities; and Bonnie Ferri, vice provost for Graduate Education and Faculty Development.\n“The commitment to our core mission as a public technological research institution will remain unchanged, but we must be responsive to the larger forces impacting the higher education landscape,” said Bras. “The first day of classes at Georgia Tech in 2040 will serve a much more diverse population than the traditional students who have largely defined our past. We must ready ourselves now to meet such demands.”\nThe report is organized into three sections:\nThe Georgia Tech Commitment to a Lifetime Education\nThe overarching recommendation of the Commission is a proposal called the Georgia Tech Commitment to a Lifetime Education. The proposed commitment is a promise to students to provide an educational experience that is highly individualized and sustainable for a lifetime.\n“The university of the future will not necessarily be confined to a physical campus where one spends a few years, earns a degree, and leaves,” said DeMillo. “To be responsive to changing demographics and transformed workplaces, the university experience will begin earlier in life and continue long after graduation. Most people will benefit from technology-enhanced advances in learning science to blend in-person and digital experiences that allow students to start, stop, and start again as personal and professional needs change. The Commission’s challenge was to find ways to achieve this vision.”\nThe Five Initiatives\nThe Commission recommends five initiatives aimed at closing knowledge gaps, prototyping new products and services, and building critical technological infrastructure to achieve the vision of a lifetime education.\nEducating the Whole Person.\nDeveloping New Products and Services.\nReinventing Advising for a New Era.\nIntroducing Artificial Intelligence and Personalization Technologies.\nDeploying a Distributed Worldwide Presence.\nThese initiatives will result in new models of teaching and advising; new curricular models that support episodic educational experiences attuned to the needs of 21 st\ncentury workplaces; a data backbone to enable predictive analytics that improve educational decisions and outcomes; and the integration of technology-enhanced coaches, mentors, and guides to help students navigate more complex educational pathways.\nThe Culture of a Deliberately Innovative Organization\nThe Commission recommends a systems approach to growing Georgia Tech’s capacity for educational innovation, as all ideas imagined in the report are predicated on a culture change across the institution. This reshaping would fuse research and educational cultures into a single, immersive culture of innovation.\n“Georgia Tech is already known as a top-tier academic institution, but this reputation won’t be enough to grow and support the global Georgia Tech community of the future,” said Ferri. “Taking immediate and lasting steps to ensure that the Institute establishes a culture of deliberate innovation will set Georgia Tech apart and bolster the lifelong academic and career success of our learners.”\nProvost Bras will host a town hall discussion and moderate a panel of Commission members on\nApril 25 at 1 p.m.\nin the East Architecture Auditorium. Town hall attendees will have an opportunity to ask questions of the Commission leadership and will hear next steps on the formation of implementation groups.\nThe formation of formal implementation groups is forthcoming and will provide the basis for working groups on topics such as business models for new educational products and services, building a deliberately innovative culture, realizing the Georgia Tech Commitment to a Lifetime Education, and initiative execution.\n“Georgia Tech has a rich history of innovation, and we are encouraged by the current and ongoing projects as the Commission transitions into the implementation stage,” said Bras. “We are making strides with a new advising initiative, new credentials, exploration of mini-mesters, and other efforts around our K-12 partnerships. The momentum is building, and we look forward to engaging our colleagues in future efforts.”\nStream the town hall and read the report at\ngatech.edu/ed-innovation .\nAdditional Images\nRelated links\nRead the Report: Deliberate Innovation, Lifetime Education\nMessage from President Peterson: Increasing Access, Reducing Costs, and Meeting…\nContact\nSusie Ivy\nInstitute Communications\n404-385-3782\nEmail\nsusie.ivy@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}