{"text": "Vaccine Appointments Available on Campus | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nVaccine Appointments Available on Campus\nIf you've been waiting to get vaccinated, now is the time to sign up.\nFacebook\nTwitter\nEmail\nCovid-19 Vaccine Card\nApr 19, 2021\n— Atlanta, GA\nWhat started as a single shipment of 1,200 Covid-19 vaccine doses on Jan. 12 has grown to a full-fledged campus vaccination effort that sees nearly 1,000 people being inoculated daily.\nWith Covid-19 vaccines available to all Georgia residents 16 years of age and older, Georgia Tech’s vaccine clinics are now able to meet the demand of students, faculty, and staff who have been eager for appointments for weeks. Thus far,  around 15,000 members  of the campus community have received at least one dose at Tech’s Exhibition Hall, and almost 6,000 have received two doses. ( Read why some of them got the vaccine .) Georgia Tech is distributing the Pfizer vaccine, which is a two-dose vaccine.\nFor those who may have been waiting for others to go first, on the fence about vaccination, or not wanting to hunt for an appointment, now is the time to sign up. Appointments are open nearly every day in April and can be booked at  mytest.gatech.edu . Vaccination is free and the process takes about 20 to 30 minutes, including a 15-minute monitoring period after vaccination. ( Watch a video of the vaccination process at Georgia Tech .)\nChen Zhou, associate chair for Undergraduate Studies and associate professor in the H. Milton Stewart School of Industrial and Systems Engineering, was one person who thought “waiting his turn,” even though he was eligible, was the right thing to do. After talking with a colleague, though, he realized his hesitation could be problematic.\n“I heard many people were eligible for the vaccine but did not get it. I teach remotely and can avoid encounters with others,” Zhou said. “So, I thought I could help if I let others get it first. However,  Pinar Keskinocak  and others told me that it is people like me who slow down the process. Therefore, I went to get my shots and recorded the process to urge others to do the same.”\nVaccination opens up the possibility to resume some activities that many people have put on hold for over a year.  As of April 2 , the Centers for Disease Control and Prevention (CDC) advises that fully vaccinated people can resume domestic travel and do not need to get tested before or after travel, or self-quarantine after travel. The CDC also advises that they can visit with other fully vaccinated people without masks or physical distancing, and visit indoors with unvaccinated people from a single household who are at low risk for severe Covid-19 disease without wearing masks or physical distancing.\nStill, those who are vaccinated are encouraged to take precautions in public places, such as wearing a mask and physical distancing, and to wear masks, maintain distance, and practice other prevention measures when visiting with unvaccinated people from multiple households. ( View further guidance from the CDC .)\nThe University System of Georgia (USG) has temporarily reinstated the use of Non-Closure Emergency Leave for eligible employees receiving a Covid-19 vaccination. The policy is effective as of March 31, 2021, andwill expire at the conclusion of the Public Health State of Emergency declared in the Governor’s Executive Order.  Learn more about how to use leave when you get your vaccine .\nOn campus, all members of the community are encouraged to continue to  test , mask, and distance, both during and after vaccination.\nThose who received a first dose of Pfizer elsewhere can receive a second dose from Georgia Tech, as long as it is scheduled for at least 21 days after the first dose was administered. In addition, a first dose can be received at Georgia Tech and a second elsewhere, as long as the doses are at least 21 days apart and are both Pfizer vaccines. ( Nine things to know about the Covid-19 vaccines .)\nGeorgia Tech has been working toward the 1,000-person daily capacity since vaccine planning began in earnest in December, when the first vaccines received emergency authorization from the Food and Drug Administration.\n“Georgia Tech has led throughout this pandemic, whether it be from our amazing surveillance testing efforts to our campaign, Jackets Protect Jackets. I expect our community to lead once again with vaccinations,” said William Smith, director of the Office of Emergency Management and Communications, who took the vaccine as soon as it was available. “The vaccine is safe, proven, and effective against Covid-19. I certainly encourage anyone who is hesitant to ask others about their experience and ask experts about the vaccine.” ( Read more about Smith, who has helped lead the campus vaccination effort .)\nLearn more about Covid-19 vaccination on campus at  health.gatech.edu/coronavirus/vaccine/ . Book your vaccine appointment at  mytest.gatech.edu .\nAdditional Images\nRelated links\nBook a Vaccine Appointment\nTech Community Members Champion the Vaccine\nVideo: Covid-19 Vaccines at Georgia Tech\nAbout the Covid-19 Vaccines at Georgia Tech\nVaccine Dashboard\nContact\nKristen Baliey\nInstitute Communications\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}