{"text": "Georgia Tech receives U.S. Department of Commerce research grant | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech receives U.S. Department of Commerce research grant\nThis award will fund a research study to see the feasibility of expanding Technology Enterprise Park on Atlanta's westside into a health and bioscience hub.\nFacebook\nTwitter\nEmail\nTechnology Enterprise Park is a joint project of Georgia Advanced Technology Ventures, which is a Georgia Tech affiliate, and the University Financing Foundation.\nMay 22, 2015\n— Atlanta, GA\nThe U.S. Department of Commerce’s Economic Development Administration (EDA) has awarded the Georgia Institute of Technology a Science and Research Park Development Grant — one of 12 such awards to universities and government entities the agency announced on May 22. The $460,707 grant will be used to study the feasibility of expanding Technology Enterprise Park (TEP) on Atlanta’s west side into a health and bioscience hub. “This grant provides us an exceptional opportunity for Georgia Tech and the city of Atlanta to help create high-paying jobs and economic opportunity for the city’s west side,” said Chris Downing, associate vice president of the Enterprise Innovation Institute, Tech’s chief statewide economic development arm. Downing led the effort in crafting the grant proposal. The University Financing Foundation, Invest Atlanta, and the Atlanta Housing Authority also served as partners in the project proposal. The target area encompasses approximately 60 acres and will assess the viability of expanding TEP’s footprint. Georgia Tech founded the technology park, which is located at North Avenue and Northyards Boulevard, in 2004. As planned, the vision for the expanded park would be the interconnection of parcels of land owned by the project’s collaborators and supporters. Those include Tech, the Atlanta Housing Authority, and the city of Atlanta, among others. The goal is to create a health and bioscience hub in an economically distressed part of the city. As a hub it would be a natural location for startups in the health and bioscience sectors spinning out from area schools, including Tech, Georgia State University, Emory University, Morehouse School of Medicine, and Clark Atlanta University. Existing health and bioscience companies such as CardioMems, Kemira, and CryoLife would be able to expand their current operations without leaving the area, and it would be a magnet for leading-edge research and innovation enterprises such as the Global Center for Medical Innovation and the Georgia Tech Research Institute. The project will study the best practices Georgia Tech has implemented in the development of the neighboring Technology Square in Midtown, which serves as a model for innovation-led economic development success. This area of the west side could enjoy a similar outcome, Downing said. “It has the potential to create thousands of jobs and deliver hundreds of millions of dollars in economic output.” The Science and Research Park Development Grants are part of the Regional Innovation Strategies program, which is being run by the EDA Office of Innovation and Entrepreneurship. It is a new initiative designed to advance innovation and capacity-building activities in regions across the country through three different types of grants: i6 Challenge grants, Cluster Grants for Seed Capital Funds, and Science and Research Park Development Grants. In March, Commerce Secretary Penny Pritzker announced the recipients of the i6 Challenge Grants, which included $500,000 to Georgia Tech to support a sweeping innovation and entrepreneurship initiative in Athens, Augusta, and downtown Atlanta.\nAdditional Images\nRelated links\nGeorgia Tech receives U.S. Department of Commerce i6 Challenge Grant\nContact\nMedia Relations Representative Email:  laura.diamond@comm.gatech.edu Phone: 404-894-6016 laura.diamond@gatech.edu\nEmail\nperalte.paul@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}