{"text": "Where in the World are Young People Using the Internet? | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nWhere in the World are Young People Using the Internet?\nA common myth today is that young people are all glued to the Internet, but in fact, only 30 percent of the world’s youth population between the ages of 15 and 24 years old have been active online for at least five years.\nFacebook\nTwitter\nEmail\nDr. Michael Best, assistant professor in Georgia Tech's Sam Nunn School of International Affairs and in the College of Computing\nOct 07, 2013\n— Atlanta, GA\nA common myth today is that young people are all glued to the Internet, but in fact, only 30 percent of the world’s youth population between the ages of 15 and 24 years old have been active online for at least five years. In South Korea, 99.6 percent of young people are active, the highest percentage in the world. The least? The Asian island of Timor Leste with less than 1 percent.   Those are among the many findings in a study from The Sam Nunn School of International Affairs Assistant Professor Michael Best and the International Telecommunication Union (ITU). The study is the first attempt to measure, by country, the world’s “digital natives.” The term is typically used to categorize young people born around the same time as when the personal computer was introduced and who have spent their lives connected with technology.  Nearly 96 percent of American millennials are digital natives. That figure is behind Japan (99.5 percent) and several European countries, including Finland, Denmark, and the Netherlands. But the percentage Best thinks is most important is the number of digital natives compared to a country’s total population. “That’s because a country’s future will be defined by today’s young people and by technology,” said Best, who co-led the study and, jointly with ITU, developed the model that calculated the worldwide figures. “Countries with a high proportion of young people who are already online are positioned to define and lead the digital age of tomorrow.”  The countries with the highest proportion of digital natives among their population are mostly rich nations, which have high levels of overall Internet penetration. Iceland is at the top of the list with 13.9 percent. The United States is sixth (13.1 percent). A big surprise is Malaysia, a middle-income country with one of the highest proportions of digital natives (ranked fourth at 13.4 percent). Malaysia has a strong history of investing in educational technology.   The countries with the smallest estimated proportion of digital natives are Timor-Leste, Myanmar, and Sierra Leone. The bottom 10 consists entirely of African or Asian nations, many of which are suffering from conflict and/or have very low Internet availability. However, the report notes that Internet usage has increased significantly in the developing world during the past five years. The ITU believes the digital native population in these regions will more than double by 2017. Overall, there are approximately 363 million digital natives out of a world population of nearly 7 billion (5.2 percent). “Youth are transforming our world through the power of information and communication technologies,” said Hamadoun Touré, ITU secretary-general. “The\nYouth Declaration\ndeveloped at ITU’s BYND2015 Youth Summit in Costa Rica and presented to the United Nations General Assembly last week by Costa Rican President Laura Chinchilla calls for more measurable targets to monitor the digital empowerment of young people at national, regional, and international levels. This first attempt to measure the number of digital natives around the world is a valuable first contribution to this effort.” The model was developed using data collected by the ITU through surveys conducted around the globe. The study is part of the ITUs Measuring the Information Society 2013 report, which was released on October 7. Best is a faculty member in The Sam Nunn School of International Affairs with a joint appointment in the College of Computing. His research focuses on information and communication technologies for social, economic, and political development, primarily in low-income countries in Africa and Asia.\nAdditional Images\nRelated links\nITU Report\nCollege of Computing\nIvan Allen College\nContact\nJason Maderer Media Relations maderer@gatech.edu 404-385-2966\nEmail\nmaderer@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}