{"text": "New robotic vehicle provides a never-before-seen look under Antarctica | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNew robotic vehicle provides a never-before-seen look under Antarctica\nA first-of-its-kind robotic vehicle recently dove to depths never before visited under Antarctica’s Ross Ice Shelf and brought back video of life on the seafloor.\nFacebook\nTwitter\nEmail\nApr 02, 2015\n— Atlanta, GA\nEditor's note: Icefin's videos from the seafloor can also be downloaded at the Dropbox link at the bottom of the press release. A first-of-its-kind robotic vehicle recently dove to depths never before visited under Antarctica’s Ross Ice Shelf and brought back video of life on the seafloor. A team of scientists and engineers from the Georgia Institute of Technology assembled the unmanned, underwater vehicle on Antarctica. They deployed (and retrieved) the vehicle through a 12-inch diameter hole through 20 meters of ice and another 500 meters of water to the sea floor. The robotic vehicle, called Icefin, carried a scientific payload capable of measuring ocean conditions under the ice. Icefin’s readings of the environment under Antarctica’s ice shelves, and video of the life that thrives in these harsh conditions, will help understand how Antarctica’s ice shelves are changing under warming conditions, and to understand how organisms thrive in cold and light-free environments. The technologies developed for Icefin will also help in the search for life on other planets, namely Europa, a moon of Jupiter. Antarctica’s icy oceans are remarkably similar to Europa’s ice-capped oceans. “We built a vehicle that’s a hybrid between the really small probes and the ocean-going vessels, and we can deploy it through bore holes on Antarctica,” said\nBritney Schmidt , an assistant professor in the School of Earth and Atmospheric Sciences at the Georgia Tech, and the principal investigator for the Icefin project. “At the same time, we’re advancing hypotheses that we need for Europa and understanding ocean systems here better. We’re also developing and getting comfortable with technologies that make polar science -- and eventually Europa science -- more realistic.\"   Icefin was deployed as a part of the Sub Ice Marine and Planetary–analog Ecosystem (SIMPLE) program, funded by NASA and supported by NSF, with Schmidt as the principal investigator. The research team returned from Antarctica in December 2014 .\nIcefin is planned to make its Arctic debut in summer 2016, with a return to Antarctica that fall, the team hopes (For more images from the mission, visit:\nhttp://bit.ly/1P2hBRx ). At McMurdo Station, Schmidt and a team including Georgia Tech scientists and engineers from the Georgia Tech Research Institute (GTRI), led by principal research engineer\nMick West , deployed Icefin to explore the underside of the ice shelves flowing off the continent. “What truly separates Icefin from some of the other vehicles is that it’s fairly slender, yet still has all of the sensors that the scientists like Britney need,” West said. “Our vehicle has instrumentation aboard both for navigation and ocean science that other vehicles do not.” The Southern Ocean can be as deep as 5,000 meters. Icefin is capable of diving 1,500 meters and can perform three-kilometer-long surveys. Previous vehicles in Icefin’s class were rated to a few hundred meters. “We saw evidence of a complex community on the sea floor that has never been observed before, and unprecedented detail on the ice-ocean interface that hasn’t been achieved before,” Schmidt said.  Video captured by Icefin shows eerie footage of an active seafloor 500 meters under the Ross Ice Shelf. “Biologists at McMurdo were just amazed at the amount of biology at that location which included sea stars, sponges and anemones that were at the ocean bottom,” West said. “To have our very first deep-ocean dive happen through a small hole in the ice and go all the way to the ocean bottom and get the video we did was pretty amazing.”  To get to the bottom, Icefin first had to be built. A partnership between research-focused GTRI and academic-focused School of Earth and Atmospheric Sciences (EAS) enabled the team to design, build and deploy Icefin under the ice in less than a year.Traditional design cycles for these types of vehicles typically are two to three years. The team had to design for a number of challenges associated with deploying Icefin in such an extreme environment. For example, standard electronics systems are not typically rated to the extreme temperatures found under the Ross Ice Shelf. “We had probably 100 contingencies for if something went wrong,” West said. “Through lots of analysis and robust design, we were fortunate not to have to initiate any of them.”   Once Icefin was assembled, the vehicle was deployed through a bore hole in the ice that was 12 inches in diameter and 20 meters deep. Bore holes are often drilled on Antarctica for ocean moorings and sediment sampling. Traditional underwater vehicles deployed on Antarctica are either “roving eyes” because they carry only a camera, or much larger vehicles that are deployed in the water on the edge of the ice shelf. Icefin fills the gap between these two kinds of vehicles: able to be deployed easily by small teams in any environment, yet still able to record oceanographic information traditionally done by much larger vehicles. “Icefin is the most capable small vehicle that’s been down there,” Schmidt said. “What’s really rewarding is that at the same time, we were able to involve some outstanding students in the design, build and deployment of the vehicle.”  Graduate student Anthony Spears and undergraduate Matthew Meister, as well as Georgia Tech\nVertically Integrated Projects (VIP) program\nparticipants, were involved in design of the vehicle. Spears and Meister also played key roles in the field integration and deployment of Icefin, along with EAS postdoctoral fellow Catherine Walker and graduate student Jacob Buffo from Icefin’s science team. Icefin carries forward and up/down imaging and sonars and several different sensors. Icefin is also modular, similar to vehicles used on space missions. Scientists can swap sensors or point them in different directions as needed. Traditional GPS does not work under the ice, so Icefin uses a navigation system called SLAM (simultaneous localization and mapping) to triangulate its position based on measuring the range and bearing of features on the seafloor or under the ice. “Using algorithms such as SLAM allows us to construct a map of the unknown under-ice environment. When you can do that, you can begin to get a 3D picture of what’s going on under the water,” West said. The sensors on Icefin are helping scientists understand how the ocean affects properties of the ice, and how the ice affects properties of the ocean. The exchange between ocean and ice is a process that mediates biology, affects the climate system and controls the stability of glaciers.  “Those are important processes that we can work out here in our backyard at the same time as we’re answering how an ice shell would reflect the ocean chemistry on Europa,” Schmidt said. “The ice shell is built out of the ocean, but how that process works is not well understood.” Videos from the seafloor: https://www.dropbox.com/sh/qn2j1q9qf3rqdto/AACn5xE17456hQK43XHj0RBRa?dl=0 Photos from the mission: https://www.flickr.com/photos/georgiatech/sets/72157650356164390/with/16626135435/ For more on explorers at Georgia Tech, see the feature story in the spring issue of Research Horizons magazine: http://www.rh.gatech.edu/features/explorers This research is supported by Georgia Institute of Technology and the School of Earth and Atmospheric sciences through Schmidt’s startup funds, and partnership with GTRI. Icefin deployed to Antarctica with SIMPLE funded by NASA through grant NNX12AL65G. Deployment was supported by the National Science Foundation (NSF) under project B259. Any conclusions or opinions are those of the authors and do not necessarily represent the official views of the sponsoring agencies. Research News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA @GTResearchNews Media Relations Contacts : Brett Israel ( @btiatl ) (404-385-1933) ( brett.israel@comm.gatech.edu ) or John Toon (404-894-6986) ( jtoon@gatech.edu ) Writer : Brett Israel\nAdditional Images\nContact\nBrett Israel brett.israel@comm.gatech.edu\nEmail\nbrett.israel@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}