{"text": "Iran Nuclear Deal Withdrawal “Terribly Misguided,” says Sam Nunn School of International Affairs Scholar | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nIran Nuclear Deal Withdrawal “Terribly Misguided,” says Sam Nunn School of International Affairs Scholar\nRachel Whitlock, an assistant professor who specializes in lobal nuclear politics and international security , says the decision to pull out gives Iran all the leverage\nFacebook\nTwitter\nEmail\nRachel Whitlark\nMay 09, 2018\n— Atlanta, GA\nThe decision by U.S. President Donald Trump to withdraw from the Iran nuclear deal “is terribly misguided and cedes all the leverage to Iran,” said Rachel Whitlark, an expert in global nuclear politics and international security at the Georgia Institute of Technology.\n“The belief that Iran will now be willing to renegotiate a mythical ‘better deal’ seems untenable, especially since the United States’ European, Chinese, and Russian partners were opposed to a brand new deal or scrapping the current one,” said  Whitlark , who specializes in international security and foreign policy decision-making, including nuclear proliferation, counter-proliferation, and military intervention.\nTrump announced Tuesday, May 8, 2018, that the United States would pull out of the Joint Comprehensive Plan of Action, or JCPOA,  the 2015 culmination of a fevered international effort to halt Tehran’s progress toward a nuclear weapon.\nSupporters of Trump’s decision argue it will give the United States more leverage to negotiate a better deal with Iran that would permanently end the threat of the country gaining nuclear weapons. Whitlark said she doubts this scenario, in part because the United States lacks the political capital to convince international partners to restore sanctions against Iran.\nAlthough the United States could restore secondary sanctions on international entities that do business with Iran, those measures would fall well short of the far-reaching global effort that brought Iran to the negotiating table in the first place, Whitlark said.\n“Reimposing the sanctions regime is going to be incredibly difficult, especially on the scale that it was prior to the JCPOA’s negotiation,” she said.\nWhitlark also said Trump’s decision will give Iran ammunition to further isolate the United States from its allies, and likely will severely damage U.S. credibility as a negotiating partner ahead of critical upcoming talks with North Korea over its nuclear program.\n“The point of the JCPOA was to take the nuclear issue off the table, to then allow for discussion on the other relevant issues, such as terrorism, regional turbulence, and Iran’s ballistic missile program,” Whitlark said.\n“Scrapping the deal makes that all but impossible, given that this action will fuel hardliners in Iran, drive a wedge between the U.S. and key international partners, and make the United States look untrustworthy,” said Whitlark.\n“This is a lesson to any other current or future proliferant — be incredibly wary of negotiating with the U.S. or freezing or halting your nuclear program,” she said.\nWhile Iran’s next steps remain unclear — perhaps attempting to salvage some remnants of the JCPOA with the remaining participants or possibly even resurrecting its nuclear weapons program — the implications for the global non-proliferation regime are alarming, Whitlark said.\n“Denuclearizing North Korea is already a herculean challenge,” she said. “Simultaneously combatting an Iranian nuclear weapons program and Middle East arms race add dizzying nuclear complications.”\nWhitlark is an assistant professor in the Sam Nunn School of International Affairs. The school is a unit of the  Ivan Allen College of Liberal Arts .\nTo learn more about Whitlark, her work, and the work of other scholars in the Sam Nunn School, visit the school’s  website .\nAdditional Images\nContact\nRebecca Keane\nDirector of Communications\nrebecca.keane@iac.gatech.edu\n404.894.1720\nEmail\nrebecca.keane@iac.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}