{"text": "New Interdisciplinary Research Institute to Launch This Summer | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNew Interdisciplinary Research Institute to Launch This Summer\nThe Institute for Electronics and Nanotechnology and the Institute for Materials have announced they will combine to form a new Interdisciplinary Research Institute set to begin operations on July 1, 2024.\nFacebook\nTwitter\nEmail\nNov 17, 2023\nThe Institute for Electronics and Nanotechnology (IEN) and the Institute for Materials (IMat) have announced they will combine to form a new Interdisciplinary Research Institute (IRI) set to begin operations on July 1, 2024.\nThe new IRI, which has yet to be named, will explore the vast scientific, technological, societal, and economic impacts of innovative materials and devices, as well as foster their incorporation into systems that improve the human condition in areas such as information and communication technologies,\nthe built environment , and human well-being and performance.\n“The new IRI will not only combine the strengths of IEN and IMat, but will also allow us to further expand faculty representation from across the Institute,” said Julia Kubanek, vice president of Interdisciplinary Research at Georgia Tech. “As we look at the future of research in these areas, expanding inclusivity of researchers from the liberal arts, design, business, and basic sciences will allow us to better meet the education, workforce development, and innovation needs of Georgia, the U.S., and the world.”\nThe new IRI will strengthen Georgia Tech’s role in national focus areas such as the\nNational Nanotechnology Initiative , the\nMaterials Genome Initiative , and the\nCHIPS and Science Act , as well as identify and shape future priorities.\nCore competencies of the new IRI will include:\nFundamental science to comprehend and control matter from the nanoscale to the mesoscale.\nThe synthesis, processing, and characterization of materials to achieve desired properties.\nThe design and fabrication of novel devices and components with enhanced capabilities.\nThe integration of materials, devices, and components into larger systems.\nComputing, modeling, simulation, and big data to advance progress at all length scales.\nIntegration into all stages of research, from conceptualization to impact assessment, of economic, business, and social factors to ensure sustainable and equitable benefits.\n“IEN and IMat have worked closely together for years, and there is overlap in the research areas we cover,” said Eric Vogel, IMat’s executive director. “This is an opportunity for us to build on IEN and IMat’s individual successes and our strong record of collaboration to create something even more exceptional.”\nThe new IRI will strengthen the state-of-the-art core cleanroom and characterization facilities, providing researchers with the tools and resources necessary for cutting-edge interdisciplinary research. These facilities will continue to serve both Georgia Tech and, through its leadership within the\nNSF National Nanotechnology Coordinated Infrastructure , the nation. Recognizing the importance of nurturing talent, it will champion education and outreach programs to inspire the next generation and equip the workforce with the skills necessary to collaborate and communicate across multiple disciplines.\n“This is an exciting time to look to the future,” said Michael Filler, interim executive director of IEN. “We highly value the dedication and hard work of our staff and research faculty, who have been crucial to the success of IEN and IMat and will be the backbone of this new organization. We look forward to creating something exceptional in the coming months.”\nAdditional Images\nContact\nLaurie Haigh\nlaurie.haigh@research.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}