{"text": "Passion for Flying Primes SGA President for Career in Aviation | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nPassion for Flying Primes SGA President for Career in Aviation\nGrowing up, Rohan Sohani dreamed of becoming a pilot. While a heart murmur impeded the outgoing SGA president’s plans, he didn’t let it stop him from finding his way into the skies.\nFacebook\nTwitter\nEmail\nMay 03, 2023\nFor some, Commencement may feel like a plane's wheels hitting the runway, signaling an end to a journey. But, for Rohan Sohani, it's just the beginning of a flight plan.\nGrowing up, the Johns Creek, Georgia, native was awestruck as he traveled with his family. Not by the destination but by the travel itself — from navigating the airport to sitting in the window seat looking out from 30,000 feet. As a college student picking a major, Sohani was guided by his love for flying, math, and science to choose\naerospace engineering .\nThis week, he will graduate from Georgia Tech before moving to Washington to become an aircraft-level integration engineer for Boeing's 777 program. “Georgia Tech has always been a shining light and represents what I see as the gold standard, especially in the aerospace industry, and once I got in, it was a no-brainer to come back home,” he said.\nWhen he arrived here as a second-year transfer student from Purdue University, Sohani was searching for a sense of community. He quickly found what he was looking for, joining the undergraduate Student Government Association (SGA) as a member of the finance committee.\nDrawing on his own experience, Sohani worked to improve community building and academic resources for transfer students. He rose through the organization's ranks as vice president of academic affairs before being elected as the SGA president his senior year –– the first transfer student to serve in the role. During his tenure, SGA exceeded pre-pandemic levels of funding allocations to student groups, while also expanding Georgia Tech's crisis housing center.\nHe may be elated to pass the baton to the incoming SGA president, but Sohani never took his opportunity for granted as he worked behind the scenes to advocate on behalf of the student body and strived to elevate as many voices as he could along the way.\n\"I hope my legacy at SGA will be that I always prioritized students,\" he said. \"I had the privilege of being in meetings that most students won't see, so it was important to me to think of who is missing from the table and what perspectives are missing.\"\nSohani worked with the Office of Institute Relations to convey students’ priorities to the state legislature as well as Georgia's representatives in Congress during a trip to the nation's capital earlier this year. In addition to his work with student organizations, Sohani spent his summers interning with NASA developing exercise software for the Artemis Program, and with Tesla as an interior designer.\nWhile his day job after graduation will keep him on the ground, Sohani has proven that he'll find his way into the sky. Born with a heart murmur, Sohani's dream of becoming a professional pilot was thwarted at a young age, but that didn't stop him from chasing the thrill of flying. Beginning in middle school, Sohani attended aviation camps at the University of Georgia. By 16, he was flying on his own, having earned his private pilot's license, and through Centennial Aviation, Sohani regularly takes to the skies to unwind.\n\"As soon as I take off, whether I'm just flying around Atlanta or to the beach, that's the only thing that I'm focused on. I get to forget about everything else that's on the ground and just put that to the side. I'll put some music and sunglasses on and just cruise through the air,\" he said.\nSohani underwent a heart valve replacement nearly a year ago. As he emerged from the surgery, he was reminded of the community that surrounds him at Georgia Tech. His parents received a call from President Ángel Cabrera, along with an outpouring of support from members of his cabinet as well as classmates and faculty members.\n\"The support that I got from the administration and faculty was something that I really appreciate, and I think it goes to show just how much Georgia Tech cares about its students,\" he said.\nBefore he begins his work at Boeing in June, Sohani will have plenty of time to peer out of airplane windows when he travels to Europe for two weeks, visiting 16 cities and over 100 locations.\nWhen Sohani arrived at Tech, he had to reach outside of his comfort zone to find the community he was looking for. His advice to incoming students or those still searching for ways to get involved is to try everything that Tech has to offer — because the sky is the limit.\nAdditional Images\nContact\nSteven Gagliano\n- Communications Officer\nInstitute Communications\nEmail\nsteven.gagliano@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}