{"text": "Reconfigurable Origami Tubes Could Find Antenna, Microfluidic Uses | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nReconfigurable Origami Tubes Could Find Antenna, Microfluidic Uses\nOrigami may soon provide a foundation for antennas that can reconfigure themselves to operate at different frequencies.\nFacebook\nTwitter\nEmail\nThis illustration shows six different configurations that can be produced from a single origami tube through the redeployment of certain folds. (Credit: Evgueni Filipov, Glaucio Paulino, and Tomohiro Tachi.)\nJan 27, 2016\n— Atlanta, GA\nOrigami, the ancient art of paper folding, may soon provide a foundation for antennas that can reconfigure themselves to operate at different frequencies, microfluidic devices whose properties can change in operation – and even heating and air-conditioning ductwork that adjusts to demand. The applications could result from reconfigurable and reprogrammable origami tubes developed by researchers at three institutions, including the Georgia Institute of Technology. By changing the ways in which the paper is folded, the same tube can have six or more different cross sections. Though the models are now reconfigured by hand, magnetic or electrical actuators could make the changes when the tubes are used in real-world applications. The tubes can be folded flat for shipping, and made in a range of sizes from the nanoscale up to architectural scale. By developing the mathematical theory behind the folding, the researchers can design tubes with the exact properties needed for electrical engineers, civil engineers or other users. The tubes employ the Miura-ori pattern, one of many unique patterns used in origami. “We have developed a new type of origami tube that is reconfigurable to many different cross sections,” said\nGlaucio Paulino , a professor in the Georgia Tech  School of Civil and Environmental Engineering . “We have also developed a mathematical theory that goes along with it that allows us to design the tubes and predict how they can be reconfigured or reprogrammed. The research was supported by the National Science Foundation and reported January 27th in the journal\nProceedings of the Royal Society A . In addition to Paulino, the research team included Evgueni Filipov, a graduate student at University of Illinois at Urbana-Champaign and University of Tokyo professor Tomohiro Tachi. Fabricating the tubes begins by scoring paper in a device that resembles a computer printer. A special type of cutter in the device follows the researchers’ computer program to make cuts partially through the heavy paper by controlling the cutting speed and cutter force. The cuts facilitate folding and gluing the components to make the tubes, which can be folded flat and then expanded. The innovation by the research team was to design folds have two options. One fold might create a section of paper that bulges out of the tube, like a mountain range – and alternatively can create a valley in the tube. These variations allow the different configurations to be selected, each producing a slightly different cross section. “The cross section of each one is different, the area of the tube is different and the properties of the tube are different,” said Paulino. “The ability to create different cross sections is critical, especially for multi-physics applications such as deployable origami coupled with active or responsive materials.” Among the potential applications are reconfigurable tubes that could carry electromagnetic energy and function as antennas. Different folds would allow them to operate at different frequencies, an application with potential military and commercial interest. “Your phone has an antenna designed to work at a specific frequency,” explained Paulino. “If you needed the phone to work at a different frequency, right now you would need a different device. With this reconfigurable capability, we could obtain different antenna configurations in the same device with the same origami tube antenna.” Other applications could range from tiny microfluidic tubes able to switch liquids, to engineering and architectural-scale applications in ductwork, piping and even structures to provide shade for buildings during hot parts of the year. Though they’re made of paper, the origami tubes can be designed to be quite strong and to support heavy loads, while being easily foldable when not in use. In practical applications, the tubes would be made from flexible polymers or other materials. Origami structures have been made for a long time, but what Paulino and his collaborators bring to the field is a mathematical understanding and theory that allows them to apply an engineering approach to the development of the new tube configurations. “We have a complete mathematical theory that allows us to see how many cross sections each tube would allow,” he said. “The theory is very powerful. We now have the math, the theory and the prototypes to demonstrate the ideas. We can program these polygonal tubes to create almost any shape.” In future work, Paulino and his collaborators would like to establish an actuation mechanism to redeploy the tubes when needed. The system could be operated using magnetized structures, or by electronic means. “We are working toward coupling these reconfigurable capabilities with a programmable function that would allow us to activate the folds remotely,” he said. “We would be able to switch among the different configurations at will.” In September 2015, the same research team reported developing a new “zippered tube” origami configuration that makes paper structures stiff enough to hold weight yet able to fold flat for easy shipping and storage. Their method could be applied to other thin materials, such as plastic or metal, to transform structures ranging from furniture and buildings to microscopic robots. This research was partially supported by the National Science Foundation (NSF) under grant CMMI-1538830. The content is solely the responsibility of the authors and does not necessarily represent the official views of the National Science Foundation. CITATION : E.T. Filipov, G.H. Paulino and T. Tachi, “Origami tubes with reconfigurable polygonal cross-sections,” (Proceedings of the Royal Society A, 2016).\nhttp://dx.doi.org/10.1098/rspa.2015.0607. Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contact : John Toon (404-894-6986) ( jtoon@gatech.edu ) Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu 404-894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}