{"text": "IMPAX Program Accelerates Technology Transition into the Navy | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nIMPAX Program Accelerates Technology Transition into the Navy\nA new initiative known as IMPAX is transferring technology into the Navy.\nFacebook\nTwitter\nEmail\nRob “Radar” Winston, the GTRI principal research engineer who directs the IMPAX program, discusses how the initiative will serve the Naval Air Warfare Center - Aircraft Division. (Credit: Branden Camp, Georgia Tech)\nDec 06, 2017\n— Atlanta, GA\nWhat if you had to wait eight years to get the great new cellphone technology your friends and neighbors were using today? That’s essentially the situation facing today’s warfighters, who must wait for long procurement cycles to bring them the latest technology.\nThe U.S. Naval Air Systems Command (NAVAIR), Naval Air Warfare Center - Aircraft Division (NAWCAD) and the\nGeorgia Tech Research Institute\n(GTRI) are working to address that challenge through a new effort – dubbed\nIMPAX\n(Innovation and Modernization Patuxent River) – that aims to accelerate the transfer of new technology to meet U.S. Navy and U.S. Marine Corps needs. IMPAX staff members are empowered to work outside the standard acquisition process to find, develop, and prototype new technology more quickly.\nIMPAX was launched in 2017 as an initiative of Rear Admiral Mark Darrah, program executive officer for Unmanned Aviation and Strike Weapons at NAVAIR, by working closely with the Technology Transfer Office at NAWCAD. The first initiative with the Navy is to identify technology that will help integrate unmanned aerial vehicles into air control systems by providing miniaturized identification friend or foe (IFF) systems. IFF systems are already used in piloted aircraft, but the much smaller unmanned aircraft lack the space or power for conventional systems.\n“Traditionally the Department of Defense (DoD) has been limited in the means and speed at which it could bring new technologies to the warfighter,” said Rob “Radar” Winston, a GTRI principal research engineer who directs the IMPAX program near Pax River Naval Air Station in Maryland. “Our adversaries aren’t constrained by cumbersome procurement rules and regulations. Through this effort, we want to ensure that our nation’s warfighters get the best technology in the shortest time.”\nIMPAX is empowered to seek out technology from sources the government doesn’t usually work with. These can include small- and medium-sized businesses, companies that don’t traditionally work with the military or bid on billion-dollar DoD procurements. Winston and his team work on the Navy’s behalf, matching warfighter needs with technology that may already exist – or that can be developed to meet the needs.\nThe relationship between GTRI and NAVAIR’s Naval Air Warfare Center Aircraft Division (NAWCAD) is known as a partnership intermediary agreement (PIA). Such agreements allow non-federal government intermediaries to coordinate and solicit non-traditional science and technology sources and to bring forth ideas from parties not usually able to contribute directly to military solutions.\n“This is the first PIA specifically designed for the Navy to spin technology into naval aviation,” Winston explained. “We are looking for technology in industry, academia, and other government agencies that can be brought into the DoD very rapidly. If somebody is already working on something that the Navy needs, we can bring them together quickly. We are not just working for the government, but as a team member on the government’s behalf as a trusted partner.”\nIn one aspect, IMPAX team members will serve as technology scouts, scouring many sources of information to locate technologies of interest. They’ll be readily approachable, and won’t require extensive paperwork from companies and others wanting to pitch their technology for potential military applications. The overall activities will be directed by a joint GTRI/NAWCAD/NAVAIR team.\n“If an individual or company has a great idea but they have never worked with the government before, that barrier to entry is very tall now,” he said. “They don’t know who to talk with, how to get involved in a program, or even how to get through the front gate of a military facility. We are going to be able to talk with these people to assess what they can contribute to the warfighter and do it all outside the gate and without the customary barriers.”\nDoD agencies have their own research laboratories to help develop new technology, of course, but Winston’s group will tap other sources of innovation. For technology that’s promising but not quite ready for DoD use, IMPAX will fund brief research and development (R&D) initiatives – as short as three or four months – to determine whether a technology is worth pursuing. Pathways from there could include the traditional agency R&D laboratories.\n“The purpose is to run these programs very quickly, and also to fail things fast with a minimum of investment in resources or time if they aren’t working out,” he said. “We can start a technology development program at any time, and it can be any technology of interest to the fleet.”\nEach technology development program will be monitored by a subject matter expert and a director from GTRI. They will keep a close eye on program progress, help faltering ones, shut down ones that aren’t making progress or add team members and expertise to promising ones.\nThe IMPAX team will also be able to assemble packages of different technologies to meet specific needs, efforts known as mash-ups.\n“Traditional programs do little to encourage the collision of ideas between different organizations, people, and technologies,” Winston said. “We’re here to help companies and organization work together to address the need with minimal barriers to innovation.”\nThe IMPAX initiative won’t change how major weapons systems are acquired, but could affect how those systems are updated over time to retain their effectiveness as new technologies rapidly enter the marketplace.\n“IMPAX is going to enable technology that will keep these big platforms operationally relevant over a longer period of time,” Winston explained.\nThe IFF capability for unmanned systems is just one example of an ongoing IMPAX project. Another initiative is looking at the use of augmented reality to support maintenance and training programs. By combining 3-D computer-aided design files with mixed reality glasses, the technology could help maintainers identify a problem, locate components hidden within an aircraft, and train new personnel more quickly.\n“Technology already exists for these projects, but it would take a long time to actually get them to the fleet using traditional acquisition timelines,” said Winston. “We can help develop the capability, get it to the Navy who can then get it out to the warfighter quickly. We’ll run as fast as we can with a project and give our warfighters the edge by getting the latest technology to them – today.”\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : John Toon (404-894-6986) (jtoon@gatech.edu).\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}