{"text": "Celebrating National Bike Month | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nCelebrating National Bike Month\nWith May designated as National Bike Month, and this week Bike to Work Week, it’s a good time to explore options for cycling on and near Georgia Tech’s campus.\nFacebook\nTwitter\nEmail\nStudents, faculty, and staff participate in the Earth Day Bike Ride in April 2022. Photo by Joya Chapman\nMay 19, 2022\n— Atlanta, GA\nMay is National Bike Month, and this week is\nBike to Work Week , which makes it a good time to explore options for cycling on and near Georgia Tech’s campus. Georgia Tech has been designated a\nGold level Bicycle Friendly University\nand is home to more than 4,000 bike parking spaces, so there’s no shortage of amenities for those who want to enjoy a ride.\nIn recent updates, Georgia Tech will offer summer bike parking for those who will not be on campus but want to leave a bike behind for fall. Parking and Transportation Services (PTS)\nwill accommodate summer bike parking\nin the Dalney Deck (W22) and the Tech Square Hotel deck (E81). Users are required to\nregister your bike with the Georgia Tech Police Department\n(GTPD) and can enter the rooms using their BuzzCard.\nFor those who will be on campus this summer,\nSpin e-bikes are now available for use , and discounts are offered for the Tech community. New bike racks have been added to the Klaus Parking Deck, accessible through the pedestrian entrance on Ferst Drive.\nPTS continues to offer its own online bike/scooter safety class for the Tech community. Participants learn practical tips for bike care, safety, and rules of the road, and receive a free helmet upon completion of the class.\nLearn more and sign up .\nA new class is also being offered in partnership with the Atlanta Bicycle Coalition. The 45-minute class on Thursday, May 26, at 4 p.m. will include a ride on campus beginning on Tech Parkway, in the parking turnaround area behind the Campus Recreation Center (near the rear entrance to the CRC parking deck). Students, faculty and staff are welcome. Participants may bring their own bike, or Spin will also be on hand with e-bikes for participants. Helmets are required and participants will sign a waiver.\nPTS also sells helmets for $12, and U-locks can be purchased at\nEarl’s Bike Shop , located just west of campus. Campus cyclists are also encouraged to register their bikes with GTPD. Bike registration can aid in getting bikes back to their owner if they are stolen or need to be removed from a campus rack.\nRegistration is easy and free . Scooter owners can also register their scooters through the same system.\nThe\nAtlanta Cycling Festival\nis currently underway, with events running through May 22 that include group rides, outdoor social events, and bike tours, and informational classes.\nFor Tech employees, switching to a bike or other alternative mode of transportation can be lucrative — cash incentives are offered through\nGeorgia Commute Options . For resources on getting started as a bike commuter, visit\npts.gatech.edu/bicycling-georgia-tech .\nCreating a Safer Future for Cyclists\nTwo Ph.D. students in the School of Civil and Environmental Engineering are researching ways to collect better data and create safer bicycle infrastructure so that more people will feel comfortable cycling on city streets.\nRachael Panik and Reid Passmore aren’t just interested in cycling as an academic pursuit — they are also active cyclists who ride their bikes to commute and run errands, giving them a deep understanding of the opportunities and challenges of cycling in Atlanta.\nAccording to Passmore, many cyclists are hesitant to share the road with cars because they don’t feel safe. He says infrastructure like bike lanes and multi-use paths are needed to make cycling more accessible. Passmore’s research leverages cyclists’ preferences to estimate the perceived safety contributions of new bike infrastructure projects to help city planners and engineers.\nPanik says there is still not enough data to fully understand the risks affecting bicycle crash rates, especially in communities where active travel culture is just beginning to grow. In partnership with the Georgia Department of Transportation (GDOT), her research will create activity estimates of bicycle travel volumes and risk estimates to prioritize safety projects within Atlanta and Georgia.\nLearn more about these students and their research to make cycling safer and more enjoyable:\nWhat led you to this area of study?\nPanik:\nI became interested in multimodal transportation after studying abroad in Japan. I loved that I could travel around Japan without a car but instead by walking, biking, and train. My interests in bicycling grew even more during my master’s degree internship and first job. I worked for an engineering firm that specialized in bicycle and pedestrian infrastructure design and planning, and through that work I learned about all of the challenges we need to solve for people bicycling in the U.S.\nPassmore:\nBetween undergrad and grad school, I interned at the Atlanta Regional Commission and took inventory of all of metro Atlanta’s bike infrastructure. I saw lots of gaps, and I wanted to find ways to fix those gaps in a systematic way.\nWhat is your experience with cycling?\nPassmore:\nSince I started at Georgia Tech in 2015, I’ve been car-free. I use my bike for getting groceries, getting to class, exploring, and socializing.\nPanik:\nI actually never cycled for transportation until moving to Atlanta in the summer of 2020. I took advantage of there being fewer cars on the road due to Covid-19. Less traffic (for a little while, at least) gave me the opportunity to gain confidence biking in the city. Now, I cycle for many of my trips, including my commute to Georgia Tech.\nWhat’s the major problem you see with cycling safety and infrastructure?\nPassmore:\nThe lack of connected and protected cycling infrastructure.\nPanik:\nIf I had to boil it down to one major problem with cycling safety, it would be vehicle speed. Since most of the severe and fatal crashes in the United States involve cars, vehicle speed is an incredibly important problem in cycling safety.The way that we design our transportation system in the U.S. gives priority to moving vehicles fast. That decision is inherently at odds with people cycling safely, no matter what kind of infrastructure we design.\nHow does your research aim to address this problem?\nPassmore:\nI’m trying to measure how new cycling infrastructure would improve the existing cycling network. Then I can rank cycling infrastructure according to this metric and know what needs to get built first.\nHave you found a disconnect between what cyclists prefer and what infrastructure exists or has been proposed by policymakers and city planners?\nPanik:\nYes. I In general, people who cycle for trips prefer traveling on roads where drivers go slowly and where they are physically separated from cars. To create enough of those kinds of roads to make traveling feasible for people who are not already bicycling requires long-term political willpower and commitment to a shared vision of what we want transportation in Atlanta to be. We see really great examples of this kind of infrastructure all over the city, like the Atlanta BeltLine and the new Spring Street bike lanes — we just need much more of these kinds of projects so that there is a real cycling network in the city.\nHow could volume and risk estimates be used to prioritize safety projects?\nPanik:\nA big problem for engineers who decide how to improve roadway safety is knowing where to prioritize safety projects. There are many roadways and intersections in Atlanta and in Georgia that have bicycle crashes — so how do they decide which ones to tackle first? If we assume that the most important projects are those that would mitigate the most risk, then we have to effectively measure risk. That’s where my research comes in. I hope to help GDOT engineers better measure risk on Atlanta and Georgia roadways so they can more systematically implement safety projects.\nWhat are the benefits of more robust cycling options?\nPassmore:\nDriving isn’t for everyone, yet the current conditions make driving one of the only viable options. I’d be miserable if I was forced to drive everywhere because it stresses me out, so having cycling as an option lets me avoid driving entirely. In addition, cycling is cheap, efficient, healthy, and environmentally friendly.\nPanik : If Atlanta had a more robust cycling network, I think the city would be a fundamentally different (and, in my opinion, better) place. Of course, more people would cycle if there were better options to do it, and that would go hand in hand with a different kind of physical space. Think about the development that surrounds the BeltLine: it’s just different from the rest of the car-oriented development in the city. Now, imagine that kind of people-oriented development throughout the city connected by a network of great roads for biking. It would be a safer, more sustainable, and (importantly) more fun way to live.\nHow do you think civil engineers will help improve the future of cycling in cities?\nPassmore:\nCivil engineers of the past have largely ignored designing for cyclists, and this has led to inadequate and dangerous conditions. I think civil engineers of the present and future have a duty to improve these conditions through physical infrastructure (like bike lanes, multi-use paths, and traffic calming) until cycling is safe enough for a parent to feel comfortable letting their child bike on their own.\nPanik:\nCivil engineers are important members of the group of people (such as urban planners and politicians) who decide what it feels like to live in a city. That is a huge responsibility and privilege. Engineers can improve the future of cycling by prioritizing the safety of\nall\nroad users over speed and moving cars. That kind of thinking is a big shift from what transportation engineers do now, but it is a necessary one if we want to make cycling safer and more enjoyable.\nRelated Links:\nhttps://www.midtownatl.com/about/midtown-transportation/bike-to-work-week-2022\nhttps://www.atlantabike.org/classes\nhttps://www.atlantacyclingfestival.com/atlanta-cycling-festival-2022\nAdditional Images\nContact\nKristen Bailey\nInstitute Communications\nMelissa Fralick\nCivil and Environmental Engineering\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}