{"text": "Bold Move to Columbus Marks First Semiconductor Manufacturer in Region | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nBold Move to Columbus Marks First\nSemiconductor Manufacturer in Region\nCHIPS4CHIPS strategy, Georgia Tech collaboration, prove successful\nFacebook\nTwitter\nEmail\nJan 24, 2024\nCOLUMBUS and ATLANTA, GA —\nInnovative partnering proved successful as\nCHIPS4CHIPS\nannounced the locating of the first semiconductor manufacturer in the Chattahoochee Valley.\nMicromize , a pioneering semiconductor manufacturer specializing in energy-efficient electronics for wearables and mobile devices, has chosen Columbus as the location for its inaugural manufacturing facility.\nThe move is the result of strategic partnerships between  Micromize , CHIPS4CHIPS (Chattahoochee Hub for Innovation and Production of Semiconductors/C4C), and several programs at Georgia Tech’s\nEnterprise Innovation Institute , including its\nAdvanced Technology Development Center\n(ATDC), its\nGeorgia Manufacturing Extension Partnership , and the\nCenter for Economic Development Research . It also signifies a collaborative effort to harness the cutting-edge innovations in semiconductor packaging available at  Tech’s  Institute for Electronics and Nanotechnology .\n\"Our decision to locate in Columbus was driven by several crucial factors, and we are thrilled about the opportunities that this vibrant city presents for our growth and development,” said Prashant Patil, Micromize founder and CEO. “The work of CHIPS4CHIPS in supporting the semiconductor industry is commendable, and we are excited to be part of this innovative ecosystem.”\nThis exciting development was announced Tuesday, Jan. 23, at the Marcus Nanotechnology Center on Georgia Tech’s campus to a large group of state legislators and other state officials, a delegation of business and civic leaders from Columbus, and leadership from Georgia Tech and ATDC. The announcement is a true look at how statewide partnerships can lead to success for the Columbus region.\nMicromize, a spinoff of the Massachusetts Institute of Technology, selected Georgia as its new home, in part, to take advantage of the semiconductor packaging expertise at Georgia Tech. The company plans to establish its headquarters and manufacturing facility in Columbus, further solidifying its presence in the state’s vibrant technology\necosystem. Additionally, Micromize will center its cutting-edge research and development on Georgia Tech's campus.\n\"The collaboration with Micromize is a significant milestone for CHIPS4CHIPS and the entire region,” said Ben Moser, president and CEO of United Way of the Chattahoochee Valley and chair of CHIPS4CHIPS. “ This announcement marks the first of what we believe will be many to come, and we are thankful that Micromize recognizes the potential of our region for this industry. Columbus is poised for remarkable development, and we look forward to the positive impact that Micromize will bring to our community.”\nThe strategic relocation is expected to create significant economic opportunities in the region. Micromize will bring 20-25 jobs to Columbus through its headquarters and manufacturing facility, contributing to the local workforce, and fostering growth.\nMicromize will center its Research & Development Lab at Georgia Tech’s\n3D Systems Packaging Research Center , which is regarded as the world’s best for semiconductor packaging research. This partnership represents a synergistic collaboration of industry leaders, research institutions, and the entrepreneurial ecosystem. Micromize's move to Columbus not only underscores the city's growing prominence as a technology hub, but also highlights the collaborative efforts driving innovation and economic development in the state of Georgia.\nIn addition to C4C’s nationally recognized workforce development efforts, the Fort Moore Army base, and its skilled workforce, the region’s proximity to a port and airport will facilitate efficient shipping, and Columbus played a pivotal role in supporting the company by providing essential infrastructure, he said.\n“Our collaboration with Georgia Tech enriches our talent pool, adds exponentially to our research and development capabilities, and access to mentorship at ATDC enhances our commercialization potential,” Patil said. “We are also proud to be part of the effort to revitalize semiconductor manufacturing in the United States, with Columbus serving as our starting point as we embark on this exciting journey of growth and innovation.”\nGeorgia Tech, a leader in microchips and nanotechnology research, innovation, and fabrication, provides fertile ground for Micromize's relocation. The Institute’s commitment to advancing semiconductor technology aligns with the national push at the federal level (via the CHIPS and Science Act) to bring more semiconductor production to the U.S., making it more competitive in research, development, and manufacturing.\n“As the state’s technology startup incubator, we’re excited to welcome Micromize into our portfolio and to support them into the next phase of growth and expansion,” said ATDC Director John Avery.\n“Microchips, semiconductor packaging, and microelectronics are critical to our national economy and national security. Micromize’s choosing Georgia as its home to grow reflects what is proving to be a successful model when business, government, and research institutions such as Georgia Tech collaborate.”\nAdditional Media\nContact\nPéralte C. Paul\n404.316.1210\nperalte@atdc.org\nEmail\nperalte@gatech.edu\nAdditional information\nAbout Micromize\nMicromize is a leading provider of energy-efficient electronics for wearables and mobile devices. With a foundation rooted in MIT research in semiconductor packaging, Micromize is at the forefront of technological innovation, creating solutions that empower the future of electronics.\nAbout CHIPS4CHIPS\nCHIPS4CHIPS (Chattahoochee Hub for Innovation and Production of Semiconductors) is a dynamic bi-state, multi-county coalition in the Chattahoochee Valley, uniting hundreds of individuals, organizations, and businesses, as well as the public and private sector. C4C’s vision positions our region as the Southeast leader in U.S. semiconductor manufacturing. C4C’s efforts will bolster the domestic semiconductor industry, contribute to regional economic growth, support national security, and reduce poverty through the creation of well-paying jobs. With the industry’s significant U.S. expansion, C4C strategically aligns with the public, business, and educational sectors to foster a skilled semiconductor value chain.\nAbout Georgia Tech\nThe\nGeorgia Institute of Technology,\nor\nGeorgia Tech,\nis one of the top public research universities in the U.S., developing leaders who advance technology and improve the human condition.\nThe Institute offers  business, computing, design, engineering, liberal\narts, and sciences  degrees. Its more than\n46,000 students ,\nrepresenting\n50 states and more than 150 countries, study at the main campus in Atlanta, at campuses in France and China, and through distance and online learning.\nAs a leading technological university, Georgia Tech is an engine of economic development for Georgia, the Southeast, and the nation, conducting more than\n$1 billion\nin research annually for government, industry, and society.\nAbout ATDC\nThe\nAdvanced Technology Development Center\n(ATDC), a program of the Georgia Institute of Technology ’s Enterprise Innovation Institute , is the state ’s\ntechnology startup incubator. Founded in 1980 by the Georgia General Assembly, which funds it each year, ATDC’s mission is to work with entrepreneurs in Georgia to help them learn, launch, scale, and succeed in the creation of\nviable , disruptive technology companies. Since its founding, ATDC has grown to become the longest running and one of the most successful university-affiliated incubators in the United States, with its graduate startup companies raising\n$3 billion\nin investment financing and generating more than\n$12 billion\nin revenue in the state of Georgia. To learn more, visit\natdc.org .\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}