{"text": "Sol-gel Capacitor Dielectric Offers Record-high Energy Storage | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nSol-gel Capacitor Dielectric Offers Record-high Energy Storage\nResearchers have developed a new capacitor dielectric material that provides an electrical energy storage capacity rivaling certain batteries.\nFacebook\nTwitter\nEmail\nJul 29, 2015\n— Atlanta, GA\nUsing a hybrid silica sol-gel material and self-assembled monolayers of a common fatty acid, researchers have developed a new capacitor dielectric material that provides an electrical energy storage capacity rivaling certain batteries, with both a high energy density and high power density. If the material can be scaled up from laboratory samples, devices made from it could surpass traditional electrolytic capacitors for applications in electromagnetic propulsion, electric vehicles and defibrillators. Capacitors often complement batteries in these applications because they can provide large amounts of current quickly. The new material is composed of a silica sol-gel thin film containing polar groups linked to the silicon atoms and a nanoscale self-assembled monolayer of an octylphosphonic acid, which provides insulating properties. The bilayer structure blocks the injection of electrons into the sol-gel material, providing low leakage current, high breakdown strength and high energy extraction efficiency. “Sol-gels with organic groups are well known and fatty acids such as phosphonic acids are well known,” noted\nJoseph Perry , a professor in the\nSchool of Chemistry and Biochemistry\nat the Georgia Institute of Technology. “But to the best of our knowledge, this is the first time these two types of materials have been combined into high-density energy storage devices.” The research, supported by the Office of Naval Research and the Air Force Office of Scientific Research, was reported July 14 in the journal\nAdvanced Energy Materials . The need for efficient, high-performance materials for electrical energy storage has been growing along with the ever-increasing demand for electrical energy in mobile applications. Dielectric materials can provide fast charge and discharge response, high energy storage, and power conditioning for defense, medical and commercial applications. But it has been challenging to find a single dielectric material able to maximize permittivity, breakdown strength, energy density and energy extraction efficiency. Perry and colleagues in Georgia Tech’s\nCenter for Organic Photonics and Electronics\n(COPE) had been working on other capacitor materials to meet these demands, but were not satisfied with the progress. The hybrid sol-gel materials had shown potential for efficient dielectric energy storage because of their high orientational polarization under an electric field, so the group decided to pursue these materials for the new capacitor applications. Using an aluminized mylar film coated with the hybrid sol-gel capacitor material, they showed that the capacitor could be rolled and re-rolled several times while maintaining high energy density, demonstrating its flexibility. But they were still seeing high current leakage. To address that, they deposited a nanoscale self-assembled monolayer of n-octylphosphonic acid on top of the hybrid sol-gel. Less than a nanometer thick, the monolayer serves as an insulating layer. “Our silica sol-gel is a hybrid material because it has polar organic groups attached to the silica framework that gives the sol-gel a high dielectric constant, and in our bilayer dielectric, the n-octylphosphonic acid groups are inserted between the sol-gel layer and the top aluminum layer to block charge injection into the sol-gel,” Perry explained. “It’s really a bilayer hybrid material that takes the best of both reorientation polarization and approaches for reducing injection and improving energy extraction.” In their structures, the researchers demonstrated maximum extractable energy densities up to 40 joules per cubic centimeter, an energy extraction efficiency of 72 percent at a field strength of 830 volts per micron, and a power density of 520 watts per cubic centimeter. The performance exceeds that of conventional electrolytic capacitors and thin-film lithium ion batteries, though it doesn’t match the lithium ion battery formats commonly used in electronic devices and vehicles. “This is the first time I’ve seen a capacitor beat a battery on energy density,” said Perry. “The combination of high energy density and high power density is uncommon in the capacitor world.” Researchers in Perry’s lab have been making arrays of small sol-gel capacitors in the lab to gather information about the material’s performance. The devices are made on small substrates about an inch square. “What we see when we apply an electric field is that the polarization response – which measures how much the polar groups line up in a stable way with the field – behaves in a linear way,” said Perry. “This is what you want to see in a capacitor dielectric material.” The next step will be to scale up the materials to see if the attractive properties transfer to larger devices. If that is successful, Perry expects to commercialize the material through a startup company or SBIR project. “The simplicity of fully solution-based processes for our dielectric material system provides potential for facile scale-up and fabrication on flexible platforms,” the authors wrote in their paper. “This work emphasizes the importance of controlling the electrode-dielectric interface to maximize the performance of dielectric materials for energy storage application.” In addition to Perry, the research team included Yunsang Kim, Mohanalingam Kathaperumal and Vincent Chen from the Georgia Tech School of Chemistry and Biochemistry; Yohan Park from the Georgia Tech School of Materials Science and Engineering; Canek Fuentes-Hernandez and Bernard Kippelen from the Georgia Tech School of Electrical and Computer Engineering, and Ming-Hen Pan from the Naval Research Laboratory. This research was supported by the Office of Naval Research Dielectric Films Program (Grant N000141110462) and U.S. Air Force Office of Scientific Research, BioPAINTS MURI Program (Grant FA9550-09-0669). The content of this article is solely the responsibility of the authors and does not necessarily represent the official views of the sponsoring agencies. CITATION : Yunsang Kim, et al., “Bilayer Structure with Ultra-high Energy/Power Density Using Hybrid Sol-Gel Dielectric and Charge Blocking Monolayer, (Advanced Energy Materials, 2015).\nhttp://www.dx.doi.org/10.1002/aenm.201500767 Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contact : John Toon ( jtoon@gatech.edu ) (404-894-6986) Writer : John Toon\nContact\nJohn Toon Research News jtoon@gatech.edu 404-894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}