{"text": "Study in 'Science' finds missing piece of biogeochemical puzzle in aquifer | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nStudy in 'Science' finds missing piece of biogeochemical puzzle in aquifer\nNew study may dramatically shift our understanding of the complex dance of microbes and minerals that takes place in aquifers deep underground.\nFacebook\nTwitter\nEmail\nJul 18, 2014\n— Atlanta, GA\nWritten by Argonne National Laboratory A study published in Scienceby researchers from the U.S. Department of Energy’s Argonne National Laboratory and co-authored by Georgia Tech may dramatically shift our understanding of the complex dance of microbes and minerals that takes place in aquifers deep underground. This dance affects groundwater quality, the fate of contaminants in the ground and the emerging science of carbon sequestration. Deep underground, microbes don’t have much access to oxygen. So they have evolved ways to breathe other elements, including solid minerals like iron and sulfur. The part that interests scientists is that when the microbes breathe solid iron and sulfur, they transform them into highly reactive dissolved ions that are then much more likely to interact with other minerals and dissolved materials in the aquifer. This process can slowly but steadily make dramatic changes to the makeup of the rock, soil and water. “That means that how these microbes breathe affects what happens to pollutants — whether they travel or stay put — as well as groundwater quality,” said Ted Flynn, a scientist from Argonne and the\nComputation Institute\nat the\nUniversity of Chicago\nand the lead author of the study. About a fifth of the world’s population relies on groundwater from aquifers for their drinking water supply, and many more depend on the crops watered by aquifers. For decades, scientists thought that when iron was present in these types of deep aquifers, microbes who can breathe it would out-compete those who cannot. There’s an accepted hierarchy of what microbes prefer to breathe, according to how much energy each reaction can theoretically yield. (Oxygen is considered the best overall, but it is rarely found deep below the surface.) According to these calculations, of the elements that do show up in these aquifers, breathing iron theoretically provides the most energy to microbes. And iron is frequently among the most abundant minerals in many aquifers, while solid sulfur is almost always absent. But something didn’t add up right. A lot of the microorganisms had equipment to breathe both iron and sulfur. This requires two completely different enzymatic mechanisms, and it’s evolutionarily expensive for microbes to keep the genes necessary to carry out both processes. Why would they bother, if sulfur was so rarely involved? The team decided to redo the energy calculations assuming an alkaline environment — “Older and deeper aquifers tend to be more alkaline than pH-neutral surface waters,” said Argonne coauthor Ken Kemner — and found that in alkaline environments, it gets harder and harder to get energy out of iron. “Breathing sulfur, on the other hand, becomes even more favorable in alkaline conditions,” Flynn said. The team reinforced this hypothesis in the lab with bacteria under simulated aquifer conditions. The bacteria,\nShewanella oneidensis,\ncan normally breathe both iron and sulfur. When the pH got as high as 9, however, it could breathe sulfur, but not iron. There was still the question of where microorganisms like\nShewanella\ncould find sulfur in their native habitat, where it appeared to be scarce. The answer came from another group of microorganisms that breathe a different, soluble form of sulfur called sulfate, which is commonly found in groundwater alongside iron minerals. These microbes exhale sulfide, which reacts with iron minerals to form solid sulfur and reactive iron. The team believes this sulfur is used up almost immediately by\nShewanella\nand its relatives. “This explains why we don’t see much sulfur at any fixed point in time, but the amount of energy cycling through it could be huge,” Kemner said. Indeed, when the team put iron-breathing bacteria in a highly alkaline lab environment without any sulfur, the bacteria did not produce any reduced iron. “This hypothesis runs counter to the prevailing theory, in which microorganisms compete, survival-of-the-fittest style, and one type of organism comes out dominant,” Flynn said. Rather, the iron-breathing and the sulfate-breathing microbes depend on each other to survive. Understanding this complex interplay is particularly important for sequestering carbon. The idea is that in order to keep harmful carbon dioxide out of the atmosphere, we would compress and inject it into deep underground aquifers. In theory, the carbon would react with iron and other compounds, locking it into solid minerals that wouldn’t seep to the surface. Iron is one of the major players in this scenario, and it must be in its reactive state for carbon to interact with it to form a solid mineral. Microorganisms are essential in making all that reactive iron. Therefore, understanding that sulfur—and the microbe junkies who depend on it—plays a role in this process is a significant chunk of the puzzle that has been missing until now. The study, “Sulfur-Mediated Electron Shuttling During Bacterial Iron Reduction,” appeared online in the May 1 edition of\nScience Express\nand was published in\nScience\nearlier this summer. Other authors on the study were Argonne scientists Bhoopesh Mishra (also of the Illinois Institute of Technology) and Edward O’Loughlin and\nGeorgia Tech\nscientist Thomas DiChristina. “The exciting findings reported in our study were made possible by combining the microbiology expertise of my laboratory in the School of Biology at Georgia Tech with the geochemical expertise of the Molecular Environmental Sciences group led by Ken Kemner at Argonne National Laboratory,” said Professor DiChristina, “The biogeochemical link between bacterial iron- and sulfur-breathing bacteria is important for survival of microbial communities in modern subsurface environments, and also provides clues to the evolution of ancient metabolic processes on an early Earth that lacked oxygen but contained large amounts of iron and sulfur.” Funding for the research was provided by the\nU.S. Department of Energy’s Office of Science . The\nAdvanced Photon Source\n(APS) is also supported by the DOE’s Office of Science. The team conducted X-ray analysis at the APS\nGeoSoilEnviroCARS\nbeamline 13-ID-E, which is operated by the University of Chicago and jointly supported by the\nNational Science Foundation\nand the DOE’s Office of Science. Additional support came from the\nNational Institutes of Health\nand the National Science Foundation. T ‪ he Computation Institute\n(CI), a joint institute of the University of Chicago and Argonne National Laboratory, is an intellectual nexus for scientists and scholars pursuing multi-disciplinary research, and a resource center for developing and applying innovative computational approaches. Founded in 1999, it is home to over 200 faculty, fellows, and staff researching complex, system-level problems in such areas as biomedicine, energy and climate, astronomy and astrophysics, computational economics, social sciences and molecular engineering. CI is home to diverse projects including the Center for Robust Decision Making on Climate and Energy Policy , the\nCenter for Multiscale Theory and Simulation , the\nUrban Center for Computation and Data\nand\nGlobus . The Advanced Photon Source\nat Argonne National Laboratory is one of five national synchrotron radiation light sources supported by the U.S. Department of Energy’s Office of Science to carry out applied and basic research to understand, predict, and ultimately control matter and energy at the electronic, atomic, and molecular levels, provide the foundations for new energy technologies, and support DOE missions in energy, environment, and national security. To learn more about the Office of Science X-ray user facilities, visit the\nuser facilities directory . Argonne National Laboratory\nseeks solutions to pressing national problems in science and technology. The nation's first national laboratory, Argonne conducts leading-edge basic and applied scientific research in virtually every scientific discipline. Argonne researchers work closely with researchers from hundreds of companies, universities, and federal, state and municipal agencies to help them solve their specific problems, advance America's scientific leadership and prepare the nation for a better future. With employees from more than 60 nations, Argonne is managed by\nUChicago Argonne, LLC\nfor the U.S. Department of Energy's Office of Science. DOE’s Office of Science\nis the single largest supporter of basic research in the physical sciences in the United States, and is working to address some of the most pressing challenges of our time. For more information, visit\nscience.energy.gov .\nContact\nJason Maderer National Media Relations 404-385-2966 maderer@gatech.edu\nEmail\nmaderer@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}