{"text": "Tech in DC: Intersecting Science and Policy | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nTech in DC: Intersecting Science and Policy\nGeorgia Tech grads are finding that a background in engineering is quite useful — and welcome in Washington, DC.\nFacebook\nTwitter\nEmail\nMarc Canellas and fellow researcher/co-author Rachel Haga, simulating air traffic controllers in a study of collision avoidance systems.\nAug 25, 2017\n— Atlanta, GA\nScience has been in the political hot seat recently, with questions surrounding what is or is not real. But Tech grads are undaunted and are finding that a background in engineering is quite useful\n—\nand welcome in Washington, D.C.\nMarc Canellas is going to Washington. He graduated in May with a doctorate in aerospace engineering and will spend a year in the nation’s capital as an IEEE Congressional Science and Technology Fellow, serving as a science and technology advisor for one year beginning this fall. He will be assigned to a congressional office to help with issues of science and technology.\n“[The congressperson] may not be on a formal committee that has ‘science and technology’ in the name explicitly, but science and technology issues are ubiquitous,” said Canellas. “I met with Rep. John Lewis’ staff, and they’re very interested in Atlanta’s growth, Georgia Tech, and the airport. You might ask: ‘Why does a civil rights icon care about science and technology? There are a lot of issues with surveillance, face recognition, and body cameras that are very technology dependent. And that affects people’s civil rights. So, issues of ethics and morals have technology embedded in them.”\nCanellas, who plans to attend law school after his fellowship, wants to combine law and technology.\n“I love technology, but I think it has to be balanced with our morals and ethics, and thus our laws and regulations. That’s where the ‘pacing problem’ comes in,” he said. “The capability of science and technology is increasing at such a great pace, way faster than our laws or political norms can change, creating gaps in our society’s legal and ethical oversight. We need people to bridge that gap between what’s coming out of Silicon Valley and what’s being governed in D.C., and I want to be one of those people.”\nCanellas, who studied in the\nCognitive Engineering Center\nin the School of Aerospace Engineering, said there is a place for technologists to say: “Here is what the technology is really doing as we understand it.” The center designs and analyzes complex, safety-critical, human-technology interaction.\n“If there is a human and a computer involved, we, as engineers, want to make sure they interact and work together very well,” he said. “Our job is to make sure the design of cockpits or collision avoidance systems, or the management of air traffic control is done in such a beautiful way that the humans and the technology work seamlessly, so that everybody is safe and operating effectively.”\nWhen he was applying to the doctoral program in aerospace engineering, Canellas originally wanted to build spacecraft. “I wanted to be an astronaut, like every other kid.”\nBut then he met with Karen Feigh, aerospace associate professor and director of the Cognitive Engineering Center, who told him about their work in human-technology interaction, and he thought: “That is the coolest thing I have ever heard of in my entire life.”\nCanellas said, “You can do anything with this. So, if you want to work on submarines, ships, robots, computers, or phones, our methods are valuable. We apply it to aerospace because we like planes and spacecraft.”\nWorking with Congress appeals to Canellas because he can apply a diverse set of cognitive engineering methods to help deal with people and technology. For example, if a congressperson is interested in a novel technology, Canellas has formal training and experience that can help.\n“I would like to bring some of my expertise to Congress,” he said. “For example, law enforcement is now using face recognition algorithms to identify people from pictures and videos. I can read the literature on face recognition, apply my expertise, and say, ‘here’s the general description and its potential. Here are the main issues of accuracy and bias. Here are the questions we should be asking not just about the technology but about their training, procedures, and organization. Oh, and here’s a draft of a policy or standard that would be a good first step towards good governance.’ That is already in my skill set, so I would like to use it.”\nCanellas also can help bridge the gap when congresspersons need to speak with engineers about technological issues. And he would like to help them learn to communicate better with voters, regardless of political affiliation.\nEngineering Public Policy\nGretchen Goldman is the research director for The Center for Science and Democracy at the\nUnion of Concerned Scientists\nin Washington, DC. The Georgia Tech graduate leads research efforts on the role of science in public policy, focusing on topics ranging from scientific integrity in government decision-making, to political interference in science-based standards on hydraulic fracturing, climate change, sugar, and chemicals.\nThe organization develops science-based solutions to highly technical policy problems and gets them into the hands of members of Congress, government officials, the media, and the public. The goal is to help ensure that the scientific community can lend its expertise to a range of policy decisions that affect people’s lives, from food safety to drug approvals to clean air and water standards.\nGoldman, who has master’s and doctoral degrees in environmental engineering from Tech, largely works on federal policy, but occasionally works at the state or local level.\n“The training I got at Georgia Tech as a scientist taught me how science works and what is and isn’t science. I carry that with me when I think about what I’m doing here,” Goldman said. “I think a lot about how our role — being at the intersection of science and policy, and being a science-based advocacy group — is that we make sure what we do is based on solid science. I take that very seriously in thinking about how to advocate for change and inform policies while making sure we’re being accurate and true to what science tells us.”\nWhen Goldman enrolled at Georgia Tech she was not thinking about going into policy. As she went through the graduate program, she realized that she felt best suited for and there was more action around translating technical information in order to make better decisions.\n“That was a place where I could really make a difference — at that intersection of science and policy, and applying my engineering training to affecting change and making people’s lives better,” she said.\nWhile a Tech student, Goldman was a senator for the student government for a few years, and she chaired the Bicycle Infrastructure Improvements Committee which looked at ways to improve bicycle infrastructure on campus. She took advantage of the opportunities that allowed her to hone her skills in organizing and management, and to see what that science policy interface looked like.\n“I had advisors that were very open about how I could apply my work to the science policy intersection to student groups on campus,” she said. “I was involved with students organizing for sustainability. And I did some direct lobbying at the Georgia level that gave me a good window into the policy realm and how you can apply technical knowledge into the policy space.”\nToday, Goldman has some advice for science, technology and engineering students who may be considering working in the policy arena.\n“You know more than you think you know,” she said. “When you’re in school, especially in engineering, you are aware of how much you don’t know. But, when you enter the real world you realize you have a ton of expertise, and you are valuable in the policy space. There’s a huge opportunity for scientists and people with technical training to contribute. In fact, we really need people with technical training to be involved in decision making at the federal level and all levels. I think Tech students would be very well suited for policy roles.”\nAdditional Images\nRelated links\nCognitive Engineering Center\nUnion of Concerned Scientists\nGovernment & Community Relations internship opportunities\nContact\nVictor Rogers\nInstitute Communications\n404-894-6398\nEmail\nvictor.rogers@comm.gatech.edu\nAdditional information\nGeorgia Tech’s Office of Government and Community Relations fosters meaningful work experiences in public service settings for Tech students and graduates. Next week, the office will hold information sessions for the Georgia Legislative Internship Program on August 29, and for the Georgia Tech Federal Jackets Fellowship on August 31. Details and application deadlines can be found below.\nAug. 29:  Georgia Legislative Internship Program\nAug. 31:  Federal Jackets Fellowship\nGeneral internship site\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}