{"text": "Chris Downing to head Enterprise Innovation Institute (EI2) | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nChris Downing to head Enterprise Innovation Institute (EI2)\nChris Downing, a 28-year Georgia Tech veteran, selected to lead the future of Institute’s economic development and innovation mission.\nFacebook\nTwitter\nEmail\nJun 30, 2016\n— Atlanta, GA\nThe Georgia Institute of Technology has named Chris Downing vice president of the Enterprise Innovation Institute (EI 2 ), effective immediately. The announcement ends a six-month national search for a new vice president, following Stephen Fleming’s decision to step down from the position in December 2015. As the Institute’s chief business outreach organization, EI 2\nis the nation’s largest and most comprehensive university-based program of business and industry assistance, technology commercialization, and economic development. Downing will report directly to Stephen E. Cross, executive vice president for Research at Georgia Tech.  “I am thankful for this opportunity and I remain focused on our core mission at EI 2\nto fulfill Georgia Tech’s commitment to economic development,” Downing said. “Working with the dedicated professionals at EI 2 , we will enhance Georgia Tech’s work in designing the future through our service to entrepreneurs, business, researchers, innovators, and the people of Georgia.” Downing had served as EI 2 ’s associate vice president since 2012 and as interim vice president since October 2015. He has been at Georgia Tech in various leadership roles related to economic development since 1988. “EI 2 , including its multiple programs that support Georgia startups, manufacturers, and entrepreneurs across the state, serves all aspects of economic development in Georgia. It is a vital component of the innovation ecosystem we have built at Tech Square,” Georgia Tech President G.P. “Bud” Peterson said. “Chris has worked diligently to support and enhance our economic development initiatives, as well as to forge and maintain strong partnerships with other organizations across the state to strengthen the Georgia economy.” Downing, whose past posts at Georgia Tech included serving as research engineer, program manager, regional manager, and director of the Georgia Manufacturing Extension Partnership (GaMEP) — EI 2 ’s largest program — has brought national recognition to the unit and several awards, including the 2014 Innovation Award in Economic Development from the Association of Public and Land Grant Institutions, the 2014 Outstanding Research Park Award from the Association of University Research Parks, and the National MEP Innovation Award in 2011 for the GaMEP. “Chris has elevated EI 2 ’s commitment to technology commercialization, business and industry outreach, and entrepreneurship,” Cross said. “Through his leadership, EI 2 ’s stature and prominence in Georgia as the state’s most comprehensive economic development organization has risen. His passion and commitment to EI 2 ’s mission has helped to make Tech Square the Southeast’s premier neighborhood for innovation and economic development and is instrumental in helping to define other innovation neighborhoods adjacent to the rest of the campus.” About the Enterprise Innovation Institute (EI 2 ): The Enterprise Innovation Institute (EI²) is the Georgia Institute of Technology’s chief business outreach and economic development organization. EI²’s core mission is to provide an exhaustive suite of programs to assist business, industry, entrepreneurs, and economic developers across Georgia. As the nation’s largest and most comprehensive university-base program of its kind, EI² helps enterprises of all kinds and sizes and across all sectors improve their competitiveness through the application of science, technology, and innovation. For more information, please visit\ninnovate.gatech.edu .\nAdditional Images\nContact\nFor inquiries about the Enterprise Innovation Institute, contact: Laura Diamond 404.660.2927 laura.diamond@gatech.edu\nEmail\nperalte.paul@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}