{"text": "Wearable Computing Ring Allows Users to Write Words and Numbers with Thumb | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nWearable Computing Ring Allows Users to Write Words and Numbers with Thumb\nTechnology allows people to trace letters and numbers on their fingers and see the figures appear on a nearby computer screen.\nFacebook\nTwitter\nEmail\nFingerSound uses wearable ring technology to detect numbers and letters drawn on fingers.\nNov 29, 2017\n— Atlanta, GA\nWith the whirl of a thumb, Georgia Tech researchers have created technology that allows people to trace letters and numbers on their fingers and see the figures appear on a nearby computer screen. The system is triggered by a thumb ring outfitted with a gyroscope and tiny microphone. As wearers strum their thumb across the fingers, the hardware detects the movement.\nIn a\nvideo demonstration , the “written” figures appear on an adjacent screen. In the future, the researchers say the technology could be used to send phone calls to voicemail or answer text messages — all without the wearer reaching for their phone or even looking at it.\n“When a person grabs their phone during a meeting, even if trying to silence it, the gesture can infringe on the conversation or be distracting,” said Thad Starner, the Georgia Tech School of Interactive Computing professor leading the project. “But if they can simply send the call to voicemail, perhaps by writing an ‘x’ on their hand below the table, there isn’t an interruption.”\nStarner also says the technology could be used in virtual reality, replacing the need to take off a head-mounted device in order to input commands via a mouse or keyboard.\nThe research team wanted to build a system that would always be available and easy to use.\n“A ring augments the fingers in a way that is fairly non-obstructive during daily activities. A ring is also socially acceptable, unlike other wearable input devices,” said Cheng Zhang, the Georgia Tech graduate student who created the technology.\nThe system is called Fingersound. While other gesture-based systems require the user to perform gestures in the air, Fingersound uses the fingers as a canvas. This allows the system to clearly recognize the beginning and end of an intended gesture by using the microphone and gyroscope to detect the signal. In addition to helping recognize the start and end of a gesture, it also provides tactile feedback while performing the gestures. This feedback is crucial for user experience and is missing on other in-air gestures\n“Our system uses sound and movement to identify intended gestures, which improves the accuracy compared to a system just looking for movements,” said Zhang. “For instance, to a gyroscope, random finger movements during walking may look very similar to the thumb gestures. But based on our investigation, the sounds caused by these daily activities are quite different from each other.”\nFingersound sends the sound captured by the contact microphone and motion data captured by the gyroscope sensor through multiple filtering mechanisms. The system then analyzes it to determine whether a gesture was performed or whether it was simply noise from other finger-related activity.\nThe research was presented earlier this year at Ubicomp and the ACM International Symposium on Wearable Computing along with two other papers that feature ring-based gesture technology.\nFingOrbits\nallows the wearer to control apps on a smartwatch or head-mounted display by rubbing their thumb on their hand. With\nSoundTrak , people can write words or 3-D doodles in the air by localizing the absolute position of the finger in 3-D space, then see the results simultaneously on a computer screen.\nThe new technologies were developed by the same team that created a technique that\nallowed smartwatch wearers to control their device by tapping its sides .\nAdditional Images\nRelated links\nPrevious Research with Smartwatches\nSchool of Interactive Computing\nMeet Thad Starner\nContact\nJason Maderer\nNational Media Relations\nmaderer@gatech.edu\n404-660-2926\nEmail\nmaderer@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}