{"text": "Disclosing Weaknesses Can Undermine Some Workplace Relationships | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nDisclosing Weaknesses Can Undermine Some Workplace Relationships\nSharing personal information with friends and family has long been held by researchers as a way to build rapport and healthy relationships. But between coworkers, that's not always true.\nFacebook\nTwitter\nEmail\nDana Harari, Georgia Institute of Technology (Credit: Rob Felt)\nJan 29, 2018\n— Atlanta, GA\nSharing personal information with friends and family has long been held by researchers as a way to build rapport and healthy relationships. But between coworkers, that’s not always true.\nThat is at the center of new research conducted at Georgia Institute of Technology, where researchers looked into how personal disclosures in a workplace environment could impact the relationships between coworkers and task effectiveness.\nIn the study published in January in the journal Organizational Behavior and Human Decision Processes, the researchers found that for higher status individuals, disclosing a weakness negatively affected their relationship and task effectiveness with their lowers status partners.\n“We may think that sharing personal information is always a good thing, but what we found is that when higher status individuals, which could in real situations include star employees, share personal information that highlights a potential shortcoming, it can affect the way they are perceived by coworkers,” said Dana Harari, a doctoral student at Georgia Tech’s Scheller College of Business. “This is important because it could undermine their ability to be an effective manager.”\nThe team, which included Kerry Gibson, now an assistant professor at Babson College and Jennifer Carson Marr, now an assistant professor at the University of Maryland, focused on task-oriented relationships such as those found in a workplace.\nThe researchers devised three laboratory experiments during which a total of 762 participants completed virtual tasks with either a higher status or peer status partner. During the task, the “coworker,” who was actually a confederate in the study, disclosed personal information that could be perceived either as a weakness, a positive or neutral.\nThe researchers found that although the type of disclosure did not affect peer status disclosers, higher status individuals who disclosed a weakness experienced a “status penalty.” As a result, higher status disclosers were liked less, and participants resisted their influence more during the task.\n“A lot of the current conversations that we hear about leadership is that we want leaders to be authentic and to bring their true selves to work, but our findings suggest that if doing so reveals vulnerability initially such as sharing their flaws, it could have a negative impact on how well they’ll be able to influence the people that they work with,” Harari said.\nThe findings are particularly notable because in organizations, higher status individuals may be motivated to disclose information about their weaknesses to coworkers in the hopes of developing a closer relationship and working better together as a result, the researchers wrote. Or, in some cases, the disclosing individual may hope to relieve the stress of trying to conceal weaknesses.\nBut that “status loss” could lead to unintended outcomes, such as the discloser having less influence and experiencing more conflict within their team, the researchers wrote.\n“It is especially interesting that although self-disclosing weakness signaled vulnerability for everyone, only higher status disclosers suffered from this ‘status penalty,’” Harari said. “Thus, although higher status disclosers may feel closer to their coworkers after disclosing information themselves, they may not realize that the receiver may not feel closer to them.”\nCITATION:\nKerry Roberts Gibson, Dana Harari, Jennifer Carson Marr, “When sharing hurts: How and why self-disclosing weakness undermines the task-oriented relationships of higher status disclosers,” (Organizational Behavior and Human Decision Processes, January 2018). https://doi.org/10.1016/j.obhdp.2017.09.001\nAdditional Images\nContact\nJohn Toon\nResearch News\nEmail\njohn.toon@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}