{"text": "Rising Temperatures Threaten Stability of Tibetan Alpine Grasslands | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nRising Temperatures Threaten Stability of Tibetan Alpine Grasslands\nA warming climate could affect the stability of alpine grasslands in Asia's Tibetan Plateau.\nFacebook\nTwitter\nEmail\nResearchers studied the effects of rising temperatures and varying rainfall on Tibetan Plateau grasslands at this experimental site at the Haibei Alpine Grassland Ecosystem Research Station of the Chinese Academy of Sciences. (Credit: Xian Yang and Qianna Xu)\nMay 10, 2017\n— Atlanta, GA\nA warming climate could affect the stability of alpine grasslands in Asia’s Tibetan Plateau, threatening the ability of farmers and herders to maintain the animals that are key to their existence, and potentially upsetting the ecology of an area in which important regional river systems originate, says a new study by researchers in China and the United States.\nThough temperature changes could destabilize the fragile ecosystem of the area, variations in rainfall appear to have no similar effect. The study involved varying two factors likely to change with a warming climate – temperature and rainfall – in test plots over a five-year period. The project is believed to be the first to simultaneously examine the effects of temperature and rainfall changes on ecosystem stability.\n“We were concerned about the variability of the total community plant cover over time,” said\nLin Jiang , a professor in the Georgia Tech\nSchool of Biological Sciences . “Significant warming could reduce the stability of the grasslands, which would increase the variability of plant biomass production that could be a significant issue for people living in the region. We believe the effects of climate change could be particularly dramatic in this area.”\nThe research, conducted by scientists from Peking University, the Chinese Academy of Sciences and the Georgia Institute of Technology, was reported May 10 in the journal\nNature Communications . The research was supported by the National Basic Research Program of China, the National Natural Science Foundation of China and the U.S. National Science Foundation.\nThe Tibetan Plateau is an area of about 2.5 million square kilometers in which summertime high temperatures seldom rise above 25 degrees Celsius and nighttime temperatures could drop below freezing even in the summer. Because of the altitude, temperature extremes and high winds, more than two-thirds of the Plateau is grassland used for grazing yak, sheep and other animals. About 9.8 million people live in the area, which is also the source for several of Asia’s major river systems.\n“Our results suggest that under a warmer climate, the ecosystem would provide less forage production in drought years, and more biomass production in wet years – which is undesirable,” said Jin-Sheng He, a professor in the Department of Ecology, College of Urban and Environmental Sciences at Peking University. “Reduced plant production temporal stability could mean that this alpine ecosystem may not be able to provide stable forage for the livestock that local people rely on. Reduced stability may also have consequences for other ecosystem services, such as climate regulation and water conservation.”\nThe researchers found that the stability of the grasslands was affected not by the richness of plant species, but by the effects on dominant species and the asynchrony of the species.\n“We found that climate warming lowers stability through increasing species synchrony in which the biomass of a few dominant species increased while that of most rare species declined,” said He. “That indicates the alpine grasslands that have well adapted to cold environments owing to their long-term evolutionary history may be jeopardized in the future.”\nExperimentally, the researchers created test plots in which some were heated to two degrees Celsius above the surrounding grasslands. At the same time, the researchers varied the amount of rainfall onto the plots, with some sections receiving 50 percent more water, and others receiving 50 percent less. There were also control sections in which temperature and rainfall were not adjusted. Each of the six conditions were replicated six times, for a total of 36 test plots.\nOver a period of five years, the researchers studied the growth of different grass species by weighing the biomass production from the different test plots. The research was done at the Haibei Alpine Grassland Ecosystem Research Station of the Chinese Academy of Sciences.\nJiang was surprised that the dramatic variations in rainfall didn’t affect the grass species, and hadn’t expected much impact from the temperature change, which translates to about 3.6 degree Fahrenheit. “The plants appear to be able to tolerate significant variations in the amount of water available,” he said.\nWhile the Tibetan Plateau is unique for its size and high average altitude, there are other areas of the world with similar conditions. “If these findings can be generalized to other alpine ecosystems, we may need to be concerned about large variations in biomass production in these other areas, as well,” Jiang added.\nThe study adds to knowledge about the Tibetan plateau, which has not been well studied because of its geographical isolation and harsh climate.\n“The Tibetan plateau is sometimes called the third pole because there are so many high mountains and so much of the area is covered with snow and ice,” said Jiang. “Ecologically, it is a very important region, but relatively few ecological studies have ever been done there.”\nThis study was supported by the National Basic Research Program of China (2014CB954004 and 2014CB954003), the National Natural Science Foundation of China (31630009 and 31361123001), the U.S. National Science Foundation (DEB-1257858 and DEB-1342754), and the 111 Project (Grant No. B14001) of China. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the author(s) and do not necessarily reflect the views of the sponsoring agencies.\nCITATION : Zhiyuan Ma, Huiying Liu, Zhaorong Mi, Zhenhua Zhang, Yongui Wang, Wei Xu, Lin Jiang and Jin-Sheng He, “Climate warming reduces the temporal stability of community biomass production,” (Nature Communications, 2017).\nhttp://dx.doi.org/10.1038/NCOMMS15378 .\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contacts : John Toon (404-894-6986) (jtoon@gatech.edu) or Ben Brumfield (404-385-1933) (ben.brumfield@comm.gatech.edu).\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}