{"text": "Team Demonstrates Digital Health Platform for Department of Veterans Affairs | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nTeam Demonstrates Digital Health Platform for Department of Veterans Affairs\nA public-private team has developed a proof-of-concept digital health platform for the Department of Veterans Afffairs.\nFacebook\nTwitter\nEmail\nThe Veterans Health Administration serves more than 8 million veterans a year through more than 1,700 sites of care. Among them is the Atlanta VA Medical Center, shown here. (Credit: VHA)\nJan 31, 2017\n— Atlanta, GA\n“Liberate the data.” That was a principal design goal for a team of public-private health care technology collaborators established by the U.S. Department of Veterans Affairs and Veterans Health Administration to develop a working and scalable proof-of-concept\ndigital health platform\n(DHP) to support the department’s long-term vision.\nThe open-source project demonstrated both proven and emerging technologies for interoperability and advanced functionality innovations from both the public and private sectors. The proof-of-concept delivers capabilities that VA and VHA leadership had identified as strategically important to support clinical and operational policy and program transformation plans needed to address expected changes in veteran populations, service needs and care delivery models.\nFor example, the demonstration included the capability to obtain patient data from disparate military and commercial electronic records systems, and accept information from a broad range of ancillary services and consumer medical devices.\nThe public-private collaboration, established in partnership with the VA’s Office of Information and Technology, included the VHA, Office of the National Coordinator for Health Information Technology (ONC), the Georgia Institute of Technology and private-sector companies providing services in analytics, customer relationship management, and application program interfaces. Georgia Tech served as the project’s lead architect and provided overall project management.\n“If you can liberate the data from deep inside a system and securely move it to the cloud and manage its movement through well-designed application programming interfaces (APIs), that gives you a lot of options for reorganizing work flows and processes,” said Steve Rushing, senior strategic adviser in Georgia Tech’s Health Extension Services. “We are doing for health care what has already been done for other industries that have used interoperability standards as the foundation for APIs to exchange information among different systems.”\nThe team – including partner organizations Salesforce (CRM), Mulesoft (API gateway), Apervita (real-time analytics) and UCB (portfolio of predictive analytics solutions for epilepsy) – conducted its first demonstration just six weeks after the contract with the VA was signed. Using Fast Healthcare Interoperability Resources (FHIR), a standard describing health data formats and elements, and a REST API transport protocol, the team built an API gateway surrounding VistA and Georgia Tech’s testing and teaching electronic health record system, known as GTonFHIR. The project used anonymous patient data.\nThe overall project created 21 system APIs, which control how specific types of data flow into and out of the DHP. This included data exchanges with the Cerner EHR (representing the Department of Defense and a community hospital), Duke University Medical Center (Epic) as an academic medical provider, DocSnap personal health record (connecting to a Navy medicine pilot project), and personal health monitoring devices via Apple Healthkit and Validic.\nResults of the proof-of-concept collaboration point to better experiences for veterans, said LaVerne Council, who was the VA’s chief information officer at the time the project was conducted.\n“The DHP leverages the power of public-private partnerships,” she said. “We brought together some of the brightest engineers and health informaticists from some of the most innovative companies and assembled them at Georgia Tech. There, over a period of eight weeks, we established an API gateway, the cornerstone of the digital health platform, consisting of 21 APIs that connected to three different EHR systems including our own, VistA, a class leading customer relationship management system, Georgia Tech’s Fast Healthcare Interoperability Resources (FHIR) server, and a real time analytics system. We also developed a veteran-facing mobile app. We integrated low-cost, high-quality video communication into the fabric of the veteran experience, and we integrated internet-connected health devices that track activities and vitals including blood pressure, weight and blood glucose.”\nBecause the architecture is not tied to any proprietary system, the proof-of-concept accommodates future developments by connecting to and from other web services, apps, devices or electronic health systems that use the FHIR or other accepted industry open standards, Rushing said. Also, by keeping much of the original VistA system accessible via the API gateway, the strategy protects the investment in and could accelerate the deployment of the agency’s existing health information technology innovations across the VHA system during the period of full DHP component acquisition and deployment, he explained.\n“In electronic health records, like almost any other major enterprise application, about 60 percent of the code is tied to routine workflow needed on a day-to-day basis. Changing these doesn’t add strategic value because the new programming will look much like the old,” Rushing said. “The important strategic implementation is done at the edges of the system, and that’s where the VA wanted us to focus our interoperability engineering and demonstrate the power of liberating the data. By using an architecture that is API-driven, we addressed the interoperability requirement, kept what works and added new VHA-created and private industry innovations where needed.”\nAmong the innovations is an analytics layer. By studying the health records of service members transitioning from active duty to veteran status, the analytics layer makes recommendations about care, such as enrollment in specialized services for veterans suffering from traumatic brain injury (TBI).\n“This is basically doing the same thing – with a different intent – that happens every time you sign into Facebook or Amazon,” said Rushing. “The system learns about you from your records to help health professionals precisely meet your personal needs. Rather than wait until a veteran has a seizure because of a service-related injury, the system would use the analytics to recommend a protocol for proactively managing the problem.”\nAs an independent third party, Georgia Tech combined the best components from the VA/VHA and private sector companies, negotiated any differences and worked with private-sector staff in five different programming teams to meet the VA’s goals. “We just wanted the best services for veterans,” said Rushing. “That was our driving objective.”\nThe demonstration addressed the specific challenges of three groups of former service members: Iraq war veterans with traumatic brain injuries, women veterans who need gender-specific services not traditionally provided by the VA, and Vietnam-era veterans who are now suffering age-related illnesses such as diabetes and congestive heart failure. TBIs alone affect some 87,000 veterans.\nThe system was demonstrated to VA and VHA officials in September and October 2016, and the Georgia Tech team is now wrapping up the documentation for what has been done.\n“The VA is looking for a flexible, future-focused health platform and architecture focused on a services-based model,” said Jon Duke, M.D., director of Georgia Tech’s Center for Health Analytics and Informatics. “They are taking a really ambitious approach to it, and this could have a tremendous impact on care for veterans as well as on health systems more broadly.”\nThe project illustrates the role Georgia Tech can play because it doesn’t have a medical school or hospital and isn’t tied to any specific technology platform.\n“When we are working with health systems, we’re neither a competitor nor a vendor,” Duke noted. “We approach each problem from a ‘white hat’ perspective, working to find the right data and infrastructure needed, often using open-source platforms.”\nThe impetus for the project was VHA strategic planning, started in the spring of 2016, on developing a successor to VistA, which has served the agency for 40 years. The strategic planning scope was expanded beyond replacement of VistA as a single EHR application system to include best practices driving enterprise information technology modernization across other industries. This included the move to a platform of interoperable cloud-based application system components.\nThe envisioned architecture with its “liberated data” allows for clinical and operational functionality extensions over time by connecting a robust portfolio of interoperable web services and mobile app innovations. By building out this architecture, the project demonstrated that these services and apps could be acquired and deployed in alignment with VA and VHA technology needs for systematically transforming clinical and operations work flows.\nThe proof-of-concept’s scope of work included a tactically critical goal: treating VistA as just another EHR. The intent was for DHP to not only be agnostic regarding commercial EHRs, but agnostic toward VistA as well.  This was achieved by moving VistA data and core modules to the cloud and leveraging existing successful VA initiatives to build open-source interoperable API gateway connections, such as the Enterprise Health Management Platform (eHMP).\nThe independence from commercial EHRs and VistA showed that VA investments in VistA modernization and VHA investments in industry leading healthcare information technologies, such as telemedicine and home monitoring, could move forward within the DHP deployment cycle and not wait for full deployment, Rushing said.\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contacts : John Toon (404-894-6986) (jtoon@gatech.edu) or Ben Brumfield (404-385-1933) (ben.brumfield@comm.gatech.edu)\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}