{"text": "Fish use chemical camouflage from diet to hide from predators | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nFish use chemical camouflage from diet to hide from predators\nA species of small fish uses a homemade coral-scented cologne to hide from predators, a new study has shown, providing the first evidence of chemical camouflage from diet in fish.\nFacebook\nTwitter\nEmail\nA filefish, pictured here, can create chemical camouflage by feeding on coral reefs. Credit: Tane Sinclair-Taylor\nDec 11, 2014\n— Atlanta, GA\nA species of small fish uses a homemade coral-scented cologne to hide from predators, a new study has shown, providing the first evidence of chemical camouflage from diet in fish. Filefish evade predators by feeding on their home corals and emitting an odor that makes them invisible to the noses of predators, the study found. Chemical camouflage from diet has been previously shown in insects, such as caterpillars, which mask themselves by building their exoskeletons with chemicals from their food. The new study shows that animals don’t need an exoskeleton to use chemical camouflage, meaning more animals than previously thought could be using this survival tactic . “This is the very first evidence of this kind of chemical crypsis from diet in a vertebrate,” said\nRohan Brooker , a post-doctoral fellow in the School of Biology at the Georgia Institute of Technology in Atlanta. “This research shows that you don’t need an exoskeleton that for this kind of mechanism to work.” The study was published December 10 in the journal\nProceedings of the Royal Society B .\nThe study was sponsored by the ARC Centre of Excellence for Coral Reef Studies and the Ecological Society of Australia. The work was done as a part of Booker’s doctoral research at James Cook University in Australia.  Anyone who has watched a nature documentary has seen insects that camouflage themselves as sticks, protecting the insects against predators that use vision to hunt for prey. But many animals see the world through smell rather than sight, and cunning critters from among them have adapted clever ways of smelling like their surroundings. A certain species of caterpillar, for example, smells like the plant that it lives on and eats. The caterpillar incorporates chemicals from the plant into its exoskeleton. Ants hunting for the caterpillar will walk right over it, none the wiser. For the new study, researchers traveled to Australia’s\nLizard Island Research Station\nin the Great Barrier Reef, where they collected filefish. To show that filefish smelled like their home coral, the researchers recruited crabs to sniff them out. The filefish were fed two different species of coral; each species of coral is home to a unique species of crab. The crabs were given a choice between a filefish that had been fed the crab’s home coral and a filefish that had been fed a coral that is foreign to the crab. The crabs always sought the filefish that had been feeding on the crabs home coral. The filefish smelled so strongly of coral that sometimes the crabs were attracted to the fish instead of coral, when given a choice between the two. “We can tell that there is something going through the filefish diet that’s making the fish smell enough like the coral to confuse the crabs,” Booker said. To see if the chemical camouflage gives the filefish an evolutionary advantage to evade predators, the researchers tested cod to see how they responded to filefish that had been fed various diets. Cod, filefish and corals were put in a tank, with the filefish hidden from the cod. When the filefish diet didn’t match the corals in the tank, the cod were restless, suggesting that they smelled food. When the filefish diet matched the corals in the tank, the cod stayed tucked away in their cave inside the tank. The next step in the project is to learn how filefish can smell like coral without the benefit of an exoskeleton. Some evidence shows that amino acids in the mucus of fish – where much of their smell originates – will match their diet, but much work remains to tease apart this pathway. “We have established that there is some kind of pathway from filefish diet to filefish odor,” Booker said. “This is just the first study. There’s a lot of work still to be done to understand how it works.” Booker is now working in the lab of\nDanielle Dixson , an associate professor of biology at Georgia Tech. This research is supported by the ARC Centre of Excellence for Coral Reef Studies and the Ecological Society of Australia. Any conclusions or opinions are those of the authors and do not necessarily represent the official views of the sponsoring agencies. CITATION : Rohan Brooker, et al., “You are what you eat: diet-induced chemical crypsis in a coral-feeding fish.” ( Proceedings of the Royal Society B , December 2014).\nhttp://rspb.royalsocietypublishing.org/content/282/1799/20141887 Research News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA @GTResearchNews Media Relations Contacts : Brett Israel ( @btiatl ) (404-385-1933) ( brett.israel@comm.gatech.edu ) or John Toon (404-894-6986) ( jtoon@gatech.edu ) Writer : Brett Israel\nAdditional Images\nContact\nBrett Israel 404-385-1933 @btiatl\nEmail\nbrett.israel@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}