{"text": "Board of Regents Approves Funding and Tuition Increases for Fiscal Year 2025 | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nBoard of Regents Approves Funding and Tuition Increases for Fiscal Year 2025\nThe University System of Georgia Board of Regents has announced budget approvals and tuition increases for its 26 member institutions.\nFacebook\nTwitter\nEmail\nApr 17, 2024\nThe University System of Georgia (USG) Board of Regents (BOR) has announced budget approvals and tuition increases for its 26 member institutions. Pending approval by Gov. Brian Kemp, Georgia Tech will receive $527.4 million in total state appropriations – an increase of nearly 9% — from last fiscal year. In addition, the BOR approved a systemwide 2.5% in-state tuition increase, a 5% out-of-state tuition increase, and an additional tuition increase of 2% for out-of-country students for the upcoming fiscal year (FY25).\nThe USG adopted these increases to help combat the rising costs of institutional operations, while also prioritizing their commitment to affordability for Georgia’s college students. For Georgia Tech, this will be the first tuition rate increase since the 2019-2020 academic year and the third increase in the past 10 years.\n“Institutional budgets are under a lot of pressure due to rising costs, and this increase in vital funding sources will enable Georgia Tech to continue to grow and invest in its people in the upcoming fiscal year. It is imperative to boldly align our resources with core institutional priorities and goals to maximize the impact of the increased funding opportunities,” said Shantay N. Bolton, executive vice president for Administration and Finance and chief business officer. “Georgia Tech’s record-breaking applications and enrollment, return on investment, and economic impact are a testament to what we can achieve with continued support from our partners. We are grateful to Gov. Kemp, the General Assembly, and the University System of Georgia for contributing to the continued success of Georgia Tech.”\nTuition and Cost of Attendance\nThe 2.5% in-state tuition and 5% out-of-state tuition increases apply to both undergraduate and graduate programs. For the first time, the BOR also approved a new rate for out-of-country students, representing a 2% increase over out-of-state tuition.\nTuition for online programs will also increase next year. Georgia Tech’s online and professional master’s programs are increasing by 2.5%. The Online Master of Science in Analytics, Computer Science, and Cybersecurity are each increasing by 8% — though they remain among the country’s most affordable programs.\nThe USG approved fee and rate increases for many of its 26 member institutions. At Georgia Tech, mandatory fees will increase by 2.7% overall. Notably, of the elective fees, the housing deposit fee of $600 has been eliminated in FY25. Housing and food costs will increase by approximately 3% and 5% respectively.\nThe USG also created a new online learning fee for students enrolled in distance learning courses or programs who are not enrolled in on-campus courses or residing on campus. This new fee will be prorated for part-time students. The Online Master of Science in Analytics, Computer Science, and Cybersecurity each have a separate tuition and fee structure approved by the BOR and are not affected by this fee. Visit the\nUSG website  for a full listing of fee and rate changes.\nState Appropriations\nThe BOR approved an additional $43 million in state appropriations for FY25. This includes the permanent reinstatement of $10.1 million initially cut from Tech’s FY24 budget. In FY24, state appropriations accounted for 19% of Georgia Tech’s total budget of $2.7 billion.\nNew state appropriations for FY25 will include approximately $17 million to fund the cost-of-living adjustment for full-time eligible employees. The majority of pay adjustments will be completed in July; more information will be provided as it becomes available.\nOther new allocations include:\n$13.5 million in enrollment growth funding.\n$4 million in adjustments to employee benefits and maintenance and operations.\n$3.6 million reduction for legislative adjustments.\nGeorgia Tech’s Institute Budget Planning and Administration will submit the FY25 budget to the BOR for spending approval in advance of their meeting in May.\nThe new fiscal year begins July 1.\nRelated links\nUniversity System of Georgia Approves Tuition for 2024-2025 Academic Year\nContact\nRachael Pocklington\nInstitute Communications\nEmail\nrpocklington@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}