{"text": "Easy on the eyes: How eyelash length keeps your eyes healthy | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nEasy on the eyes: How eyelash length keeps your eyes healthy\nThe optimal eyelash length is one-third the width of your eye.\nFacebook\nTwitter\nEmail\nEyelashes of 22 mammals, including goats (pictured) and humans are the same: one-third the length as the width of the eye.\nFeb 25, 2015\n— Atlanta, GA\nIt started with a trip to the basement of the American Museum of Natural History in New York to inspect preserved animal hides. Later, Georgia Institute of Technology researchers built a wind tunnel about 2 feet tall, complete with a makeshift eye. By putting both steps together, the team discovered that 22 species of mammals – from humans, to hedgehogs, to giraffes ­– are the same: their eyelash length is one-third the width of their eye. Anything shorter or longer, including the fake eyelashes that are popular in Hollywood and make-up aisles, increases airflow around the eye and leads to more dust hitting the surface. “Eyelashes form a barrier to control airflow and the rate of evaporation on the surface of the cornea,” said\nGuillermo Amador , a Georgia Tech Ph.D. candidate in the\nGeorge W. Woodruff School of Mechanical Engineering\nwho authored the study. “When eyelashes are shorter than the one-third ratio, they have only a slight effect on the flow. Their effect is more pronounced as they lengthen up until one-third. After that, they start funneling air and dust particles into the eye.” The study, “Eyelashes divert airflow to protect the eye,” is currently published in the Journal of the Royal Society Interface. Amador and the research team, which is led by mechanical engineering Associate Professor\nDavid Hu , sent a student to the museum in 2012 to measure eyes and eyelashes of various animals. Aside from an elephant, which has extremely long eyelashes, every species studied had evolved to the same ratio of lash length to eye width. The team then built the wind tunnel to re-create air flows on a mimic of an adult, human eye. A 4-millimeter deep, 20-millimeter diameter aluminum dish served as the cornea. It sat on top of an acrylic plate, which imitated the rest of the face. Mesh surrounded the dish to replicate the eyelashes. They discovered the ideal ratio while varying the mesh length during evaporation and particle deposition studies. “As short lashes grew longer, they reduced air flow, creating a layer of slow-moving air above the cornea,” said Hu, who is also a faculty member in the School of Biology. “This kept the eye moist for a longer time and kept particles away. The majority of air essentially hit the eyelashes and rolled away from the eye.” The opposite process occurred with longer eyelashes. The lashes extended further into the airflow and created a cylinder. The air and its molecules channeled toward the eye and led to faster evaporation. “This is why long, elegant, fake eyelashes aren’t ideal,” said Amador. “They may look good, but they’re not the best thing for the health of your eyes.” There are exceptions, though. The research team notes that people who can’t grow eyelashes could wear fake ones, if they’re the correct length, for extra protection and to reduce dry eye. “Even if they’re not the correct length, more eyelashes are always better than less,” said\nAlexander Alexeev , an associate professor in the School of Mechanical Engineering. “If fake eyelashes are dense enough, they may give the same overall effect in protecting the eye even if they are longer than one-third.” They team also says the findings could be used to create eyelash-inspired filaments to protect solar panels, photographic sensors or autonomous robots in dusty environments. This work was supported by the National Science Foundation award numbers PHY-1255127 (Career Award) and CBET-1256403. Any opinions expressed in this article are those of the authors and do not necessarily reflect the official views of the sponsoring organizations.\nAdditional Images\nContact\nJason Maderer National Media Relations maderer@gatech.edu 404-385-2966\nEmail\nmaderer@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}