{"text": "Angela Davis Talks Activism and Reform at 2021 Black History Month Lecture | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nAngela Davis Talks Activism and Reform at 2021 Black History Month Lecture\nActivist, author, and educator Angela Davis delivered a virtual keynote address at Georgia Tech’s 2021 Black History Month Lecture on Feb. 10.\nFacebook\nTwitter\nEmail\nAngela Davis gave a keynote speech at the 2021 Georgia Tech Black History Month Lecture\nFeb 11, 2021\n— Atlanta, GA\nEsteemed activist, author, and educator Angela Davis delivered a virtual keynote address at Georgia Tech’s 2021 Black History Month Lecture on Feb. 10. A pioneer in international civil rights and Black feminist movements, Davis has been a prominent figure for decades, working as an academic and authoring more than 10 books on race, class, gender, prison abolition, and the criminalization of marginalized communities.\nThe lecture was seen by more than 1,700 unique viewers.\n“We are thankful to Carter G. Woodson for initiating the observance in 1926 of what was then called Negro History Week,” she opened, referring to the historian and one of the first scholars to study African American history. Woodson became known as the “Father of Black History.” “This week is precisely the week we would be celebrating [Negro History Week] in those days.”\nDecades later, Black History Month became, in Davis’ words, “the 28 days that are allocated to us to reflect not only on the contributions of Black people, but on the meaning of the phenomenal collective struggle for freedom that stretches back to the days when the first Africans were forcefully brought to the Americas.”\nShe was born in Birmingham, Alabama, in 1944, growing up in the infamous “Dynamite Hill” neighborhood, which gained its name from frequent bombings to drive out middle-class Black residents in the 1950s and 1960s, including the 16 th\nStreet Baptist Church bombing that killed four girls in 1963. Davis attended segregated schools but reflected on the resilience her early upbringing and surroundings afforded her, saying, “Even as we boldly challenged racial segregation, I later came to understand what a gift it was to be able to grow up in a community that realized that resistance was at the core of our visions of new futures. We learned how to resist not so much as a choice, not as an extracurricular activity, but rather as a condition of life — as a condition of our collective conviction that we would someday be free.”\nAfter completing high school in New York (via a program that placed Black students from the South into integrated schools in the North), she would go on to study at Brandeis University in Boston; the Sorbonne in Paris; the University of Frankfurt in Germany; and the University of California, San Diego. In 1969, she received a doctorate in philosophy from Humboldt University in what was then East Berlin.\nDavis noted the critical role that Black women have played in advancing civil rights in the U.S., beginning with early suffrage movements. “Especially because I am speaking virtually here at Georgia Tech in Atlanta, I want to pay tribute to Stacey Abrams,” the 2018 Georgia Democratic nominee for governor and the first Black woman of a major political party to win a gubernatorial nomination. Through her voting rights advocacy, Abrams is largely credited with helping President Joseph Biden Jr. win the state of Georgia in the 2020 presidential election and for delivering two Democratic Georgia Senate seats in January. “There’s been a long history of Black women not only saving the Black community but saving the country.”\nThe lecture, sponsored by Institute Diversity, Equity, and Inclusion and the Georgia Tech African American Student Union (AASU), included a question-and-answer session moderated by AASU members Shelbe Johnson and Kemuel Russell.\nViewers asked Davis several questions on criminal justice reform. A common theme throughout much of her scholarly work has been the social issues associated with incarceration and the criminalization of communities hardest hit by poverty and racism. She rose to national prominence in 1970 for her arrest — and subsequent acquittal — in a high-profile criminal case for which she spent 18 months in jail and on trial after being placed on the FBI’s Ten Most Wanted Fugitives list. In 1997, she helped found Critical Resistance, which aims to dismantle prison systems worldwide.\nHer teaching career has taken her to San Francisco State University and the University of California, Berkeley. She also has taught at the University of California, Los Angeles (UCLA), Vassar College, Syracuse University, and Stanford University. Most recently she spent 15 years at the University of California Santa Cruz, where she is now a distinguished professor emerita of history of consciousness and of feminist studies.\n“I was hired to teach at UCLA in 1969,” she said, but before she could teach, she was fired for being a member of the Communist Party. “When I think back on the campaign to save my job, I had an enormous amount of support, including from white students and white faculty. What I attempted to do was to develop what we might call an intersectional approach. I was at the same time involved in campaigns to free political prisoners — campaigns against racism against prisoners,” Davis continued, while describing herself as a prison abolitionist rather than a prison reformer. “I took the position that people who supported me and my right to teach at UCLA should also support people in prisons who were facing far worse forms of oppression because of their political beliefs.”\nDavis will return to teach at UCLA this spring, but noted her slight disdain for the fanfare her return has already brought to the campus. “I don’t want to be accepted. I still want to make trouble – I like John Lewis’ notion of ‘good trouble,’” a nod to the late civil rights giant and Georgia congressman. “So whereas I am going to be teaching at UCLA again, I will continue to critique the institution, call out the racism, point to the heteropatriarchy, and point to their support of capitalist systems.”\nDavis paused when asked a final question about how Black people can best handle racial trauma.\n“For so long, we haven’t acknowledged racial trauma. I think what is exciting about this current era is that so many people are taking holistic approaches, teaching us how to make sense of these issues. It’s important how you incorporate acknowledgment of people’s trauma into the very work of organizing against racism.\n“Since this is the last question, I just want to point out that we can’t let up. We can’t stop. We should recognize that this is the time that the real work is getting done.”\nThe lecture can be viewed for a limited time\nhere .\nAdditional Images\nContact\nCourtney Hill\nCommunications Manager\nInstitute Diversity, Equity, and Inclusion\ncourtney.hill@gatech.edu\nEmail\ncourtney.hill@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}