{"text": "The Helix, of DNA Fame, May Have Arisen with Startling Ease | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nThe Helix, of DNA Fame, May Have Arisen with Startling Ease\nAn evolutionary enigma may have just been cracked: Explaining how the helix of RNA and DNA evolved.\nFacebook\nTwitter\nEmail\nArtwork for a study led by Nick Hud and published in Angewandte Chemie shows the chemical structure of the helix that self-assembled in the lab, producing surprisingly bountiful results. Credit: Georgia Tech / Nick Hud\nJan 23, 2019\n— Atlanta, GA\nTrying to explain how DNA and RNA evolved to form such neat spirals has been a notorious enigma in science. But  a\nnew study\nsuggests  the rotation may have occurred with ease billions of years ago when RNA’s chemical ancestors casually spun into spiraled strands.\nIn the lab, researchers at the Georgia Institute of Technology were surprised to see them do it under conditions thought to be common on Earth just before first life evolved: in plain water, with no catalysts, and at room temperature.\nThe neat spiraling also elegantly integrated another compound which today forms the backbone of RNA and DNA. The resulting structure had features that strongly resembled RNA.\nPivotal twists\nThe study has come a step closer to answering a\nchicken-egg\nquestion about the evolutionary path that led to RNA (from which DNA later evolved): Did the spiral come first, and did this structure influence which molecular components made it later into RNA because they fit well into the spiral?\n“The spiraling could have had a reinforcing effect. It could have facilitated the molecules getting connected together that have the same\nchirality\n(curve) to connect into a common backbone that is compatible with the helical twist,” said the study’s principal investigator Nicholas Hud,  a Regents Professor in Georgia Tech’s School of Chemistry and Biochemistry .\nThe researchers published the new study  in the journal  Angewandte Chemie  in December 2018 . The research was funded by the National Science Foundation and the NASA Astrobiology Program under the  Center for Chemical Evolution . The center is headquartered at Georgia Tech, and Hud is its principal investigator.\nThe study’s resulting polymers were not RNA but could be have been an important intermediate step in the early evolution of RNA. For building blocks, the researchers used base molecules referred to as “proto-nucleobases,” highly suspected to be precursors of  nucleobases , main components that transport genetic code in today’s RNA.\n[Thinking about grad school?  Here's how to apply to Georgia Tech. ]\nNucleobase paradox\nThe study had to work around a paradox in chemical evolution:\nMaking RNA or DNA using their actual nucleobases in the lab without the aid of the enzymes of living cells that usually do this job is more than a herculean task. Thus, although RNA and DNA are ubiquitous on Earth now, their evolution on pre-life Earth would appear to have been an anomaly requiring erratic convergences of extreme conditions.\nBy contrast, the Georgia Tech researchers’ model of chemical evolution holds that precursor nucleobases self-assembled easily to into ancestral prototypes -- that were polymer-like and referred to as assemblies -- which later evolved into RNA.\n“We would call these ‘proto-nucleobases’ or ‘ancestral nucleobases,’” Hud said. “For our overall model of chemical evolution, we’re saying that these proto-nucleobases, which self-assemble into these long strands, could have been part of a very early stage before modern nucleobases were incorporated.”\nOne main suspected proto-nucleobase in this experiment -- and in previous experiments on the possible the evolution of RNA -- was  triaminopyrimidine (TAP) .  Cyanuric acid (CA)  was another. The researchers highly suspect TAP and CA were parts of a proto-RNA.\nThe chemical bonds that hold together assemblies of the two suspected proto-nucleobases were surprisingly strong but  non-covalent , which is akin to connecting two magnets. In RNA the main bonds holding together modern nucleobases are  covalent bonds , akin to welding, and enzymes make those bonds in cells today.\nHelical biases\nA helix can spiral two ways, left-handed or right-handed. In chemistry, a molecule can also be handed, or  chiral , making for “L” or “D” forms of the molecule.\nIncidentally, the building blocks of today’s RNA and DNA are all the D form, which make a right-handed helix. Why they evolved like this is still a mystery.\nBatches of TAP and CA the researchers started out with produced roughly equal amounts of right and left-handed helices, but something stood out: Whole regions of a batch were biased in one direction and were separate from other regions that spiraled mostly the other way.\n“The propensity for the molecules to choose one helical direction was so strong that large regions of the batches were made up predominantly of assemblies that were unidirectionally twisted,” Hud said.\nThis was surprising because the individual molecules of TAP and CA had no chirality of their own, neither L nor D. Still, the twists had a preferred direction.\n‘world record’\nThe researchers added two more experiments to test how strongly their RNA-like assemblies preferred making one-handed helices.\nFirst, they introduced a smidgeon of compounds similar to TAP and CA, but which had L or D chirality, to nudge the spiraling direction. The whole batch conformed to the chirality of the respective additive, resulting in assemblies twisting in a unified direction as helices do in RNA and DNA today.\n“It was the new world record for the smallest amount of a chiral dopant (additive) that would flip a whole solution,” said  Suneesh Karunakaran , the study’s first author and a graduate researcher in Hud’s lab. “This demonstrated how easy it would be in nature to get abundant amounts of unified helices.”\nSecond, they put the sugar compound  ribose-5-phosphate  together with TAP to more closely emulate the current building blocks of RNA. The ribose fell into place, and the resulting assembly spiraled in a direction dictated by the ribose chirality.\n“This molecule easily formed an RNA-like assembly that was surprisingly stable, even though the pieces were only held together by non-covalent bonds,” Karunakaran said.\nEvolution revolution\nThe study’s results under such simple conditions represent a leap forward in experimental evidence for how the helical twist of biomolecules could have already been in place long before life emerged.\nThe research also expands a growing body of evidence supporting an unconventional hypothesis by the Center for Chemical Evolution, which dispenses with the need for a narrative that rare cataclysms and unlikely ingredients were necessary to produce life’s early building blocks.\nInstead, most biomolecules likely arose in several gradual steps, on quiet, rain-swept dirt flats or lakeshore rocks lapped by waves. Precursor molecules with the right reactivity enabled those steps readily and produced abundant materials for further evolutionary steps.\nBasement engineer\nIn the lab, helix self-assemblage was so productive that it outstripped a detection device’s capacity to examine the output. Regions a square millimeter or more in size were packed with unidirectionally spiraled polymer-like assemblies.\n“To look at them I had to make adjustments to the equipment,” said Karunakaran. “I punched holes in a foil and put it in front of the beam of our spectropolarimeter.”\nThat worked but needed improvement, so Hud took to his basement at home to build an automated scanner that could handle the experiment’s bountiful results. It revealed large regions of helices with the same handedness.\nAlso READ :\nThis actually happened: Strip all the lynchpins from the ribosome and it still works\nBrian J. Cafferty, Angela Weigert-Muñoz and Gary B. Schuster of Georgia Tech co-authored the research. It was funded by the National Science Foundation and the NASA Astrobiology Program under the NSF Center for Chemical Evolution (grant CHE-1504217). Nicholas Hud is also Associate Director of the Parker H. Petit Institute for Bioengineering and Bioscience. Any findings, recommendations or conclusions are those of the authors and not necessarily of the funding agencies.\nMedia relations assistance : Ben Brumfield\n(404) 660-1408\nben.brumfield@comm.gatech.edu\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nWriter:  Ben Brumfield\nAdditional Images\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}