{"text": "Finding the ‘Goldilocks’ Level of Enthusiasm for Business Pitches | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nFinding the ‘Goldilocks’ Level of Enthusiasm for Business Pitches\nGeorgia Institute of Technology researchers found that how long an entrepreneur displays the highest level of excitement during a pitch plays a major role in predicting their success in receiving funding.\nFacebook\nTwitter\nEmail\nGetty Images\nMay 16, 2019\n— Atlanta, GA\nWhen it comes to pitching business ideas to potential investors, an entrepreneur’s excitement and enthusiasm can be the difference between dreams taking shape or ultimately falling flat.\nBut it’s not just the intensity of enthusiasm that’s important, according to a recent study by a team led by Georgia Institute of Technology researchers. How long an entrepreneur displays the highest level of excitement during a pitch also plays a major role in predicting success in receiving funding.\nBasically, too much enthusiasm can be a bad thing.\n“The findings suggest that investors may interpret prolonged periods of high enthusiasm as over-optimistic,” said Dong Liu, an associate professor in Georgia Tech’s Scheller College of Business. “Over-optimistic entrepreneurs are thought to make irrational decisions and overestimate their products’ profitability.”\nIn the study, which was published April 8 in the\nAcademy of Management Journal , the researchers described using artificial intelligence software to analyze video pitches for 1,460 business funding proposals for products posted on the crowd funding website Kickstarter.\nThe software used facial expression recognition and big data analytics to measure the intensity of enthusiasm in more than 8 million frames of video, then recorded how long the presenters stayed at their maximum level of excitement, which the researchers described as the point of “peak joy.”\nThey found that, generally speaking, the higher the peak level of enthusiasm, the more likely the entrepreneur was to receive funding, after controlling for differences in the products and business ideas. But there was a bell curve in the results, where the likelihood of funding tended to fall as “peak joy” levels went on for too long.\n“Although a higher level of peak joy displayed by entrepreneurs during their pitches leads to better funding performance over time, prolonged display of peak joy seemed to undermine funding performance,” Liu said. “Another possible interpretation is that investors may believe the entrepreneur is acting and the pitch is manipulative. Maybe they feel the entrepreneur is using his or her excitement to manipulate the investors’ perceptions in hopes of increasing the odds of getting funding.”\nThe facial recognition software analyzed when the presenters made expressions linked to joy, such as raising the cheek, drawing the corners of the mouth into a smile, and the movement and position of the eyes. The researchers noted that the software, called FaceReader, was even more accurate in recognizing emotions than real people analyzing those video frames.\nThe researchers also found another factor that influenced funding success was at what point during the presentation “peak joy” happened. They found the most effective times to display enthusiasm was at the beginning of the pitch and near the end.\n“The results of our research could be broadly applicable to different kinds of audiences, not just those funding projects through crowd funding websites,” Liu said. “Venture capitalists are looking for good business ideas on these websites too. But in general these findings could help inform any business pitch.”\nCITATION:\nLin Jiang, Dezhi Yin and Dong Liu, “Can Joy Buy You Money? The Impact of the Strength, Duration, and Phases of an Entrepreneur’s Peak Displayed Joy on Funding Performance,” (Academy of Management Journal, April 2019). http://dx.doi.org/10.5465/amj.2017.1423\nAdditional Images\nContact\nJohn Toon\nResearch News\nEmail\njohn.toon@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}