{"text": "Robotic Submarine Snaps First-Ever Images at Foundation of Notorious Antarctic Glacier | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nRobotic Submarine Snaps First-Ever Images at Foundation of Notorious Antarctic Glacier\nThese are the first-ever images taken at the foundations of the glacier that inspires more fear of sea-level rise than any other - Thwaites Glacier.\nFacebook\nTwitter\nEmail\nThwaites Glacier's outer edge. As the glacier flows into the ocean, it becomes sea ice and drives up sea-level. Thwaites Glacier's ice is flowing particularly fast, and some researchers believe it may have already tipped into instability or be near that point, though this has not yet been established. Credit: NASA/James Yungel\nJan 29, 2020\n— Atlanta, GA\nDuring an unprecedented scientific campaign on an Antarctic glacier notorious for contributions to sea-level, researchers took first-ever images at the glacier’s foundations on the ocean floor. The area is key to Thwaites Glacier’s potential to become more dangerous, and in the coming months, the research team hopes to give the world a clearer picture of its condition.\nThe images, taken by a robotic underwater vehicle, were part of a broad set of data collected in a variety of experiments by an international team. The  International Thwaites Glacier Collaboration  (ITGC)  announced the completion of this first-ever major research venture  on the glacier coincident with the 200-year anniversary of the discovery of Antarctica in 1820.\nAlready, Thwaites accounts for about four percent of global sea-level rise. Researchers have had concerns that a tipping point in the stability at its foundations could result in a run-away collapse of the glacier and boost sea levels by as much as 25 inches. By studying multiple aspects of Thwaites, the ITGC wants to understand more about the likelihood that the glacier the size of Florida may reach such instability in the coming decades.\nLine of concern\nThe area of concern that the underwater vehicle visited is called the grounding line, and it is important to the stability of Thwaites Glacier’s footing. It is the line between where the glacier rests on the ocean bed and where it floats over water. The farther back the grounding line recedes, the faster the ice can flow into the sea, pushing up sea-level.\n“Visiting the grounding line is one of the reasons work like this is important because we can drive right up to it and actually measure where it is,” said Britney Schmidt, an ITGC co-investigator from the Georgia Institute of Technology. “It's the first time anyone has done that or has ever even seen the grounding zone of a major glacier under the water, and that’s the place where the greatest degree of melting and destabilization can occur.”\nThe underwater robot,  Icefin, was engineered by Schmidt’s Georgia Tech lab . The Georgia Tech team was part of a greater collaboration between researchers from the U.S. and the British Antarctic Survey (BAS), who lived and worked on Thwaites in December and January. A BAS hot water drill melted a hole 590 meters deep (1,935 feet) to access the ocean cavity for Icefin.\n“Icefin swam over 15 km (9.3 miles) round trip during five missions. This included two passes up to the grounding zone, including one where we got as close as we physically could to the place where the seafloor meets the ice,” said Schmidt, who is  an associate professor in Georgia Tech’s School of Earth and Atmospheric Sciences . “We saw amazing ice interactions driven by sediments at the line and from the rapid melting from warm ocean water.”\n[Ready for graduate school?  Here's how to apply to Georgia Tech. ]\nHistoric research venture\nIn the coming months and years, the ITGC team made up of researchers from multiple universities and research institutions in the U.S. and the UK will publish studies with thorough findings based on the unprecedented data collected during the field campaign.\nThe array of research the scientists carried out research included seismic and radar measurements and using hot water drills to make holes between 300 and 700 meters (985 and 2,300 feet) deep down to the ocean and glacier bed below Thwaites’ ice. Researchers also took cores of sediment from the seafloor and under parts of the glacier grounded on the bed to examine the quality of the foothold that it offers Thwaites.\n“We know that warmer ocean waters are eroding many of West Antarctica’s glaciers, but we’re particularly concerned about Thwaites. This new data will provide a new perspective of the processes taking place, so we can predict future change with more certainty,” said Keith Nicholls, an oceanographer from the British Antarctic Survey.\nNicholls is a co-principal investigator on the project that involved Schmidt along with David Holland of New York University. The research is funded by the National Science Foundation, the UK Natural Environment Research Council, the U.S. Antarctic Program, and the British Antarctic Survey.\nAntarctica sea-level background\nOver the past 30 years, the amount of ice flowing to the sea from Thwaites and its neighboring glaciers has nearly doubled.\n“While Greenland's contribution to sea level has already reached an alarming rate, Antarctica is just now picking up its contributions to sea level,” Schmidt said. “It has the largest body of ice on Earth and will contribute more and more of sea-level rise over the next 100 years and beyond. It’s a massive source of uncertainty in the climate system.”\nWatch   BBC News report on this research .\nExternal News Coverage:\nBBC News-  Antarctica melting: Climate change and the journey to the 'doomsday glacier'\nThe Atlantic-\nThe New Video of One of the Scariest Places on Earth\nThe Washington Post-  Unprecedented data confirms that Antarctica’s most dangerous glacier is melting from below\nBBC Newsround-  Climate change: Scientists concerned about future of Antarctic glacier\nDaily Mail Online-  Scientists drill into Antarctica's 'doomsday' Thwaites glacier for the first time in a bid to stop dramatic sea level rise as the ice shelf the size of BRITAIN melts at an alarming rate\nYahoo News-  Scientists drill into ‘doomsday glacier’ the size of Britain to see if it’s going to collapse\nFox News-  Antarctica’s ‘doomsday glacier’ reveals alarming new trait to scientists\nCosmos Magazine-\nHere's what's below an unstable glacier\nPBS Newshour-\nA risky expedition to study the ‘doomsday glacier’\nNOVA Next-  Scientists find warm water beneath Antarctica’s most at-risk glacier\nMore reading:   Instability in Antarctic Ice Projected to Make Sea Level Rise Rapidly   and\nReframing Antarctica’s Meltwater Pond Dangers to Ice Shelves and Sea Level\nAny findings, conclusions, or recommendations are those of the authors and not necessarily of the sponsors.\nWriter & Media Representative : Ben Brumfield (404-272-2780), email:  ben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\nAdditional Images\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}