{"text": "From Vaccine Skeptic to Believer | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nFrom Vaccine Skeptic to Believer\nHow Marlon Ellis, area maintenance manager for The Kendeda Building for Innovative Sustainable Design, came to understand the importance of the vaccine.\nFacebook\nTwitter\nEmail\nPhoto of Marlon Ellis, area maintenance manager for KBISD, receives his first dose of the Covid-19 vaccine.\nFeb 16, 2021\n— Atlanta, GA\nMarlon Ellis, area maintenance manager for The Kendeda Building For Innovative Sustainable Design, maintains one of the most interesting buildings on Georgia Tech’s campus. The Kendeda Building features regenerative heating and cooling systems, compostable toilets, and a rooftop garden — all of which demand a thorough understanding of very complex operating requirements. Ellis says that research and continuing education have become part of the daily routine that allows him to successfully execute his job responsibilities. It’s this same quest for knowledge that has helped Ellis understand the benefits of the Covid-19 vaccine.\nIn late January, Ellis received notification from Georgia Tech that he was eligible for the Covid-19 vaccine. Hesitant and skeptical at first, he ignored the email. He was surprised at how quickly the vaccine was available on campus, and his experience with Covid-19 was limited to a co-worker who tested positive and experienced only minor symptoms. He admits that as a Black man, born and raised in Alabama, he felt a deep mistrust of the government and its public health initiatives. This mistrust stemmed from his knowledge of the Tuskegee Syphilis Experiment research study and the subsequent abuse of Black men over a 40-year period. Ellis also felt the chaotic and divided political climate had clouded information surrounding the science behind the vaccine.\nEllis knew he should do his research and find out more. He needed to hear from those he trusted so he did what he does every day at Georgia Tech — he educated himself. Fortunately, his church, the Providence Missionary Baptist Church in southwest Atlanta, was offering a virtual forum about the vaccine.\nThe forum was moderated by Pastor Damon Williams, a frequent lecturer in the H. Milton Stewart School of Industrial and Systems Engineering at Georgia Tech. The panel included three doctors — a pediatrician, an oncologist, and a general surgeon — who carefully explained the medical facts surrounding the vaccine to help church members understand that the vaccine is safe. They dispelled many misconceptions and revealed that one of the scientists at the forefront of the Moderna vaccine research, Dr. Kizzmekia Corbett, is a Black woman, a research fellow, and a scientific lead at the National Institutes of Health. They emphasized that the vaccine clinical trials did include people from many races and ethnicities and were thus deemed safe for this segment of the population. Ellis also felt reassured after hearing that this mRNA type of vaccine delivery had been used in previous virus trials and was not entirely new. The forum ended by focusing on the fact that the vaccine helps in preventing you from contracting the coronavirus infection as well as keeping you from becoming severely ill if you do contract Covid-19. In addition, it may help protect others you come in contact with, including friends and family. It became clear that vaccination is key to ending the Covid-19 pandemic.\nAfter the forum, Ellis had a much better understanding of the safety and necessity of getting the vaccine. He thought about his new baby granddaughter and how this could protect her as well. With information directly from respected medical professionals and encouragement from trusted individuals, he changed his mind and signed up for the vaccine. He received his first dose on Jan. 27 at the Stamps Health Services vaccine clinic and said, “The nurse who administered my vaccine was so helpful, and she made sure that I would be safe during the process.” He said he experienced no side effects from the Pfizer vaccine that day and is due for his second dose shortly.\nEllis calls himself a “free spirit” and said, for him, the worst aspect of the pandemic has been living as somewhat of a recluse. “I prefer being out and being social. I love people and enjoy being around others.”\nFor Ellis, getting the vaccine was the first step toward doing that again.\nAdditional Images\nRelated links\nCovid-19 Vaccines at Georgia Tech\nCovid-19 Vaccine Frequently Asked Questions\nContact\nCathy Brim\nCommunications Officer I\nSustainability, Facilities, and Safety\nAdditional information\nThe Covid-19 vaccine helps in preventing you from contracting the coronavirus infection as well as keeping you from becoming severely ill if you do contract Covid-19. In addition, it may help protect others you come in contact with, including friends and family.\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}