{"text": "Two-Stage Power Management System Boosts Energy-Harvesting Efficiency | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nTwo-Stage Power Management System Boosts Energy-Harvesting Efficiency\nA power management and storage system could boost energy harvesting.\nFacebook\nTwitter\nEmail\nTriboelectric nanogenerators use a combination of the triboelectric effect and electrostatic induction to generate small amounts of electrical power from mechanical motions such as rotation, sliding or vibration. (Credit: Zhong Lin Wang Laboratory)\nJan 11, 2016\n— Atlanta, GA\nA two-stage power management and storage system could dramatically improve the efficiency of triboelectric generators that harvest energy from irregular human motion such as walking, running or finger tapping. The system uses a small capacitor to capture alternating current generated by the biomechanical activity. When the first capacitor fills, a power management circuit then feeds the electricity into a battery or larger capacitor. This second storage device supplies DC current at voltages appropriate for powering wearable and mobile devices such as watches, heart monitors, calculators, thermometers – and even wireless remote entry devices for vehicles. By matching the impedance of the storage device to that of the triboelectric generators, the new system can boost energy efficiency from just one percent to as much as 60 percent. The research was reported December 11 in the journal\nNature Communications . “With a high-output triboelectric generator and this power management circuit, we can power a range of applications from human motion,” said Simiao Niu, a graduate research assistant in the\nSchool of Materials Science and Engineering\nat the Georgia Institute of Technology. “The first stage of our system is matched to the triboelectric nanogenerator, and the second stage is matched to the application that it will be powering.” Triboelectric nanogenerators use a combination of the triboelectric effect and electrostatic induction to generate small amounts of electrical power from mechanical motions such as rotation, sliding or vibration. The triboelectric effect takes advantage of the fact that certain materials become electrically charged after they come into moving contact with a surface made from a different material. However, the output is alternating current, which can power applications such as LED lighting – but is not ideal for mobile devices. Ordinary alternating current can be converted to direct current by using a transformer – but such a device requires consistency in the number of cycles per second. Because biomechanical energy sources such as walking or finger tapping produce fluctuating amplitude and variable frequencies, a standard transformer can’t be used. In addition, the output from a triboelectric generator tends to have high voltage and low current – while applications for it require just the opposite: low voltage and higher current. To address the problem, Niu and collaborators under the supervision of Professor\nZhong Lin Wang\nat Georgia Tech developed their power management system, which converts the fluctuating power amplitudes and variable frequencies to a continuous direct current. The power management system can work with any triboelectric generator that produces a minimum of 100 microwatts. The system requires some power to operate, but compensates by increasing the overall output as much as 330 times to reach milliwatt levels. “It doesn’t matter what kind of mechanical motion or what frequency of mechanical motion you have as long as the energy input is high,” said Niu. “This is a critical step in the commercialization of triboelectric nanogenerators because it opens up a range of new applications.” With finger tapping as the only energy source, the power unit provides continuous direct current of 1.044 milliwatts. The unit can work continuously with the motion, allowing devices to be operated even as the device charges the battery or capacitor. Beyond portable electronics, Niu believes the system could be useful in powering networks of sensors, allowing long-term operation without the need for replacing batteries. “In a sensor network, you would have so many devices that you could not replace all of the batteries,” he said. “This technology would allow you to power the sensors by harvesting energy from the environment and then directly providing energy for each component of the network.” With the energy management circuitry demonstrated in this proof-of-concept, the next step will be to miniaturize the circuitry to fit into an overall system, said Zhong Ling Wang, a Regents professor in the Georgia Tech School of Materials Science and Engineering who led development of the original triboelectric nanogenerators. “This new device provides a bridge between the triboelectric nanogenerator and many different types of applications,” he said. “This work will allow us to build a package that can power wearable and mobile devices from the motion of humans. With constant output from a battery or large capacitor, you can drive just about any device that you want.” The power management system could also be applied to piezoelectric and pyroelectric generators, which also produce alternating current. In 2012, Wang and his research team announced triboelectric nanogenerators that produce small amounts of electricity from motion in the world around us – by capturing the electrical charge produced when two different kinds of plastic materials rub against one another. Based on flexible polymer materials, the triboelectric generators provide alternating current (AC) from activities such as walking. Variations in generator structures allow a variety of applications depending on the source of mechanical energy. Wang’s team has reported four major groups of generators including those that operate by (1) vertical contact-separation mode, (2) lateral sliding mode, (3) single-electron mode, and (4) freestanding triboelectric-layer mode. There are also hybrid combinations of these major structural modes. CITATION : Simiao Niu, Xiaofeng Wang, Fang Yi, Yu Sheng Zhou and Zhong Lin Wang, “A universal self-charging system driven by random biomechanical energy for sustainable operation of mobile electronics,” (Nature Communications, 2015).\nhttp://dx.doi.org/10.1038/ncomms9975 Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contact : John Toon (404-894-6986) ( jtoon@gatech.edu ). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}