{"text": "Naomi Davis: Behind the Mask | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNaomi Davis: Behind the Mask\nA photo of second-year student Naomi Davis in a Georgia Tech protective face mask has gone viral around campus.\nFacebook\nTwitter\nEmail\nThis photo of Naomi Davis taken during OMED's 2020 Challenge program has appeared in several campus publications.\nFeb 15, 2021\n— Atlanta, GA\nNaomi Davis is a Georgia Tech student who you may have seen around… sort of. The second-year business administration major’s photo donned in a Tech protective face mask taken this past summer has made its rounds in several campus publications. And, the Institute's internal image portal lists the photo in its 'most viewed' category. Get to know more about the music-lover and\nOffice of Minority Educational Development (OMED)\nvolunteer.\nQ: Tell us about yourself, Naomi.\n\"My name is Naomi Davis and I am a second-year student majoring in business administration with a concentration in information technology management. On campus, I am involved with the Georgia Tech Society of Black Engineers, the African American Student Union, and the Sports Business Club. I'm also a member of Heard Atlanta which is a collective for writers, poets, and lyricists.\n\"I love music and sports; I play tennis and basketball. I mostly write and perform hip hop, rap, and alternative rap music. (My artist name is NTiGer.) I have been engineering music since age six and been writing songs since the fifth grade. I’m often asked, ‘What\ncan’t\nyou do?,’ referring to my versatility.\"\nQ: What made you want to attend Georgia Tech?\n\"I’m an Atlanta native and I’ve always loved the midtown area. In ninth grade, I participated with a math internship program here [Georgia Tech]. While in high school, I began to fall in love with the campus and knew I wanted to attend. I'm the first in my family to attend a PWI [predominately white institution] for an undergraduate degree.\"\nQ: What drew you to participate with OMED?\n\"What drew me to OMED was the\nChallenge Program , OMED’s numerous resources, and the great people who run OMED. OMED also has a lot of opportunities and events throughout the year that are very fun. Everyone in OMED – from the student participants to the staffers – is a family and I really like the energy that I get every time I step into the Chapin Building [home of OMED, located in Harrison Square].\"\nQ: Tell us about the work you’ve done for OMED.\n\"As an incoming first-year student, I participated in the Challenge Program; that was my first taste of OMED. Challenge was one of the best experiences I’ve ever had and I will never forget it. I got to meet so many people and recognized all the support that I would have throughout my time here on campus. I was hired as a Challenge counselor for the 2020 program. Needless to say, Challenge 2020 was very different because it was hosted in July, just a few months after the coronavirus pandemic was announced and the campus went into quarantine-mode. OMED organized the program extremely effectively and safely.\"\nQ: Your photo in a Georgia Tech protective fask mask taken during the 2020 Challenge Program opener has gone somewhat viral on campus. How do you feel about that?\n\"It’s been crazy! It was opening day and I was just chilling on the steps in CULC [Clough Undergraduate Learning Commons]. This guy, I think his name is Chris, [Chris Moore, Institute Communications photographer] came up to me and asked if he could take a picture and share it. I thought it was just going on the Challenge landing page on the OMED website; I was wrong. People started to send me screenshots of my face everywhere in publications around the campus.\"\nQ: You opened for Jason Derulo at Homecoming in 2020. How did that come about?\n\"One of the things on my college bucket list was to perform as part of Georgia Tech’s Homecoming Concert. I had been working on some popular songs, so I knew I could turn people up. I really wanted to take part because I knew I could bring something different to our Homecoming Concert (being a Black woman rapper/artist). The\nStudent Center Programs Council\ntreated me with lots of respect and were excited to see my performance. I got lots of great feedback from people after my performance and I would love to do it again.\"\nQ: What are your hopes for the rest of your time as a Georgia Tech student?\n\"My hopes are to meet and network with as many people as I can. With the pandemic going on, this might be a little hard. But still, I hope to gain all the experience I need to be successful after I graduate and enter the workforce.\"\nAdditional Images\nContact\nCourtney Hill\nCommunications Manager\nInstitute Diversity, Equity, and Inclusion\ncourtney.hill@gatech.edu\nEmail\ncourtney.hill@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}