{"text": "Lifting Communities with Smart Technology | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nLifting Communities with Smart Technology\nGeorgia Smart Communities Challenge helps small and large cities improve quality of life.\nFacebook\nTwitter\nEmail\nAlbany, Chamblee, Chatham County and Gwinnett County won the Georgia Smart Communities Challenge, a Georgia Tech-led initiative that brings together industry and public agencies to help local governments.\nJun 12, 2018\n— Albany, GA\nWhile the four Georgia communities represent different parts of the state, their leaders expressed a similar goal: improve the quality of life for residents.\nThe cities of Albany and Chamblee and the counties of Chatham and Gwinnett will soon embark on year-long projects to address housing blight, traffic and transportation woes and sea level rise along Georgia’s coast. These projects are supported through the Georgia Smart Communities Challenge, a Georgia Tech-led initiative that brings together industry and public agencies to support large and small neighborhoods in their efforts to implement cutting-edge smart technologies.\nGeorgia Tech President G.P. “Bud” Peterson and other state leaders traveled to Albany Tuesday to\nannounce the four winners .\n“Georgia Tech is very proud to have played a role in this program, which we believe will improve the quality of life in the participating communities and also provide models for other communities throughout our state to consider as they strive to make life better for their citizens,” Peterson said.\nThe program provides seed funding and access to technical assistance, expert advice and a network of peers. A Georgia Tech researcher will advise and conduct research in support of each group’s goals.\nThe teams will each receive $50,000 in grants and $25,000 from Georgia Tech in research support. The selected communities each raised an additional $50,000.\nGeorgia Power is the lead sponsor of the program, with additional financial support from the Atlanta Regional Commission.\nIn Albany, the city and its collaborators will establish an efficient inventory of key community housing and associated infrastructure conditions. City leaders said this housing resiliency project will provide them with the data to make sure resources are being spent and allocated in ways that will result in the biggest positive impact.\n“This program allows us to be part of work that is on the cutting edge and will prepare our community for the future,” Albany Mayor Dorothy Hubbard said. “It means so much for the community to know we have Georgia Tech behind us and that this is a project we should be doing.”\nThe Gwinnett County project will evaluate traffic management technologies for improved vehicle mobility throughout the region. The technology will improve safety and connectivity. For this project to succeed, the county needs to make sure it’s investing in the right hardware and technology, said Vince Edwards, project coordinator with the Gwinnett County Department of Transportation.\n“This an opportunity for us to work with the premier research institution in the state and have access to world-class talent,” he said. “We know working with Georgia Tech and the other partners will help us make sure we are successful.”\nGeorgia Smart organizers expect the strategies developed by the selected communities will serve as models that could be implemented elsewhere across the state.\nThe program is just one part of the work Georgia Tech is doing in this area. The Institute has partnered with the city of Atlanta since 2015 to design, implement and study Smart City initiatives.\n“For us, Georgia Smart represents a great opportunity to branch out to other parts of our state,” Peterson said.\nWork on the projects will begin in September and continue through September 2019.\nGeorgia Tech will conduct site visits to the four communities and hold workshops, conference calls and other activities to support the projects, said Debra Lam, managing director of\nSmart Cities and Inclusive Innovation\nat Georgia Tech.\n“Creating and implementing smart communities is hard work and it’s difficult,” she said. “But we know we’re on the right path when we are purposely empowering local communities themselves with data and technology.”\nAdditional Georgia Smart partners include: Association County Commissioners of Georgia, Georgia Centers for Innovation, Georgia Chamber of Commerce, Georgia Department of Community Affairs, Georgia Municipal Association, Global City Challenges, Metro Atlanta Chamber and Technology Association of Georgia.\nAdditional Images\nRelated links\nGeorgia Smart Communities Challenge\nContact\nFor media inquiries about Georgia Smart, contact Laura Diamond,  laura.diamond@gatech.edu\nFor all other inquiries, email  scii@ipat.gatech.edu\nEmail\nlaura.diamond@gatech.edu\nAdditional information\nGeorgia Smart Communities Challenge Plans\nFour communities are the first winners of the Georgia Smart Communities Challenge. Learn more about their plans:\nAlbany Housing Data Analytics and Visualization Initiative\nLead: Albany\nCollaborators: Department of Community and Economic Development; Dougherty County; Albany, Georgia Initiative for Community Housing; and Fight Albany Blight\nThis initiative seeks to bridge the gap between available data and the need for a comprehensive, flexible and accurate database to effectively manage the Albany housing inventory. The end result will allow a better measurement of public funds allocated for housing and neighborhood structure repairs and enhancements, using an automated data analytics and visualization tool. The initiative also allows the city and its collaborators to engage with residents and become part of the solution to the communities’ housing issues.\nAssigned Georgia Tech researcher: Omar Isaac Asensio, assistant professor in the School of Public Policy.\nShared Autonomous Vehicle Study\nLead: Chamblee\nCollaborators: Doraville, MARTA, Stantec and Assembly Community Improvement District (CID)\nThis project will study improvements in mobility through the use of shared autonomous vehicles, which travel from MARTA stations into the community. This option will reduce road congestion, increase pedestrian and traveler safety and improve equity in the community. While the project will look at challenges surrounding the “last mile” – getting from a transportation hub to a final destination – there will be additional implications. The research will look at the potential impacts of autonomous vehicle technology on land use, attracting residents and employees, expanding access to MARTA, prioritizing pedestrian and bike mobility; and improving public health.\nAssigned Georgia Tech researcher: Ellen Dunham-Jones, professor in the School of Architecture.\nSmart Sea Level Tools for Emergency Planning and Response\nLead: Chatham County\nCollaborators: Savannah and Creative Coast\nThis project will develop and test a pilot sensor network for measuring sea level flood risk during natural disasters and storms. Sea level rise presents a risk to coastal communities and those risks become more pronounced during hurricane landfalls when extreme flooding exacts a major toll on public safety and key infrastructure. The proposed sensor network will improve flood warnings, emergency response action plans and predictions for future flood events. This project is considered the first of its kind for the region, and the expectation is it will serve as a model for future smart designs along Georgia’s coastline.\nAssigned Georgia Tech researcher: Kim Cobb, Georgia Power Chair and professor in the School of Earth and Atmospheric Sciences.\nConnected Vehicle Technology Master Plan\nLead by Gwinnett County\nCollaborators: Berkeley Lake, Duluth, Norcross, Suwanee and Georgia Department of Transportation\nThis project will evaluate traffic management technologies for improved vehicle mobility throughout the region. It will use the latest technological advances in traffic management systems to improve traffic congestion and reduce crashes along the Peachtree Boulevard corridor. In addition to modeling how to set up a connected vehicle system, this project will help agencies charged with new traffic safety and mobility to manage expectations and costs, and fully realize the benefits of these new technologies.\nAssigned Georgia Tech researcher: Angshuman Guin, senior research engineer in the School of Civil and Environmental Engineering.\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}