{"text": "Meet Renjith Narendranathan Nair, project manager in OIT | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMeet Renjith Narendranathan Nair, project manager in OIT\nOne of his current projects is collaborating with the Registrar’s Office to switch the web access system (OSCAR) from Banner 8 to Banner 9, starting with student registration.\nFacebook\nTwitter\nEmail\nRenjith is a project manager in the Office of Information Technology. His office, located in Coda, overlooks Midtown. (Photo by Allison Carter)\nFeb 11, 2022\n— Atlanta, GA\nRenjith Narendranathan Nair is a project manager in the Office of Strategic Initiatives in the Office of Information Technology. His job sounds straightforward, but there’s more beneath the surface.\n“I have a complicated role,” said Renjith. “A normal project manager is one who plans, tracks, and monitors to make sure that projects go smoothly and reach the goal within budget. But Georgia Tech is always special. It presents a lot of challenges, not just to me but to my colleagues because we have to wear multiple hats.”\nAt times his role ranges from gathering the requirements for a project to serving as the bridge between the technical teams and functional offices, such as the Registrar’s Office or other campus clients. He sometimes acts as a “unifier” to get the disparate teams to work together, which is both challenging and rewarding.\n“We also need to maintain business relationships and work with multiple stakeholders outside of Georgia Tech,” he said. “We have to bring all of that together to ensure the project is a success.”\nOne of Renjith’s current projects is collaborating with the Registrar’s Office to switch the web access system (OSCAR) from Banner 8 to Banner 9, starting with student registration. The software maintains student, faculty, course, financial aid, and personnel data.\n“This is an important and exciting project because it’s something the students have wanted for about five years,” he said. “Transitioning the current registration system to Banner 9 will provide students with a more modern interface with more features and a more responsive design. They will be able to use it on their tablets or other mobile devices.” The new system is scheduled to go live in March.\nDuring the pandemic Renjith has been working remotely most of the time and coming to the office as needed. He misses being able to connect with his colleagues on a personal level.\n“I miss walking to someone’s desk and having a two-minute chat to catch up,” he said, acknowledging that most video meetings don’t allow much time for personal conversation. “I don’t want the environment to have too much of a strictly business state of mind. As a project manager you need to have a good working relationship, professional but also personal at times. Understanding what the other person is going through is critical.”\nAway From Work\nIn 2016 Renjith moved to Atlanta from Minneapolis. Georgia’s relatively mild winter season was a warm reprieve for the native of Kerala, India.\n“It is probably at minus 20 degrees in Minneapolis right now,” he said. “So, coming here was a big change.”\nHe settled in the Johns Creek community near Alpharetta with his wife and their three children — a daughter in third grade, a son in eighth grade, and a son who’s a junior in high school. When he isn’t busy with family activities, he enjoys reading and playing video games.\n“When I was driving one hour or more from Johns Creek to campus, I listened to audio books. Now I am picking up real books again,” Renjith said. He is reading Isaac Asimov’s robot series, and during the pandemic he renewed his love of video games.\n“I’ve always played video games.\nCall of Duty: Warzone\nis one that I’ve picked up recently,” he said. “I’m still pretty bad at it but playing video games brought me closer to some of my friends in Australia and India.” He and his friends around the globe find a common time they can play and reconnect.\n“Playing with someone you know is a different experience. You’re just enjoying the game and you don’t worry about whether you’re good or bad at it.”\nAdditional Images\nContact\nVictor Rogers\nInstitute Communications\nEmail\nvictor.rogers@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}