{"text": "Former Fortune 50 CEOs Join Georgia Tech | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nFormer Fortune 50 CEOs Join Georgia Tech\nFormer CEOs of The Home Depot, Wal-Mart join Scheller College of Business\nFacebook\nTwitter\nEmail\nScheller College of Business\nSep 17, 2015\n— Atlanta, GA\nThe former CEOs of Fortune 50 companies The Home Depot and Walmart are now affiliated with the Georgia Institute of Technology Scheller College of Business. Former chairman and CEO of The Home Depot, Frank Blake, and former president and CEO of Wal-Mart Stores, Inc., Mike Duke, will serve as distinguished executives in residence. They will work with College Dean Maryam Alavi on strategic initiatives and strengthening partnerships with the local and national business communities. Blake served as chairman and CEO of The Home Depot from January 2007 through November 2014, and then as chairman through January 2015. Blake joined The Home Depot in 2002 as executive vice president, business development and corporate operations. He holds a bachelor’s degree from Harvard University and a JD from Columbia University School of Law.  Becoming affiliated with Scheller College was a very easy decision, according to Blake. “I was honored to be asked by Dean Alavi. Georgia Tech and Scheller College are tremendous assets for Atlanta and Georgia. Dean Alavi has an engaging vision for the role Scheller College can play locally, nationally and internationally. She brings a focus on the future role of technology in business that fits well with Georgia Tech's strengths and the community's needs,” Blake says. Duke, a Georgia Tech alumnus, joined Walmart in 1995 and over his 19 years with the company led the logistics, distribution and administration divisions as well as Walmart U.S. In 2005, he was appointed vice chairman with responsibility for Walmart International. Duke served as president and CEO from 2009 to 2014. He continues to serve on the Board of Directors for Walmart. “It is a great honor to be affiliated with the Scheller College, and I accepted this offer because of my love of Georgia Tech and the opportunity for the College of Business to make such a difference in the lives of the students, “says Duke. “I want to impact the lives of students so they can have an outstanding future in whatever they pursue.” In doing so, he wants to help Georgia Tech “to be recognized as producing the best business leaders in the world.” Alavi is looking forward to working with both Blake and Duke to advance Scheller College’s mission. “It is truly an honor to have Frank Blake and Mike Duke as distinguished executives in residence at the Scheller College. I am confident that these appointments will strengthen our position as a leading business college.” Georgia Tech’s Scheller College of Business is located in a state-of-the-art building in Technology Square, the core of the Atlanta’s high-tech business community. The College offers an internationally recognized business education, including full-time, evening and Executive MBA options as well as undergraduate and PhD programs, to approximately 2,000 degree-seeking students each year. Scheller College collaborates across Georgia Tech to offer joint MS degrees in Quantitative and Computational Finance and Business Analytics. Custom and open enrollment programs for executives and professionals are offered through the Huang Executive Education Center, located within the College. Four interdisciplinary Centers of Excellence encourage collaboration in research, teaching and experiential learning within Georgia Tech and the business community in sustainability, business analytics, leadership, and international business and related topics.\nAdditional Images\nRelated links\nScheller College of Business\nMike Duke\nFrank Blake\nContact\nLaura Diamond  Georgia Tech Media Relations 404-894-6016\nEmail\nlaura.diamond@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}