{"text": "Good Dog: LASSIE Spirit Learns to Walk on the Moon | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGood Dog: LASSIE Spirit Learns to Walk on the Moon\nResearchers at Georgia Tech have teamed up with NASA and five peer institutions to teach dog-like robots to navigate craters of the moon and other challenging planetary surfaces.\nFacebook\nTwitter\nEmail\nApr 03, 2024\nThis story by Landon Hall was first published in the\nUSC Viterbi School of Engineering newsroom .\nGeorgia Tech alumna\nFeifei Qian\n(M.S. PHYS 2011, Ph.D. ECE 2015), an assistant professor of electrical and computer engineering at the USC Viterbi School of Engineering and School of Advanced Computing, leads the NASA LASSIE project alongside co-investigator\nFrances Rivera-Hernández , an assistant professor in the School of Earth and Atmospheric Sciences at Georgia Tech.\nSharissa Thompson , a graduate student at Georgia Tech, is a student intern on the NASA Curiosity Rover project.\nThe Palmer Glacier on Oregon’s Mount Hood isn’t the moon, but it’s a good place to practice.\nSome 6,000 feet up the snow-capped mountain, located about 70 miles east of Portland, a multidisciplinary team from the University of Southern California, Texas A&M University, Georgia Institute of Technology, Oregon State University, Temple University, the University of Pennsylvania, and NASA gathered to turn loose a four-legged robot named Spirit into the wild.\nThe team that included engineers, cognitive scientists, geoscientists, and planetary scientists field-tested Spirit as part of the LASSIE Project: Legged Autonomous Surface Science in Analog Environments. Spirit covered a variety of challenging terrains, using his spindly metal legs to amble over, across, and over around shifting dirt, slushy snow, and boulders during five days of testing in summer 2023. Sometimes he expertly traversed the hillside, while at other moments he teetered and fell over — all part of the process to better understand the substrate properties and learn to better walk on these extreme terrains. The practice time Spirit logged produced data that will be used to train future robots for use on intergalactic surfaces, like Earth’s moon and perhaps planets in our solar system.\n“A legged robot needs to be able to detect what is happening when it interacts with the ground underneath, and rapidly adjust its locomotion strategies accordingly,” says\nFeifei Qian , an assistant professor of electrical and computer engineering at the USC Viterbi School of Engineering and School of Advanced Computing, which is leading the project funded by NASA. “When the robot leg slips on ice or sinks into soft snow, it inspires us to look for new principles and strategies that can push the boundary of human knowledge and enable new technology. We learn and improve from the observed failures.”\nWatch this\n5-minute video\nproduced for the team by documentary filmmaker Sean Grasso.\nSpirit learns from every step.\n“Similar to the way that when we walk on uneven surfaces as humans, we can sort of detect how the ground is shifting beneath our feet, a legged robot is capable of the exact same thing,” says\nCristina Wilson , a cognitive scientist at Oregon State University.\nThe more machines the merrier\nQian’s group doesn’t intend to stop at just one robot, wandering the wilderness alone. She and her former colleagues at Penn,\nCynthia Sung ,\nMark Yim ,\nDaniel Koditschek , and\nDouglas Jerolmack , received a two-year, $2 million grant from NASA they’re calling the TRUSSES Project: Temporarily, Robots Unite to Surmount Sandy Entrapments, Then Separate. They want to help the space agency put teams of robots on the Moon and have them work together on tasks. They would take the knowledge they came in with, and the data they collect on the mission, and communicate those details to each other.\n“They would sense how the ground conditions are,” Qian says, “and then exchange that information with one another, and collectively form a map of locomotion risk estimation. The team of robots can then use this traversal risk map to inform their planetary explorations: ‘There is an extremely soft sand patch that might be high-risk for wheeled rovers. Come over here, this might be a safer area.’ ”\nThe robots in mind for this kind of work would be more than just Spirit: There would be a wheeled rover (great for payload and long distances), a Hexapedal robot (intermediate payload but better mobility than the wheeled), and dog-like ones like the rugged version of Spirit (highest mobility, shorter distances). And here’s the coolest part of that research, the part that sounds like something the Transformers would do. Or at least a team of castaways on\nSurvivor : If one got in a jam, made immovable by loose dirt or a rock or a ravine, his bot-mates would arrive and link together and form a bridge, or a pyramid, to hoist their pal to safety. And then back to work.\n“When they plan for the strategy to pull the robot up, they’ll decide what force to exert and what position the robot should go to, while also compiling the terrain information,” Qian says. “That’s the key idea of how to use these capabilities: to both prevent and recover from locomotion failures in extreme terrain.”\nBack to Mount Hood\nSpirit gets around a variety of natural environments, to learn how to better move on challenging terrains. Qian has let him off his leash on Southern California beaches, and the multi-university team has field-tested him in the soft granules of White Sands National Park in New Mexico. But\nthe video\nshot at Mount Hood shows just how otherworldly that landscape can be in these planetary-analog environments. This provides Spirit with plenty of opportunities to learn on earth, before potentially exploring other planets.\n“You look around us, it would be very hard to drive up this,”\nRyan Ewing , a geologist from NASA Johnson Space Center,\nshares . “But as a legged being, as humans, we can step around it easily. A dog could walk around it easily. So this project is the proving ground that we can enable new science and new mobility on environments that are like other planets.”\nIn fact, a dog is indeed frisking about: Howard, Wilson’s German shepherd, wandered about, with the kind of agility Spirit could only dream of.\n“We are going to observe how Howard moves in different types of snow and ice conditions,” Qian\nsays . “What exactly, out of those combined motions, allows him to succeed on challenging terrain?”\nThe LASSIE Project calls for two more trips for Spirit: to Mount Hood this summer, and to White Sands next year. The TRUSSES team, from USC and Penn, also plans to visit White Sands next year with Spirit and the other, new, multitasking robots. Imagine WALL-E with friends.\n—\nThe NASA PSTAR (Planetary Science and Technology Through Analog Research) number for this project is 80NSSC22K1313.\nAdditional Media\nRelated links\nFrances Rivera-Hernández Lands NASA and Scialog Grants for Planetary Research, …\nTeaching robots to walk on the moon, and maybe rescue one another\nPractice Makes Perfect: Teaching Robots To Walk On The Moon\nNASA LASSIE: Legged Autonomous Surface Science In Analogue Environments\nContact\nJess Hunt-Ralston\nDirector of Communications\nCollege of Sciences at Georgia Tech\nEmail\njess@cos.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}