{"text": "The ANAK Society's Annual Award Honors Leaders at Tech Making a Change | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nThe ANAK Society's Annual Award Honors Leaders at Tech Making a Change\nThis year, the ANAK Award was presented at the Faculty and Staff Honors Celebration to honor a faculty member and a\nstaff member who have demonstrated “outstanding service to the Institute and to the student body.”\nFacebook\nTwitter\nEmail\nJul 07, 2021\n— Atlanta, GA\nThe question of what the ANAK Society is has lingered since the group’s inception in 1908. The society’s membership process is a secret, and its\nwebsite\noffers minimal information. (Fun fact: new members used to find out they’d been selected by a tap on the shoulder during interfraternity council dances.)\nWhat is clear is that campus involvement and leadership skills are crucial to becoming a member. The ANAK Society’s activities and members are hard to pin down, but every year, the ANAK Award is presented at the Faculty and Staff Honors Celebration to honor a faculty member who has demonstrated “outstanding service to the Institute and to the student body.” ANAK members vote on who to give the award to, and, starting this year, staff members will also be honored. Sidartha Rakuram, former ANAK president, talked about this year’s ANAK Award and the decision behind naming Dr. Jennifer Hirsch and Dr. Benjamin Holton as this year’s winners.\nBoth were honored at this year’s virtual\nFaculty and Staff Honors Celebration\nin April. When asked about picking Hirsch as a recipient, Rakuram explained, \"She has been an amazing leader at the Center for Serve-Learn-Sustain in the Office of Undergraduate Education.\" Hirsch established the SLS Affiliated Courses Program and, under her leadership the past six years, the number of SLS affiliated courses has grown significantly. She is also a founding leader of the sustainability education network RCE Greater Atlanta, officially acknowledged by the United Nations University – one of more than 175 Regional Centres of Expertise on Education for Sustainable Development across the world.\nThis year, SLS was part of the Racial Injustice and Sexual Violence collective, which advances the United Nations’ Sustainable Development Goal of Peace, Justice, and Strong Institutions. The collective aims to develop a plan to address issues of inequality and accountability for racial injustice and sexual violence on campus by identifying “gaps, systemic barriers, and areas for improvement that may exist within our institution due to policies, practices, and other norms.” In Rakuram’s words, Hirsch has “pushed Georgia Tech forward in many ways and is an inspiration to the many students who work with her.\"\nWhen asked about the inaugural staff recipient, Rarkuram said, “Dr. Holton’s impact this past year has been undeniable and his patience and empathy while working with students, faculty, staff, and parents has been clear to all of us.” Dr. Holton has played a key role in coordinating Georgia Tech’s Covid-19 response. His leadership has been vital in rolling out Tech’s Covid-19 policies and protocols, as well as the Institute’s surveillance testing and vaccination programs. “Georgia Tech is safer and healthier because of him and his team at Stamps Health Services,\" Rakuram said.\nFor more information on the ANAK Award, visit the ANAK Society\nwebsite .\nAdditional Images\nContact\nVanesa Vargas\nInstitute Communications\nEmail\nstucomm@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}