{"text": "Previously Overlooked “Coral Ticks” Weaken Degraded Reefs | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nPreviously Overlooked “Coral Ticks” Weaken Degraded Reefs\nA previously overlooked predator could be increasing the pressure on endangered coral reefs.\nFacebook\nTwitter\nEmail\nCorallivorous gastropod (Coralliophila violacea) feeding on a Porites cylindrica coral. (Credit: Cody Clements, Georgia Tech)\nJul 27, 2018\n— Atlanta, GA\nA previously overlooked predator— a thumbnail-sized snail—could be increasing the pressure on coral reefs already weakened by the effects of overfishing, rising ocean temperatures, pollution and other threats. The snail attacks a key coral species that may offer the last hope for bringing back degraded Pacific reefs.\nThe snail damages coral by sucking fluid from it like a tick, and may have been ignored because it camouflages itself on reefs and doesn’t move around to leave obvious signs of its attack. In experiments done directly on Fiji Island reefs, scientists quantified the impact of the snails, and found that snail attacks could reduce the growth of\nPorites cylindrica\ncoral by as much as 43 percent in less than a month.\nScientists at the Georgia Institute of Technology conducted the research and\nreported\nit July 26 in the journal\nEcological Applications . The research was supported by the National Institutes of Health, the National Science Foundation and the Teasley Endowment to Georgia Tech.\n“Once the reefs are down and nearly out, these snails are piling on,” said\nMark Hay , a Regents and Teasley professor in Georgia Tech’s\nSchool of Biological Sciences . “The Porites coral is kind of the last man standing, the last hope for some of these reefs coming back, and they are the ones these snails selectively prey on. As you get fewer and fewer corals, the snails focus on the fewer and fewer of these colonies that remain. This is part of the downward spiral of the reefs.”\nIn areas protected from fishing, Postdoctoral Fellow Cody Clements never found more than five of the creatures – whose scientific name is\nCoralliophila violacea\n– on a single coral colony. But on degraded reefs where fishing was permitted, he found hundreds of the snails on some declining coral colonies, as much as 35 times more than colonies in the protected areas. To assess the damage, he devised an experiment to measure how the snails affected coral growth.\nOn the reefs near Votoa Village on Fiji’s Coral Coast, Clements isolated coral branches and attached snails to them. After a period of 24 days, he compared the growth of snail-infested coral branches to comparable branches that had no snails. During that three-week period, the predators reduced coral growth by approximately 18 to 43 percent, depending on snail size.\n“A single snail can do a considerable amount of damage,” Clements said. “They are sucking the juice out of the coral. If you have a lot of snails feeding on a single coral colony, it can be very hard for the colony to thrive.”\nIn coral ecosystems, fish help keep many predators and seaweeds under control. For that reason, fishing is forbidden in marine protected areas to maintain species diversity. To confirm their suspicions that overfishing was related to the snail problem, Clements tethered individual snails to reefs in a paired protected and unprotected areas.\nWhen they returned to examine the experiment, they found that snails in the protected areas had been eaten, and evidence left behind suggested they had been consumed by triggerfish and other species with teeth able to crack the snail shells. Predation of the snails was 220 percent higher in the marine protected areas compared to unprotected areas with few remaining fish, they found.\n“From the predation evidence, it looked like the fish were eating the snails,” said Clements. “It seemed like the main element driving the difference was the protection status of the area where the snails were tethered.”\nOne unexpected finding was that the shells of larger snails had been taken over by hermit crabs. “The hermit crabs were very direct about getting the shells that they wanted,” Hay said. “This may or may not be ecologically important on a large scale.”\nThe study began with an accidental discovery while Clements was working on another project in a heavily degraded reef area. “I was fragmenting branches from colonies and noticed these snails,” he said. “I wondered why I had never seen them before, then I started looking around and noticed they were everywhere.”\nThe snail shells are covered with marine growth, so they’re difficult to see – unless you know what to look for, Clements said. During the research, Clements removed more than 2,000 of the snails with needle-nosed pliers.\nThe\nPorites\ncoral often provides the foundation for reefs, and is considered one of the most hardy species because it is less susceptible to disease, less attractive to crown-of-thorns sea stars, and more resistant to damage from seaweeds. For that reason, researchers believe it may provide a way for reefs to recover if conditions improve. Unfortunately, that coral is also a favorite for the small snail.\nThe findings reinforce a lesson Hay and Clements have been working to explain for years.\n“Protecting coral reef areas and keeping food webs intact is really important to maintaining these communities,” Hay said. “Overfishing takes a lot of key species out of the communities so that all you have left is the marine equivalent of cockroaches and dandelions. Taking out the fish takes away the functions the fish have been providing to the community.”\nThis research was supported by the National Science Foundation under award OCE 0929119, the National Institutes of Health under award 2 U19 TW007401-10, and the Teasley Endowment to the Georgia Institute of Technology.\nCITATION : Cody S. Clements and Mark E. Hay, “Overlooked coral predators suppress foundation species as reefs degrade, (Ecological Applications, 2018).\nhttps://esajournals.onlinelibrary.wiley.com/doi/full/10.1002/eap.1765\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : John Toon (404-894-6986) (jtoon@gatech.edu).\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}