{"text": "'MacGyver'-like Robot Can Build Own Tools By Assessing Form, Function of Supplies | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\n'MacGyver'-like Robot Can Build Own Tools By Assessing Form, Function of Supplies\nThe breakthrough is a significant step toward enabling intelligent agents to devise more advanced tools that could prove useful in hazardous and potentially life-threatening environments.\nFacebook\nTwitter\nEmail\nAug 07, 2019\n— Atlanta, GA\nThanks to new technology that enables them to create simple tools, robots may be on the verge of their own version of the Stone Age.\nUsing a novel capability to reason about shape, function, and attachment of unrelated parts, researchers have for the first time successfully trained an intelligent agent to create basic tools by combining objects.\nThe breakthrough comes from Georgia Tech’s\nRobot Autonomy and Interactive Learning\n(RAIL) research lab and is a significant step toward enabling intelligent agents to devise more advanced tools that could prove useful in hazardous – and potentially life-threatening – environments.\nThe concept may sound familiar. It’s called “MacGyvering,” based off the name of a 1980s — and recently rebooted — television series. In the series, the title character is known for his unconventional problem-solving ability using differing resources available to him.\nFor years, computer scientists and others have been working to provide robots with similar capabilities. In their new robot-MacGyvering work, RAIL lab researchers led by Associate Professor\nSonia Chernova\nused as a starting point a robotics technique previously developed by former Georgia Tech Professor\nMike Stilman .\nIn this latest work, a robot trained using the team’s novel approach is given a set of optional parts and told to make a specific tool. Much like its human counterparts, the robot first examines the shapes of each part and how one might be attached to another.\nUsing machine learning, the robot is trained to match form to function – which object shapes facilitate a particular outcome – from numerous examples of everyday objects. For example, by learning that the concavity of bowls enables them to hold liquids, it makes use of this knowledge when constructing a spoon. Similarly, the robots were taught how to attach objects together from examples of materials that could be pierced or grasped.\nIn the study, researchers successfully created hammers, spatulas, scoops, squeegees, and screwdrivers.\n“The screwdriver was particularly interesting because the robot combined pliers and a coin,” said\nLakshmi Nair , a Ph.D. student in the\nSchool of Interactive Computing\nand one of the researchers on the project. “It reasoned that the pliers were able to grasp something and said that the coin sort of matched the head of a screwdriver. Put them together, and it creates an effective tool.”\nCurrently, the robot is limited only to the shape and attachment. It cannot yet effectively reason about particular material properties, a crucial step in advancing to a real-world scenario.\n[RELATED: Robot Able to Instantly Identify Household Materials Using Near-Infrared Light]\n“People reason that hammers are sturdy and strong, so you wouldn’t make a hammer out of foam blocks,” Nair said. “We want to reach that level of reasoning in our work, which is something we’re working on now.”\nThe inspiration for the work comes from the popular story of Apollo 13, the doomed seventh crewed flight of the Apollo space program. After an oxygen tank in the ship’s service module exploded two days into the mission, crew members were forced to make makeshift modifications to the carbon dioxide removal system.\nDespite a dangerously tight window of time and extremely high tension among all aboard and at mission control, the rescue proved successful. Nair and collaborators hope this research will prove foundational to future robotics technology that could reason faster and without the burden of stress.\n“They were able to make this filter, but the solution took a long time to come up with,” Nair said. “We want to make robots that can assist humans in these kinds of scenarios to take the pressure off of them to come up with innovative solutions and potentially save their lives.”\nThis work was presented at the 2019 Robotics: Science and Systems conference in a paper titled\nAutonomous Tool Construction Using Part Shape and Attachment Prediction\n(Lakshmi Nair,\nNithin Shrivatsav ,\nZackory Erickson , Sonia Chernova). It is supported in part by grants from the\nNational Science Foundation\nand the\nOffice of Naval Research .\nAdditional Images\nRelated links\nRobot Autonomy and Interactive Learning Lab\nRobotics and Computational Perception Research at Georgia Tech\nContact\nDavid Mitchell\nCommunications Officer\ndavid.mitchell@cc.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}