{"text": "Self-Administration of Flu Vaccine with a Patch May be Feasible, Study Suggests | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nSelf-Administration of Flu Vaccine with a Patch May be Feasible, Study Suggests\nMicroneedle patches may allow self-administration of influenza vaccine, a new study shows.\nFacebook\nTwitter\nEmail\nTen microneedle patches are shown with a ten-dose vial of influenza vaccine and ten hypodermic needles with syringes. (Georgia Tech Photo: Gary Meek)\nFeb 26, 2014\n— Atlanta, GA\nThe annual ritual of visiting a doctor’s office or health clinic to receive a flu shot may soon be outdated, thanks to the findings of a new study published in the journal\nVaccine .     The research, which involved nearly 100 people recruited in the metropolitan Atlanta area, found that test subjects could successfully apply a prototype vaccine patch to themselves. That suggests the self-administration of vaccines with microneedle patches may one day be feasible, potentially reducing administration costs and relieving an annual burden on health care professionals. The study also suggested that the use of vaccine patches might increase the rate at which the population is vaccinated against influenza. After comparing simulated vaccine administration using a patch and by conventional injection, the percentage of test subjects who said they’d be vaccinated grew from 46 percent to 65 percent. “Our dream is that each year there would be flu vaccine patches available in stores or sent by mail for people to self-administer,” said\nMark Prausnitz , a Regent’s professor in the\nSchool of Chemical and Biomolecular Engineering\nat the Georgia Institute of Technology. “People could take them home and apply them to the whole family. We want to get more people vaccinated, and we want to relieve health care professionals from the burden of giving these millions of vaccinations.” The research on patient acceptance of vaccine patch immunization was published online February 11, 2014, by the journal\nVaccine\nand will appear in a later edition of the print journal. In addition to Georgia Tech researchers, the project also included scientists from Emory University and the Centers for Disease Control and Prevention (CDC). Research into the use of microneedle patches for influenza vaccination has been supported by the National Institutes of Health (NIH). The study is believed to be the first published report of a head-to-head comparison between microneedle patches and traditional intramuscular injection for the administration of vaccines in human subjects. The patches consisted of arrays of 50 microscopic needles about as tall as the thickness of a few hairs. When used for vaccination, the patches would be pressed painlessly onto a person’s forearm to carry vaccine into the outer layers of skin, where they would prompt an immune reaction from the body. The 91 study subjects, who had no previous experience with microneedle patches, were given brief instructions on applying the patches to themselves. Each volunteer applied three patches, had a fourth patch applied by a member of the research team, and received an injection of saline with a conventional hypodermic needle. Neither the patches nor the hypodermic needle actually carried a vaccine, and the study did not assess the efficacy of using microneedle patches for vaccinations in humans. The researchers evaluated how well the volunteers were able to self-administer the microneedle patches. After the subjects pressed the patches into their skin, the researchers applied a dye to highlight the tiny holes made by the microneedles. By photographing the administration sites and counting the number of holes, they were able to assess the accuracy of the application. “We found that everyone was capable of administering a microneedle patch appropriately, though not everyone did on the first try,” Prausnitz said. Some of the subjects used an applicator that made a clicking sound when sufficient force was applied to the patch. Use of that feedback device improved the ability of subjects to correctly apply patches and virtually eliminated administration mistakes. During the study, the volunteers were asked if they planned to receive a flu vaccination in the next year and if their intent to be vaccinated would change if it could be done with the patch. The percentage saying they’d be vaccinated jumped from 46 to 65 percent when the patch was an option. “If this holds for the population as a whole, that would have a tremendous impact on preventing disease and the cost associated with both influenza and the vaccination process,” said Paula Frew, an assistant professor in the Emory University School of Medicine and a co-author of the study. Interviewing the test subjects found strong support for self-administration of the flu vaccine. “In addition to the preference for the vaccine patch, we found that a large majority of the people willing to be vaccinated would choose to self-administer the vaccine,” said James Norman, the study’s first author, who was a Georgia Tech graduate student when the research was conducted.   Study participants were asked to assess the pain associated with administering the patch and receiving the intramuscular injection. On a scale of one to 100, they rated the patches 1.5 on average, while the injection was rated 15. Less than half the U.S. population receives vaccination against influenza each year. Several thousand Americans die of complications from the flu each year, and as many as 200,000 are hospitalized. Increasing the immunization rate could cut the deaths, hospitalizations and costs associated with the disease, Prausnitz noted. Use of a vaccine patch could potentially also reduce the cost of vaccination programs. For influenza, the cost of storing and administering the vaccine – along with patient time to visit a clinic – accounts for as much as three-quarters of the total cost. If microneedle vaccine patches could be produced for about the same cost as current flu vaccines, self-administration could provide significant cost savings to the nation’s health care system. Animal studies have shown that microneedle patches are at least as good as conventional intramuscular injections at conferring immunity to influenza. Prausnitz and his research team plan to begin a Phase 1 clinical study of the vaccine patches in humans during the spring of 2015. If that study shows promise, it could lead to larger studies and development of commercial patch manufacture. If all goes well, the vaccine patch could be available within five years. Prausnitz expects it to be administered first by health care professionals before being made available for self-administration. In addition to those already named, the study also involved Martin I. Meltzer, senior health economist with the CDC, and two Georgia Tech researchers: Jaya M. Arya and Maxine A. McClain. Mark Prausnitz is an inventor on patents that have been licensed to companies developing microneedle-based products, is a paid advisor to companies developing microneedle-based products, and is a founder/shareholder of companies developing microneedle-based products. This potential conflict of interest has been disclosed and is managed by Georgia Tech and Emory University. Research on the use of microneedle patches for influenza vaccination has been supported by the National Institute of Biomedical Imaging and Bioengineering, part of the National Institutes of Health (NIH/NIBIB), under award R01EB006369. The content is solely the responsibility of the authors and does not necessarily represent the official views of the National Institutes of Health. CITATION : James J. Norman, et al., “Microneedle Patches: Usability and Acceptability for Self-Vaccination Against Influenza,” (Vaccine, 2014). ( http://dx.doi.org/10.1016/j.vaccine.2014.01.076 ) Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia  30332-0181  USA Media Relations Contacts : John Toon (404-894-6986) ( jtoon@gatech.edu ) or Brett Israel (404-385-1933) ( brett.israel@comm.gatech.edu ). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News (404) 894-6986 jtoon@gatech.edu\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}