{"text": "GTRI Interns Create Portable, Modular Medical Imaging Devices for Remote Places | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGTRI Interns Create Portable, Modular Medical Imaging Devices for Remote Places\nStudents used a 3D printer and magnets to build an expandable prototype device.\nFacebook\nTwitter\nEmail\nAaron Metyko, right, demonstrates the use of a portable, modular medical imaging device as Boluwaji Omodele, Farouk Marhaba, and Chloe Collins watch. They created the 3D-printed device to be easily created and used in remote places as part of their internship at the Georgia Tech Research Institute. (Photo: Branden Camp)\nOct 03, 2019\n— Atlanta, GA\nUsing a 3D printer and a few simple components that snap together with magnets, a group of Georgia Tech students has created a small prototype device that can replace multiple biomedical imaging systems.\nTheir goal was to create a transformable setup that could be used in remote parts of the world, such as military forward operating bases or developing countries, where resources and infrastructure are scarce.\nSo far, they’ve made a simple microscope in one configuration and a retinal camera in another. But the idea is to design and print other modular components so the same basic structure could be assembled into a spectrometer, a chemical sensor, or anything else engineers could dream up.\n“Instead of hauling in a microscope and a camera to see into your eye and a spectrometer to check your blood, maybe we could take the raw materials, which you can pack in a small box, and then build what you need as the need arises,” said Jack Wood, who worked with the students and is a senior research scientist at the Georgia Tech Research Institute, or GTRI.\nWood said the students ran with a seed of an idea that has been floating around GTRI’s\nElectro-Optical Systems Laboratory\n— as he put it: “Can we quickly create biomedical optical systems to accomplish some important goals using limited infrastructure?”\nAccording to Chloe Collins, a fourth-year biomedical engineering student from Bellevue, Washington: “We basically started from scratch. We didn’t really have a basis or instructions for what to do like we would have in a class. But our mentor, Jack, was very good at giving us some fundamental ideas that we could work off of [and] teaching us about the optics that we needed to know.”\nCollins worked on the project with computer science major Farouk Marhaba from Bridgewater, New Jersey; fellow biomedical engineering student Aaron Metyko from Galveston, Texas; and chemical and biomolecular engineering student Boluwaji Omodele from Buford, Georgia. They were part of a two-year-old internship program at GTRI that brings in undergraduates to get a taste of real-world, applied research.\nOther groups in the program worked on projects such as automatically classifying malware using neural networks or using LiDAR scans of water depths to create visualizations of the seabed. One team worked on a project developing an artificial “predator” to help control invasive marine species, like lionfish in parts of the Atlantic Ocean.\n“A big part of the internship program is giving students the opportunity to work on their own and figure things out as they go and also learning how research works,” said Emily Farmer, a mechanical engineering student from Clarkesville, Georgia, who worked on a digital signal processing project. “It’s not so much your typical internship where you go in and sit at a computer all day and do whatever they tell you to do. It’s more so learning about how research works and figuring out how you can apply that to your academics.”\nWood said his team did exactly that — exploring research, probing for answers and driving their ultimate design.\n“I found myself having to apologize, because they're used to having a professor know what he's doing, knowing the end result, and then mentoring them through a process,” he said. “This was something brand new for us, so in one sense, it was exciting — they got to explore and help define the path. By the same token, that path wandered a little bit.”\nThe team Wood mentored ultimately followed the path to a simple microscope and retinal camera because that’s where they identified needs they could meet.\n“A big issue [for the military] is retinal detachment along with macular degeneration. The best way to find out about retinal detachment is to have a retinal camera, a fundus camera,” Omodele said. “We also thought about things like malaria in developing countries and how could we pick out the malaria pathogens? The fastest way we can do that is with a microscope. So we thought, why not create a microscope and a fundus camera, because these two things pretty much have the same function.”\nWood said the goal of the project was to develop a proof of concept that researchers at GTRI could further develop and then pursue outside funding. That could expand the potential applications of the device into other kinds of sensors — maybe to measure heart rate or oxygen levels in blood — or for non-medical uses built on the same infrastructure.\nThere also was a team working on complementary software to automate the design process for the imaging device. Users without technical backgrounds could enter the kinds of functions they need, and the software would design device components.\nAll of that will take more work, but Wood said he’s optimistic about the foundation the students have created.\nFor the students, the experience proved eye-opening.\n“During this job, I had to become an optical engineer,” said Omodele, the fifth-year chemical engineering student, “and one thing that Georgia Tech has taught me is being able to morph myself into whatever kind of engineer I need [to be].”\nAdditional Images\nRelated links\nGTRI Electro-Optical Systems Laboratory\nContact\nJoshua Stewart\n404.894.6016\nEmail\njstewart@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}