{"text": "Out of Mind, Out of Sight | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nOut of Mind, Out of Sight\nEver search desperately for something, then realize you were looking straight at it the whole time? Research indicates that vision is controlled by the part of the brain associated with thinking. And in sight, too, it can be absent minded.\nFacebook\nTwitter\nEmail\nBrain image from a functional MRI scan during tests on the role of the frontal cortex in vision. It's the part of the brain known for being the \"thinking cap.\"\nMay 10, 2016\n— Atlanta, GA\nA sportscaster lunges forward and blurts out, “Interception! Drew Brees threw the ball right into the opposing linebacker’s hands! Like he didn’t even see him!” The quarterback likely actually did not see the defender standing right in front of him, said Dobromir Rahnev, a psychologist at the Georgia Institute of Technology.  Rahnev leads a research team making new discoveries about how the brain organizes visual perception, including how it leaves things out even when they're plainly in sight. Rahnev and researchers from the University of California, Berkeley have come up with a rough map of the frontal cortex’s role in controlling vision. They published their findings on Monday, May 9, 2016\nin the journal Proceedings of the National Academy of Sciences . Thinking cap The frontal cortex is often seen as our “thinking cap,” the part of the brain scientists associate with thinking and making decisions. But it’s not commonly connected with vision. “Some people believe that the frontal cortex is not involved,” said\nRahnev, an assistant professor at the School of Psychology . The new research adds to previous evidence that it is, he said. The lack of association with that part of the brain may have to do with the fact it’s other parts that transform information coming from the eyes into sight and others still that make sense of it by doing things like identifying objects in it. But the thinking cap of the brain controls and oversees this whole process, making it as essential to how we see as those other areas, Rahnev said. How that works also accounts for why we sometimes miss things right in front of us. A camera it’s not “We feel that our vision is like a camera, but that is utterly wrong,” Rahnev said.  “Our brains aren’t just seeing, they’re actively constructing the visual scene and making decisions about it.”  Sometimes the frontal cortex isn’t expecting to see something, so although it’s in plain sight, it blots it out of consciousness. To test out the fontal cortex’s involvement in vision, the researchers ran a two-part experiment. First, they observed which regions of the brain -- in particular the frontal cortex -- lit up with activity while healthy volunteers completed visual tasks corresponding to three basic stages of conscious visual perception. Second, they inhibited those same regions using magnetic stimulation to confirm their involvement in each visual stage. Believing is part of seeing The first stage of the visual perception the researchers tested for was selection, Rahnev said. That’s when the brain picks out part of the vast array of available visual stimuli to actually pay attention to. In the case of the football quarterback, this might mean focusing on the route the receiver takes. The second stage is combination, he said. The brain merges the visual information it processed with other material. “The quarterback’s brain is putting what he actually sees together with expectations based on the play he called,” Rahnev said. Then comes evaluation. The quarterback needs to decide whether to release the ball given everything he has processed. Expecting a blocker to stop the defending player (which didn’t happen), he may have blotted him out of perception and thrown the ball right at him. Interception. “The frontal cortex sends a signal to move your attention onto the object you select,” Rahnev said. “It does some of the combining with other information, and then it’s probably the primary evaluator of what you think you saw.” Simple vision brain map In experiments, during a functional MRI scan, different parts of the frontal cortex of the participants lit up, corresponding to each vision function. The back of the frontal cortex activated during selection; its midsection lit up during combination, and the front, or anterior, part cranked up during evaluation. That’s how the researchers arrived at a kind of vision map of the frontal cortex. “It’s a rudimentary map,” Rahnev said. “A very simple one that just says, ‘This is the back. This in the middle. This is the front.’\" The critical evidence The critical evidence for this map came from the use of magnetic stimulation. When the researchers used it to inhibit the back and middle of the frontal cortex separately, subjects became less able to complete the corresponding functions of selection and combination. When they stimulated the front, the opposite happened. Subjects were slightly but significantly better able to evaluate the accuracy of what they think they saw. “This is a really clear demonstration of the role that the frontal cortex, which is usually seen as the seat of thought, plays in controlling vision.” Sorry, officer! And there is a practical takeaway for health and safety. Instead of the quarterback telling the coach, “I swear I didn’t see that coming,” often it’s motorists telling police officers the same thing after a car accident. Distraction is often the culprit, because it overtaxes the organization of perception, Rahnev said. These three functions are going on all the time in multiple scenarios in our brains while they process the world around us. But add too much to the pile, like texting behind the wheel, Rahnev said, and “you can run right into a parked car without ever seeing it.” Derek Evan Nee, Justin Riddle, Alina Sue Larson and Mark D’Esposito from the University of California, Berkeley, co-authored the research paper. The National Institutes of Health funded the research under grants MH63901 and NS79698.\nAdditional Images\nContact\nResearch News Georgia Institute of Technology 177 North Avenue Atlanta, GA 30032-0181 Media Relations Contacts:\nBen Brumfield,\nben.brumfield@comm.gatech.edu , 404-660-1408 Writer:\nBen Brumfield\nEmail\nben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}