{"text": "School of Economics Emphasizes STEM Footing with New Degree Classification | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nSchool of Economics Emphasizes STEM Footing with New Degree Classification\nDegrees earned in the Georgia Institute of Technology’s School of Economics now classed as STEM degrees.\nFacebook\nTwitter\nEmail\nSep 10, 2019\n— Atlanta, GA\nDegrees earned in the Georgia Institute of Technology’s\nSchool of Economics\nnow count as STEM degrees, a classification that highlights the rigorous analytical nature of the School’s offerings and points to where Chair Laura O. Taylor wants to take the program.\nIn May, the Board of Regents approved the shift in the school’s U.S. Department of Education Classification of Instructional Programs (CIP) Code from “general economics” to “econometrics and quantitative economics.” The change, which takes effect this semester, makes Georgia Tech's School of Economics program the only one in the University System of Georgia to have the STEM designation.\n“This designation reflects who we are and what we are building in the School of Economics,”\nTaylor\nsaid. “The foundational tools of economics are mathematics and statistics. We couple theoretical models of behavior and decision-making with state of the art data analytics to understand and solve the most important questions facing society and business today.”\nLeveraging a ‘Gold-Standard Economics Education’\nThe new designation will not result in changes to degree programs. It may, however, be a benefit to some foreign students who come to Georgia Tech to study economics. Under U.S. Department of Homeland Security regulations, foreign students who obtain STEM degrees may remain in the United States to work for up to three years after graduation under the Optional Practical Training (OPT) program. Students who earn non-STEM degrees are allowed to remain for only one year.\nCasey Hampton, recruitment and retention director, said the new designation will help “increase the visibility and reputation of the School and help us attract, recruit, and matriculate students.”\n“This is a great opportunity to leverage what is already already a gold-standard economics education here at Georgia Tech,” he said. “This is true for international students, who gain an extra year of OPT, but also for our domestic students, who now will be classified as STEM graduates.”\nThe classification could potentially also open up new sponsored research opportunities for faculty, said Associate Professor\nShatakshee Dhondge .\n“Economics relies heavily on rigorous, quantitative analysis to solve real world problems,” she said. “So the STEM designation is a perfect fit for the School of Economics at Georgia Tech.”\nGrowing the STEM Connection\nThe School has already added new faculty positions in economic theory and econometrics, which is the application of statistics to the analysis of economic data. New assistant professors—Dylan Brewer,\nMaxwell Rosenthal\nand\nKaren Yan —work in the areas of market design, behavioral economics, energy and environmental economics, and big data analytics.\nAdditional classes in high demand across campus, such as those focused on the economics of strategy and information and behavioral economics, are also on the way, Taylor said.\n“The STEM nature of economics is reflected in the strong demand for our classes at Georgia Tech.” Taylor said. “Our game theory course offered this fall reached capacity on the first day of registration.”\nTaylor also expects the School to add more capacity in data analytics—already a growing area of emphasis.\nFor instance, the Health Economics and Analytics Lab (HEAL), led by School of Economics Professor\nDanny R. Hughes , uses big data analytics and artificial intelligence to analyze large-scale medical claims databases and better understand how evolving health care delivery and payment models affect patients and providers.\nHEAL recently moved to Coda, Georgia Tech’s new headquarters for data analytics, and shares space with other health analytics units from around campus.\n“It is an exciting time in the School,” Taylor said. “These changes reflect the strengths of our students, of the Ivan Allen College of Liberal Arts, and of Georgia Tech as a whole,” Taylor said. “I’m proud to be a part of what we’re doing here.”\nThe School of Economics, which is a unit of the\nIvan Allen College of Liberal Arts , offers the Bachelor of Science degrees in economics (ECON), economics and international affairs (EIA) (jointly with the Sam Nunn School of International Affairs) and global economics and modern languages (GEML) (jointly with the School of Modern Languages).\nThe School also offers the Master of Science and the Ph.D. in Economics.\nAdditional Images\nContact\nMichael Pearson\nmichael.pearson@iac.gatech.edu\n404.894.2290\nEmail\nmichael.pearson@iac.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}