{"text": "What to Read This Summer | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nWhat to Read This Summer\nAvid readers suggest books to read during the coming weeks.\nFacebook\nTwitter\nEmail\nBook jackets of reading recommendations for summer 2020.\nJun 24, 2020\n— Atlanta, GA\nWith a global pandemic and political protests in the spotlight, the change of seasons went largely unnoticed. But summer has arrived, and with it comes the question of what to read. We asked several readers for recommendations, and the books range from a guide that encourages women to find their voice to the story of Georgia native and “(Sittin’ On) The Dock of the Bay” singer and co-writer Otis Redding.\nThe Vanishing Half: A Novel\nBy Brit Bennett, Riverhead Books (2020)\n“This brilliant novel tells the story of twin sisters — Desiree and Stella — coming of age in the mid-20th century, in Mallard, Louisiana, a town so small it’s not a speck on the map. In 1848, Alphonse Decuir establishes Mallard for former slaves like him: too light-skinned to fit in with other freed slaves, and with no chance of being accepted into a white community. This is the town the sisters are raised in, in midst of the Jim Crow South, during a time when racial discrimination is meant to keep order. But what happens when you don’t fit neatly into one group or the other? As the story progresses, one sister remains tied to Mallard, while the other discreetly passes for white. For years their lives orbit in different worlds, until the day their stories once again converge. Bennett’s storytelling is magnetic, tender, thought-provoking, and timely.”\n—Melissa Heffner, program manager, Georgia Tech’s VentureLab\nFierce, Free, and Full of Fire: The Guide to Being Glorious You\nBy Jen Hatmaker, Nelson Books (2020)\n“Jen Hatmaker is a Christian author, and in\nFierce, Free, and Full of Fire , she leads women toward the discovery of who they are truly meant to be and encourages them to embrace their findings without fear or shame. She addresses every woman (regardless of religious belief) who feels that she lives and works in a community that does not hear her voice, that overlooks her ideas, and ignores her needs and wants. She urges women not to hide behind what is expected of them, but to be brave and let the truthfulness in their heart guide them toward freedom. Jen’s writing style is crisp and colorful, and the stories she shares take us through a roller coaster of emotions. Reading or listening to Jen Hatmaker is like hanging out with your BFF on a Friday night, feet propped up on the porch railing, drinking an ice cold beer.”\n—Florence Stoia, project manager and executive assistant, Vice Provost for International Initiatives\nThe 7 ½ Deaths of Evelyn Hardcastle\nBy Stuart Turton, Sourcebooks Landmark (2018)\n“Evelyn Hardcastle will die. She will die every day, again and again, until Aiden Bishop can identify her killer and break the cycle. Unfortunately, Aiden doesn’t know that. He doesn’t even know who he is when he awakes each day. And each day he awakes, he is someone else.\nThis book is a mystery wrapped in a puzzle. It is not for someone with a short attention span or firmly grounded in reality. It twists and turns. The reader must jump from viewpoint to viewpoint, never quite understanding what is going on, just like Aiden. A fun, mind-blowing book that is a challenging but deeply satisfying read.”\n—Donna Vandersall, database administrator, Enterprise Innovation Institute\nIn the Heat of the Summer: The New York Riots of 1964 and the War on Crime\nBy Michael W. Flamm, Penn Press (2016)\n“Those who don’t learn from history are doomed to repeat it. This book extensively details the 1964 Harlem Riot after the death of a black teenager, James Powell. Using an array of sources the book gives a street-level view of the riot and also chronicles the local and federal responses. These responses led to an uneasy peace but also created additional systems susceptible to systemic racism and oppression through the War on Crime. It is a reminder that the questions and events we are struggling with today are not new but also provide us an opportunity to not make the same mistakes again.”\n—Shawn Dommer, assistant director, Undergraduate Program Student Services, Scheller College of Business\nEnterprise Innovation Institute Project Manager Paul Todd recommended two books:\nDreams to Remember: Otis Redding, Stax Records, and the Transformation of Southern Soul\nBy Mark Ribowsky, Liveright (2015)\n“Macon native Otis Redding is an icon of American music whose influence is still felt half a century after his tragic death. I knew his music well and have lived in Macon for 20 years, but never imagined that he was only 26 when he died. That was one of many revelations in\nDreams to Remember , a thoroughly researched account of his journey from singing gospel in his father’s church, to the ‘Chitlin Circuit’ of segregated clubs, to stardom at the Monterey Pop Festival in 1967. It’s the story of a larger than life performer and the music business he conquered.”\nCarrying the Fire: An Astronaut’s Journeys\nBy Michael Collins, Cooper Square Press (revised edition 2001; first published 1974)\n“One of the many documentaries and articles commemorating the 50 th\nanniversary of\nApollo 11\nlast year led me to this account by the Command Module pilot — the guy who didn’t land on the moon. It’s considered the gold standard of astronaut books, written by the man himself rather than a ghostwriter, and filled with funny stories and technical details alike. In a sobering example, Collins was trained to operate all the systems necessary for the return trip — in case Armstrong and Aldrin never made it back from the lunar surface.”\nAdditional Images\nContact\nVictor Rogers\nInstitute Communications\nEmail\nvictor.rogers@comm.gatech.edu\nAdditional information\nNote:\nSome of these books are available electronically from Georgia Tech via\nOverdrive . You may also use the\nLibby app\nto borrow eBooks and audiobooks from your local public library for free.\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}