{"text": "The Case For DIY Masks To Slow Coronavirus’ Spread | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nThe Case For DIY Masks To Slow Coronavirus’ Spread\nIf coughing in your sleeve is effective, face masks must be, too, and successes in Asia and Europe corroborate this, physicist says.\nFacebook\nTwitter\nEmail\nHelping teleworkers stay safe.\nApr 11, 2020\n— Atlanta, GA\nA nationwide chorus is urging the wearing of homemade face masks in public to fight the spread of the novel coronavirus. One voice is that of is physicist Walt de Heer who here explains some of the logic behind wearing the protective covering, starting with old-fashioned wisdom.\n“Your mother told you to cover your mouth when you cough, and this is the best way to do it without fail,” said de Heer, a Regents Professor in Georgia Tech’s School of Physics.\nDe Heer advocates that widespread use of masks can save hundreds of lives in just days, and he is not alone. The\nCenters for Disease Control and Prevention , the U.S. Surgeon General, and the White House have officially recommended cloth face coverings.\nSince people can carry the coronavirus with no COVID-19 symptoms and still spread the virus, everyone is a potential carrier, which means that everyone should wear a DIY mask in public, de Heer said. He compared it to coughing into your sleeve but even better because a DIY mask is always in front of your face, and it can be made out of more effective fabrics than a sleeve.\nNotes of caution\nAll of these parties, including de Heer, want people to not buy up masks needed by clinicians. N95 masks are not only not necessary for the general public but are also ineffective for many people, which could be dangerous.\n“N95 masks are difficult to wear correctly, and they are hard to breathe through. They are not as effective for everyday use as a more comfortable cloth mask,” de Heer said.\nU.S. Surgeon General Jerome Adams has cautioned that wearing masks must not discourage other behaviors to fight contagion like handwashing, avoiding touching your face, and social distancing.\nDIY mask physics\nHere is more logic on DIY mask effectiveness followed by links to instructions on how to make them.\nAs a researcher, de Heer is a leading expert on small clusters, particles the size of the misty droplets that shoot out of mouths when people sneeze or cough. The bigger the droplets, the higher the viral loads they likely contain, and face covers catch nearly all larger drops and most smaller ones as well.\nBreathing mist from a cough or sneeze or getting it in the eyes, nose, or mouth\nis likely the primary source of contagion for the coronavirus , according to the CDC. There have also been reports that the mist may hang in the air\nlike exhaled cigarette smoke\nthat people can inhale and become infected.\nA hand-sewn mask out of cloth that has a tighter weave can cut down sharply on the mist, de Heer said, but even a bandana is much better than nothing.\n“For math’s sake, say a bandana stops 80 percent of dangerous mist. That protection increases when everyone wears them. So, if two people are wearing bandanas – the sender of the spittle and a potential receiver – the math tells us that two bandanas would catch 96 percent of the dangerous mist. This shows that we all need to be wearing something.”\nHordes of Americans wore masks during the last great pandemic to hit the country, the Spanish flu of 1918-1919. Nurses handed out white gauze masks, and people also made them at home.\nGeorgia Tech researchers have published instructions and guidance\nfor making and using homemade masks. Also,\nthe New York Times has published mask sewing instructions here\nand\nthe CDC here .\nThe Czech example\nOne country, in particular, impressed upon de Heer that the effectiveness of masks – the Czech Republic. A recent movement there led to the very widespread use of homemade cloth masks, and that country also has a very mild curve of new COVID-19 infections.\nCountries turn a variety of weapons against contagion with varying success or failure, so it can be hard to determine if a single one stands out. But some countries have clearly reduced the rise in contagion as well as death rates more effectively.\nSome are known for world-class healthcare systems with large capacities to serve their populations, but at the same time, they have displayed signature measures in the struggle. In the Czech Republic, this has been widespread cloth mask use.\n“If you look at Western countries – and I’m going to include the state of New York in that list – New York has had really high increases in new cases. So have Spain, Italy, and France,” de Heer said. “Then you have outliers. Germany and Austria got out ahead of the game by getting widespread testing going very early on.\"\nThe Czech Republic has been another distinct outlier. So have many other places where masks are ubiquitous such as Hong Kong, Japan, or South Korea, de Heer noted, even though they are densely populated, making social distancing more challenging.\nAustria also recently mandated the use of face covers when grocery shopping, following the lead of the Czech Republic. De Heer points to the Czech experience and that of successful Asian countries as very conspicuous evidence that masks help and that it is wise to adopt widespread use in the United States as well.\nHere's how to  subscribe to our free science and technology newsletter\nAlso read:\nAdvice on DIY masks\nWriter & Media Representative : Ben Brumfield (404-272-2780), email:  ben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\nAdditional Images\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}