{"text": "The Home Depot Supports Supply Chain and Logistics Vertical with Georgia Tech’s Advanced Technology Development Center | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nThe Home Depot Supports Supply Chain and Logistics Vertical with Georgia Tech’s Advanced Technology Development Center\nCompanies participating in the incubator program will work directly with SC&L and business leaders at The Home Depot and Georgia Tech as they build.\nFacebook\nTwitter\nEmail\nATDC has been a leading hub for technology entrepreneurs since 1980.\nJun 13, 2022\n— Atlanta, GA\nATLANTA — The Home Depot®, the world’s largest home improvement retailer, is working with Georgia Tech’s Advanced Technology Development Center (ATDC) to create a new program focused on Supply Chain and Logistics startups (SC&L).\nAs part of a three-year sponsorship, Home Depot executives will mentor program participants and offer guidance and expertise to support their growth. As the SC&L space continues to evolve, partnerships with program participants have become more important for an early-stage company’s customer acquisition and business model development. The incubator has hired Alex Rhodeen as the catalyst to run the SC&L vertical, build a pipeline of companies, and evaluate these startups for acceptance into the ATDC portfolio.\n“Our long-standing relationship with Georgia Tech is a cherished one as the ATDC will foster the next generation of technology entrepreneurs. We’re proud to support the introduction of a new vertical within the incubator program to contribute forward-thinking innovation as the Supply Chain and Logistics industry continually evolves,” said Stephanie Smith, SVP of Supply Chain at Home Depot.\nCompanies participating in the incubator program will work directly with SC&L and business leaders at The Home Depot and Georgia Tech as they build, test and bring to market new products and services. ATDC is a globally recognized technology incubator. The Supply Chain vertical is the sixth of its kind at ATDC and follows other targeted programs in health, retail, and financial technologies.\n“Georgia is a leader in supply chain and logistics infrastructure with coastal and inland seaports and Hartsfield-Jackson Atlanta International Airport, as well as being home to Fortune 500 companies in rail and ground transportation,” said ATDC Director John Avery. “More than 140 technology firms in the supply chain and logistics space are already in Georgia, so this collaboration with The Home Depot is a natural extension of Georgia Tech’s ATDC incubator to further drive innovation in our state.”\nATDC brings a unique framework that combines its startup curriculum, coaching, connections, and community, as well as direct access to Georgia Tech resources, research expertise, and student talent, to help entrepreneurs learn, launch, scale, and succeed. In this effort, ATDC will offer programming, recruit and evaluate startups, and hire staff to manage the vertical.\nAbout Georgia Tech\nThe Georgia Institute of Technology, or Georgia Tech, is a top 10 public research university developing leaders who advance technology and improve the human condition. The Institute offers business, computing, design, engineering, liberal arts, and sciences degrees. Its nearly 44,000 students representing 50 states and 149 countries, study at the main campus in Atlanta, at campuses in France and China, and through distance and online learning. As a leading technological university, Georgia Tech is an engine of economic development for Georgia, the Southeast, and the nation, conducting more than $1 billion in research annually for government, industry, and society.\nAbout the Advanced Technology Development Center (ATDC)\nThe Advanced Technology Development Center (ATDC), a program of the Georgia Institute of Technology, is the state of Georgia’s technology startup incubator. Founded in 1980 by the Georgia General Assembly which funds it each year, ATDC’s mission is to work with entrepreneurs in Georgia to help them learn, launch, scale, and succeed in the creation of viable, disruptive technology companies. Since its founding, ATDC has grown to become the longest running and one of the most successful university-affiliated incubators in the United States, with its graduate startup companies raising $3 billion in investment financing and generating more than $12 billion in revenue in the state of Georgia. To learn more, visit atdc.org.\nAdditional Images\nContact\nSiobhan Rodriguez\nInstitute Communications\nsar30@gatech.edu\nEmail\nsar30@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}