{"text": "App Detects Harsh Side Effect of Breast Cancer Treatment | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nApp Detects Harsh Side Effect of Breast Cancer Treatment\nMany breast cancer survivors suffer from lymph collection known as lymphedema, and a new phone app detects it early.\nFacebook\nTwitter\nEmail\nAn app and a camera attachment are now all that are needed to check for early onset lymphedema in breast cancer survivors. Credit: LymphaTech / Georgia Tech\nMar 16, 2020\n— Atlanta, GA\nSome 20 percent of breast cancer survivors will suffer from lymphedema, a potentially severe side effect of treatment that makes arms swell with lymph. The disease is often overlooked, but commercially available app-based technology now makes early detection easier, allowing for proactive treatment.\nThe lymphedema monitoring technology originated through research at the Georgia Institute of Technology and was further developed for market by the company LymphaTech, which also emerged from Georgia Tech. Now,  a new study  has benchmarked the technology, finding that it effectively detects early arm swelling associated with  lymphedema  in breast cancer patients.\nThe detection technology is intended to improve not only patients’ physical health but also their peace of mind and finances.\nSevere depression\n“The most immediate awful consequence of lymphedema is seen in mental health. Severe depression is very high,” said Brandon Dixon, who co-led the study and is an  associate professor in Georgia Tech’s George W. Woodruff School of Mechanical Engineering . “If you detect it early, managing it could cost as little as $2,500 in a patient’s lifetime. If you catch it too late, the costs can rise as high as $200,000.”\n“Lymphedema is under-researched, so we don’t know directly how it may lead to deadly health conditions, but there are more cases than AIDS, Parkinson’s disease, and Alzheimer’s disease combined, and it diminishes patients’ health,” Dixon said.\nThe researchers published the detector’s test results  in the journal  Physical Therapy  in February 2019 . Dixon and Georgia Tech graduates founded LymphaTech through the initiative  TI:GER, Technology Innovation: Generating Economic Results  at Georgia Tech’s Scheller College of Business. The startup received early funding from the Georgia Research Alliance.\nNo cure\nLymphedema can strike breast cancer survivors if surgery includes the removal of a lymph node, slowing the flow of  lymph . The liquid waste can congest the arm, at first subtly but later so drastically that patients may no longer fit into their clothing.\n“It makes the stigma of cancer stick out,” Dixon said. “And it is a very underappreciated disorder in medical treatment, so patients can feel stuck with it with no way out.”\nA German device called a perometer accurately detects arm swelling caused by lymphedema, but perometers are seldom available in the U.S. The research team could find only one in metropolitan Atlanta to benchmark the  LymphaTech  system against. It was located at  TurningPoint Breast Cancer Rehabilitation , a non-profit center that co-led the new study in collaboration with Dixon.\nThe advantages of the new technology over  perometers  are cost and convenience. Perimeters are bulky, costly machines, while the LymphaTech system runs on iPhone or iPad and requires only a $400 camera attachment and a paid smartphone app. Both perometers and the app technology simply determine total volume of the arm for swelling diagnosis.\nThe new app system performed comparably in its accuracy to the perometer in the study.\n[Ready for graduate school?  Here's how to apply to Georgia Tech. ]\nAwareness barriers\nDeveloping LymphaTech has faced a more challenging component – spreading lymphedema awareness – and a less challenging component – arriving at the technology to make the app measurements work.\n“In the past 20 years, depth-sensor cameras have become significantly cheaper and better. Video games, self-driving cars, robotics – they have all required better depth sensors, and we took advantage of that by using a commercially available lens attachment,” Dixon said.\nThe camera attachment creates point clouds, 3D representations of objects, in this case of human arms, which the app uses to calculate the total arm volume. Usually, only one arm is afflicted with lymphedema, allowing clinicians to compare it with the unaffected arm for easier gauging of disease severity.\nAs with perometers, the LymphaTech technology avoids human error that creeps in when recording arm volume with a tape measure, a currently common method to assess lymphedema.\n“The real battle has been to convince a medical market that has not much cared about lymphedema in the past or sought solutions to care,” Dixon said. “Hopefully, the high accessibility of our solution will make it easier to care.”\nIn a separate study involving the LymphaTech system, a research team traveled to Sri Lanka to measure lymphedema in legs, Dixon said. And in Germany, the technology is catching on with medical garment manufacturers to help them custom-fit compression sleeves to treat lymphedema.\nAlso read:\nExperimental flickering light device to treat Alzheimer's triggers special brain chemistry\nHere's how to\nsubscribe to our free science and technology newsletter\nThese researchers and clinicians co-authored the study: Jill Binkley and Lauren Bober from TurningPoint Breast Cancer Rehabilitation, and LymphaTech’s Michael Weiler and Nathan Frank, both of whom graduated from Georgia Tech. Paul Stratford from McMaster University also co-authored the study.  Disclosures: B. Dixon owns equity in LymphaTech   and may benefit financially from the technology. J.B. Dixon is   affiliated with LymphaTech Inc and serves as a scientific advisor.   Georgia Institute of Technology has licensed to LymphaTech   technology that is related to this study and that is covered by patent applications for which J.B. Dixon is an inventor. In addition,   J.B. Dixon is eligible to receive royalties under the license   agreement for LymphaTech.\nThis content is a public domain news release and may also be republished without charge.\nWriter & Media Representative : Ben Brumfield (404-272-2780), email:  ben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\nAdditional Images\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}