{"text": "Georgia Tech Joins Manufacturing Innovation Institute for Flexible Hybrid Electronics | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Joins Manufacturing Innovation Institute for Flexible Hybrid Electronics\nGeorgia Tech has become a founding member of the new Flexible Hybrid Electronics Manufacturing Innovation Institute (FHE-MII) established by the U.S. Department of Defense.\nFacebook\nTwitter\nEmail\nSuresh Sitaraman, a professor in Georgia Tech’s Woodruff School of Mechanical Engineering, examines the flexibility of an electronic circuit of the type that the new Manufacturing Innovation Institute will be developing. Sitaraman leads Georgia Tech’s activities related to the new Flexible Hybrid Electronics Manufacturing Innovation Institute (FHE MII). (Credit: Candler Hobbs, Georgia Tech)\nAug 31, 2015\n— Atlanta, GA\nThe Georgia Institute of Technology has become a founding member of the new Flexible Hybrid Electronics Manufacturing Innovation Institute (FHE-MII) established by the U.S. Department of Defense. The Institute will receive up to $75 million in federal support over a five-year period, funding that will be matched by more than $96 million in cost sharing from private companies, universities, several U.S. states, not-for-profit organizations and the city of San Jose, Calif. On August 28, U.S. Secretary of Defense Ashton Carter announced the award, which will go to the San Jose-based FlexTech Alliance, a research consortium and trade association that will create and manage the FHE-MII, which includes companies, laboratories and non-profit organizations, universities and state and regional organizations from across the United States. While the Manufacturing Innovation Institute will be headquartered in San Jose, existing nodes around the country already have in place an infrastructure ready to solve some of the known manufacturing challenges. The Institute will distribute R&D funds via competitively bid project calls. Industry-generated technology roadmaps will drive project calls, timelines and investments. “The strength of the Institute will stem from the strong support and previous work of our partner organizations,” said Malcolm Thompson, executive director of the FHE MII. “Georgia Tech’s advanced work and broad understanding in so many of the Institute’s key manufacturing thrusts – including electronic systems modeling and design, printed electronics, and packaging, assembly, test, and reliability assessment – will provide great benefits to both of our organizations.” Georgia Tech’s FHE MII activities will be led by Suresh Sitaraman, a professor in the George W. Woodruff School of Mechanical Engineering. The effort will include faculty from the School of Electrical and Computer Engineering, School of Mechanical Engineering, School of Materials Science and Engineering, and School of Industrial and Systems Engineering. Support will also come from the Institute of Electronics and Nanotechnology, the Georgia Tech Manufacturing Institute, the Institute of Materials and the Office of Industry Collaboration. “Georgia Tech brings to the FHE MII a depth of expertise, outstanding innovation, and excellent infrastructure to address a wide range of technology challenges associated with flexible hybrid electronics,” said Sitaraman. “At the FHE MII, the ongoing research at Georgia Tech will be integrated into technology demonstrator platforms and scaled up into the early-stage manufacturing prototype line. Thus, the FHE MII will facilitate the transition of the technologies developed at Georgia Tech and elsewhere around the country into real-world and use-inspired applications.” Flexible electronics are circuits and systems that can be bent, folded, stretched or conformed without losing their functionality. Hybrid electronics involves a mix of elements such as logic, memory, sensors, batteries, antennas, and various passives which may be printed or assembled on flexible substrates. Combined with low-cost manufacturing processes, flexible hybrid electronics will present an entirely new paradigm for a wide range of electronics used in health care, consumer, automotive, aerospace, energy, defense, as well as other applications. Thus, flexible hybrid electronics will provide a pervasive and powerful technology platform to address some of society’s greatest challenges associated with food supply, clean water, clean energy, education, information, and safety and security. “Imagine skin-like electronic patches with sensors that can wirelessly alert when a pilot is fatigued, smart and flexible wrappers that can monitor the quality of food, and tablets that can be folded and kept in your pocket,” said Sitaraman. “Many of these ideas are in various stages of research today, and only through an effective manufacturing pathway will these innovative research pursuits be transitioned into viable products.” The new initiative leverages Georgia Tech’s broad expertise in manufacturing and electronics technologies, said Stephen E. Cross, Georgia Tech’s executive vice president for research. “There is a recognized need to bolster the U.S. manufacturing sector. We will exploit our research base in flexible hybrid electronics and work with industry in a collaborative way to create new domestic jobs in Georgia and the U.S.,” Cross said. “We look forward to working with the FlexTech Alliance to leverage our unique resources and attributes in this field to spur technology development and innovation leading to economic and workforce development in Georgia and the Southeast.” The new institute is part of the National Network for Manufacturing Innovation program (NNMI). The FHE MII is the seventh MII announced—the fifth under Department of Defense management. The NNMI program is an initiative of the Obama Administration to support advanced manufacturing in the U.S. Each institute is part of a growing network dedicated to securing U.S. leadership in the emerging technologies required to win the next generation of advanced manufacturing. Bridging the gap between applied research and large-scale product manufacturing, the institutes bring together companies, universities, other academic and training institutions, and federal agencies to co-invest in technology areas that benefit the nation’s commercial and national defense interests. According to Thompson, the MII will bring together the country’s best scientists, engineers, manufacturing experts and business development professionals in the field of flexible hybrid electronics. Under the FlexTech initiative, the San Jose hub provides overall program direction, is the integrator of components, creates prototypes, and matures manufacturing readiness levels. “Fast start” projects for equipment, materials, devices and other vital components will make use of existing node facilities and key personnel from around the country. To complement the San Jose hub, key technology nodes will be linked and include IC thinning, system design and fabrication, integration and assembly, and flexible hybrid electronics applications. Several regional nodes have been recognized and more are expected. Those currently aligned to the Institute are centers and educational institutions throughout California, along with Alabama, Arizona, Arkansas, Connecticut, Georgia, Indiana, Massachusetts, Michigan, New York, North Dakota, Ohio and Texas. The academic lead organizations for the System Design and Fabrication Node are Georgia Tech and the University of Texas, Austin. The FlexTech Alliance is a leading industry association focused on growth, profitability and success throughout the manufacturing and distribution chain of flexible, printed electronics and displays. By facilitating collaboration between and among industry, government, and academia, the FlexTech Alliance develops solutions for advancing these technologies from R&D to commercialization. For more information on FlexTech Alliance, visit\nwww.flextech.org . Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contact : John Toon (404-894-6986) ( jtoon@gatech.edu ).\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}