{"text": "Polio vaccination with microneedle patches receives funding for patch development, clinical trial | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nPolio vaccination with microneedle patches receives funding for patch development, clinical trial\nGeorgia Tech and Micron Biomedical have been awarded $2.5 million to advance the development of dissolvable microneedle patches for polio immunization.\nFacebook\nTwitter\nEmail\nMicroneedle patches are shown in the foreground of this photograph, with a vial of vaccine and examples of traditional hypodermic needles shown in the background. (Credit: Gary Meek).\nFeb 24, 2015\n— Atlanta, GA\nThe Georgia Institute of Technology and Micron Biomedical have been awarded $2.5 million in grants from the Bill & Melinda Gates Foundation to advance the development of dissolvable microneedle patches for polio immunization. The patches will be studied to evaluate their potential role as part of the worldwide efforts to eradicate polio. The funds will support research and development of vaccine-filled microneedles that are designed to dissolve in the skin to provide protection against the poliovirus in humans. Studies with animal models have shown that microneedle patches containing polio vaccine effectively stimulate the immunological responses necessary for immunization. A Phase I clinical trial funded by the award will evaluate whether the microneedle patches can be safely and effectively used to supplement current immunization efforts, bridging a gap between existing polio vaccines taken orally and those injected with conventional hypodermic needles. The patches, about an inch square, contain 100 vaccine-filled needles that are about the diameter of a human hair. In use, they are pressed onto the skin, where the needles quickly dissolve to leave only a harmless patch backing with no sharps waste for disposal. The patches can be applied by minimally-trained personnel, facilitating their use in vaccination programs even in remote areas and areas with weaker health systems. “We believe that the microneedle patch has the potential to help complete the polio eradication effort with a simple-to-administer patch that can be used in immunization efforts in all countries,” said Mark Prausnitz, a Regents Professor in the School of Chemical & Biomolecular Engineering at the Georgia Institute of Technology. Existing oral polio vaccines are made with a live, attenuated virus. The inexpensive vaccine can be administered house-to-house in mass vaccination campaigns by minimally-trained personnel who place a drop of the vaccine into the mouths of those being vaccinated. However, the live virus contained in this vaccine can, in very rare cases, mutate to a virulent form. If that happens, individuals being vaccinated with oral polio vaccine can become infected with the virus, meaning the oral vaccine must be phased out after polio has been successfully eradicated. After polio has been eradicated, inactivated polio vaccine will be the only vaccine used worldwide to maintain immunity levels to the disease. Existing injectable polio vaccines are made with an inactivated form of the virus. Because it is injected, the vaccine must be administered by trained medical personnel. The vaccine itself is considerably more expensive than the oral vaccine. The cost, together with the need for administration in a medical setting, means the inactivated virus is much more difficult to use in mass vaccination campaigns in developing countries. The microneedle patch uses dissolving needles made from the vaccine based on inactivated virus, which cannot mutate. But unlike the injectable version, the microneedle version could be applied by minimally-trained personnel, thereby facilitating use in developing countries. “This new vaccine technology has the potential to significantly increase reach to children everywhere, including in the most marginalized areas of the world. Because it does not need to be injected means achieving high vaccination coverage would be significantly easier, and this is crucial, particularly in outbreak situations,” commented Dr. Roland Sutter, coordinator of Research and Product Development, Polio Operations, for the World Health Organization (WHO). The researchers funded by these Gates Foundation awards will be developing methods to reduce the cost of manufacturing the microneedle patch vaccine. Studies have shown that injections into the skin using a hypodermic needle or a jet injector can prompt the desired immunological response with smaller amounts of vaccine than is required for a traditional intramuscular injection. Determining the minimum level of vaccine needed in microneedle patches will be one goal for the new research. Laboratory studies of microneedle vaccine patches have already shown the vaccine to be stable during manufacturing, and additional research will be done to develop patch designs that are stable during long-term storage without refrigeration. Eliminating the need for cold storage could reduce logistical costs. In the first year of the two-year project, Georgia Tech researchers will develop the formulation to be used in the patches and prepare the technology for manufacturing by Micron Biomedical. “The grant has a clear goal: At the end of the first year, we have to be able to show compelling data that we’ve made a patch that can do what it needs to do,” said Prausnitz. “Georgia Tech will then hand off the patch design to the company for clinical trials on the vaccine’s safety and immunogenicity during the second year.” The vaccine patch will likely be about the size of a postage stamp, including an area in the center where the microneedles are located. The tiny needles – too small to be seen with the unaided eye – will be surrounded by an area of adhesive designed to keep the patch on the skin of the person being vaccinated. In addition to the vaccine, the needles will include polymer and other materials that have been approved for use in pharmaceutical products. “The materials in the microneedles are water soluble, so when the patch is pressed into the skin, the needles are designed to dissolve quickly,” explained Prausnitz. “The intent is that after 15 minutes, you can remove the patch and the needles will have dissolved, leaving only a backing that can be discarded.” The Phase I clinical trial for the polio vaccine patch may be followed by a second phase, or the project may go directly to larger-scale studies. Ultimately, the polio vaccine patch will need to be approved for use by national regulatory authorities. Development of the vaccine patch began about five years ago, and has also involved funding from the WHO, the Global Immunization Division of the U.S. Centers for Disease Control and Prevention (CDC), and a Grand Challenges Exploration grant from the Gates Foundation. In a related study, a clinical trial is planned to begin later this year to assess the use of microneedle patches in vaccinating against influenza. The work, being done in collaboration with Emory University, is funded by the National Institutes of Health. Researchers working on the polio vaccine effort believe their project will benefit from what is learned in the influenza project, and that both studies will demonstrate that the microneedle patch technology is ready for use in humans. Micron Biomedical ( www.micronbiomedical.com ) is commercializing a novel vaccine and drug delivery technology, based on dissolving microneedle patches and aimed at achieving better health outcomes through enhanced therapeutic efforts, simplified logistics and improved patient compliance. Mark Prausnitz is an inventor of patents that have been or may be licensed to companies developing microneedle-based products, is a paid advisor to companies developing microneedle-based products, and is a founder/shareholder of companies developing microneedle-based products, including Micron Biomedical. The resulting potential conflict of interest has been disclosed and is managed by the Georgia Institute of Technology and Emory University. Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contacts : John Toon (404-894-6986) ( jtoon@gatech.edu ) or Brett Israel (404-385-1933) ( brett.israel@comm.gatech.edu ). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News (404) 894-6986 jtoon@gatech.edu\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}