{"text": "Gecko Adhesion Technology Moves Closer To Industrial Uses | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGecko Adhesion Technology Moves Closer To Industrial Uses\nWhile human-made devices inspired by gecko feet have emerged in recent years, enabling their wearers to slowly scale a glass wall, the possible applications of gecko-adhesion technology go far beyond Spiderman-esque antics.\nFacebook\nTwitter\nEmail\nThis is a microscopic image showing the walls formed to mimic the adhesion characteristics of gecko feet. (Georgia Tech)\nDec 13, 2017\n— Atlanta, GA\nA gecko scampering up a wall or across a ceiling has long fascinated scientists and encouraged them to investigate how to harness lizard’s mysterious ability to defy gravity.\nWhile human-made devices inspired by gecko feet have emerged in recent years, enabling their wearers to slowly scale a glass wall, the possible applications of gecko-adhesion technology go far beyond Spiderman-esque antics.\nA Georgia Institute of Technology researcher is looking into how the technology could be applied in a high-precision industrial setting, such as in robot arms used in manufacturing computer chips.\n“There are numerous ways that gecko adhesion could be used in an industrial setting, especially in handling delicate materials like the silicon wafers used in manufacturing computer processors,” said Michael Varenberg, an assistant professor in Georgia Tech’s George W. Woodruff School of Mechanical Engineering.\nBut before robot arms and other devices can implement gecko adhesion technology, researchers need more information about the mechanical and physical characteristics of the human-made adhesive surfaces.\nIn a study published Dec. 13 in\nJournal of the Royal Society Interface , Varenberg looked at a particular type of gecko-inspired adhesive surface and narrowed down a range of angles at which the material will attach stronger and release its grip easier.\nThe gecko gets its unique ability through the use of tiny hairs that interact with surfaces at an intermolecular level. It’s a one-two process during which the tiny film-like hairs are pressed onto the surface and engaged with a shearing action. They then either hold to the surface or easily release when pulled away at different directions.\nFor that process to be replicated in a factory using man-made adhesive technology, researchers must determine the precise angles at which to apply a load to get or release the grip between the robotic arm and the silicon wafer.\nVarenberg’s team tested a wall-shaped microstructure surface molded out of polyvinylsiloxane and designed to mimic the gecko’s attachment ability. Their tests showed that the optimum attachment angle varies between 60 and 90 degrees, while the microstructure detach at zero force when the pull-off angle reaches 140-160 degrees.\n“That relatively wide range to control the attachment and pulling away for these wall-shaped microstructures will make it easier to build a mechanical process around that tolerance,” Varenberg said.\nThat could hold promise for replacing a current method used during the processing and inspection of silicon wafers in computer processor production. Robot arms employ ceramic chucks that use vacuum or electrostatic grippers to pick up and handle the wafers. Soon after installation, the ceramic contact posts start wearing down due to cyclic loading and release particles that can potentially contaminate the backside of the wafer leading to lithography defects on its front side.\n“This reality is inconsistent with the cleanliness standards required in the semiconductor industry,” Varenberg said. “Using gecko adhesion microstructures instead would be better because they do not generate any damage to wafers and do not wear over time.”\nNext steps in the research include simplifying the manufacturing technique, working with industrial-grade materials as well as studying the effects of environment and surface geometry parameters, Varenberg said.\nCITATION   :\nJae-Kang Kim and Michael Varenberg, “Biomimetic wall-shaped adhesive microstructure for shear-induced attachment: the effects of pulling angle and preliminary displacement,” (J. R. Soc. Interface, Dec. 13, 2017). http://dx.doi.org/10.1098/rsif.2017.0832\nAdditional Images\nContact\nJohn Toon\nResearch News\nEmail\njohn.toon@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}