{"text": "Novel Circuit Design Boosts Wearable Thermoelectric Generators | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNovel Circuit Design Boosts Wearable Thermoelectric Generators\nResearchers have demonstrated proof-of-concept wearable thermoelectric generators that can harvest energy from body heat.\nFacebook\nTwitter\nEmail\nAkanksha Menon, a Ph.D. student in the Woodruff School of Mechanical Engineering at the Georgia Institute of Technology, measures electrical conductivity of a thermoelectric polymer film device. (Credit: Candler Hobbs, Georgia Tech).\nOct 09, 2017\n— Atlanta, GA\nUsing flexible conducting polymers and novel circuitry patterns printed on paper, researchers have demonstrated proof-of-concept wearable thermoelectric generators that can harvest energy from body heat to power simple biosensors for measuring heart rate, respiration or other factors.\nBecause of their symmetrical fractal wiring patterns, the devices can be cut to the size needed to provide the voltage and power requirements for specific applications. The modular generators could be inkjet printed on flexible substrates, including fabric, and manufactured using inexpensive roll-to-roll techniques.\n“The attraction of thermoelectric generators is that there is heat all around us,” said Akanksha Menon, a Ph.D. student in the\nWoodruff School of Mechanical Engineering\nat the Georgia Institute of Technology. “If we can harness a little bit of that heat and turn it into electricity inexpensively, there is great value. We are working on how to produce electricity with heat from the body.”\nThe research, supported by PepsiCo, Inc. and the Air Force Office of Scientific Research, was reported online in the\nJournal of Applied Physics\non September 28th.\nThermoelectric generators, which convert thermal energy directly into electricity, have been available for decades, but standard designs use inflexible inorganic materials that are too toxic for use in wearable devices. Power output depends on the temperature differential that can be created between two sides of the generators, which makes depending on body heat challenging. Getting enough thermal energy from a small contact area on the skin increases the challenge, and internal resistance in the device ultimately limits the power output.\nTo overcome that, Menon and collaborators in the laboratory of Assistant Professor\nShannon Yee\ndesigned a device with thousands of dots composed of alternating p-type and n-type polymers in a closely-packed layout. Their pattern converts more heat per unit area due to large packing densities enabled by inkjet printers. By placing the polymer dots closer together, the interconnect length decreases, which in turn lowers the total resistance and results in a higher power output from the device.\n“Instead of connecting the polymer dots with a traditional serpentine wiring pattern, we are using wiring patterns based on space filling curves, such as the Hilbert pattern – a continuous space-filling curve,” said Kiarash Gordiz, a co-author who worked on the project while he was a Ph.D. student at Georgia Tech. “The advantage here is that Hilbert patterns allow for surface conformation and self-localization, which provides a more uniform temperature across the device.”\nThe new circuit design also has another benefit: its fractally symmetric design allows the modules to be cut along boundaries between symmetric areas to provide exactly the voltage and power needed for a specific application. That eliminates the need for power converters that add complexity and take power away from the system.\n“This is valuable in the context of wearables, where you want as few components as possible,” said Menon. “We think this could be a really interesting way to expand the use of thermoelectrics for wearable devices.”\nSo far, the devices have been printed on ordinary paper, but the researchers have begun exploring the use of fabrics. Both paper and fabric are flexible, but the fabric could be easily integrated into clothing.\n“We want to integrate our device into the commercial textiles that people wear every day,” said Menon. “People would feel comfortable wearing these fabrics, but they would be able to power something with just the heat from their bodies.”\nWith the novel design, the researchers expect to get enough electricity to power small sensors, in the range of microwatts to milliwatts. That would be enough for simple heart rate sensors, but not more complex devices like fitness trackers or smartphones. The generators might also be useful to supplement batteries, allowing devices to operate for longer periods of time.\nAmong the challenges ahead are protecting the generators from moisture and determining just how close they should be to the skin to transfer thermal energy – while remaining comfortable for wearers.\nThe researchers use commercially-available p-type materials, and are working with chemists at Georgia Tech to develop better n-type polymers for future generations of devices that can operate with small temperature differentials at room temperatures. Body heat produces differentials as small as five degrees, compared to a hundred degrees for generators used as part of piping and steam lines.\n“One future benefit of this class of polymer material is the potential for a low-cost and abundant thermoelectric material that would have an inherently low thermal conductivity,” said Yee, who directs the lab as part of the Woodruff School of Mechanical Engineering. “The organic electronics community has made tremendous advances in understanding electronic and optical properties of polymer-based materials. We are building upon that knowledge to understand thermal and thermoelectric transport in these polymers to enable new device functionality.”\nAmong the other prospects for the materials being developed are localized cooling devices that reverse the process, using electricity to move thermal energy from one side of a device to another. Cooling just parts of the body could provide the perception of comfort without the cost of large-space air conditioning, Yee said.\nThis research was supported by the Air Force Office of Scientific Research (AFOSR) under Award No. FA9550-15-1-0145 and by PepsiCo, Inc. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the sponsors.\nCITATION : Kiarash Gordiz, Akanksha K. Menon, Shannon K. Yee, “Interconnect Patterns for Printed Organic Thermoelectric Devices with Large Fill Factors, (Journal of Applied Physics, 2017).\nhttp://dx.doi.org/10.1063/1.4989589\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : John Toon (404-894-6986) (jtoon@gatech.edu).\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}