{"text": "Researchers Awarded $6.25 Million to Study Collective Emergent Behavior | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nResearchers Awarded $6.25 Million to Study Collective Emergent Behavior\nResearchers have been awarded $6.25 million to use collective emergent behavior.\nFacebook\nTwitter\nEmail\nThese simple vibrating robots have weak magnetic interactions that encourage cohesion. (Photo: Allison Carter, Georgia Tech)\nApr 09, 2019\n— Atlanta, GA\nGeorgia Tech researchers have been awarded $6.25 million from the Department of Defense (DoD) to use collective emergent behavior to achieve task-oriented objectives.\nDoD’s Multidisciplinary University Research Initiatives (MURI) Program funds projects that bring researchers together from diverse backgrounds to work on a complex problem. I nstitute for Data Engineering and Science\nco-director, Professor\nDana Randall , is project investigator and leads a team of six that includes\nDaniel Goldman , Dunn Family Professor in the School of Physics. The Formal Foundations of Algorithmic Matter and Emergent Computation team also includes chemical engineering, mechanical engineering, physics, and computational science researchers from other universities.\nThe researchers are trying to predict and design emergent behavior within computation by using basic algorithms on simple machines to perform complex tasks. Emergent behavior is when a microscopic change in a parameter creates a macroscopic change to a system. This collective behavior is easy to find in nature, from a swarm of bees to a colony of ants, but also appears in other scientific disciplines.\n“A MURI lets us take a deep dive toward understanding how many computationally limited components at the micro-scale can be programmed to work collectively to produce useful behavior at the macro-scale,” said Randall, who is also the ADVANCE Professor of Computing. “Our interdisciplinary team combines expertise in many fields, mimicking the research by forming a collaboration that is also greater than the sum of its parts.\"\nThe MURI hybrid approach to algorithmic matter combines traditional logic-based programming with non-traditional computational methods, such as using physical characteristics of the interacting matter to drive a system toward collective behavior. One of the goals is to program based on this predictable emergent behavior. The approach also predicts basic properties of the collective’s emergent behavior, like whether it will behave like a gas, fluid, or solid. In this context, emergent behavior turns into emergent collective computation.\n“MURI promises basic algorithms that allow very simple machines to work collectively to perform amazingly complex tasks,” Massachusetts Institute of Technology (MIT) chemical engineering Professor\nMichael Strano\nsaid. “Our team will examine systems of autonomous cell-like particles that interact and respond to the movement of their neighbors in a programmable way. Theorists will be able to test ideas of emergent computation from these simple devices and learn how to execute tasks from the behavior of relatively simple, autonomous particles.”\nAlthough the behavior has footing in physics, computer science, and swarm robotics, there is no underlying framework to explain why until this research. The multidisciplinary approach allows theory and experiment to continuously inform each other and determine the computational capabilities of emergent behavior. The team has an ideal range of expertise in machine learning, control theory, and non-equilibrium physics and algorithms. They are also working with experimentalists who build collective systems at granular and microscopic scales.\n“An exciting aspect of this collaboration will be our attempts to interface and integrate ideas and tools from robotics, non-equilibrium physics, control theory, and computer science to develop task-capable swarms,” Goldman said.\nThis MURI project will run for five years and is funded by the Army Research Office. In addition to Randall, Goldman, and Strano, the team also includes Arizona State computational science and engineering Professor Andrea Richa, MIT physics Associate Professor Jeremy England, and Northwestern mechanical engineering Professor Todd Murphey.\nThe overarching goal is to find how simplistic the computation can be for this complexity. This could lead to advances in engineered systems achieving specific task-oriented goals.\n“The MURI promises nothing short of the transformation of robots,” Strano said, “from the large, bulky constructions that we think of today, to future clouds or swarms that enable functions that are currently impossible to realize.”\nWriter : Tess Malone\nAdditional Images\nContact\nTess Malone\nCollege of Computing\nEmail\ntess.malone@cc.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}