{"text": "George Floyd – One Year Later | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorge Floyd – One Year Later\nOne year after the death of George Floyd, Archie Ervin, vice president for Institute Diversity, Equity, and Inclusion, shares a reflection and hope for the Georgia Tech community.\nFacebook\nTwitter\nEmail\nGeorge Floyd mural in Minneapolis, MN (unknown source)\nMay 25, 2021\n— Atlanta, GA\nToday marks exactly one year since the death of George Floyd at the hands of Derek Chauvin. The former Minneapolis police officer was convicted on all counts of Floyd’s murder this past April.\nThe high-profile death of Floyd, who was pinned under Chauvin’s knee for nine minutes and 29 seconds, still brings anguish for many across the world who were already monthslong into the depths of a global pandemic. For some, it provided reason to finally acknowledge that systemic racism and racial violence have been deeply embedded into our nation’s fabric for centuries.\nMy thoughts last spring were captured in\nCommitment to Drive Change . One year later, I am still wrapped with sadness and sometimes anger, but I can optimistically reflect on the many changes I have seen around the world and, particularly, within our campus community.\nImmediately after May 25, 2020, units across the Institute issued statements denouncing racism and pledging solidarity with the Black community. Campus offices hosted candid discussions on race and its systemic injustices. My office,\nInstitute Diversity, Equity, and Inclusion , launched the Race at Georgia Tech discussion series and our Education and Training unit has worked diligently to provide increased diversity, equity, and inclusion trainings to meet high campus demand.\nLast November, under the direction of President Ángel Cabrera, we launched the Georgia Tech Diversity, Equity, and Inclusion Council (GTDEIC) to identify issues of campus racial and gender disparity, bias, and inequity. Since then, the Council has actively monitored and assessed Tech’s progress toward achieving the DEI objectives that undergird our vision for a welcoming and inclusive campus community for all students, staff, and faculty. Earlier this year, the GTDEIC and issue-area campus experts\nbegan working to create a DEI blueprint plan\nto create an equitable and inclusive community; to recruit, retain, and develop a diverse community; and to support innovative and inclusive scholarship and teaching. President Cabrera will reveal this plan later this year.\nIn March, the campus decried the murder of eight victims at three spas in the metro Atlanta area – six of whom were Asian women. The horrifying string of events on that day stirred considerable conversation and action against Asian hate and violence. The Division of Student Life hosted one of Tech’s first Asian American and Pacific Islander Heritage Month series of events a month later.\nThis past April – one day after the conviction of Chavin –  we dedicated a space of healing in the new EcoCommons area . On the site of the former Pickrick Restaurant, where its segregationist owner forcibly and unlawfully removed Black patrons despite the then-fresh passing of the 1964 Civil Rights Act, we honored the bravery of the three Black seminary students who attempted to break down the walls of injustice there. The architectural design of this area is intended to inspire reflection and connections, both with nature and with others.\nFinally, many around campus are preparing to recognize the 60 th\nanniversary of the matriculation of the Institute’s first Black students this September. In 2019, the Institute honored these three pioneers, and its first Black graduate, with the\ninstallation of bronze statues on campus . Our focus for the future is to build upon the momentum we have established toward making the Georgia Tech community a place where our people are treated fairly and included.\nI know we have a long road to travel, but these campus developments since last spring bring me some solace that we are headed in the right direction on our journey toward meaningful change to eradicate racial injustice. As members of the Georgia Tech community, we all have a duty to deliver upon its mission to develop leaders who advance technology and improve the human condition. We can only achieve this by leveraging our diversity as an asset to capitalize our human potential.\nArchie W. Ervin, Ph.D.\nVice President, Institute Diversity, Equity, and Inclusion\nAdditional Images\nContact\nCourtney Hill\nCommunications Manager\nInstitute Diversity, Equity, and Inclusion\ncourtney.hill@gatech.edu\nEmail\ncourtney.hill@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}