{"text": "Beaulieu recognized for efforts to keep Dalton area kids focused on high school graduation | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nBeaulieu recognized for efforts to keep Dalton area kids focused on high school graduation\nEach month the Georgia Manufacturing Extension Partnership profiles Georgian who make a difference in manufacturing\nFacebook\nTwitter\nEmail\nThe employees of Dalton flooring company Beaulieu work with area high school students who are at risk of not graduating from high school. Through an initiative with the Great Promise Partnership, Beaulieu hires high school students who learn and develop skills in manufactruing, while also in a program that aims to keep them in school and on track to graduate. The Beaulieu team is the Georgia Manufacturing Extension Partnership's April Faces of Manufacturing Award winner. (Photo Credit: Kim Harper)\nApr 21, 2016\n— Dalton, GA\nBeaulieu, a leading floor covering manufacturer headquartered in Dalton, Georgia, has a long history of supporting education throughout northwest Georgia, which is home to 13 of its plants. In addition, the company encourages its team members to develop creative solutions both inside and outside of their plants. So four years ago, Angie Ledford, talent development coordinator at Beaulieu, came up with an idea that met both goals. She approached her management team with her idea of filling up some open positions at the company with high school students who were in jeopardy of not graduating. “This was not a hard sell to our team. I had people raising their hands asking how they could help,” she said. For Beaulieu, the reward was twofold: The company could help students stay in school while giving them a job in the afternoon. In addition, Beaulieu could fill multiple job openings while building their team member pipeline for the future. The Georgia Manufacturing Extension Partnership is recognizing the Beaulieu team and its efforts as the April recipient of the Faces of Manufacturing Award. Beaulieu employees were presented with the award on April 19. The Faces of Manufacturing initiative highlights Georgia's manufacturing industry, which employs 365,000 and is an important sector of the state economy. The Faces of Manufacturing shows that companies have an economic impact not only on the communities they serve but also on the lives of the people they touch, from employees to customers. Beaulieu reached out to the Great Promise Partnership (GPP), an initiative to help at-risk students complete their high school education while gaining real-world job skills, to work with students and high schools in Dalton and surrounding Whitfield County. The Beaulieu initiative, now in its third year and with 20 students participating, has been a success. It’s also making a substantial difference in the lives of those students. “Last year, we had a student miss 30 days of school in just one semester,” said Sheila McKeehan, a school counselor at Morris Innovative High School in Dalton. “Since getting involved in this program, this student has missed just three days. We’ve had such success with the program that we have kids lining up to be involved.” But beyond the job skills learned and commitment to graduating, the students say they have experienced profound personal growth and development. “Before working here, I thought manufacturing was people working by themselves,” said Kyle, one of the students in the program. “Instead, it’s about people working together to create products. I’ve learned teamwork, responsibility, and how to communicate with others.” — Péralte C. Paul\nAdditional Images\nRelated links\nFaces of Manufacturing\nContact\nContact Information For media inquiries contact: Laura Diamond Georgia Tech Media Relations  laura.diamond@gatech.edu   For more information about GaMEP contact: Katie Takacs GaMEP Marketing Manager katie.takacs@innovate.gatech.edu\nEmail\nperalte.paul@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}