{"text": "New $1.2 Million NSF Grant Aims to Improve Treatment for PTSD Patients | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNew $1.2 Million NSF Grant Aims to Improve Treatment for PTSD Patients\nThe grant -- which includes Georgia Tech, Emory, and the University of Rochester -- will fund the development of a computational assessment toolkit for patients and clinicians.\nFacebook\nTwitter\nEmail\nOct 02, 2019\n— Atlanta, GA\nPost-traumatic stress disorder (PTSD), particularly among veterans returning from combat zones or other troubling situations, is a devastating mental condition with tremendous individual and societal costs. About 12 percent of Gulf War veterans and 15 percent of Vietnam veterans suffer from PTSD according to a 2019 article in\nU.S. News and World Report . While recovery is possible, it requires intensive therapeutic engagement that less than 50 percent of affected veterans actually seek out.\nA new four-year, $1.2 million grant\nfrom the\nNational Science Foundation\nto a team of researchers from Georgia Tech, Emory University, and the University of Rochester will help bridge this gap by funding the development of a computational assessment toolkit for PTSD patients and clinicians, called PE Collective Sensing System (PECSS). PECSS, which will sit atop the PE Coach App developed by the Veterans Health Administration and the Department of Defense, will aim to improve current treatment practices and increase the number of veterans who seek treatment.\n“PECSS will allow clinicians to use automated predictions to deliver better therapeutic treatment and individualized feedback, and patients to better understand the progress they are making and how to improve their exposure exercises,” said\nRosa Arriaga , a Senior Research Scientist in\nGeorgia Tech’s School of Interactive Computing\nand the principal investigator on the project.\n[THE INTERACTION HOUR PODCAST: IS TECHNOLOGY A GAME CHANGER FOR CARE OF PTSD PATIENTS?, FEATURING DR. ROSA ARRIAGA]\nCurrently, the most common and empirically-supported treatment for PTSD is “prolonged exposure” (PE) therapy. The treatment consists of imaginal exposure, where patients imagine themselves and narrate their traumatic event, and in-vivo exposure to real-world stimuli in safe but challenging environments.\nThere are, however, challenges in data collection and extraction, which is often subjective and narrow. This project will address those challenges by developing a novel, user-tailored sensing system that can record and transfer information from exercises, continuously monitoring patients and clinicians\n“Clinicians are in urgent need of methods, tools, and data to efficiently track, assess, and respond to mental health needs throughout the treatment process,” Arriaga said.\nThe project will involve insights from experts in multiple fields – ubiquitous computing, human-computer interaction, applied machine learning, psychology, and more. When complete, the system will be deployed at the\nEmory Healthcare Veterans Program , a nationally-renowned initiative that treats members of the military suffering from PTSD.\n“The Trauma and Anxiety Recovery Program that includes the Emory Veterans Program has been on the cutting edge in using technology to advance the care of people suffering with anxiety since it was founded by Dr.\nBarbara Rothbaum\nover 25 years ago,” said\nSheila Rauch , an associate professor in Emory’s Department of Psychiatry and Behavioral Sciences and a co-principal investigator on the project.\n“As a team of international experts in PTSD treatment, we integrate technology to speed response to treatment and help patients to visualize the changes as they respond to care. Our aim is to use this real-time data to find tune practice for the individual patient and learn across patients how we can improve care.”\n“Mental health clinicians and their patients are in urgent need of 21 st -centural methods, tools, and objective data to optimize therapy,” added Emory Assistant Professor\nAndrew Sherrill , another co-principal investigator. “This partnership will bring together innovators in HCI and evidence-based psychotherapy to transform mental health care for PTSD patients.”\nThis grant is provided under the\nNSF Smart and Connect Health Funding Program\nin its\nDivision of Information and Intelligent Systems .\nAdditional Images\nRelated links\nHuman-Centered Computing at Georgia Tech\nThe Interaction Hour: Is Technology a Game Changer for Care of PTSD Patients?\nContact\nDavid Mitchell\nCommunications Officer\ndavid.mitchell@cc.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}