{"text": "As Temperatures Climb, Flying Insects Slower to Migrate to Cooler Elevations | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nAs Temperatures Climb, Flying Insects Slower to Migrate to Cooler Elevations\nIn response to changing climates, many plants and animals are moving to higher elevations, seeking cooler temperatures. But a new study finds that flying insects like bees and moths may struggle with insurmountable issues to this escape route.\nFacebook\nTwitter\nEmail\nSep 11, 2023\nThis story by Jennifer Woodruff is\nshared jointly\nwith the University of Colorado Denver.\nIn response to rising global temperatures, many plants and animals are moving to higher elevations to survive in cooler temperatures. But a new study from the University of Colorado Denver (CU Denver) and Georgia Tech finds that for flying insects — including bees and moths — this escape route may have insurmountable issues that could mean their doom.\nThe research team examined more than 800 species of insects from around the world and discovered that many winged insects are moving to higher elevations much slower than their non-flying counterparts. This is because the thinner air at higher elevations provides less oxygen for species to use. Because flight requires more oxygen to generate energy for movement than other styles of movement, such as walking, these species are migrating more slowly.\nThe  team’s findings were published  in this week’s  Nature Climate Change  journal.\nJesse Shaich , postbaccalaureate student at CU Denver, is also a member of the research team.\n“When we think about where species will be able to live under climate change in the coming decades, we need to remember that animals are sensitive to more than just how hot or cold they are,” said CU Denver Assistant Professor of Integrated Biology  Michael Moore , who led the study.\nDeclining insect biodiversity has direct impact on humans\nIf flying insects’ native habitats get too warm too quickly, and they can’t find a suitable alternative or adapt in time, that will likely lead to their extinction. Beyond just being bad for the bugs themselves, loss of insects is bad news for humans as well. Most crop pollinators are the flying species the researchers expect to be vulnerable, and their extinction would be catastrophic to global food supply. Not only would this have implications for agriculture and food supply chains, but similar challenges are likely true for other species that need a lot of oxygen to live.\n“Our earth’s biodiversity is rapidly declining, especially amongst insects. The global loss of insects will be ecologically catastrophic, so we urgently need to understand why and how this is happening,” said\nJames Stroud , assistant professor of Biological Sciences at Georgia Tech.\nBroadening research on high elevation challenges\nTo conserve as many species as possible, researchers need to grasp the full scope of challenges plants and animals face, whether they can overcome these challenges, and to predict the locations where they can survive. High elevation environments are also difficult for new species because of the scarcity of food, stronger winds, more extreme cold snaps, and increased ultraviolet radiation.\nMoore concludes, “If we want to design effective conservation strategies, we must consider a broader range of environmental factors that species need to live.”\nAbout Georgia Institute of Technology\nThe  Georgia Institute of Technology,  or  Georgia Tech,  is one of the top public research universities in the U.S., developing leaders who advance technology and improve the human condition. The Institute offers  business, computing, design, engineering, liberal arts, and sciences  degrees. Its more than 45,000 undergraduate and graduate students, representing 50 states and more than 148 countries, study at the main campus in Atlanta, at campuses in France and China, and through distance and online learning. As a leading technological university, Georgia Tech is an engine of economic development for Georgia, the Southeast, and the nation, conducting more than $1 billion in research annually for government, industry, and society.\nAbout the University of Colorado Denver\nThe\nUniversity of Colorado Denver\nis the state’s premier public urban research university and equity-serving institution. Globally connected and locally invested, CU Denver partners with future-focused learners and communities to design accessible, relevant, and transformative educational experiences for every stage of life and career. Across seven schools and colleges in the heart of downtown Denver, our leading faculty inspires and works alongside students to solve complex challenges through boundary-breaking innovation, impactful research, and creative work. As part of the state’s largest university system, CU Denver is a major contributor to the Colorado economy, with 2,000 employees and an annual economic impact of $800 million. For more information, visit  ucdenver.edu .\nhttps://doi.org/10.1038/s41558-023-01794-2\nAcknowledgments: Support was generously provided by the University of Colorado Denver (to M.P.M. and J.S.) and Washington University in St. Louis and the Georgia Institute of Technology (to J.T.S.). Conversations with J. de Mayo, J. Grady and A. Lenard and input from three reviewers improved this study.\nContact\nJess Hunt-Ralston\nDirector of Communications\nCollege of Sciences at Georgia Tech\njess@cos.gatech.edu\nJennifer Woodruff\nDirector of Public Relations & Integrated Media\nUniversity of Colorado Denver\nJennifer.Woodruff@ucdenver.edu\n+1 (303) 315-0283\nEmail\njess@cos.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}