{"text": "Researchers Develop Wireless Monitoring to Detect Sleep Apnea at Home | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nResearchers Develop Wireless Monitoring to Detect Sleep Apnea at Home\nGeorgia Tech researchers have created a wearable device to accurately measure obstructive sleep apnea — when the body repeatedly stops and restarts breathing for a period — as well as the quality of sleep people get when they are at rest.\nFacebook\nTwitter\nEmail\nGeorgia Tech Associate Professor W. Hong Yeo is shown sleeping with the wearable sleep apnea detection and sleep quality monitoring device he and a team of researchers and clinicians created.\nGeorgia Tech Associate Professor W. Hong Yeo is shown sleeping with the wearable sleep apnea detection and sleep quality monitoring device he and a team of researchers and clinicians created.\nMay 24, 2023\nGeorgia Tech researchers have created a wearable device to accurately measure obstructive sleep apnea — when the body repeatedly stops and restarts breathing for a period — as well as the quality of sleep people get when they are at rest.\nUnder conventional methods, people who are suspected of having some sleep issue or disorder must go to a medical facility, where they are monitored overnight and tethered to a series of wired probes that record brain, eye, and muscle activity.\nThe wearable sleep monitor patch developed by a team of researchers and clinicians, led by\nW. Hong Yeo , an associate professor and Woodruff Faculty Fellow in Tech’s\nGeorge W. Woodruff School of Mechanical Engineering , is made of silicone and fits over the forehead, with a second, smaller silicone attachment that molds to the chin.\n“A lot of people have this disorder, but they don’t know it because it’s very hard to diagnose right now,” Yeo said. “Current smartphone apps don’t capture the specific data doctors and clinicians study to determine if a patient has apnea, rendering them useless.”\nConventional existing sleep testing is occurring in sleep labs because of device limitations. This at-home wearable device could be the alternative to the more expensive medical procedures at sleep labs.\nYeo and his team, which included researchers from across Georgia Tech, Emory University School of Medicine, the University of Texas at Austin, the Icahn School of Medicine at Mount Sinai in New York, the Korea Institute of Materials Science, and the Korea Advanced Institute of Science and Technology,\nreported their findings\nin Science Advances in May.\nRising Prevalence\nWhile there are two additional types of sleep apnea — central and complex — obstructive sleep apnea is the most common, Yeo said, explaining that in addition to snoring and arrested breathing episodes, it’s generally characterized by waking up suddenly, gasping for air or choking, and high blood pressure.\nLack of quality sleep can exacerbate other health issues in people with existing illnesses such as heart disease or diabetes, Yeo said. But even those who don’t have other health ailments can have serious complications from sleep apnea because the longer it goes undetected and untreated, the more it will affect their hearts and brains over time.\nSeeing the toll sleep apnea was taking on the U.S. population, Yeo set out to apply his wearable device research to the industry with a wireless sleep monitoring patch system.\nThe patches — which have an accuracy rate of 88.5% for sleep apnea detection — have the thickness of an adhesive bandage. Three embedded electronic sensors send signals wirelessly via Bluetooth to record brain, eye, and muscle activity. That data is relayed to an app on a smart device such as a phone or tablet for further study and evaluation.\nThe device can be used at home, negating the need to go to a sleep center or medical facility for overnight monitoring.\n“A lot of people have this type of sleep disorder; they just don’t know it,” said Yeo, whose research is centered primarily in advancing healthcare through the development of biosensors and bioelectronics. “In the U.S., more than 18 million people have this type of sleep apnea. That’s basically one out of every 15 Americans, and those numbers are increasing over time.”\nUnderlying health issues are partly behind the increase, he said, but key drivers are the types of food and portion sizes of the modern American diet as well as stress.\nThere’s also an economic toll on the country. Poor sleep cost the U.S. economy $411 billion in lost productivity in 2015. That figure is projected to exceed $467 billion by 2030.\nPredicting Sleep Apnea\nUsing artificial intelligence and machine learning, the technology behind the wearable device records the data to give a sleep score that determines if the patient has sleep apnea or if they are getting enough quality sleep.\nIn the study, when measured against a controlled group of eight sleep apnea patients whose issues were detected under conventional testing means, Yeo’s wireless patch detected sleep apnea with an accuracy rate of 88.5%. For comparison, an existing headband device on the market had an accuracy rate of about 71% and cannot measure muscle activities.\nWhat’s more, the technology Yeo and his team developed, and the machine learning algorithms used, can predict the likelihood that a person who doesn’t show any symptoms of sleep apnea will develop it at some point.\n“By looking at the data, we can say that, if you don’t change something right now — whether it’s diet or sleeping behavior or anything like that — you’re likely to develop sleep apnea because your numbers are bad,” he said.\nSolving a Problem\nThe wireless patch solves a multipronged challenge to conventional testing methodology by addressing current patient issues with comfort, time, access, and cost.\nThe current process — called a PSG or polysomnography test — proves uncomfortable for some patients. That’s because they must sleep in a fixed position for fear of detaching any one of the 15 wired probes from their skin. Having any of those sensors detach from their bodies risks not capturing enough data for proper assessments.\nIt's also time consuming because the patient must go to a sleep center and spend the night being monitored by medical personnel. There can also be a lag to even get tested. Patients who don’t have severe symptoms or other high-risk, underlying factors such as heart disease or hypertension, often must wait after getting a referral from a doctor to be slotted for a bed at a sleep center, pending availability. Finally, the current detection method is costly to patients and insurance systems, tallying roughly $8,000 per person, per night.\n“So that testing barrier is really high for regular people unless you are already sick, then they will screen you to avoid any severe conditions,” Yeo said. “But for people who don’t show symptoms, you won’t know whether you have the sleep disorder until it gets severe. We want to stop sleep apnea before it starts.”\nCITATION: Woon-Hong Yeo, Shinjae Kwon, Hyeon Seok Kim, Kangkyu Kwon, Hodam Kim, Yun Soung Kim, Sung Hoon Lee, Young-Tae Kwon, Jae-Woong Jeong, Lynn Marie Trotti, Audrey Duarte. “At-home wireless sleep monitoring patches for the clinical assessment of sleep quality and sleep apnea.” Science Advances. May 24, 2023. doi/10.1126/sciadv.adg9671.\nAdditional Images\nContact\nPéralte C. Paul\nperalte.paul@comm.gatech.edu\n404.316.1210\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}