{"text": "Campus Community Provides Feedback on the Classroom Experience | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nCampus Community Provides Feedback on the Classroom Experience\nAlmost 7,000 students participated in the academic restart survey.\nFacebook\nTwitter\nEmail\nProfessor Cristi Bell-Huff teaches in a lecture hall in MoSE\nApr 07, 2021\n— Atlanta, GA\nResults have been compiled from the Spring 2021 listening sessions and a survey about the Georgia Tech student learning experience. The Academic Restart Taskforce conducted the research to better understand the impact of course modalities on student learning as well as the broader student experience. The survey and listening sessions were coordinated by Casey Chaviano, assistant director for Assessment and Planning - Office of Undergraduate Education, and Kyla Ross, assistant vice provost for Advocacy and Conflict Resolution.\nA total of 46 undergraduate students, graduate students, graduate teaching assistants, and faculty and instructors participated in the listening sessions. Almost 7,000 undergraduate and graduate students participated in the Academic Restart Student Survey for a response rate of 28%. Students currently enrolled in courses were given the opportunity to participate in the survey (excluding students in professional master’s programs or distance learning).\nA majority of students reported that in-person opportunities in hybrid and residential courses were of value to the learning experience in the Spring 2021 term. Many faculty created and shared detailed schedules of regular in-person opportunities for those students who indicated interest in attending in-person sessions, yet not all students opted to attend. In some cases, students who were committed to attending regularly in person were permitted to do so on a more frequent basis, whereas those students opting to not attend in person engaged with course material remotely. Still some students noted these in-person opportunities were not available to them.\nSimilar to Fall 2020, students reported that faculty were flexible and empathetic. As noted in the research summary, the flexibility may have unintentionally led to decreased engagement in classes. Some students reported that flexibility in attendance policies and the availability of recorded course material decreased their motivation to attend regularly. While survey respondents noted relatively high perceptions of learning across course modes, some students reported being distracted while attempting to engage in class sessions remotely, which negatively affected their ability to retain information.\nStudents and faculty openly discussed experiencing “screen fatigue” and a lack of motivation. Many faculty and students reported that few participants turned on their videos during class sessions, which increased distractedness and decreased their joy of teaching and learning. Some students and faculty reported a loss in connection to others in their courses and on campus, and many reported that there were diminishing returns for increased effort. Both faculty and student participants described challenges with engagement in the classroom. One faculty participant described instruction as “teaching in gray scales.” Students often described their homes or residence halls as their bedroom, classroom, lab, and social space. Participants frequently noted how different types of stimulation were required to increase engagement — a challenge given the current environment, leaving individuals limited in how they interact with one another.\nStudent survey respondents reported higher levels of engagement with both faculty and peers in residential courses when compared to other modes. When asked about engagement with peers, 42% of those in remote classes, 49% of those in hybrid classes, and 82% of those in residential classes agreed or strongly agreed their classes allowed them opportunities to engage with their peers. When asked about engagement with faculty, 58% of those in remote classes, 64% of those in hybrid classes, and 77% of those in residential classes agreed or strongly agreed their classes offered them opportunities to engage with their instructors. While some participants reported continued challenges with technology and logistics in courses, more participants spoke about their overall sense of well-being and connectedness, which have been persistently negatively affected during the time of the pandemic.\nParticipants were asked questions in the following categories: Course Management and Communication; Flexibility, Motivation, and Engagement; Connecting with Faculty and Peers; and Campus Culture and Well-Being. Student survey respondents reported that instructors continued to provide clear expectations regarding attendance in their courses when compared to the Fall 2020 term.\nListening session participants noted high degrees of flexibility in their courses as a way of coping with the challenges of the pandemic. Similarly, 90% of survey respondents agreed or strongly agreed their faculty were flexible with them during Covid-19.\nSeveral participants noted the value of faculty placing an emphasis on well-being during this time. For some, this meant the promotion of self-care through wellness days (either encouraged by instructors or the Institute). Others noted instructors encouraging mindfulness breaks during lectures, acknowledging student stressors, or increasing flexibility for students, particularly around illness. Of survey respondents, 92% agreed or strongly agreed their instructors were empathetic with them this semester.\nSee the full summary report for more details.\nhttps://comm.gatech.edu/moving-tech-forward/surveys\nAdditional Images\nContact\nOffice of the Provost\nEmail\npatti.futrell@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}