{"text": "Study Finds Alligator Hearts Keep Beating No Matter What | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nStudy Finds Alligator Hearts Keep Beating No Matter What\nBoth humans and alligators share a common four-chamber heart structure, but unlike mammals, alligators have built-in antiarrhythmic protection.\nFacebook\nTwitter\nEmail\nBoth humans and alligators have four-chamber hearts, but alligator hearts are uniquely resilient to temperature extremes. (Photo credit: Z. Owerkowicz)\nFeb 15, 2021\n— Atlanta, GA\nMammals and cold-blooded alligators share a common four-chamber heart structure – unique among reptiles – but that’s where the similarities end. Unlike humans and other mammals, whose hearts can fibrillate under stress, alligators have built-in antiarrhythmic protection. The findings from new research were reported Jan. 27 in the journal Integrative\nOrganismal Biology .\n“Alligator hearts don’t fibrillate – no matter what we do. They’re very resilient,” said\nFlavio Fenton , a professor in the\nSchool of Physics\nat the Georgia Institute of Technology, researcher in the Petit Institute for Bioengineering and Bioscience, and the report’s corresponding author. Fibrillation is one of the most dangerous arrhythmias, leading to blood clots and stroke when occurring in the atria and to death within minutes when it happens in the ventricles.\nThe study looked at the action potential wavelengths of rabbit and young alligator hearts. Both species have four-chambered hearts of similar size (about  3 cm); however, while rabbits maintain a constant heart temperature of 38 degrees Celsius, the body temperature of active, wild alligators ranges from 10 to 37 degrees Celsius. Heart pumping is controlled by an electrical wave that tells the muscle cells to contract. An electrical signal drives this wave, which must occur in the same pattern to keep blood pumping normally. In a deadly arrhythmia, this electrical signal is no longer coherent.\n“An arrhythmia can happen for many reasons, including temperature dropping. For example, if someone falls into cold water and gets hypothermia, very often this person will develop an arrythmia and then drown,” Fenton said.\nDuring the study, the researchers recorded changes in the heart wave patterns at 38 C and 23 C. “The excitation wave in the rabbit heart reduced by more than half during temperature extremes while the alligator heart showed changes of only about 10% at most,” said Conner Herndon, a co-author and a graduate research assistant in the School of Physics. “We found that when the spatial wavelength reaches the size of the heart, the rabbit can undergo spontaneous fibrillation, but the alligator would always maintain this wavelength within a safe regime,” he added.\nWhile alligators can function over a large temperature range without risk of heart trauma, their built-in safeguard has a drawback: it limits their maximum heart rate, making them unable to expend extra energy in an emergency. Rabbits and other warm-blooded mammals, on the other hand, can accommodate higher heart rates necessary to sustain an active, endothermic metabolism but they face increased risk of cardiac arrhythmia and critical vulnerability to temperature changes.\nThe physicists from Georgia Tech collaborated with two biologists on the study, including former Georgia Tech postdoctoral fellow Henry Astley, now assistant professor in the Biomimicry Research and Innovation Center at the University of Akron’s Department of Biology.\n“I was a little surprised by how massive the difference was – the sheer resilience of the crocodilian heart and the fragility of the rabbit heart. I had not expected the rabbit heart to come apart at the seams as easily as it did,” noted Astley.\nLower temperatures are one cause of cardiac electrophysiological arrhythmias, where fast-rotating electrical waves can cause the heart to beat faster and faster, leading to compromised cardiac function and potentially sudden cardiac death. Lowering  the temperature of the body – frequently done for patients before certain surgeries – also can induce an arrhythmia.\nThe researchers agree that this study could help better understand how the heart works and what can cause a deadly arrhythmia – which fundamentally happens when the heart doesn’t pump blood correctly any longer.\nThe authors also consider the research a promising step toward better understanding of heart electrophysiology and how to help minimize fibrillation risk. Until December 2020, when Covid-19 took the top spot, heart disease was the leading cause of death in the United States and in most industrialized countries, with more people dying of heart disease than the next two causes of death combined.\nAstley said the research provides a deeper understanding of the natural world and insight into the different coping mechanisms of cold- and warm-blooded animals.\nCo-author Tomasz Owerkowicz, associate  professor in the Department of Biology at California State University, San Bernardino, considers the findings “another piece of the puzzle that helps us realize how really cool non-human animals are and how many different tricks they have up their sleeves.”\nHe expressed hope that more researchers will follow their example and use a non-traditional animal model in future research.\n“Everyone studies mammals, fruit flies, and zebrafish. There's such a huge wealth of resources among the wild animals that have not been brought to the laboratory setting that have such neat physiologies, that are waiting to be uncovered. All we have to do is look,” he said.\nCITATION : C. Herndon, et al., “Defibrillate you Later, Alligator; Q10 Scaling and Refractoriness Keeps Alligators from Fibrillation.” ( Integrative Organismal Biology , 2021)\nhttps://academic.oup.com/iob/advance-article/doi/10.1093/iob/obaa047/6120966?login=true .\nResearch News Georgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contacts:\nAnne Wainscott-Sargent (404-435-5784) (asargent7@gatech.edu) John Toon (404-894-6986) (jtoon@gatech.edu)\nWriter:\nAnne Wainscott-Sargent\nAdditional Images\nContact\nAnne Wainscott-Sargent\nResearch News\n(404) 435-5784\nEmail\nasargent7@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}