{"text": "Neurotech Moonshot: Georgia Tech Researcher Shares Impact of BRAIN Initiative in Congressional Briefing | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNeurotech Moonshot: Georgia Tech Researcher Shares Impact of BRAIN Initiative in Congressional Briefing\nChris Rozell traveled to Washington, D.C. to share the impacts of the past decade of brain research funded by the NIH BRAIN Initiative with Congress — and share with local representatives how Georgia Tech is playing a key role in leading the charge.\nFacebook\nTwitter\nEmail\nApr 24, 2024\nFor the past 10 years, the National Institutes of Health have led an unprecedented effort to revolutionize our understanding of the human brain. The aptly named\nBRAIN (Brain Research Through Advancing Neurotechnologies) Initiative\nhas led to remarkable technological advancements, insights into the structure and function of the brain, and budding therapies.  Recently,\nSchool of Electrical and Computer Engineering\n(ECE) Professor\nChris Rozell\ntraveled to Washington, D.C. to share the impact of his BRAIN Initiative research with U.S. Congressional offices — and offer insights on how critical this program is to society. The briefing took on a particular urgency because BRAIN Initiative funding was cut over 40% this year, and future funding appears to be in jeopardy in the current federal budget climate.  “The millions of patients suffering with intractable neurologic disorders and mental illness deserve a moonshot to develop new solutions for their conditions,” said Rozell, who also holds the Julian T. Hightower Chair in ECE and serves on the executive committee for Georgia Tech’s\nNeuro Next Initiative . “You can't get to the moon with a paper plane, and you can’t get there without a map. The BRAIN Initiative is a vital program because it's one of the few places that brings together interdisciplinary teams that include the scientists who have been building maps of brain circuits and the engineers who have been building rockets to understand and intervene with those circuits.  “I'm proud to have had the chance to represent not only our own research, but the incredible community here at Georgia Tech and around the country working to understand many different aspects of the brain, developing new neurotechnologies, and advancing therapies for neurologic disorders.”  Interdisciplinary impacts  “The main message we presented to Congress is that the interdisciplinary combination of rigorous science and technical innovation can have enormous societal impact over the next few decades,” said Rozell.  A stark example of that impact was published in\nNature\nthis past fall. In this research, Rozell and his collaborators at the  Icahn School of Medicine at Mount Sinai\nand  Emory University School of Medicine\nidentified the\nfirst known biomarker\nof disease recovery with deep brain stimulation in treatment-resistant depression.  “The fact that an engineer can advance clinical therapies is a testament to the new era we're in,” says Rozell, “where disciplinary boundaries are fading, and technological innovation accelerates our scientific and translational breakthroughs.”  This research served as a focal point of the congressional briefing, where Rozell presented with BRAIN Initiative Director\nJohn J. Ngai , clinical collaborators, and a family whose lives have been transformed by this work.   “Events like last week are dream come true,” shared Jon Nelson, who was treated with deep brain stimulation as part of the study and presented with Rozell in D.C. After living through 10 years of debilitating, treatment-resistant depression, Nelson says “remission of depression still doesn't feel real. It's been a year and a half, and I still am in awe every single day.  “The fact that I have come out of this study and found that the disease is purely an electrical deficiency in my brain has fueled me to completely pulverize the stigma of mental illness,” Nelson explained. “When you have an opportunity to go speak to Congress — that’s about as great of a platform as you can get for that. Being able to put a face to what the BRAIN Initiative funding can do for people was just amazing.”  When meeting with local representatives, Rozell also relayed his work as co-executive leader of the\nNeuro Next Initiative , a budding Interdisciplinary Research Institute at Georgia Tech.  “I was thrilled to highlight that Georgia Tech is leading the charge with the Neuro Next Initiative, which will evolve into a full Interdisciplinary Research Institute in 2025,” said Rozell. “Georgia Tech has the ingredients to become a leading center for modern technology-driven interdisciplinary brain research and workforce development.  “This visit was a reminder to me that research funding is not guaranteed and it’s important to keep communicating the critical value that research plays in advancing our understanding, training our workforce, fueling our economy, and ultimately making a better tomorrow for society.”\nAdditional Media\nRelated links\nResearchers Identify Crucial Biomarker That Tracks Recovery from Treatment-Resi…\nLearn more about the Neuro Next Initiative\nAI and Neuroscience Become Dance Partners for Georgia Tech Arts Event\nContact\nAudra Davidson Research Communications Program Manager Neuro Next Initiative\nEmail\naudra.davidson@research.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}