{"text": "Tiny Magnetic Particles Enable New Material to Bend, Twist, and Grab | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nTiny Magnetic Particles Enable New Material to Bend, Twist, and Grab\nA team of researchers from the Georgia Institute of Technology and The Ohio State University has developed a soft polymer material, called magnetic shape memory polymer, that uses magnetic fields to transform into a variety of shapes.\nFacebook\nTwitter\nEmail\nAn assortment of objects made from magnetic shape-memory polymers. (Credit: Shuai Wu, The Ohio State University)\nDec 10, 2019\n— Atlanta, GA\nA team of researchers from the Georgia Institute of Technology and The Ohio State University has developed a soft polymer material, called magnetic shape memory polymer, that uses magnetic fields to transform into a variety of shapes. The material could enable a range of new applications from antennas that change frequencies on the fly to gripper arms for delicate or heavy objects.\nThe material is a mixture of three different ingredients, all with unique characteristics: two types of magnetic particles, one for inductive heat and one with strong magnetic attraction, and shape-memory polymers to help lock various shape changes into place.\n“This is the first material that combines the strengths of all of these individual components into a single system capable of rapid and reprogrammable shape changes that are lockable and reversible,” said Jerry Qi, a professor in the George W. Woodruff School of Mechanical Engineering at Georgia Tech.\nThe research, which was reported Dec. 9 in the journal  Advanced Materials , was sponsored by the National Foundation of Science, the Air Force Office of Scientific Research, and the Department of Energy.\nTo make the material, the researchers began by distributing particles of neodymium iron boron (NdFeB) and iron oxide into a mixture of shape memory polymers. Once the particles were fully incorporated, the researchers then molded that mixture into various objects designed to evaluate how the material performed in a series of applications.\nFor example, the team made a gripper claw from a t-shaped mold of the magnetic shape memory polymer mixture. Applying a high-frequency, oscillating magnetic field to the object caused the iron oxide particles to heat up through induction and warm the entire gripper. That temperature rise, in turn, caused the shape memory polymer matrix to soften and become pliable. A second magnetic field was then applied to the gripper, causing its claws to open and close. Once the shape memory polymers cool back down, they remain locked in that position.\nThe shape-changing process takes only a few seconds from start to finish, and the strength of the material at its locked state allowed the gripper to lift objects up to 1,000 times its own weight.\n“We envision this material being useful for situations where a robotic arm would need to lift a very delicate object without damaging it, such as in the food industry or for chemical or biomedical applications,” Qi said.\nThe new material builds on earlier research that outlined actuation mechanisms for soft robotics and active materials and evaluated the limitations in current technologies.\n“The degree of freedom is limited in conventional robotics” said Ruike (Renee) Zhao, an assistant professor in the Department of Mechanical and Aerospace Engineering at Ohio State. “With soft materials, that degree of freedom is unlimited.”\nThe researchers also tested other applications, where coil-shaped objects made from the new material expanded and retracted – simulating how an antenna could potentially change frequencies when actuated by the magnetic fields.\n“This process requires us to use of magnetic fields only during the actuation phase,” Zhao said. “So, once an object has reached its new shape, it can be locked there without constantly consuming energy.”\nThis research was supported by   The Ohio State University Materials Research Seed Grant Program, funded by the National Science Foundation’s Center for Emergent Materials under grant No. DMR-1420451. The project was also supported by the Center for Exploration of Novel Complex Materials, the Institute for Materials Research, the Air Force Office of Scientific Research under grant No. FA9550-19-1-0151, the U.S. Department of Energy under grant No. DE-SC0001304, and by grants from the Haythornthwaite Foundation. The content is the responsibility of the authors and does not necessarily represent the official views of the sponsoring agencies.\nCITATION :  Qiji Ze, Xiao Kuang, Shuai Wu, Janet Wong, S. Macrae Montgomery, Rundong Zhang, Joshua M. Kovitz, Fengyuan Yang, H. Jerry Qi, and Ruike Zhao, “Magnetic Shape Memory Polymers with Integrated Multifunctional Shape Manipulations” ( Advanced Materials , 2019). http://dx.doi.org/10.1002/adma.201906657\nAdditional Images\nContact\nJohn Toon\nResearch News\nEmail\njohn.toon@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}