{"text": "Physics: It's What's Happening Inside Your Body Right Now | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nPhysics: It's What's Happening Inside Your Body Right Now\nResearchers have shown that the relative softness of white blood cells determines whether they remain in a dormant state.\nFacebook\nTwitter\nEmail\nResearchers at Georgia Tech and Emory University fabricated model blood vessel systems that include artificial blood vessels with diameters as narrow as the smallest capillaries in the body. The systems were used to study the activity of white blood cells as they were affected by drugs that tend to make them softer, which facilitates their entry into blood circulation. (Credit: Rob Felt, Georgia Tech)\nFeb 08, 2016\n— Atlanta, GA\nSimple physics may play a larger role than previously thought in helping control key bodily processes – such as how the body fights infection. Using a model blood vessel system built on a polymer microchip, researchers have shown that the relative softness of white blood cells determines whether they remain in a dormant state along vessel walls or enter blood circulation to fight infection. Changes in these cell mechanical properties – from stiff to soft – can be triggered as a side effect of drugs commonly used to fight inflammation or boost blood pressure. Other researchers have found that blood flow affects the cells that line arteries and that particles within cells tend to congregate near cell walls. Better understanding the role of physics in fine-tuning such biological processes could give researchers new approaches for both diagnosing and treating disease. The work, believed the first to show how biophysical effects can control where white blood cells are located within the blood circulation, was reported February 8 in the journal\nProceedings of the National Academy of Sciences . The research was supported by the National Heart, Lung, and Blood Institute of the National Institutes of Health (NIH), the National Science Foundation (NSF), and the American Heart Association. “We are showing that white blood cells, also known as leukocytes, respond physically to these drugs and that there is a biological consequence to that response,” said\nWilbur Lam , an assistant professor in the\nWallace H. Coulter Department of Biomedical Engineering\nat Georgia Tech and Emory University. “This may suggest new ways to treat disease, and new places to look for diagnostic information. There may be physics-based disease biomarkers that we can use in addition to the common biological and biochemical markers we have been using.” Lam’s research group began studying the issue to better understand a common side effect of glucocorticoid drugs such as hydrocortisone used to treat inflammatory disorders such as asthma and allergic reactions. These hormonal drugs prompt an increase in white blood cell counts, a change that had been attributed to biological processes, including a reduced “stickiness” between the cells and blood vessel walls. The increase in white cell count is also seen with drugs that support blood pressure, such as epinephrine, also known as adrenaline. “The biological explanation for this seemed to fall short, so we thought maybe some of what was happening could be attributed to other factors – such as physical and mechanical issues,” said Lam, who is also a physician in the Aflac Cancer and Blood Disorders Center at Children’s Healthcare of Atlanta and the Department of Pediatrics at the Emory University School of Medicine. To examine the theory, graduate student Meredith Fay and postdoctoral researcher David Myers fabricated model blood vessel systems that include artificial blood vessels with diameters as narrow as the smallest capillaries in the body. To isolate effects attributable only to physics, the systems – which were fabricated in Georgia Tech’s\nInstitute for Electronics and Nanotechnology\n– did not include the endothelial cells that normally line blood vessels in the body. Using blood samples taken from a healthy human volunteer, they studied the behavior of white blood cells in the presence – and absence – of the drugs dexamethasone – a glucocorticoid drug – and epinephrine. Working with Georgia Tech Professor of Mechanical Engineering Todd Sulchek, they also used atomic force microscopy to characterize the stiffness of individual white blood cells before and after they had been exposed to the drugs, and determined that the drugs cause the cells to become significantly softer than before exposure. “When we fluorescently label the white blood cells and perfuse them into the artificial vessels, the white blood cells are always flowing along the edge, on the walls of these artificial blood vessels,” said Lam. “But when they are exposed to the drugs, they go to the center of the channel and enter the main blood flow. Then, we discovered that the drugs cause the cells to remodel actin, which comprises the ‘skeleton’ of all mammalian cells.” The group’s overall hypothesis is that the body uses the mechanical properties of these cells to help control their activity and where they are located within the circulation. The relative softness or stiffness of the cells, which collide constantly with billions of other cells in the bloodstream, including red and white blood cells, causes the cells to self-sort and determines where they end up physically within both the model blood vessels and in the human body. “The soft cells are always flowing in the middle of the bloodstream, while the stiff ones are sequestered on the edges,” Lam said. “We believe this is how white blood cells traffic in the body and get to the site of an infection. This may be a way that the body very efficiently sorts and directs its white blood cells to get them where they’re needed.” As a next step, Lam hopes to study how physical properties affect the movement of hematopoietic stem cells used in bone marrow transplants. Once injected intravenously into the body, the cells quickly move from the circulation to bone marrow sites where they belong, and he believes mechanical properties may also play a role in this homing process. “Whenever there is a change in some cellular activity or physiological activity, we tend to try to explain everything at the genetic level – which genes turn off and which genes turn on,” he said. “Gene expression is a relatively complex process, and our hypothesis is that there are probably a lot of cellular processes that are much simpler and more efficient than the typical paradigm of DNA expression, then RNA translation, and then protein production. A little tweak of a white blood cell’s actin will allow it to change from stiff to soft, and that small change, in and of itself, may have profound physiologic consequences and enable it to be transported from one part of the body to another.” In addition to those already mentioned, the research also included Amit Kumar and Michael Graham from the Department of Chemical and Biological Engineering at the University of Wisconsin-Madison; Cory Turbyfield, Rebecca Byler and Kaci Crawford from the Wallace H. Coulter Department of Biomedical Engineering at Georgia Tech and Emory University and the George W. Woodruff School of Mechanical Engineering at Georgia Tech; Robert Mannino, Alvin Laohapant, Erika Tyburski, Yumiko Sakurai and Micahel Rosenbluth from the Coulter Department, the AflacCancer Center and Blood Disorders Service of Children's Healthcare of Atlanta, Emory University School of Medicine, the Winship Cancer Institute at Emory University, the Parker E. Petit Institute for Bioengineering and Bioscience at Georgia Tech, and the Institute for Electronics and Nanotechnology at Georgia Tech; and Neil Switz of The Evergreen State College. This research was supported by the National Heart, Lung and Blood Institute of the National Institutes of Health (NIH) under grant 5R01HL121264-03, the National Science Foundation (NSF) under grant CBET-1436082 and the American Heart Association. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the author(s) and do not necessarily reflect the views of the sponsors. CITATION : Meredith E. Fay, et al., “Cellular softening mediates leukocyte demargination and trafficking, thereby increasing clinical blood counts,” (PNAS 2016).\nhttp://dx.doi.org/10.1073/pnas.1508920113 Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contact : John Toon (404-894-6986) ( jtoon@gatech.edu ). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}