{"text": "New School Builds on Georgia Tech's Commitment to Advancing Cybersecurity and Privacy Education | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNew School Builds on Georgia Tech's Commitment to Advancing Cybersecurity and Privacy Education\nGeorgia Tech’s newest school is the first of its kind at a major research university.\nFacebook\nTwitter\nEmail\nSep 15, 2020\n— Atlanta, GA\nGeorgia Tech, which has been named No. 2 in undergraduate cybersecurity education by U.S. News and World Report, is building upon its success by launching a new School of Cybersecurity and Privacy. The new school is the first of its kind among top research universities.\nThe new School will build on Georgia Tech’s considerable investments in cybersecurity and privacy education and research. The Institute already has three cybersecurity degree programs. The School will weave them together with other important interdisciplinary programs.\n“The new School of Cybersecurity and Privacy is a reflection of Georgia Tech’s strengths and commitment to serving the needs of our society and our state,” said Georgia Tech President\nÁngel Cabrera .\n“Georgia Tech’s new School of Cybersecurity and Privacy will focus on applied research collaborations with the fast-growing cybersecurity industry in Georgia and meeting a critical workforce need,” Cabrera said. “It will bring together Georgia Tech’s expertise across disciplines to advance technology and find new solutions to protect our personal privacy and support our national security.”\nThere are more than 500 cybersecurity researchers spread across Georgia Tech who bring in more than $180 million in research awards annually. Georgia Tech’s faculty are ranked #2 in the world in publications in top security conferences.\nThe\nSchool of Cybersecurity and Privacy at Georgia Tech\nis the first School of its kind at a top university, drawing together faculty and researchers across various disciplines from practically all six colleges at Georgia Tech and the Georgia Tech Research Institute.\nThe new School will be intercollegiate and interdisciplinary because cybersecurity and privacy problems typically play out across multiple dimensions.\n“Cybersecurity includes not only technology but the law, business processes, and cultural considerations,” said\nCharles Isbell , dean and John P. Imlay, Jr. chair of the College of Computing. “The School of Cybersecurity and Privacy will bring together thought leaders from all of those areas to push the envelope of technical innovation and produce the workforce of the future.\"\nTo that end, the School will bring in not only computer scientists and engineers but business experts and behaviorists.\n“Solving tomorrow’s toughest cybersecurity problems will require not only a thorough understanding of the technologies and threats involved. It also will require deep expertise in behavioral and policy considerations that must increasingly inform the development and use of new cybersecurity approaches and technologies,” said\nKaye Husbands Fealing , dean of the Ivan Allen College of Liberal Arts.\n“By drawing on Georgia Tech’s globally respected expertise in the technology and policy arenas, the School of Cybersecurity and Privacy will extend our leadership in this area with exactly the kind of innovative, interdisciplinary, human-centered thinking and research we need to advance socially responsible and technically practical solutions to these critical issues.”\nThe solutions and the workforce produced by the new School will not only benefit business, but also protect every aspect of our online lives and our national infrastructure.\n“Cybersecurity is not just a personal issue — our credit cards or identities quickly come to mind — but it has an even larger impact on national security, financial markets, even power grids,” said Provost and Executive Vice President for Academic Affairs\nSteve McLaughlin . “That is why the new School of Cybersecurity and Privacy is so important at this time. Cybersecurity, privacy, and related policies dominate the priorities of many organizations, and the need for advanced research and talent is outpacing supply. Georgia Tech is already a leader in this area the new School will take us to even greater heights and impact.”\nThe creation of the School has been welcomed by industry leaders in cybersecurity and privacy, both in Atlanta and nationwide. Atlanta in particular is a center of financial technology, an area that goes hand-in-hand with cybersecurity.\n[RELATED: Georgia Tech Institute for Information Security and Privacy]\n\"Financial technology companies leverage technology and data to fuel innovation, which makes cybersecurity and privacy vital to their success”, said\nRyan Graciano\n(B.S. Computer Science ’04), co-founder and chief technology officer of Credit Karma. “This means not only staying on the cutting-edge technologically but also building systems that work with multiple sets of privacy regulations in different jurisdictions. The School of Cybersecurity will be an essential resource for fintech companies in Atlanta and worldwide.\"\nThe new School will strengthen Atlanta’s tech economy, said\nAlan Taetle , general partner at the venture-capital firm Noro-Moseley Partners.\n“The creation of a new School of Cybersecurity and Privacy will help the Atlanta tech ecosystem build on two of its greatest strengths: internet security and payment processing,” Taetle said. “Georgia Tech is a world-class university that creates world-class technology, and I expect the new school to both produce new companies and also provide vital support to existing ones both locally and nationally.”\nOf course, financial companies are not the only ones to benefit from new cybersecurity and privacy technologies.\n“Consumer demands for digital service are transforming business, forcing new innovations in cloud infrastructure and other areas for businesses to compete or remain relevant. Every one of these innovations must be accompanied by new cybersecurity technologies and policies in order to keep both corporations and consumers safe,“ said Tony Spinelli, chief information officer for Urban One, Inc. and former chief information officer for Capital One. “The School of Cybersecurity and Privacy, in other words, is addressing a vast and growing demand from all sectors of the modern digital economy.”\nThe School of Cybersecurity and Privacy will be led by interim chair\nRich DeMillo\n(Ph.D. 72), the Charlotte B. and Warren C. Chair of Computer Science and Professor of Management. DeMillo has previously served as the founder and executive director of Georgia Tech’s Center for 21 st\nCentury Universities, and as the dean of the College of Computing. He is the author of more than 100 articles, books, and patents, and is a fellow of the Association for the Advancement of Science and the Association of Computing Machinery. Prior to arriving at the Institute, DeMillo served as Hewlett-Packard’s first chief technology officer.\n“Its roots are in computer science and engineering, mathematics, public policy, and national security, but the last twenty years has seen the birth of cybersecurity as a profession in its own right,” DeMillo said. “I am pleased that the Institute recognized this shift by launching an academic unit that will be home to a new generation of scholars.  Building that culture will be challenging, but we will be judged by the success of our people and our ability to meet the growing demand for Georgia Tech-caliber experts with unique skills.”\nThe new School will launch a nationwide search this fall for multiple faculty members and for its founding chair. For more information about the school, please\nvisit its website .\nAdditional Images\nContact\nAnn Claycombe, Communications Director ann.claycombe@cc.gatech.edu\nEmail\nann.claycombe@cc.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}