{"text": "October Events Celebrate Campus Sustainability Month | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nOctober Events Celebrate Campus Sustainability Month\nEvents throughout the month of October offer a glimpse into the wide-ranging commitment to sustainability at Georgia Tech.\nFacebook\nTwitter\nEmail\nSep 28, 2023\nOctober is\nCampus Sustainability Month , an international celebration of sustainability on college and university campuses. Georgia Tech will host sustainability-focused events all month. With the recent release of the Institute’s\nSustainability Next plan , these campus opportunities underscore our commitment to the objectives outlined in the plan. There are numerous options centered on climate and social sustainability topics in addition to trips to explore nature around Atlanta. The programming is hosted by diverse campus groups and offers a glimpse into the wide-ranging commitment to sustainability at Tech.\nEvent Lineup\nClimate Action Plan Student Engagement Workshop\nMonday, Oct. 2\n5 – 6 p.m.\nThe Kendeda Building for Innovative Sustainable Design, Room 210\nAs a deliverable of the Sustainability Next Plan, the Georgia Tech Climate Action Plan is a roadmap for integrating climate action strategies across operations, research, and education focusing on climate justice and reducing emissions. Students are invited to join the Office of Sustainability for an interactive, in-person event to learn about the climate action strategies in the plan, share input, and enjoy free pizza.\nFor registration and additional information, click\nhere . RSVP required.\nClimate Action Plan Campus Town Hall (Virtual)\nWednesday, Oct. 4\n11 a.m. – noon\nVirtual via Zoom (RSVP Required)\nThe entire Georgia Tech community can learn more about the Georgia Tech Climate Action Plan and share input during a virtual campus town hall hosted by the Office of Sustainability.\nFor registration and additional information, click\nhere .\nApproaching the Limits of Climate Viability: Urban Heat Vulnerability in Atlanta and How to Adapt\nWednesday, Oct. 4\nNoon – 1:30 p.m.\nScholar’s Event Theater, First Floor, Price Gilbert Library\nAs part of Georgia Tech Library’s initiative to highlight research that makes data accessible and meaningful to the public, Brian Stone Jr., a professor in the School of City and Regional Planning, will present a lecture on the urban heat island effect and its context for Atlanta.\nFind more details and registration information\nhere .\nBrook Byers Institute for Sustainable Systems Seminar Series, Baabak Ashuri — Valuation of Investment in Sustainable Buildings and Renewable Energy Infrastructure\nThursday, Oct. 5\n3 – 4 p.m.\nHybrid Event: BBISS Offices, 760 Spring St., Suite 118, and on\nTeams\nBaabak Ashuri, a professor in the School of Building Construction and the School of Civil and Environmental Engineering, and a Brook Byers Institute for Sustainable Systems Fellow, will speak about how a new set of tools for the valuation and appraisal of renewable energy projects can enhance investment decision-making.\nLiam's Legacy Symposium 2023: Humanitarian Engineering with Juan Lucena\nThursday, Oct. 5\n4 – 6 p.m.\nCoda Building, Ninth Floor Atrium\nJuan Lucena, director of the Humanitarian Engineering Undergraduate Program and professor of engineering, design, and society at the Colorado School of Mines will visit Georgia Tech for the annual Liam’s Legacy Symposium. Lucena will explore the relationship between engineers, engineering, and the well-being of communities, social justice, and sustainability.\nThis event is presented by the Center for Sustainable Communities Research and Education in partnership with the School of History and Sociology, through a grant from the Gertrude and William C. Wardlaw Fund in support of the Conference on Human Rights, Changes, and Challenges.\nSustainable Careers and Shared Value Panel\nThursday, Oct. 12\n2 – 3:15 p.m.\nScheller College of Business, Room 221\nJoin the Ray C. Anderson Center for Sustainable Business to hear from three panelists at various stages in their careers and diverse types of corporations about how sustainability is incorporated and how it has shaped their roles.\nMore information and registration\nhere .\nLullwater Preserve (Emory) Bird Walk\nFriday, Oct. 13\n7 a.m. – 12:30 p.m.\nMeet at Cherry Emerson\nRide the GT/Emory bus with Birdwatchers @ GT to Lullwater Preserve, a beautiful, forested park on Emory’s Druid Hills campus. Open to beginner and expert birders alike — make sure to RSVP if you need binoculars.\nFor more information and registration, click\nhere .\nCampus Energy Challenge\nOct. 16 – 22\nResidence Halls Across Campus\nHousing and Residence Life’s annual Energy Competition takes place the week of Oct. 16. The competition will give all campus residents a chance to see the daily energy use of their residence halls, along with tips on how to reduce their individual use. The residence hall that reduces its use the most will win a prize.\nContact\nMalte Weiland , senior sustainability project manager, Auxiliary Services, for more information.\nA Conversation With Victor Luckerson, Author of ‘Built From the Fire ’\nTuesday, Oct. 17\n7 – 8:30 p.m.\nScheller College of Business, Room 100\nA panel discussion with Victor Luckerson, author of\nBuilt From the Fire , moderated by Todd Michney, associate professor in the School of History and Sociology. The book follows a multigenerational saga of a family and a community in Tulsa’s Greenwood district, known as “Black Wall Street,” that in one century survived the 1921 Tulsa Race Massacre, urban renewal, and gentrification.\nStaff Council Drive-Thru Recycling Event\nWednesday, Oct. 18\n2 – 4 p.m.\nO’Keefe Building Parking Lot, 151 Sixth St. NW\nThe Georgia Tech Staff Council and CPEC subcommittee are hosting a recycling collection event for faculty and staff. Drop off items such as plastic bottles, mixed paper, household batteries, electronics, and glass.\nBrook Byers Institute for Sustainable Systems Seminar Series – Dylan Brewer: Who Heeds the Call in an Energy Emergency? Evidence from Smart Thermostat Data\nThursday, Oct. 19\n3 – 4 p.m.\nHybrid Event: BBISS Offices, 760 Spring St., Suite 118, and on\nTeams\nDylan Brewer, an assistant professor in the School of Economics and BBISS Fellow, will present research exploring the relationship between compliance with calls to conserve energy during a shortage situation and in an environment of political polarization.\nClimate and Innovation Business Forum\nFriday, Oct. 20\n1 – 5:30 p.m.\nGlobal Learning Center\nThe Climate and Innovation Business Forum will convene stakeholders from various sectors to explore strategies for driving innovative climate solutions. Attendees are invited to participate in discussions on harnessing the potential of climate technology, forging innovative collaborations, and mobilizing capital for environmental and social impact.\nAdministration and Finance Virtual Town Hall\nFriday, Oct. 20\n2 – 3 p.m.\nVirtual via Zoom\ngatech.zoom.us/j/95142941085\nCelebrate Sustainability Month at the A&F virtual town hall and learn about activities designed to promote sustainability across the Institute. We will share highlights from the recently published Sustainability Next plan, developing strategies from the Climate Action Plan, and how Georgia Tech is harnessing the power of data throughout our utility management efforts to foster a living campus for all.\nGeorgia Tech Undergraduate Sustainability Education Panel\nTuesday, Oct. 24\n11 a.m. – noon\nThe Kendeda Building for Innovative Sustainable Design, Room 210\nLearn more about sustainability-focused campus educational opportunities at this panel discussion and hear from affiliated faculty, staff, and students. Snacks will be provided.\nSurviving the “Zombie Apocalypse” at Kendeda 2023\nFriday, Oct. 27\n4 – 7:30 p.m.\nThe Kendeda Building for Innovative Sustainable Design\nThe Kendeda Building is an example of resilient infrastructure, with its potable water storage, solar power system, composting toilets, and ability to grow food on its rooftop garden. This Office of Sustainability event will focus on the lessons that The Kendeda Building has taught us about sustainability, regenerative design, and the benefits of being more self-sufficient. Join us for a spooky Kendeda Building tour, snacks, and lessons in sewing and food pickling.\nGet tickets\nhere .\nExtension of Community: What It Means to Be Sustainable in a Digital World\nThroughout October\nLocations include The Kendeda Building, the Library, and the Georgia Tech Media Bridge\nExperience an interactive art exhibit at the intersection of science and technology addressing sustainability and the climate crisis.\nHow have our technological and digital developments helped and harmed us?\nHow can we be more digitally sustainable?\nWhat are the limits of technology and how can we shift our behaviors to help heal the planet?\nFourteen artists and scientists reflect on community and sustainability within their practice and question the impact of technology on the environment and society. The exhibit, curated by Birney Robert, addresses themes of plastics and waste, social and environmental justice, and imagined futures.\nFor more information,\nclick here .\nExplore the\nCampus Sustainability Month 2023 Calendar\nfor a comprehensive list of events and updates. Campus groups, departments, and organizations interested in adding their sustainability-focused event to the calendar can email sustain.gatech.edu.\nAdditional Images\nRelated links\nThe Sustainability Next Plan Transforms Vision Into Reality\nContact\nAbby Bower\nProgram Support Coordinator\nOffice of Sustainability\nEmail\nabby.bower@sustain.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}