{"text": "Proposed Standards for Triboelectric Nanogenerators Could Facilitate Comparisons | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nProposed Standards for Triboelectric Nanogenerators Could Facilitate Comparisons\nResearchers have proposed standards for comparing and selecting triboelectric nanogenerators.\nFacebook\nTwitter\nEmail\n(Left to right) Georgia Tech graduate student Simiao Niu, postdoctoral fellow Yunlong Zi and Regents professor Zhong Lin Wang are shown with a selection of triboelectric nanogenerators. (Credit: Rob Felt, Georgia Tech)\nSep 25, 2015\n— Atlanta, GA\nMore than 60 research groups worldwide are now developing variations of the triboelectric nanogenerator (TENG), which converts ambient mechanical energy into electricity for powering wearable electronics, sensor networks, implantable medical devices and other small systems. To provide a means for both comparing and selecting these energy-harvesting nanogenerators for specific applications, the Georgia Institute of Technology research group that pioneered the TENG technology has now proposed a set of standards for quantifying device performance. The proposal evaluates both the structural and materials performance of the four major types of TENG devices. “Triboelectric nanogenerators are a new energy technology that has shown phenomenal potential,” said\nZhong Lin Wang , a Regents professor in the Georgia Tech\nSchool of Materials Science and Engineering.\n“Here, we have proposed standards by which the performance of these devices can be quantified and compared. These standards will be useful for academic researchers developing the devices and for future industrial applications of the nanogenerators.” The proposed standards are described in an article published September 25 in the journal\nNature Communications . Triboelectric nanogenerators use a combination of the triboelectric effect and electrostatic induction to generate small amount of electrical power from mechanical motion such as rotation, sliding or vibration. The triboelectric effect takes advantage of the fact that certain materials become electrically charged after they come into moving contact with a surface made from a different material. The electricity generated by TENG devices could replace or supplement batteries for a broad range of potential applications. Developed over the past several years, the technology has advanced to the point where it can power small electronic devices, potentially enabling widespread sensing and infrastructure systems – as well as powering wearable consumer devices. “Because of the large number of devices being developed, people need to have a standard for judging the performance of these nanogenerators,” Wang said. He noted that standards have allowed technologies such as photovoltaics and thermoelectric devices to advance, though the performance of TENG devices is more difficult to quantify because of the different design and materials options available. In their paper, Wang’s team proposes a general figure of merit which can be used to quantify the potential energy output of the TENG devices. The general figure of merit is made up of information from two other sources: the capabilities of the specific TENG structure used, and the surface charge density provided by the specific materials chosen to construct the device. The output is compared to the mechanical energy inputs to provide an efficiency comparison. These measurements are based on plots of the build-up of voltage and total transferred electrical charges from each device. The structural figures of merit are derived from theoretical calculations for each of the four major nanogenerator modes, plus experimental results produced by TENG devices placed into a circuit with a switch and an electrical load. The materials figure of merit depends on experimental measurements of the surface charge density done with an experimental set-up that uses liquid metal to collect the surface charge. Variations in TENG structures allow a variety of applications depending on the source of mechanical energy. The four major groups include (1) vertical contact-separation mode, (2) lateral sliding mode, (3) single-electron mode, and (4) freestanding triboelectric-layer mode. There are also hybrid combinations of these major structural modes. The contact-separation mode, for example, is powered by a periodic driving force that causes repeated contact, and then separation, between two dissimilar materials that have coated electrodes on the top and bottom surfaces. The lateral sliding model uses two surfaces that briefly slide together, then separate, generating a charge. “We can calculate for the four modes what are the best sizes and shapes, and the best power output you can expect for a specific structural figure of merit,” Wang explained. Material choices tested include fluorinated ethylene propylene, Kapton, polarized polyvinylidene fluoride, polyethylene, natural rubber and cellulose. The measurement and theoretical techniques were developed by postdoctoral fellow Yunlong Zi and graduate student Simiao Niu, both members of Wang’s research team. In developing their proposed standards, the researchers considered what had already been done in setting standards for heat engines and other technologies. “For triboelectric generators, because the mechanical input is varied, you have different kinds of measurements to evaluate the performance,” said Zi. “These figures of merit are considerably more complicated than would be needed for characterizing solar cell performance, for example.” Publishing the proposed standards is a first step in what Wang expects to be a long process of gaining acceptance. He plans to spend the next several months explaining the standards to other research groups developing TENG devices. He estimates that there could be 60 research groups around the world working on TENG devices, and he expects that number to grow as the nanogenerators become more sophisticated and powerful. “As wearable electronics become more popular and fashionable, we will need a better way to power them,” Wang said. “Triboelectric nanogenerators can play a large role in that. We have spent a lot of time improving the power efficiency, and the field is quickly expanding.” Ultimately, he said, the standards could also be modified for piezoelectric generators and other systems designed to produce electricity from mechanical motion. CITATION : Yunlong Zi, et al., “Standards and Figures of Merit for Quantifying the Performance of Triboelectric Nanogenerators,” (Nature Communications, 2015). ( http://dx.doi.org/10.1038/NCOMMS9376 ). Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contact : John Toon ( jtoon@gatech.edu ) (404-894-6986) Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu 404-894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}