{"text": "3D-Printed Device Finds ‘Needle in a Haystack’ Cancer Cells by Removing the Hay | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\n3D-Printed Device Finds ‘Needle in a Haystack’ Cancer Cells by Removing the Hay\nA new approach enabled by 3D printing could help isolate tumor cells circulating in the bloodstream.\nFacebook\nTwitter\nEmail\nA 3D-printed cell trap developed in the laboratory of Georgia Tech Assistant Professor A. Fatih Sarioglu captures blood cells to isolate tumor cells from a blood sample. (Photo: Allison Carter, Georgia Tech)\nOct 29, 2019\n— Atlanta, GA\nFinding a handful of cancer cells hiding among billions of blood cells in a patient sample can be like finding a needle in a haystack. In a new approach enabled by 3D-printed cell traps, researchers are removing the hay to expose the cancer cells.\nTrapping the white blood cells – which are about the size of cancer cells – and filtering out smaller red blood cells leaves behind the tumor cells, which could then be used to diagnose the disease, potentially provide early warning of recurrence and enable research into the cancer metastasis process. The work, led by researchers at the Georgia Institute of Technology, could advance the goal of personalized cancer treatment by allowing rapid and low-cost separation of tumor cells circulating in the bloodstream.\n“Isolating circulating tumor cells from whole blood samples has been a challenge because we are looking for a handful of cancer cells mixed with billions of normal red and white blood cells,” said\nA. Fatih Sarioglu , an assistant professor in Georgia Tech’s\nSchool of Electrical and Computer Engineering\n(ECE). “With this device, we can process a clinically-relevant volume of blood by capturing nearly all of the white blood cells and then filtering out the red blood cells by size. That leaves us with undamaged tumor cells that can be sequenced to determine the specific cancer type and the unique characteristics of each patient’s tumor.”\nThe research was reported September 20 in the journal\nLab on a Chip , and was supported by a seed grant from the Integrated Cancer Research Center at Georgia Tech.\nOther attempts to capture circulating tumor cells have attempted to extract them from the blood using microfluidic technology that recognizes specific surface markers on the cancer cells. But because the cancer can change over time, the malignant cells can’t be recognized with certainty. And even if they can be captured, the tumor cells must be removed from circuitous channels in the device and separated from the antigen without causing damage.\nSarioglu and collaborators, including ECE graduate student and first author Chia-Heng Chu, decided to take a different approach, building 3D-printed traps lined with antigens to capture the white blood cells in a sample. The 3D printed traps allowed the researchers to greatly expand the surface area for capturing the white blood cells as they pass by in blood samples. Zig-zagging fluid channels, some as much as half a meter long, increase the likelihood that every white blood cell would come into contact with a channel wall.\n“Usual microfluidic devices have just a single layer with channel heights of 50 to 100 microns,” Sarioglu said. “They are thick, but most of it just empty plastic. Using 3D printing liberates us from the single channel and allows us to create many channels in three dimensions that better utilize the space.”\nWhile the 3D printing allowed an increase in channel density, that came with a significant challenge. Earlier microfluidic devices could be designed with etched channels to carry the blood. But with 3D printing processes that are fabricated layer-by-layer, channels had to be filled with wax to allow more channels to be built atop them. The torturous channel structure, designed to maximize cell-wall interaction, made it virtually impossible to get the wax out after fabrication.\nThe solution was to design cell traps that fit into standard centrifuges designed to spin samples for separation. The traps were heated in the centrifuge and then spun to allow the melted wax to escape. After removing the liquid wax, the channels received the antigen coating.\nAfter the white blood cells are removed, the smaller red blood cells pass through a simple commercial filter that traps the cancer cells and any remaining white blood cells. The tumor cells can then be removed from the filter, which is integrated into the 3D printed device.\nMinimal processing of blood samples is a goal for the project to make the process available to clinics and hospitals without requiring specialized technician skills. Less processing also reduces the risk of damage to the tumor cells and minimizes other cellular changes that could skew the evaluation.\nAs part of the proof of principle testing, the researchers coated the white blood cells with biotin to accelerate testing. Future cell traps will use antigens designed to attract the cells to the channel walls without the biotin processing step.\nThe researchers tested their approach by adding cancer cells to blood taken from healthy people. Because they knew how many cells were added, they could tell how many they should extract, and the experiment showed the trap could capture around 90 percent of the tumor cells. Later testing of blood samples from prostate cancer patients isolated tumor cells from a 10-milliliter whole blood sample.\nTesting included cells from prostate, breast and ovarian cancer, but Sarioglu believes that the device will capture circulating tumor cells from any type of cancer because the removal mechanism targets blood cells rather than cancer cells.\nNext steps will be to narrow the channels in the device, test white blood cell removal without the use of biotin, boost the percentage of white cell extraction and connect cell traps to increase trapping capacity.\n“We expect that this will really be an enabling tool for clinicians,” Sarioglu said. “In our lab, the mindset is always toward translating our research by making the device simple enough to be used in hospitals, clinics and other facilities that will help diagnose disease in patients.”\nOther co-authors of the paper include Ruxiu Liu, Tevhide Ozkaya-Ahmadov, Mert Boya, Brandi E. Swain, Jacob M. Owens, Enerelt Burentugs, and John F. McDonald, all from Georgia Tech, and Mehmet Asim Bilen from Emory University.\nCITATION : Chia-Heng Chu, et al, “Hybrid Negative Enrichment of Circulating Tumor Cells from Whole Blood in a 3D-Printed Monolithic Device.” ( Lab on a Chip , 2019)\nhttp://dx.doi.org/10.1039/C9LC00575G\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia 30332-0181  USA\nMedia Relations Contact:\nJohn Toon (404-894-6986) (jtoon@gatech.edu)\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}