{"text": "Students Use Data Science to Solve Society’s Problems | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nStudents Use Data Science to Solve Society’s Problems\nStudents in Data Science for Social Good show non-profits and government agencies how data can tackle social and societal problems.\nFacebook\nTwitter\nEmail\nThe Atlanta Data Science for Social Good (DSSG) program is an intensive, 10-week paid internship experience that places students onto multi-disciplinary teams working under the supervision of a professor on a problem that comes from a partner in the City of Atlanta or a local non-profit company. The program is sponsored by Georgia Tech and Oracle.\nJul 07, 2015\n— Atlanta, GA\nFires will happen. But what if the Atlanta Fire Rescue Department could determine which buildings are at greatest risk of fire and prioritize inspections to focus on those sites? The fire department is working to do just that thanks to a summer internship program sponsored by Georgia Tech and Oracle. The city agency is one of four groups participating in this year’s\nData Science for Social Good\n(DSSG), where 14 undergraduate and graduate students show non-profits and government agencies how data can tackle social and societal problems. Other projects include maintaining and improving Atlanta’s urban forest, increasing efficiency for a popular hotline system, and working with Georgia Tech’s WiFi data to understand mobility patterns. “It’s important to get students involved in real-world projects,” said Christopher LeDantec, co-director of the program and an assistant professor of digital media in the School of Literature, Media and Communication in the Ivan Allen College of Liberal Arts. “We are building out sustainable learning opportunities that allow students and Georgia Tech to have a wider impact in the community. “ The four students working with Atlanta Fire Rescue shadowed inspectors to learn not only how they work, but also how they create and use data. The students identified hundreds of additional commercial properties at high risk for a fire that should be inspected with greater frequency, said Matt Hinds-Aldrich, a management analyst with Atlanta Fire Rescue working with the student team. The program is “helping us make more informed and data-driven decisions on how best to allocate our limited resources as we balance protecting residents, visitors and commerce in our community all while remaining fiscally responsible,” Hinds-Aldrich said. While many public agencies and non-profits collect data, staff may be overwhelmed by the volume or may lack the time and capabilities to interpret the information, said Bistra Dilkina, co-director of the DSSG program and an assistant professor in the School of Computational Science and Engineering in the College of Computing. The program shows groups how data can work to their advantage, while exposing students to different career paths, Dilkina said. “Nonprofits and conservationists need data scientists, too,” she said. Georgia Tech received more than a dozen project proposals, but could only staff four. More than 100 students applied for the 10-week paid internship and 14 were selected. Richard Huckaby, a rising third-year student in computer engineering, joined because he wanted to learn new skills and help people. He’s part of the team working with the United Way of Greater Atlanta on their 211-hotline system, which is a searchable database of city services. Students will suggest ways to improve and reconstruct the existing call menu to better organize incoming calls and reduce average wait time. “There’s more to data science than commercialization or helping large companies,” he said. To conduct their work, students pulled data from multiple sources and had to go through several steps before it was ready for analysis. The urban forest team working with the City of Atlanta and Trees Atlanta relied on tax parcels, thermal maps, city inventories, floodplain data and other sources. “Games and apps are fun, but we’re setting up a system the city and Trees Atlanta can build on in the future,” said Caroline Foster, who will start Georgia Tech’s masters program in Human-Computer Interaction next month. Students from all four teams will present their findings and recommendations during a\npublic demonstration\nscheduled to begin at 6:30 p.m. Thursday at Ponce City Market.\nAdditional Images\nRelated links\nData Science for Social Good\nContact\nLaura Diamond  Georgia Tech Media Relations 404-894-6016\nEmail\nlaura.diamond@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}