{"text": "Crab Shell Signaling Helps Control the Many Faces of Cholera, Study Shows | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nCrab Shell Signaling Helps Control the Many Faces of Cholera, Study Shows\nA new study shows the diversity and resourcefulness of Vibrio cholerae, the organism behind the disease cholera.\nFacebook\nTwitter\nEmail\nImage shows cholera colonies (yellow) growing on an agar plate. Growth of the bacterium was part of research into the diversity and resourcefulness of the bacterium. (Credit: John Toon, Georgia Tech)\nApr 06, 2016\n— Atlanta, GA\nIn humans, cholera is among the world’s most deadly diseases, killing as many as 140,000 persons a year, according to World Health Organization statistics. But in aquatic environments far away from humans, the same bacterium attacks neighboring microbes with a toxic spear – and often steals DNA from other microorganisms to expand its own capabilities. A new study of more than 50 samples of\nVibrio cholerae\nisolated from both patients and the environment demonstrates the diversity and resourcefulness of the organism. In the environment, the cholera bacterium is commonly found attached to chitin, a complex sugar used by aquatic creatures such as crabs and zooplankton to form protective shells. In the wild, most strains of cholera can degrade the shells for use as food, and the new study showed how the presence of chitin can signal the bacteria – which have receptors for the material – to produce behaviors very different from those seen in human disease. Among the cholera strains studied, less than a quarter were able to take up DNA from other sources. Almost all of the samples taken from the environment were able to kill other bacteria – a phenomenon called “bacterial dueling” – but just 14 percent of the bacterial pathogen strains isolated from humans had that capability. “It’s a dog-eat-dog world out there even for bacteria,” said Brian Hammer, an associate professor in the School of Biology at the Georgia Institute of Technology. “Bacteria such as\nVibrio cholerae\nsense and respond to their surroundings, and they use that information to turn on and off the genes that benefit them in the specific environments in which they find themselves.” The research, supported by the National Science Foundation and the Gordon and Betty Moore Foundation, provides information that could lead to development of better therapeutic agents against the disease, which is found in densely-populated areas with limited sanitation and clean water. The research was done with assistance from the Centers for Disease Control and Prevention (CDC), and was reported online March 4 in the journal\nApplied and Environmental Microbiology . In humans, the cholera bacteria produce a diarrheal disease that can kill untreated patients in just a few hours. The deadly effects of the disease, however, are actually caused by a virus that infects the\nVibrio cholerae\nstrains found in humans. The toxin carried by the virus helps spread the disease among humans, but cholera strains quickly lose the virus and adapt other competitive mechanisms in the environment. To study how cholera regulates these adaptations, Georgia Tech graduate student Eryn Bernardy obtained nearly 100 samples of cholera bacteria from a variety of sources globally, including one originally isolated from a 1910 Saudi Arabian outbreak of the disease. She then studied 53 of the samples for their ability to (1) degrade chitin, (2) take up DNA from the environment, and (3) kill other bacteria by poking them with a poisoned spear. Colonies of each strain were grown in petri plates containing chitin material. The strains able to digest the material produced a clear ring showing that they had broken down the chitin in the agar growth medium. Only three of the cholera colonies failed to degrade the chitin. To study their ability to take up DNA, bacterial cells were grown on crab shells, then exposed to raw DNA containing a gene for antibiotic resistance. The cells were scraped off the shells and placed onto agar plates containing an antibiotic that would normally kill the bacteria. Colonies that survived showed they had taken up the genetic material. To study their ability to compete with other bacteria, each cholera strain was placed into contact with a billion or so\nE. coli\ncells on petri plates. After a few hours in contact, the researchers counted the number of\nE. coli\nremaining. Some cholera strains were able to kill nearly all of the\nE. coli\ncells, reducing their numbers to a few hundred thousand. “We found a very sharp difference between the clinical isolates and the environmental isolates,” Hammer said. “For example, most of the isolates that came out of patients either couldn’t kill other bacteria, or were carefully controlling that behavior. Patient isolates have a very different way of competing inside the human body. They use the virus-encoded toxin to cause the diarrheal disease and remove their competitors from the intestine.” With help from CDC scientists, the researchers correlated the behavior of each strain with their unique DNA sequences. They also examined the strains for the presence of the toxin used to cause disease. To deduce the rules governing the bacterium’s behavior, Hammer and his lab have been studying cholera for the last 15 years, starting with a single strain first isolated in Peru in the early 1990s. When a cholera outbreak began in Haiti after the 2010 earthquake, his lab worked with the CDC to isolate these new strains. In further study, Hammer was surprised to find that the 2010 Haitian strains were less capable than the 1991 Peruvian variety. “We were very surprised to find that most of the Haiti strains did not behave like the one we had been studying for years,” he said. “This was a reminder to us that we needed to embrace the diversity of the organisms we’ve been studying. We thought this would be an opportune time to start looking at how diverse Vibrio cholerae really is.” Hammer compared the diversity of the cholera strains to the diversity of humans, who increasingly receive personalized health care. “In humans, one size doesn’t fit all for patient care,” he said. “For cholera, the behavior is personalized for each strain. Understanding this will be useful in the development of future therapeutics, and we’re hopeful that knowing how these bacteria interact with other organisms in complex communities will lead us to things that can truly benefit humans.” In addition to those already mentioned, the study included Maryann A. Turnsek and Cheryl L. Tarr from the CDC. Georgia Tech undergraduate Sarah K. Wilson from the Hammer lab, another author on the paper, is now a Ph.D. student at the University of Wisconsin-Madison. This material is based upon work supported by the Gordon and Betty Moore Foundation and National Science Foundation Grant No. 1149925. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the National Science Foundation or the Moore Foundation. CITATION : Eryn E. Bernardy, et al., “Diversity of Clinical and Environmental Isolates of Vibrio cholerae in Natural Transformation and Contact-Dependent Bacterial Killing Indicative of Type VI Secretion System Activity,” (Applied and Environmental Microbiology, 2016).\nhttp://dx.doi.org/10.1128/AEM.00351-16 . Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contacts : John Toon ( jtoon@gatech.edu ) (404-894-6986) or Ben Brumfield ( ben.brumfield@comm.gatech.edu ) (404-385-1933). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}