{"text": "Georgia Tech launches financial technology accelerator at ATDC | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech launches financial technology accelerator at ATDC\nWorldpay's $1 million gift will fund the program for three years.This is the first major private sector gift for ATDC.\nFacebook\nTwitter\nEmail\nGeorgia Tech signs on 10th street (Photo Credit: Fitrah Hamid)\nMar 02, 2015\n— Atlanta, GA\nWorldpay will expand its commitment to accelerating payments technology innovation with a $1 million gift and mentorship commitment to Georgia Tech’s Advanced Technology Development Center (ATDC), company and university officials announced Tuesday. Worldpay will fully fund a new Financial Technology accelerator at ATDC for the next three years, which will include hiring a FinTech expert to serve as an entrepreneur-in-residence to mentor startups. Worldpay executives are also mentoring entrepreneurs at the center, providing both payments expertise and Worldpay’s global resources to support companies within the new program. “As the leaders in modern money, Worldpay is creating new payments experiences for software and applications that business owners use to run their businesses smarter across all channels,” said Worldpay US President and CEO Tony Catalfano. “To sustain our competitive advantage, we must continue to innovate and attract top talent, both key drivers behind this groundbreaking partnership.” “The ATDC has empowered scores of entrepreneurs to grow their ideas into successful companies,” added Catalfano, who also serves as the board chairman of the American Transaction Processors Coalition. “Our commitment is about investing in the smartest, most-creative innovators so the next generation of financial technology will be built right here in Georgia.” “We are always focused on bringing businesses to our state, but we also want to encourage the next generation of entrepreneurs to build their businesses right here in Georgia,” said Georgia Lieutenant Governor Casey Cagle. “This is a groundbreaking public-private partnership that will create jobs and help secure Georgia’s place as the country’s leader in financial technology for another generation. I congratulate Georgia Tech and Worldpay on this collaboration and look forward to seeing the results.” The announced partnership underscores Georgia Tech’s statewide economic development mission. “This gift from Worldpay will enhance the innovation ecosystem that is rapidly developing in Tech Square,” said Georgia Tech President G.P. “Bud” Peterson. “We are fulfilling our mission to create new products that will foster new companies and job opportunities for all of Georgia.” As a statewide startup incubator, ATDC is always looking at the technologies that are of interest to entrepreneurs in Georgia, said ATDC Director Stephen Fleming. “Financial technology is important for us and the state because it’s a sector where Georgia is a leader,” added Fleming. “ATDC will use Worldpay’s gift and executive mentorship to ensure that Georgia stays at the cutting edge of FinTech.” More than 70 percent of all U.S. payments are processed in Georgia’s “Transaction Alley,” according to the American Transaction Processors Coalition. More than 60 percent of the industry’s companies are based in metro Atlanta, supporting more than 40,000 jobs in the state. Tuesday’s announcement comes on the heels of Worldpay’s announced relocation of its U.S. headquarters to Midtown Atlanta this year. The company will invest more than $10 million to move more than 600 employees to the city and add an additional 600 workers over the next four years.   About Worldpay Worldpay is a leading global payments technology and services company, which allows merchants to accept payments anywhere in the world, across any channel. Headquartered in London and operating in over 30 countries, the company offers services across the entire payments value chain, including transaction capturing, merchant acquiring and transaction processing. In 2014, the business processed a total of 10.7 billion transactions with a value of more than half a trillion dollars, making it one of the largest payments companies in the world. The company employs over 4,700 people in markets throughout the U.S., Europe and Asia. Worldpay US is headquartered in Georgia, and recently announced it will move its headquarters to Midtown Atlanta this year. Worldpay is owned by private equity firms Advent International and Bain Capital alongside management and employees. For additional information, visit Worldpay.com.   About Georgia Tech The Georgia Institute of Technology is one of the world’s premier research universities. Georgia Tech is a national and international leader in scientific and technological research and education and is the nation’s leading producer of engineers as well as a leading producer of female and minority engineering Ph.D. graduates. Ranked among the top public universities by U.S. News & World Report, the Institute enrolls more than 23,000 students within its six colleges. For additional information, visit\nwww.gatech.edu .   About the Advanced Technology Development Center (ATDC) The Advanced Technology Development Center (ATDC) is one of the oldest and largest university-based startup incubators in the country. ATDC, which is celebrating its 35th anniversary this year, has graduated about 150 companies from its program. ATDC is a unit of the Enterprise Innovation Institute, Georgia Tech’s chief economic development arm. For additional information, visit\nwww.atdc.org .\nAdditional Images\nRelated links\nAdvanced Technology Development Center\nEnterprise Innovation Institute\nContact\nLaura Diamond  Georgia Tech Media Relations 404-894-6016  Laura.diamond@comm.gatech.edu @LauraRDiamond\nEmail\nlaura.diamond@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}