{"text": "Meet Alexa Ramirez, GTRI Project Portfolio Manager and Marching Band Color Guard Director | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMeet Alexa Ramirez, GTRI Project Portfolio Manager and Marching Band Color Guard Director\nAlexa Ramirez grew up going to Georgia Tech football games. Now she works at GTRI and directs the color guard for the Yellow Jacket Marching Band.\nFacebook\nTwitter\nEmail\nAlexa Ramirez has completed nine half marathons, one full marathon, and several 5K and 10K races, including the Peachtree Road Race. (Photo courtesy of Alexa Ramirez)\nJun 09, 2023\nGeorgia Tech graduate Alexa Ramirez has always had strong Yellow Jacket roots. Now, she is the project portfolio manager for the Health Emerging and Advanced Technologies (HEAT) Division in the Information and Communications Laboratory at GTRI, and she directs the color guard for the Yellow Jacket Marching Band.\n“I was already pretty familiar with Georgia Tech by the time I enrolled as an undergraduate in 2005 because my dad, Paul Ramirez, is a 1973 graduate in building construction,” she said. “I grew up coming to Tech games and coming to campus all the time. I went to my first game as a 6-month-old child.”\nAfter earning a bachelor’s degree in\ninternational affairs\nin 2009, Ramirez earned a master’s in British and Russian interwar history at Georgia State University and also worked as a graduate assistant at GTRI. She went on to work for a nonprofit in D.C. before returning to Atlanta and GTRI in 2016. She has been with the\nHEAT Division\nfor three years.\n“Most of our work in the HEAT Division is for the CDC,” she said. “We perform data analytics and systems interoperability for health data of all kinds.” Her favorite project is the mortality reporting project, which has been in the works for more than five years, making it one of the oldest projects in the department’s portfolio.\n“Our team is helping the CDC with efforts to modernize and standardize mortality and death reporting across the U.S. so the CDC can receive that information in a timelier manner from cities and counties reporting that data,” Ramirez said.\nCoroners and medical examiners across the country employ various methods to gather and report the data. “People are using everything from paper to somewhat advanced technological systems when reporting, but nobody is doing it the same. So, we’re creating a standardized process,” she said. “Death reporting is something most people never think about, but it’s pretty interesting.”\nRamirez’s favorite part of the job is working with her team and with brilliant scientists. “It’s a good environment. Also, it’s nice knowing that the work we do as a group with the CDC is going to have a positive impact, hopefully on the country and the world.”\nLife With the Color Guard\nShe has a second job at Tech, directing the color guard for the\nYellow Jacket Marching Band . Her love of the color guard began at Pope High School in Marietta, Georgia, where she was in the color guard all four years. She has performed with several organizations, and she has taught and choreographed for many Atlanta-area high school programs over the years.\nShe joined Georgia Tech’s color guard during her second year. She took a break from color guard when she moved to D.C., and reengaged when she moved back to Atlanta, temporarily filling in as a Yellow Jacket director.\n“Helping out turned into me doing the job,” she said. “I’ve been here ever since. This fall will be my ninth year.”\nRamirez has two assistant coaches, Mallory Kliesrath and Maddie Jones, CS 2017, who help manage the squad, including auditions each spring and three camps over the summer. During football season, the color guard performs at all home games and travels with the band to the big away games, such as Georgia, Florida State, and Clemson. They rehearse from 3:30 to 6:30 p.m., every Monday, Wednesday, and Friday. This work is in addition to Ramirez’s GTRI job.\n“My workday starts at 6:00 or 6:30 a.m., so I work eight hours for GTRI, and then I teach color guard until 6:30 at night,” she said. “I do it because I love it and I love the kids. They all have been taught color guard in different ways, or not at all, and we turn them into a cohesive group. It’s fun watching their growth, seeing the result at the end of each season, and being proud of them.”\nWhen she isn’t working, Ramirez likes to run. She has completed nine half marathons, one full marathon (the Marine Corps Marathon), and several 5K and 10K races, including the Peachtree Road Race.\n“I’ve done the Peachtree five times. This year will be my sixth,” she said. “And I’m doing what is called the ‘triple peach,’ when you run the Peachtree Road Race, the Atlanta 10 Miler, and the Thanksgiving Day Half Marathon all in the same year.”\nShe also bikes and goes to the gym to stay in shape. She generally likes to be able to run a 5K at any time.\n“I’m not fast, but I can go the distance.”\nAdditional Images\nRelated links\nRead More Staff Stories\nContact\nVictor Rogers\nInstitute Communications\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}