{"text": "Catching Molecular Dances in Slow Motion by Adding White Noise | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nCatching Molecular Dances in Slow Motion by Adding White Noise\nCounterintuitive addition of noise to AFM instrument requiring quiet boosts its performance\nFacebook\nTwitter\nEmail\nAn atomic force microscope allows scientists to observe molecular interactions important to understanding life processes. Georgia Tech mechanical engineers focusing on biotechnology recently significantly improved AFM's sensitivity by adding electronic white noise. Credit: Georgia Tech /  Rob Felt\nNov 21, 2016\n— Atlanta\nIn extreme slow-motion, a molecule of medicine entering a cell receptor would look a little like a Soyuz space capsule docking at the International Space Station. It would brake here, boost there; rotate, translate and then, with a light jolt, lock into place.\nIn real time, large molecules interact in nanosecond speed, practically instantaneously, making them nearly impossible to watch. But scientists are a step closer to being able to observe their moves -- play-by-play -- thanks to novel fine-tuning of an atomic scale instrument by engineers at the\nGeorgia Institute of Technology.\nThe advancement could someday help researchers figure out why some drugs work well and others less so, and measure details about the workings of life at their root.\nAtomic forces seen clearly\nThe improvement works by carefully adding electronic white noise to a sensing probe inside an\natomic force microscope (AFM),\nwhich is already sensitive enough to detect forces exerted by interacting molecules, such as protein receptors and vitamins. But even with those abilities at a nanometer scale, in a slight but significant way,\nAFM\ncan be a blunt instrument.\n“There’s an inability of the probe to sample the deepest part of the interaction,” said researcher\nTodd Sulchek, an associate professor at Georgia Tech’s School of Mechanical Engineering . “You either see how these molecules are bound together or unbound. It was either black or white, but now we’re succeeding at getting varying shades of gray.”\nSulchek and graduate researchers\nAhmad Haider\nand\nDaniel Potter\npublished the results of their engineering solution in  the journal the\nProceedings of the National Academy of Sciences\nEarly Edition\nthe week of November 21, 2016. Their research was funded by the National Science Foundation.\nCone wiggling a cantilever\nMolecules have tractor beams, albeit weak ones. They tug at each other with an  array of faint forces, such as van der Waals interactions , mostly generated though negative or positive polarities spread around the molecules.\nAtomic force microscopes measure those attracting energies by sticking a nanoscale cone-shaped probe close to the molecules to feel the forces out as they interact. The cone is attached to a\ncantilever , a flexible tiny stick, and makes it wiggle, as the atomic forces tug the cone this way or that.\nThe cantilever transfers the quivering into the microscope, which turns it into a usable signal much the way the needle of a turntable transfers vibrations from a record to be converted into sound. The resulting signal illustrates what is called an energy well. The top of the well is the point where the adhesive forces are about to take hold, and the bottom is a point about where the molecules meet.\nFalling into the energy well\nBut as the forces pull the cone and the molecules it’s observing closer to each other, at some point, they basically jerk together, preventing a detailed measurement of the gradient of energy. As a result, as the cone approaches the interacting molecules, researchers see the top of the energy well and the end of the interaction, but the details of the well’s walls, particularly deep down where the molecules most closely interact, invariably elude them.\n“The way we got around it was, we simply added some electronic noise in a well-defined manner, and that allowed the probe to feel the interaction when it was still relatively far away from the surface of the molecules,” Sulchek said. The electronic vibration, called enhanced\nstochastic\nfluctuation, also diluted the effect of the adhesive forces that otherwise would have snatched the cantilever and molecules together.\n“What I think is neat is that it’s counterintuitive, because you usually try to eliminate noise from your system to get more accurate measurements, but we’re adding noise,” Sulchek said. The improvement gets around potential bias produced by the addition of noise by allowing researchers to take more samples and longer ones, effectively cancelling the effects of the noise in the overall data.\nAdding some noise may sound simple, but it took Haider and Potter a good two years to figure out how it could work and to make tedious adjustments to the instrumentation.\nBacterial vise grip ballet\nThe researchers used interactions between the cantilever and a material called\nmica\nto finish developing the improvement. Mica has a predictable shape and charge, good for benchmarking – it’s very smooth. “Mica is atomically flat,” Sulchek said. “That and graphite are about the two flattest surfaces that you can construct.”\nNow, Sulchek’s team is testing the improved cantilever in a biological scenario -- a protein from\nStreptomyces avidinii\nbacteria, which eats up the vitamin\nbiotin\nwith a vengeance. The protein, streptavidin, binds with biotin so tightly, that researchers commonly use it to study molecular adhesion.\n“It’s the strongest bio-interaction known to science,” Sulchek said. Streptavidin’s vise grip makes for a well standardized test case for the newly fine-tuned device.  “A flap opens up and the biotin fits in it like a glove,” Sulchek said. “We want to see if we can watch how that happens and measure its energy well.”\nCancer, AIDS, autoimmune disease\nThat puts Sulchek closer to his dream of an instrument to boost experimental biomolecular research, and potentially lead to insights useful to medicine. “I want to have a tool to visualize these intermediate steps,” he said. “I want a tool to see those short-lived states.\"\nResearchers could use such an improved tool to better understand autoimmune disorders, immunotherapy to treat cancer or the ability of HIV to thwart an antibody defense.\n“Many\nantibodies have two binding\nsites, and there’s a reason for that, but we don’t yet understand why,” Sulchek said. “We do know that you don’t want antibodies to interact too strongly.” When they do, it can result in autoimmune diseases.\n“There’s a lot of therapeutics involving antibodies, and some work well; others don’t work well,” Sulchek said. Antibodies may not attach optimally to HIV, for example, because they’re having a hard time wrapping around the virus.\nCapturing the clumsy action in extreme slow motion could someday help biomedical researchers design a more effective antibody to further foil the virus.\nThe research was funded by the National Science Foundation (grant CBET-CAREER-1055437). Findings and opinions in this article are those of the scientists and authors and not of the funding agency.\nREAD: Tiny mirror makes microscope see cells in 3D\nAdditional Images\nContact\nWriter and media contact: Ben Brumfield\nCell: 404-660-1408\nResearch communications\nEmail\nben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}