{"text": "Institute Address Showcases Record-Breaking Growth | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nInstitute Address Showcases Record-Breaking Growth\nPresident Ángel Cabrera highlighted Georgia Tech’s record-breaking year.\nFacebook\nTwitter\nEmail\nPresident Ángel Cabrera delivers the 2023 Institute Address.&nbsp;\nAug 31, 2023\nOn the eve of his fourth anniversary on the job, Georgia Tech President Ángel Cabrera delivered the annual\nInstitute Address\nto a gathered crowd inside the Clough Undergraduate Learning Commons and over 1,000 viewers online.\nCelebrating “another banner year at Tech,” the president highlighted the Institute’s ever-growing impact in the state and around the globe. “We committed in our strategic plan to amplify our impact, and I can proudly say that our impact has never been greater,” he said. “And at a place like Tech, that’s really saying something. What we have done together is remarkable.”\nReaching New Heights\nThe 3,800 members of the Class of 2027 include record numbers of first-generation students, women, and other traditionally underrepresented students, and brought the undergraduate population over 19,000 for the first time in the Institute’s history –– further cementing Tech’s place as the fastest-growing public university in the country over the last decade, according to the Chronicle of Higher Education Almanac.\nPraised for its value to students, Tech earned a five-star ranking from\nMoney magazine\nand the top spot on the Princeton Review’s list of\nBest Value Colleges for 2023 .\n“Our students pay less here than they would at most other leading research universities,” Cabrera said. “They graduate at one of the highest rates among public universities, and they land some of the best-paying jobs in the nation. The result is one of the highest returns on investment anywhere.”\nWith continued growth in the student population comes the need for faculty growth. Prioritizing instruction, the Institute saw a record number of new faculty hires, with 80 in the past year — a 5% growth of overall academic faculty.\nTech faculty won a historic $1.45 billion in research awards this past year, a 14% increase. The funding supports innovations in nuclear security, clean energy and carbon capture, artificial intelligence applications, and more.\n“The discoveries, ideas, and inventions happening on our campus every day are truly delivering on our mission to improve the human condition,” Cabrera said.\nThe work being done across the Institute resulted in a\n$4.5 billion impact on Georgia’s economy\nin fiscal year 2022 — the largest among the 26 University System of Georgia member institutions.\n“These numbers only measure the direct economic impact: jobs, expenditures, and investments. They do not capture the value of the startups that we incubate or the companies we help attract to the state, and that impact has a far deeper and longer-lasting effect on our state’s economy,” Cabrera said.\nEmbracing Values\nEmphasizing that Tech will continue to live out its values of “We thrive on diversity” and “We safeguard freedom of inquiry and expression,” Cabrera recommitted to building a diverse campus where students of all backgrounds feel welcome. The Institute will continue offering camps for K-12 students to learn about engineering, computing, and science; creating transfer pathway programs for students from other universities; and supporting dual degree programs with historically Black colleges.\nOver the last decade, Tech has made progress in the number of Black students (9% of the incoming first-year class this year), women (43%), students from rural areas (13%), first-generation students whose parents did not graduate from college (15%), and other groups — with graduation and retention rates up across the board.\nExpanding access to Tech remains a priority for leadership, with the stated goal of increasing the share of lower-income students to 15 to 20% by 2025. In pursuit of that goal, mandatory fees have been reduced by 22%, the G. Wayne Clough Georgia Tech Promise Program was\nrecently expanded , and a new scholarship program,\nthe Georgia Tech Val-Sal Scholarship , has been established. Under this initiative, Georgia high school valedictorians and salutatorians with demonstrated financial need will have automatic admission and qualify for up to $5,000 in financial aid annually.\nCabrera also discussed the importance of fostering a culture where students feel empowered to voice their opinions and embrace diverse points of view.\n“Just as important as it is that we build an inclusive and diverse Georgia Tech, we must protect freedom of expression for every member of our community. We need to create a space where we are routinely exposed to new and different ideas, where we protect each other’s right to express our views, and where we cherish the practice of listening to one another with curiosity and respect,” he said.\nCabrera commended outgoing Vice President for Diversity, Equity, and Inclusion Archie Ervin,\nwho is retiring at the end of the year, for his efforts during the past 13 years.\nContinued Progress\nTouting the progress of the 2030 strategic plan, Cabrera noted that 20 initiatives are currently underway, including the recent launch of the\nCultivate Well-Being Action and Transformation Roadmap With a Focus on Faculty and Staff\n— a follow-up to the student roadmap launched in 2022 — and the creation of the Division of Lifetime Learning.\nAs the Institute’s\nTransforming Tomorrow\ncampaign continues, Cabrera detailed his travels to secure funding. “Campaign engagements have taken not just me, but the provost, the deans, and many others on the road, coast to coast, over the last several months. We have traveled tens of thousands of miles and met with hundreds of supporters, friends, and colleagues, and will continue those important discussions and visits,” he said.\nAddressing the need for resources on campus, Cabrera celebrated the completion of several key\ncampus construction projects\nand the ongoing work at Science Square, the George and Scheller Towers in Tech Square, and the new 850-bed, first-year residence hall set to open in 2026.\nA partnership with the Georgia Tech Foundation will develop the Randall Brothers site, near the John Lewis Student Center, into what will be known as Arts Square — described by the president as a space that will “increase residential options, bring new amenities, and create the seed of a new district at the intersection of arts and technology.”\nAthletic Achievement\nAs the Yellow Jackets prepare to kick off the 2023 season at Mercedes-Benz Stadium on Sept. 1, Cabrera commended new Athletic Director J Batt and his staff for navigating a challenging year in collegiate athletics.\n“We have invested in the program, recruited new coaches in football and men’s basketball, raised record amounts to support scholarships, and signed new sponsorships, including our biggest one to date with Hyundai Motor Company,” he said,\nreferencing the historic partnership\nthat awarded field naming rights at Bobby Dodd Stadium to the automaker, which has established a significant presence in the state.\nFor those who might be wondering, Cabrera reassured the audience, “The Ramblin’ Wreck is staying.”\nAdditional Images\nRelated links\nWatch the 2023 Institute Address\nContact\nSteven Gagliano\n- Communications Officer\nInstitute Communications\nEmail\nSteven.gagliano@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}