{"text": "Engineered “Sand” May Help Cool Electronic Devices | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nEngineered “Sand” May Help Cool Electronic Devices\nEngineered \"sand\" may offer the potential for improved cooling of electronic devices.\nFacebook\nTwitter\nEmail\nA thermal probe tests heat conductance in a sample of silicon dioxide nanoparticles. The material could potentially conduct heat at an efficiency higher than that of conventional materials. (Credit: Rob Felt, Georgia Tech)\nJul 13, 2016\n— Atlanta, GA\nBaratunde Cola would like to put sand into your computer. Not beach sand, but silicon dioxide nanoparticles coated with a high dielectric constant polymer to inexpensively provide improved cooling for increasingly power-hungry electronic devices. The silicon dioxide doesn't do the cooling itself. Instead, the unique surface properties of the coated nanoscale material conduct the heat at potentially higher efficiency than existing heat sink materials. The theoretical physics behind the phenomenon is complicated, involving nanoscale electromagnetic effects created on the surface of the tiny silicon dioxide particles acting together. The bottom line could be a potentially new class of high thermal conductivity materials useful for heat dissipation from power electronics, LEDs and other applications with high heat fluxes. \"We have shown for the first time that you can take a packed nanoparticle bed that would typically act as an insulator, and by causing light to couple strongly into the material by engineering a high dielectric constant medium like water or ethylene glycol at the surfaces, you can turn the nanoparticle bed into a conductor,\" said Cola, an associate professor in the\nGeorge W. Woodruff School of Mechanical Engineering\nat the Georgia Institute of Technology. \"Using the collective surface electromagnetic effect of the nanoparticles, the thermal conductivity can increase 20-fold, allowing it to dissipate heat.\" The research, which involved both theory and experiment, has been published online in the journal\nMaterials Horizons , and was highlighted in the July 8 issue of the journal\nScience . The work was supported by the Air Force Research Laboratory and the U.S. Air Force. Co-authors include Professor James Hammonds at Howard University, and graduate students Eric Tervo from Georgia Tech and Olalekan Adewuyi from Howard University. In the last several years, theoretical papers have predicted the ability of surface phonon polaritons to increase thermal conduction in nanomaterials made from polar materials like silicon dioxide. Polaritons are quantum quasiparticles produced by strong coupling of electromagnetic waves with an electric or magnetic dipole-carrying excitation. In the specific case of surface phonon polaritons, the electromagnetic waves are coupled to a certain frequency and polarization of vibrating atoms in the material known as optical phonons. When materials are reduced to sizes below 100 nanometers, the surface properties of the material dominate over bulk properties, allowing phonons of heat to flow from particle to particle in the closely packed bed with the assistance of the coupled electromagnetic waves. Although researchers could not previously measure heat flow from surface phonon polaritons due to experimental difficulties, they have observed their wave propagation when light hits the surface of a nanostructure material, suggesting a potential role in heat dissipation. In addition to the first measurement of heat flow, Cola and his collaborators also found that the effect can occur when thermal energy is added to a packed bed of nanoparticles. “What we are also showing for the first time is that when you have nanoparticles of the right type in a packed bed, that you don’t have to shine light on them,” he explained. “You can just heat up the nanoparticles and the thermal self-emission activates the effect. You create an electrical field around the nanoparticles from this thermal radiation.” The researchers decided to experiment with those special properties, first using water to coat the nanoparticles and turn the silicon dioxide nanoparticle bed into a conductor. But the water coating was not robust, so the researchers switched to ethylene glycol, a fluid commonly used in vehicle antifreeze. The new combination increased the heat transfer by a factor of 20 to approximately one watt per meter-kelvin, which is higher than the value ethylene glycol or silicon dioxide nanoparticles could produce alone, and competitive with expensive polymer composites used for heat dissipation. “You could basically take an electronic device, pack these ethylene glycol-coated nanoparticles in the air space, and it would be useful as a heat dissipation material that at the same time, won’t conduct electricity,” said Cola. “The material has the potential to be very inexpensive and easy to work with.” Silicon dioxide was chosen because its crystalline lattice can generate resonant optical phonons – necessary for the effect – at approximately room temperature. Other materials could also be used, but the silicon dioxide nanoparticles provide a good compromise of properties and cost. “The resonance frequency, converted into the thermal radiation temperature for silicon dioxide, is around 50 degrees Celsius,” said Cola. “With this material, we can turn on this effect at a temperature range that a microelectronic device is likely to see.” Though the ethylene glycol works well, it will eventually evaporate. For that reason, Cola plans to identify polymeric materials that could be adsorbed to the silicon dioxide nanoparticles to provide a more stable coating with a reasonable product lifetime. The effect depends on the collective action of the silicon dioxide nanoparticles. “We are basically showing a macroscopic translation of a nanoscale effect,” Cola said. “Even though the nanoparticle bed is a bulk assembly, it is a bulk assembly that has a lot of internal surface area. The internal surface area is the gateway by which it interacts with the electromagnetic field – the light and the heat.” So far, the effect has been demonstrated in small amounts of silicon dioxide nanoparticles. Another step would be to scale up the study to demonstrate that heat can be transferred longer distances in larger volumes of the material, Cola said. “The rate at which the thermal energy goes from one side of the particle to the other side of the particle is constant throughout the nanoparticle bed, so it shouldn’t matter how thick the nanoparticle bed is,” he explained. “When these particles are close enough together, their modes are coupled, which allows the energy to transport.” Further testing would be needed to ensure the long-term efficiency and to confirm that there are no impacts on the reliability of the electronic devices cooled with the technique, Cola said. This work was supported by the U.S. Air Force Research Laboratory Minority Leaders Program contract FA8650-11-D-5800 through a subcontract from United Technologies Corporation. Support is acknowledged from U.S. Air Force Summer Faculty Fellowships. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the author(s) and do not necessarily reflect the views of the sponsoring agencies. CITATION : E.J. Tervo, et al., “High thermal conductivity in polaritonic SiO2 nanoparticle beds, (Materials Horizons, 2016).\nhttp://dx.doi.org/10.1039/c6mh00098c Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30221-0181 USA Media Relations Contacts : John Toon (404-894-6986) ( jtoon@gatech.edu ) or Ben Brumfield (404-385-1933) ( ben.brumfield@comm.gatech.edu ). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News 404-894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}