{"text": "Machine Learning Advances Materials for Separations, Adsorption, and Catalysis | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMachine Learning Advances Materials for Separations, Adsorption, and Catalysis\nMachine learning is helping accelerate the development of highly tunable materials known as metal-organic frameworks.\nFacebook\nTwitter\nEmail\nThe vial shown contains a blue powder, HKUST-1, a metal-organic framework (MOF) material. (Credit, Tania Evans, Georgia Tech)\nNov 09, 2020\n— Atlanta, GA\nAn artificial intelligence technique — machine learning — is helping accelerate the development of highly tunable materials known as metal-organic frameworks (MOFs) that have important applications in chemical separations, adsorption, catalysis, and sensing.\nUtilizing data about the properties of more than 200 existing MOFs, the machine learning platform was trained to help guide the development of new materials by predicting an often-essential property: water stability. Using guidance from the model, researchers can avoid the time-consuming task of synthesizing and then experimentally testing new candidate MOFs for their aqueous stability. Already, researchers are expanding the model to predict other important MOF properties.\nSupported by the Office of Science’s Basic Energy Sciences program within the U.S. Department of Energy (DOE), the research was reported Nov. 9 in the journal\nNature Machine Intelligence . The research was conducted in the\nCenter for Understanding and Control of Acid Gas-Induced Evolution of Materials for Energy\n(UNCAGE-ME), a DOE Energy Frontier Research Center located at the Georgia Institute of Technology.\n“The issue of water stability with MOFs has existed in this field for a long time, with no easy way to predict it,” said\nKrista Walton , professor and Robert \"Bud\" Moeller faculty fellow in Georgia Tech’s\nSchool of Chemical and Biomolecular Engineering . “Rather than having to do the synthesis and experimentation to figure this out for each candidate MOF, this machine learning model now provides a way to predict water stability given a set of desired features. This will really speed up the process of identifying new materials for specific applications.”\nMOFs are a class of porous and crystalline materials that are synthesized from inorganic metal ions or clusters connected to organic ligands. They are known for their easily tunable components that can be customized for specific applications, but the large number of potential combinations makes it difficult to choose MOFs with the desired properties. That’s where artificial intelligence can help.\nMachine learning is playing an increasingly important role in materials science, said\nRampi Ramprasad , professor and Michael E. Tennenbaum Family Chair in the Georgia Tech School of\nMaterials Science and Engineering\nand\nGeorgia Research Alliance\nEminent Scholar in Energy Sustainability.\n“When materials scientists plan the next set of experiments, we use the intuition and insights that we have accumulated from the past,” Ramprasad said. “Machine learning allows us to fully tap into this past knowledge in the most efficient and effective manner. If 200 experiments have already been done, machine learning allows us to exploit all that has been learned from them as we plan the 201st experiment.”\nBeyond experimental data, machine learning can also use the results of physics-based simulations. And unlike simulations, the results from machine learning models can be instantaneous. The machine learning algorithm improves as it receives more information, he noted, and both negative and positive results are useful.\n“Great discoveries are as important as not-so-exciting discoveries — failed experiments — because machine learning uses both ends of the spectrum to get better at what it does,” Ramprasad said.\nThe machine learning model used information Walton and her research team had gathered on hundreds of existing MOF materials, both from compounds developed in her own lab and those reported by other researchers. To prepare the information for the model to learn from, she categorized each MOF according to four measures of water stability.\n“The couple hundred data points used to build the model represented years of experiments,” Walton said. “I spent basically the first half of my career working to understand this water stability problem with MOFs, so it’s something we have studied extensively.”\nUsing the model, researchers who are developing new adsorbents and other porous materials for specific applications can now check their proposed formulas to determine the likelihood that a new MOF would be stable in the presence of water. That could be particularly helpful for researchers who don’t have this particular expertise or who don’t have easy access to experimental methods for examining stability.\n“The MOF community is diverse, with a variety of subfields. Not everyone has the chemical intuition about which materials’ features lead to good framework stability, and experimental evaluation often requires specialty equipment that many labs may not have or wouldn’t otherwise need for their specific subfield. However, with good predictive models, they wouldn’t necessarily need to develop it to choose a material for a specific application,” Walton said. “This capability potentially opens up this field to a broader group of researchers that could accelerate application development.”\nWhile screening for water stability is important, Ramprasad says it’s just the beginning of the potential benefits from the project. The machine learning model can be trained to predict other properties as long as a sufficient amount of data exists. For instance, the team is already teaching their model about factors affecting methane absorption under varying levels of pressure. In that case, simulations will provide much of the data from which the model will learn.\n“We will have a very strong predictor that will tell us if a new MOF would be stable under aqueous conditions and a good candidate for methane uptake,” he said. “What we are doing is creating a universal and scalable machine learning platform that can be trained on new properties. As long as the data is available, the model can learn from it, and make predictions for new cases.”\nIn addition to those already mentioned, recent Georgia Tech postdoctoral fellow Rohit Batra and Georgia Tech graduate students Carmen Chen and Tania G. Evans were also coauthors on the\nNature Machine Intelligence\npaper.\nRamprasad has experience with machine learning techniques applied to other materials and application spaces, and recently coauthored a review article, “Emerging materials intelligence ecosystems propelled by machine learning,” about a range of artificial intelligence applications in materials science and engineering. Intended to demystify machine learning and to review success stories in the materials development space, it was published, also on Nov. 9, 2020, in the journal\nNature Reviews Materials .\nIn addition to Ramprasad, coauthors on the\nNature Review Materials\npaper included Batra and Le Song, associate professor in the Georgia Tech College of Computing.\nThis work was supported as part of the Center for Understanding and Control of Acid Gas-Induced Evolution of Materials for Energy (UNCAGE-ME), an Energy Frontier Research Center funded by the U.S. Department of Energy, Office of Science, Basic Energy Sciences under award no. DE-SC0012577.\nCITATION : Rohit Batra, Carmen Chen, Tania G. Evans, Krista S. Walton, and Rampi Ramprasad, “Prediction of water stability in metal–organic frameworks using machine learning.” ( Nature Machine Intelligence , 2020)\nhttps://doi.org/10.1038/s42256-020-00249-z\nCITATION : Rohit Batra, Le Song, and Rampi Ramprasad, “Emerging materials intelligence ecosystems propelled by machine learning.” ( Nature Reviews Materials , 2020)\nhttps://www.nature.com/articles/s41578-020-00255-y.\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : John Toon (404-894-6986) (jtoon@gatech.edu)\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}