{"text": "New Georgia Tech Environmental Science Degree Launches | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNew Georgia Tech Environmental Science Degree Launches\nThe interdisciplinary Environmental Science (ENVS) degree program, developed by faculty in the Schools of Earth and Atmospheric Sciences and Biological Sciences, is now enrolling students interested in a wide variety of environment-related careers.\nFacebook\nTwitter\nEmail\nJun 13, 2023\nGeorgia Tech’s newest interdisciplinary degree program, the\nEnvironmental Science B.S. degree\n(ENVS), developed jointly by faculty of the\nSchool of Earth and Atmospheric Sciences\nand the\nSchool of Biological Sciences , has launched and is now enrolling students.\nThe ENVS degree will provide a strong foundation in the basic sciences, requiring core content in mathematics, physics, chemistry, biology, earth sciences, and environmental policy. Flexible electives in upper-level coursework will allow students to customize their program of study to their interest and career goals.\nA launch event for the degree program will take place at the Kendeda Building on the afternoon of Friday, August 25, 2023.\n“The new degree will prepare students to be future leaders who are well-versed on how the Earth's systems can be influenced by human activity and contribute to human well-being,” says\nGreg Huey , professor and chair of the School of Earth and Atmospheric Sciences. “Graduates will be positioned to be leaders in industry, academia, education, and communication to create innovative solutions to the most significant environmental challenges of our time.”\nTwo faculty members in the School of Earth and Atmospheric Sciences (EAS) and a faculty member in the School of Biological Sciences will serve as inaugural leadership:\nJennifer Glass , associate professor, is program director;\nSamantha Wilson , academic professional, is director of Undergraduate Studies; and\nLinda Green , senior academic professional in the School of Biological Sciences, is director of Experiential Learning.\nThe foundational science classes in this new degree will be complemented by courses in Public Policy and City Planning, including\nGeographical Information Systems (GIS)\nand\nEnvironmental Policy and Politics ,\nbefore opening up and providing students with flexibility in course options to better fit their career paths and interests.\n“Past EAS students have been interested in careers related to environmental consulting, environmental law, and continuing their studies in graduate school,” Wilson says. “The variety of environmental career paths was the driver behind allowing students to diversify their options within the degree.”\n“This degree will give Georgia Tech students a unique opportunity to customize their environmental science program of study to their interests and career goals in science, policy, public service, non-profit, government, industry, academia, or beyond,” adds Glass. “We are committed to building an academic community in ENVS that values student leadership, diversity, inclusion, equity, accessibility, and belonging.”\nHands-on learning opportunities will include field station experiences and field trip excursions, study abroad programs, and internships, Green says. “This major sustains the Institute’s strategic plan to lead by example, champion innovation, and connect globally — particularly in an area so critical as addressing Earth’s environmental issues.”\nGlass added that the Schools of Chemistry, Biological Sciences, and Earth and Atmospheric Sciences are currently\nrevamping several classes\nto meet\nUnited Nations Sustainable Development Goals (SDGs) . Students will advance to be global leaders of environmental solutions that draw upon the U.N. Sustainable Development Goals and incorporate awareness of environmental justice issues.\n“We can’t wait for August to celebrate the ENVS launch with our incoming and current students,” Glass says.\nMore information on the Environment Science (ENVS) degree:\nGeneral information:\njennifer.glass@eas.gatech.edu\nCurriculum and enrollment:\nsamantha.wilson@eas.gatech.edu\nCo-curricular initiatives:\nlinda.green@gatech.edu\nLearn more: Three new EAS undergraduate degrees\nBeginning Summer 2023, prospective and current Georgia Tech students will have three new Bachelor of Science degrees to choose from in the\nSchool of Earth and Atmospheric Sciences . The expanded undergraduate offerings target a wider range of job and research opportunities — from academia to analytics, NASA to NOAA, meteorology to marine science, climate and earth science, to policy, law, consulting, sustainability, and beyond.\nThe\nBoard of Regents of the University System of Georgia\nhas approved two new specific degrees within the School:\nAtmospheric and Ocean Sciences\n(AOS) and\nSolid Earth and Planetary Sciences\n(SEP). Regents also approved\nEnvironmental Science\n(ENVS) as an interdisciplinary College of Sciences degree between the School of Earth and Atmospheric Sciences and the\nSchool of Biological Sciences . The existing Earth and Atmospheric Sciences B.S. degree will sunset in two years for new students.\nLearn more.\nRelated links\nSchool of Earth and Atmospheric Sciences to Offer Three New Undergraduate Degre…\nCollege of Sciences Courses Spotlight UN Sustainable Development Goals\nUndergraduate Student Research Round-up: Summer Across the College of Sciences\nContact\nWriter: Renay San Miguel\nCommunications Officer II/Science Writer\nCollege of Sciences\n404-894-5209\nEditor: Jess Hunt-Ralston\nEmail\nrenay.san@cos.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}