{"text": "Reflection Speakers Highlight Tech Community | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nReflection Speakers Highlight Tech Community\nStudents selected as reflection speakers have the honor of talking about their Georgia Tech experience.\nFacebook\nTwitter\nEmail\nReflection Speakers: Lama Bahanan, Aayushi Mody, and Dakshitha Anandakumar\nDec 14, 2022\n— Atlanta, GA\nCommencement is one of the happiest days of the year for Georgia Tech graduates. For the students selected as reflection speakers, it presents a unique opportunity to address their fellow graduates, professors, and family members.\nAt each of Georgia Tech’s Fall Commencement ceremonies (bachelor’s, master’s, and Ph.D.), a graduating student is given three minutes to deliver an inspiring message. The bachelor’s speaker is Lama Bahanan, a biomedical engineering major. The master’s speaker is Aayushi Mody, an architecture major. And the Ph.D. speaker is Dakshitha Anandakumar, also a biomedical engineering major.\nStudents must apply to become a reflection speaker. A panel of faculty, staff, and students selects the finalists, who present a full version of their speech to the committee. Those selected as reflection speakers are required to work with Tech’s Communication Center in preparation for the ceremony.\nLama Bahanan\nLama Bahanan has always enjoyed public speaking, and she did it often back home in Saudi Arabia. At Tech her speaking opportunities were mostly in her classes, but now she has the ultimate speaking opportunity at Commencement.\n“I truly believe that the Tech community is like no other,” she said. “Whatever problem you may have, there is always a source to support you.” That’s why she co-founded the Saudi Student Association, to help students like her feel more comfortable and to encourage them to meet new people from different countries.\nAfter graduating she will return to Saudi Arabia, where she will be an associate consultant with Strategy& - PwC in Riyadh. She’s also looking forward to being near her family again.\n“I really miss my family,” she said. “My mom encouraged me to be independent and do things on my own. My dad encouraged me to be curious and to try new experiences. I owe everything in my life to them.”\nBahanan’s parents and older brother will celebrate Commencement with her.\nAayushi Mody\nAayushi Mody applied to be a reflection speaker because she thought it would be a unique way to connect with and inspire her fellow students.\n“Everyone involved in the speaker selection process was very supportive,” she said. “The best part was when I informed my lab friends about my selection — they were all so happy.”\nHer speech is about a particular experience at Georgia Tech and how lessons from that experience can be adopted by all graduates to help them in their lives beyond Tech.\nAfter earning a master’s degree in architecture, Mody plans to practice sustainable architecture and design high-performing buildings to reduce negative environmental impacts.\nThe native of Surat, Gujarat, India wishes her family could be with her on Commencement. “I’m missing them badly,” she said. She will celebrate with her fiancé and close friends. “Without them, this journey would have been very different and difficult.”\nDakshitha Anandakumar\nFrom the start, Dakshitha Anandakumar knew the Georgia Tech community would be the theme of her reflection speech.\n“The community empowered me to be brave and chase opportunities without being tied down by social norms,” she said. “I have been fortunate to have met some of the most inspiring people here through campus organizations and classes who have all been champions for diversity, equity, and inclusion. I am sure several others in the graduating cohort share similar experiences, and through my speech I want to encourage them to continue working for the betterment of the community.”\nAnandakumar said the last couple of years of graduate school have passed quickly and working on the reflection speech gave her the opportunity to look back at her journey.\n“It was a good reminder that tough times don’t last but tough people do,” she said.\nAnandakumar is from Bashettyhalli, a village in Karnataka, a southern state of India. Her parents will travel to Atlanta, for the first time, to celebrate Commencement with her.\n“I cannot wait to see how proud they will be to watch me give the reflection speech,” she said. “My parents have sacrificed so much so that I could study here. I hope watching me graduate will make them feel that it was all worth it.”\nAfter graduating she will work as a research scientist at SiriusXM. In her free time, she plans to be a volunteer teacher at NGOs in India.\nAdditional Images\nRelated links\nGeorgia Tech Commencement\nCommencement Wishes\nFall 2022 Commencement Speakers\nWhat Not to Wear: Commencement Edition…and Other Tips For Your Graduation Day\nBreaking Down the Cap and Gown\nBeth Quay: Taking Care of Unfinished Business\nBalancing Parenthood and the Pursuit of a Ph.D.\nMission Accomplished: An Army Veteran’s Path to Commencement at Georgia Tech\nContact\nVictor Rogers\nInstitute Communications\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}