{"text": "Husbands Fealing Appointed Assistant Director of NSF Directorate for Social, Behavioral, and Economic Sciences | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nHusbands Fealing Appointed Assistant Director of NSF Directorate for Social, Behavioral, and Economic Sciences\nHusbands Fealing’s appointment begins on April 22.\nFacebook\nTwitter\nEmail\nDean Husbands Fealing\nFeb 29, 2024\nKaye Husbands Fealing, dean of Georgia Tech’s Ivan Allen College of Liberal Arts, has been appointed assistant director of the National Science Foundation (NSF) Directorate for Social, Behavioral, and Economic Sciences (SBE).\nHusbands Fealing first joined Georgia Tech as professor and chair of the School of Public Policy in 2014 before being named dean in 2020.\nUnder her leadership as dean, the College has seen consistent growth in enrollment and sponsored research, development of new degrees and programs, and various programs consistently earn national rankings. Her time as the chair of the School of Public Policy resulted in similar growth, achievements, and impact.\nShe also co-chaired the Arts@Tech Institute Strategic Planning Committee and has served on the Institute for Data Engineering and Science Council and the Intellectual Property Advisory Board.\nHusbands Fealing is an elected member of the American Academy of Arts and Sciences and an elected fellow of both the National Academy of Public Administration and the American Association for the Advancement of Science (AAAS). She was awarded the 2023 Carolyn Shaw Bell Award from the American Economic Association’s Committee on the Status of Women in the Economics Profession, as well as the 2017 Trailblazer Award from the National Medical Association Council on Concerns of Women Physicians. She is a member of the International Women’s Forum, Georgia Chapter. She serves on AAAS’ executive board and is a board member for the Society for Economic Measurement.\n“From her time as chair to her service as dean, Dean Kaye’s decade of service at Tech has left an undeniable mark on the Institute, and I am proud to have served alongside her,” said Steve McLaughlin, provost and executive vice president for Academic Affairs. “She is a trusted leader and an accomplished administrator and scholar, and we wish her well in this next chapter at the National Science Foundation.”\nHusbands Fealing came to Tech from the Humphrey School of Public Affairs at the University of Minnesota. Before that, she served as a study director at the National Academy of Sciences in Washington, D.C. Her career began at Williams College, where she started as assistant professor in the Economics Department and left after 20 years as the William Brough Professor of Economics. Additionally, she held visiting professorships at Smith College and Colgate University, and a research associate position at MIT.\nHusbands Fealing has a long history with the NSF, having served in several different capacities including as\nthe inaugural program director for NSF’s Science of Science and Innovation Policy program and as the co-chair of the Science of Science Policy Interagency Task Group, chartered by the Social, Behavioral, and Economic Sciences Subcommittee of the National Science and Technology Policy Council. She also served as an economics program director at NSF.\nHusbands Fealing also serves as chair of NSF’s Committee on Equal Opportunities in Science and Engineering and as a member of NSF’s Directorate of STEM Education Advisory Committee.\nSBE is one of eight NSF directorates and supports basic research focused on human behavior and social organizations, as well as how social, economic, political, cultural, and environmental forces affect the lives of people from birth to old age, and how people, in turn, shape those forces. The directorate is also home to one of the 13 statistical agencies in the United States, the National Center for Science and Engineering Statistics. Husbands Fealing’s appointment begins on April 22.\nProvost McLaughlin will announce plans for interim leadership for the College soon, along with more details on a search for the next dean.\nContact\nOffice of the Provost\nEmail\nprovostsoffice@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}