{"text": "Technique May Improve Lung Delivery of Bacteria-Killing Phage | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nTechnique May Improve Lung Delivery of Bacteria-Killing Phage\nA new technique could provide an alternative to antibiotics for lung infections.\nFacebook\nTwitter\nEmail\nTechnique May Improve Lung Delivery of Bacteria-Killing Phage\nJul 16, 2018\n— Atlanta, GA\nA new delivery system for bacteriophages—viruses that selectively attack harmful bacteria—could help give doctors a new way to battle lung infections that threaten older patients and people with cystic fibrosis.\nPhage therapy is a promising alternative to antibiotics because it attacks specific pathogens, does not harm the body’s normal contingent of bacteria and won’t contribute to multi-drug resistance. However, therapeutic bacteriophages can be difficult to purify and challenging to deliver to the site of an infection, especially when that location is the lungs.\nA research team headed by the Georgia Institute of Technology has demonstrated a new delivery technique that uses dry, porous microparticles coated with phages. In animal testing, the phage-coated polymer particles successfully treated pneumonia in infected mice and dramatically reduced bacterial levels in an animal model of cystic fibrosis. The technique might one day allow delivery of the dry-powder phage using a device similar to a common inhaler.\nReported July 16 in the journal\nNature Biomedical Engineering , the research was supported by the National Institutes of Health and The Children’s Healthcare of Atlanta Pediatric Technology Center, a partnership between Georgia Tech and Children’s Healthcare of Atlanta.\n“Phage delivery is an area where the right type of material could make a difference in therapeutic applications,” said\nAndrés García , the Rae S. and Frank H. Neely Chair and Regents' Professor in Georgia Tech’s\nGeorge W. Woodruff School of Mechanical Engineering.\n“We set out to engineer a biomaterial carrier that would keep the phage active while delivering them deep into the lungs in a uniform fashion. This is a key step in moving this potential therapy forward.”\nPhage therapy has generated more interest as concerns about antibiotic use has grown. Specific bacteriophages can target bacteria such as Pseudomonas aeruginosa – which causes some forms of pneumonia and is the major pathogenic bacteria in cystic fibrosis – without affecting other bacteria. Phage activity propagates beyond the coated particles, but is limited by the host population, so once the targeted bacteria are eliminated, the phage disappear.\nResearchers have previously used a nebulizer to deliver wet phage mixtures to the lungs, but that approach is inefficient and inconvenient for patients. As an alternative, García and his collaborators developed a microparticle carrier made from the same polymer material used in dissolving sutures. They made the porous particles large enough to avoid rapid clearance by the body, but light enough to be delivered deep into the lungs.\nThe phage are incubated on the particles, then dried. When introduced into animal lungs as a puff of dry powder, the phage begin attacking the bacteria. For mice infected with pneumonia, the phage carried on the particles cleared the infection – while untreated mice died. A significant reduction in bacterial populations was observed in transgenic mice whose lungs simulated conditions typical of cystic fibrosis.\n“When we immobilized the phage on the particles, we could retain good activity for days – as long as two weeks at room temperature,” García said. “We could store these particles, and when we delivered them to mice, get good distribution through the lungs. We believe the particles help stabilize the phage and improve the distribution in the lungs.”\nNael McCarty, Marcus Professor of Cystic Fibrosis and director of the Emory+Children's Cystic Fibrosis Center of Excellence at Emory University and Children’s Healthcare of Atlanta, and one of the study’s co-authors, said the development of the delivery technique potentially advances the use of phage in treatment of cystic fibrosis.\n“Cystic fibrosis is a common, life-limiting genetic disorder that affects many organ systems, but the most important impact on human health is chronic infections of the lung.  Bacterial pneumonia that is resistant to multiple drugs is a challenge we must deal with frequently with cystic fibrosis,” he said. “Treatment with antibiotics often makes space for other opportunistic bacteria to take hold. Phage therapy could complement existing therapies without worsening antibiotic resistance. The technique developed and tested through this important collaboration could address one of the major challenges we have with phage therapy, which is delivery.”\nThe phage-coated microparticles were more effective at clearing bacteria than dried phage particles by themselves. The polymer material is biodegradable and was cleared from the animals within a few days. The technique was successful in attacking different strains of bacteria within biofilms, and the researchers did not see evidence that the bacteria were developing resistance.\nThough the phage aren’t believed to attack mammalian cells, they can create an immune system response, and produce a toxins that can be harmful. They are grown in cultures containing the bacteria they attack, so separating them at the purity levels required is another challenge.\nAmong the next steps are to test the particle-delivery technique in larger animals and against mixtures of bacteria, which often infect humans. The technique must also be tested against chronic infections, which often are seen in persons with cystic fibrosis.\nIn addition to those already mentioned, the paper includes first author Rachit Agarwal, now at the Centre for BioSystems Science and Engineering of the Indian Institute of Science; Christopher Johnson from the Wallace H. Coulter Department of Biomedical Engineering at Georgia Tech and Emory University; Barry Imhoff from the Department of Pediatrics and Center for Cystic Fibrosis and Airways Disease Research at Emory University; and Rodney Donlan from the Biofilm Laboratory at the Centers for Disease Control and Prevention.\nThis  work  was  funded  by  the  National  Institutes  of  Health  (R01  AR062920  [AJG],  F30  AR069472  [CTJ],  S10  OD016264  [AJG]),   a  research  partnership  between  Children’s  Healthcare  of  Atlanta  and  the  Georgia  Institute  of  Technology, and by the Children’s Pediatric Research Alliance.  The  content  is  solely  the  responsibility  of  the  authors  and  does  not  necessarily  represent  the  official  views  of  the  National  Institutes  of  Health  or  the  Centers  for  Disease  Control  and  Prevention.\nCITATION : Rachit Agarwal, et al., “Inhaled bacteriophage-loaded polymeric microparticles ameliorate acute lung infections,” ( Nature Biomedical Engineering , 2018). https://www.nature.com/articles/s41551-018-0263-5\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : John Toon (404-894-6986) (jtoon@gatech.edu).\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}