{"text": "What Secrets Do Our Voices Keep? | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nWhat Secrets Do Our Voices Keep?\nIn Georgia Tech's new Voice + Research Lab, interdisciplinary researchers explore the voices' myriad roles in music, marketing, technology, culture, medicine, and more.\nFacebook\nTwitter\nEmail\nDec 12, 2023\nIn Georgia Tech's new Voice + Research Lab, interdisciplinary researchers explore the voices' myriad roles in music, marketing, technology, culture, medicine, and more.\nUnless we're sick and lose it — or are once again shocked by how different it sounds on a recording versus in our heads — most of us don't think about our voices too often. They're such a familiar and integral aspect of our lives that we take them for granted.\nHowever, it's precisely because of this prominent role in our lives that one group of Georgia Tech researchers is studying the voice. At the new Voice + Research Lab,\nAndrea Jonsson\nand her colleagues explore our voices not for the secrets that we tell but for the secrets that our voices keep.\n\"I branded it 'Voice Plus' to evoke the question of 'Voice plus what? Technology, history, culture?' It can be so many different things,\" said Jonsson, an associate professor of French at the\nSchool of Modern Languages.\n\"The lab will be an innovation hub for theories and methodologies around the voice.\"\nFrom accents and cultural questions in language studies to vocal range and timbre analyses in the School of Music or sound and marketing in the Scheller College of Business, the jumping-off points are endless, Jonsson says.\nShe explains why it's important to approach the voice with an interdisciplinary lens, how voice and technology intersect, and how voice studies can help students develop new perspectives and better navigate the world around them.\nWhy is it essential to study voices across disciplines?\nAJ: We talk about sound and pitch and volume, but we also use voice metaphorically. There are human voices, but there are also literary and narrative voices. And we're also digitizing voices. Now, we have deep fakes and many ways to recreate the human voice. But none of it is really quite right, not quite yet. So, it brings in many different disciplines.\nI study the cultural and media studies side, but there's also a technology side, with voice recordings, autotune, and the software you need to make music. We can also talk about voices through a linguistics lens — word choice, accents, and dialects. Or you can take a film studies approach. You can explore dialogue, who talks to whom in the movie, and how they say it. What do they say? There's also speech pathology and gender dysmorphia, where someone's voice does not connect to their gender identity, so they need therapy or surgery. In that way, studying voices connects with the medical field as well.\nThe voice is such a cultural and personal part of a person; you have to consider background, history, culture, and language. It's just so wide-ranging. It's a many-headed point of query.\nHow do voice and technology intersect?\nAJ: We've mentioned music recording and deep fakes. But another example I researched is train announcers in France.\nFor 30 years, one person recorded arrivals, departures, and so on in a robotic voice. Now they've spliced her voice like we've done with Siri and Alexa. The original woman created all the sounds but no longer records them. Her name was Simone, and now they call her E-mone because she's an electronic version. So it was interesting to explore that and think about how many atmospheric voices there are in public transport and areas where you need information — places where you're not necessarily being told anything that you'll remember, but it's said in a certain way.\nI'm also working on a book on intimacy and vulnerability in women's voices in French pop culture. All the chapters are on amplified voices, meaning anyone using a microphone. So, I have content on pop music, podcasts, ASMR, stand-up comedians, etc. Many stand-up comedians use social media and voice filters, which is interesting.\nVoice and technology will be a rich field for me moving forward. I didn't see that coming, but that's why it's exciting.\nHow can voice studies help students succeed?\nAJ: Voice is one of those areas that causes you to think about things you haven't thought about before. It's a way to engage with theory, philosophy, and critical thinking that is not necessarily about the content.\nYou can talk about a song, you can talk about the chord progressions, the text, the words, but then once you talk about the voice — What is it about the voice? What is it about the timbre, the cadence? — it takes away the supremacy of the visual.\nMany lenses we look through are visual, and unfortunately, that can be harmful to people. We can get ageism, racism, sexism — all the isms. And you still have that with voices, but the voice doesn't say anything about what you look like, right? Maybe sometimes, but it's just a different point of reference to start from, and it opens up different questions that are not as harmful. It can prompt a deeper, more humanist way of thinking that students might not have thought about before. It gets them to think outside the box.\nIt's also vital to understand how our voices work and how they're heard and interpreted across socioeconomic class, race, ethnicity, and gender, because it's always going to come down to that.\nWhat's interesting about interdisciplinary voice studies is that the voice is very material. It's linked to the somatic body, but it's also not. It's also out and acoustic, so it's both. And this prompts questions of \"Where does the voice come from? What is it about me that makes me speak this way?\" It does help us understand ourselves.\nFor example, many people don't think about it, but there are different registers. You don't talk to your friends the same way you talk to your boss at work. Often, students don't understand that and might come across as rude or less poised or mature because of how they speak, which can cause them to be written off. So, understanding what you sound like and how you code-switch in different cultural, social, or professional settings will help anyone professionally.\nGet Involved! The Voice + Research Lab is looking for collaborators. Jonsson invites any interested students or faculty members\nto reach out\nto learn more.\nContact\nDi Minardi\nIvan Allen College of Liberal Arts\nEmail\ndminardi3@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}