{"text": "NASA Pushes Exploration of Oceans in Our Solar System in Georgia Tech-Led Alliance | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNASA Pushes Exploration of Oceans in Our Solar System in Georgia Tech-Led Alliance\nEnvision a yellow submarine on a rocket to Europa as a future highpoint of a research project led by Georgia Tech to search for life in our solar system's oceans.\nFacebook\nTwitter\nEmail\nUnder the thick ice crust of Saturn's moon Enceladus flows water. Could it harbor life? A new NASA-funded research alliance called Oceans Across Space and Time wants to know. Credit: NASA\nNov 01, 2018\n— Atlanta, GA\nNASA Astrobiology Program awards $7 million to Georgia Tech-led Oceans Across Space and Time alliance to intensify the search for life in our solar system’s present and past oceans\nNASA has navigated our solar system with spacecraft and landers, but still, our celestial neighbors remain vast frontiers, particularly in the search for life. Now, an alliance of researchers will accelerate the quest to find it.\nThe\nNASA Astrobiology Program has announced\nthe establishment of the Network for Life Detection,  NFoLD , which connects researchers to pursue the detection of life and clues thereof on our neighboring planets and their moons. NFoLD includes an oceanic research alliance led by the Georgia Institute of Technology.\nIt is called\nOceans Across Space and Time, OAST , and has received a $7 million NASA Astrobiology grant with the long-range goal of extracting secrets from present and past oceans on Mars, Jupiter’s icy moon Europa, and Saturn’s moon Enceladus. But OAST will also ramp up the study of the conditions that spawned first life in Earth’s oceans.\n“With OAST, we finally hit the perfect mix of people, science questions, and supporting activities to really go after some of the most important unknowns in astrobiology,” said Britney Schmidt,  OAST’s principal investigator  and an  assistant professor in Georgia Tech’s School of Earth and Atmospheric Sciences .\nNFoLD is one of five new Research Coordination Networks that the NASA Astrobiology Program has announced. The other RCNs pull together research communities that include the study of early Earth and its chemistry, evolution, distant habitable worlds, and exoplanet systems.\nYellow submarine on Europa\nOceans Across Space and Time could one day help NASA put a submarine on a rocket to Europa to look for life in the ocean beneath its ice crust. Or OAST could join NFoLD colleagues to help NASA explore parched Martian landscapes that once were oceans.\nBut the path to our space neighbors leads through studying Earth. Field and lab experiments on our planet will divulge more knowledge about chemical and biological evolutionary strategies so that researchers can develop instruments and methodology that reliably detect signs of life on other planets and moons.\n\"We don't yet have a slam-dunk measurement that we could make on another planet to definitively say ‘this is life,’” said Schmidt, who coordinates OAST and led the application efforts to establish it. “OAST’s main goal is to take a suite of technologies into the field on Earth to make measurements side-by-side while returning samples to the lab to understand.”\nThen, when that is very finely honed, send it aloft.\nCrucial target practice\nOne of NFoLD’s goals is to participate in future astrobiology space missions from the start so that they can successfully identify target spots on other planets or moons where signs of life could actually be detected if present.\n\"A major challenge for life detection is where on a given planet or moon to look for life,” said  Jeff Bowman, deputy principal investigator of OAST and an assistant professor at Scripps Institution of Oceanography  at UC San Diego. “The density of life on our own planet extends across several orders of magnitude. Look for life in the wrong place and Earth could appear lifeless.”\nOAST’s team has the expertise to bridge earthly data and celestial goals.\nMany of its 18 co-investigators and their teams have already explored biogeochemistry in our own planet’s eons-old rock record, in the atmosphere, the oceans, and the icecaps with an eye to extrapolating the data to other worlds. Other OAST researchers have helped design Mars probes or build robotic submarines intended to one day dive into Europa’s subsurface ocean to detect life or at least a hint of it.\n“OAST researchers have expertise in detecting and characterizing life in a variety of harsh environments like the Antarctic, the deepest ocean trenches, and lakes with extreme chemistry and salinity,” Bowman said. “We will leverage this expertise to understand how life may be distributed in different ocean environmental extremes around the solar system.”\nDiverse member institutions\nOAST includes investigators from Scripps Institution of Oceanography at the University of California San Diego; the University of Kansas; Louisiana State University; the Massachusetts Institute of Technology; Stanford University; the Blue Marble Space Institute of Science; the University of Texas; Colgate University; the University of California, the University of Central Florida; the University of Auckland; York University; the University of Otago, and the New Zealand National Institute of Water and Atmospheric Research.\n“I'm particularly proud of the high number of women and pre-tenure scientists we've engaged through our project,” said Schmidt. Five leaders in OAST are women, and 12 researchers are early career or pre-tenure. The project will also support graduate and undergraduate students as well as postdoctoral researchers through the NASA Postdoctoral Program.\nLike this article?  Subscribe to our email newsletter\nAlso READ:   Laughing Gas May Have Helped Warm Early Earth and Given Breath to Life\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia relations assistance : Ben Brumfield (404) 660-1408, ben.brumfield@comm.gatech.edu\nWriter:  Ben Brumfield\nAdditional Images\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}