{"text": "Eclipse Reflections from the Experts | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nEclipse Reflections from the Experts\nFaculty members provide their thoughts on witnessing the solar eclipse.\nFacebook\nTwitter\nEmail\nThe Diamond Ring effect from Clayton, Georgia (Photo: Zonglin \"Jack\" Li, civil engineering student)\nAug 22, 2017\n— Atlanta, GA\nAtlanta experienced 97 percent coverage during Monday’s solar eclipse. But as seasoned eclipse chasers warned, “close is not close enough.” That’s why many of Georgia Tech’s planetary researchers, and others, travelled away from campus to visit the narrow path of totality throughout the country.\nWe asked them what they saw and felt during the celestial event.\nCarol Paty, Associate Professor, School of Earth and Atmospheric Sciences\nLocation: Kinnear, Wyoming\nHaving the opportunity to witness a total solar eclipse with my family was truly incredible. We stood anxiously in a beautiful field hoping that the light clouds would clear. I knew a few of the people around me, but most were friends of friends newly introduced.\nThe sparse clouds abated, yielding an open sky for a picturesque view of the entire eclipse. It was, for lack of a better word, magnificent. The steady motion of the moon slowly overtook the sun to the sounds of children playing and folks excitedly talking around the various telescopes and projection apparatuses.\nThen the sky went dark in all directions and the temperature dropped about 13 degrees. We saw the solar corona, ever present but always hiding in the glare of the solar disk, shining in the sky along with several flanking planets. Those two minutes seemed to stand still, and also speed by. There were goose bumps both from the rapid chill and momentary suspension of reality. And then the sun peeked back from behind that black circle and it was no longer night.\nWhat struck me was just how quickly everything happened and realizing that literally millions of people across the country were witnessing the same unique event within tens of minutes of each other. It was inspiring to think of so many united around a moment of science with joy and enthusiasm.\nJames Wray, Associate Professor, School of Earth and Atmospheric Sciences\nLocation: Athens, Tennessee\nOur plan was to check the forecast the night before, then decide where to drive. We found perfect skies expected for Athens, a small town just off I-75 near the center of the zone of totality. It was packed, and I spotted at least a half dozen Georgia Tech T-shirts. It was awesome to see everybody wearing space-themed attire, carrying eclipse glasses and discussing astrophotography.\nAs totality approached, my wife and her sister staked out a nice spot to lie on the grass and watch from there. But I found I was too excited to sit or lie down! Within ten minutes on either side, it started to get noticeably darker — not like twilight, still the same colors as normal daytime — just dimmer. I said it felt like we were on a movie set where they were trying to simulate daylight, but not getting it quite right. Soon the dusk-singing cicadas became notably louder. My wife, Maggie, did her Ph.D. on insect behavior. She pointed out a moth that had just landed in front of her. They are nocturnal.\nAt the moment totality began, the crowd erupted into cheers. Once it quieted down, we could hear the crickets’ nighttime chorus. The eclipse itself was beautiful. The cool thing was to look around and see that it was as dark as nighttime.\nIt was over too soon! When the sun’s edge reappeared, I checked my watch and confirmed that we had indeed gotten the promised nearly three minutes of totality, but boy did it fly by.\nAll in all, I think it was kind of like visiting an amusement park. You spend a lot of time traveling to get there, then a lot more time standing around in the heat waiting, and are rewarded with two to three minutes of exhilaration.\nI think maybe the best part about this was seeing how it brought so many people together, cutting across all age or ethnic boundaries.\nLisa Yaszek, Professor, School of Literature, Communication, and Media\nLocation: Georgetown, Tennessee\nThe crowd in the county park included scientists and Sunday school teachers, grandparents and babies, space nerds and athletes, people of all sexes and colors. Judging from the funny hats, we even had a few wizards.\nWhen the eclipse began most people were keeping to themselves under the trees lining the park road. But soon we all ventured onto the road to get a first glimpse of the eclipse through our viewing glasses, marveling at how much the sun suddenly looked like PAC-MAN. It was a hilarious and strangely apt comparison.\nAs the sky got dark and birdsong gave way to cricket noises, more people came together in the road, trading eclipse facts and war stories about The Great Quest to Find Viewing Glasses. Someone said it felt like a weird twilight without shadows. Someone else observed that it looked like sunset, but all the colors were in the wrong places. My husband said, “This must be what it’s like to visit an alien planet.” My son announced that he was extremely sleepy. People laughed and shared viewing glasses with those who never found any.\nWhen totality began a unified cheer echoed through our little park. The Sunday school teacher directed our attention to the chromosphere, and everyone admired the hot pink crescent at the bottom of the moon before moving on to marvel at the brightness of the corona. As the whooping died down and daylight returned, we smiled, and hugged, and thanked each other for being there to celebrate. For a few shining moments, everything felt electric, and completely right, and all good futures were possible. Morris Cohen, Assistant Professor, School of Electrical and Computer Engineering Location: Clayton, Georgia\nI was at Camp Ramah Darom with six Tech students, about 350 people from the general public and the entire undergrad business school from Emory. I had seen an annular eclipse. This was my first total.\nWe got lucky — the sun was uncovered when totality happened, though the sky was half cloudy and an overcast sky rolled in within minutes afterwards. It was fantastic. In those incredible 156 seconds, I was amazed by how clear and bright Venus and Jupiter were. I was amazed by the silence that fell over the entire crowd of people gathered on a softball field. I thought about the people who stood here 99 years ago knowing that this wouldn’t happen again until today, and there was a sense of connection through time to all the people throughout human history who have stared at this incredible sight and wondered.\nI thought about the eclipse bringing together the country like nothing else we’ve experienced in a while. I thought about the opportunity to excite the public about science and space like we haven’t had since the moon landing in 1969. I thought about how happy I was to be with my wife and son but sad that my daughter, who passed away in January at 12 weeks old, could not be here with us.\nJim Sowell, Director of Georgia Tech ’ s Observatory\nLocation: Lake Hartwell, Georgia\nWould I get to see it? Since having taken my first astronomy course some 40 years ago, seeing a total eclipse of the sun was probably the number one item on my astronomical bucket list. But the inconvenience in the dates, the need to travel to distant locales and the high cost always prevented me. For a couple of years, though, the Great American Eclipse has been on my mind.\nCollege of Sciences Dean Paul Goldbart, the college’s communications director Maureen Rouhi and I met in early January to discuss plans for the Georgia Tech community. I spoke to K-12, college students, and senior citizen groups about the coming event. I was interviewed for television, radio, and print media. I gave out close to 1,000 eye-safe glasses to those who so desperately wanted to witness the once-in-a-lifetime event.\nBut would I actually see it myself? I was actually getting excited a couple of days before the event. The morning of the eclipse, while at a secluded spot on Lake Hartwell with my wife, oldest son, and a few close friends, I saw clear blue skies until the eclipse began. Then the clouds appeared. But 10 minutes before totality began, they dissipated.\nI felt the temperature continue to decrease, causing a slight breeze. The color of the reduced sunlight light made me think that the rocks and sand where I was sitting reminded me of photos of the Martian surface.\nAnd then I saw it! I was unprepared for the beauty. I took the glasses off in time to see the diamond ring — three triangular streamers and a bright ring. I heard friends squealing, but I just stared at the stunningly delightful view of the sun and moon. Then Venus joined the scene.\nTwo minutes went by quickly, and suddenly another diamond ring appeared. The color and brightness of the light changed dramatically. It was over, but I had seen it, and I gave a short prayer of thanks for both the experience of the moment and the end of a long, successful quest.\nThomas Orlando, Professor and Director of the Center for Space Technology and Research Location: Atlanta\nAfter seeing the large crowds assembling on campus to view the eclipse, I planned my escape. I retrieved my daughter early from her elementary school and we clambered out onto the roof-top of our home. The pitch was not steep. The view was perfect. And it was…hot. We viewed the long awaited solar eclipse through eyewear sent to me by NASA (which I distributed mostly to my colleagues and the elementary school my daughter attends).\nWe patiently watched the moon progress across the ecliptic plane blocking the view of the sun. The speckle in the glasses was “clear” with some distortions from diffraction, and the progression was, according to my daughter, “pretty slow.”\nSince we were not in the full totality path, there was not total darkness, nor a large temperature change. The light grew dim, a breeze blew and right at the moment of totality, a hawk flew above us. It let out a weak call as if to alert us that we are not the only ones that know and care about planetary trajectories. The hawk perched itself in a nearby tree, we left the roof, the “shadow” moved out to sea, and time continues.\nJud Ready, Principal Research Engineer,\nGeorgia Tech Research Institute\nLocation: On Campus\nI had the distinct privilege of operating two telescopes around the Kessler Campanile. One of them, a 3.5\" Questar with solar filter, provided an up-close and direct image of the solar disc, while a “sun spotter” telescope projected a reflected image of a grapefruit-sized solar disc upon a screen. Both provided interested observers, while the passing clouds would allow it, with a clear view of the encroaching moon, as well as a trio of sunspots along the solar equator.\nSeveral hundred individuals of all ages, from all walks of life, and all manner of scientific understanding, patiently stood in line for a chance to participate in this shared experience and sequentially view the progress of the eclipse with these telescopes. As the celestial event proceeded, the air became noticeably cooler and a light, yet sustained, breeze picked up.  Despite the approximately 98 percent coverage, there was still a fair amount of light available – but not so much that the street lights weren’t fooled into thinking that dusk was approaching as their illumination sensors were activated.\nFor quite some time, large clouds intermittently obscured everyone’s view, and I could feel a bleak sense of consternation among the throng near me. Odds seemed slim that we would be able to see the thin sliver of the solar disc as we approached near-totality. But then, as if by divine providence, the very large cloud that had shielded the sun from view off-and-on for the past half hour, broke apart and there was an audible cheer from many on the Tech Green. It was then followed by a hushed silence during the mutual admiration of the “peak” of this unique celestial occultation.\nThough not technically a once-in-a-lifetime event (I had seen another full solar eclipse in 1984 as an eighth grader in Chapel Hill, North Carolina), this was a much more special event. It was a true joy to aid children, parents, students, casual bystanders and others while enjoying it.\nAdditional Images\nRelated links\nHow Students Reacted to the Eclipse\nHow Students Reacted to the Eclipse (Video)\nContact\nJason Maderer\nNational Media Relations\nmaderer@gatech.edu\n404-660-2926\nEmail\nmaderer@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}