{"text": "Restoring Chemotherapy Sensitivity by Boosting MicroRNA Levels | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nRestoring Chemotherapy Sensitivity by Boosting MicroRNA Levels\nResearchers have restored chemotherapy sensitivity in vitro to a line of human pancreatic cancer cells that had developed resistance.\nFacebook\nTwitter\nEmail\nGeorgia Tech Graduate Research Assistant Mengnan Zhang examines a solution containing pancreatic cancer cells. The research examined the role of microRNA molecules in controlling resistance to chemotherapy drugs. (Credit: John Toon, Georgia Tech)\nMay 27, 2016\n— Atlanta, GA\nBy increasing the level of a specific microRNA (miRNA) molecule, researchers have for the first time restored chemotherapy sensitivity in vitro to a line of human pancreatic cancer cells that had developed resistance to a common treatment drug. If the miRNA molecules can be delivered to cells in the human body – potentially with nanoparticles – the technique might one day be used to battle the chemotherapy resistance that often develops during cancer treatment. A research team at the Georgia Institute of Technology identified the miRNA used in the research with a computer algorithm that compared the ability of different miRNAs to control the more than 500 genes that were up-regulated in drug-resistant cancer cells. The study was reported May 27 in the Nature Publishing Group journal\nCancer Gene Therapy . “We were specifically interested in what role miRNAs might play in developing drug resistance in these cancer cells,” said\nJohn McDonald , a professor in Georgia Tech’s\nSchool of Biology\nand director of its Integrated Cancer Research Center. “By increasing the levels of the miRNA governing the suite of genes we identified, we increased the cells’ drug sensitivity back to what the baseline had been, essentially undoing the resistance. This would suggest that for patients developing chemotherapy resistance, we might one day be able to use miRNAs to restore the sensitivity of the cancer cells to the drugs.” MicroRNAs are small non-coding molecules that function in RNA silencing and post-transcriptional regulation of gene expression. The miRNAs operate via base-pairing with complementary sequences within messenger RNA (mRNA) molecules, silencing the mRNA molecules that control the expression of certain proteins. Roman Mezencev, a senior research scientist in the McDonald lab, began by exposing a line of pancreatic cancer cells (BxPC3) to increasing levels of the chemotherapy drug cisplatin. After each in vitro treatment, surviving cells were allowed to proliferate before being exposed to a higher level of the drug. After approximately a year and 20 treatment cycles, the resulting cell line had a resistance to cisplatin that was 15 times greater than that of the original cancer cells. The next step was to study the genetic changes associated with the resistance, comparing levels of more than 2,000 miRNAs in the cisplatin-resistant line to the original cell line that had not been exposed to the drug. Using a hidden Markov model (HMM) algorithm, they found 57 miRNAs that were either up-regulated or down-regulated, and identified miR-374b as the molecule most likely to be controlling the genes that govern chemotherapy resistance. While previous work by other researchers has shown that miRNAs can provide a mechanism for the development of drug resistance, the Georgia Tech team took the findings a step farther by increasing the expression of miR-374b. When they did, they found that the cells previously resistant to the cisplatin were again sensitive to the drug – almost back to their original levels. Techniques to control protein expression are already being used in cancer therapy, but McDonald believes there may be benefits in targeting the activity higher up in the process – at the RNA level. Studies by the Georgia Tech team and by other researchers clearly show an association between chemotherapy resistance and changes in levels of certain miRNAs. “Molecular evolution is a highly efficient process,” McDonald said. “Our evidence suggests that many of the genes regulated by a single microRNA are involved in coordinated cellular functions – in this case, drug resistance. We believe that microRNAs might be particularly good cancer therapeutic agents because when we manipulate them, we are manipulating suites of functionally coordinated genes.” A next step will be to study the effects of manipulating miRNA levels in animal cancer models. The McDonald research team is currently pursuing this possibility by inserting the microRNAs into tumors using nanoscale hydrogels developed by Andrew Lyon, former chair of Georgia Tech’s School of Chemistry and Biochemistry. McDonald says the study confirms the role of miR-374b in creating resistance, though he says there could be other microRNA molecules involved, as well. “These cells have acquired resistance to the drug, and we have found a microRNA that seems to be playing a major role,” he said. “We have shown that we can bring sensitivity to drugs back by restoring levels of miR374b, but there may be other miRNAs that will work equally as well. Just as there are multiple pathways to establish cancer and chemoresistance, there may be multiple pathways to restore chemosensitivity, as well.” If cancer could one day be treated using miRNAs, it’s likely to be a continuing battle rather than a decisive victory, McDonald said. Cancer cells are very resourceful, and will likely find a new genetic route to resistance if one pathway is destroyed. That could require use of a different miRNA to reverse resistance. While the miRNA research isn’t likely to provide a “magic bullet” for cancer, it does show the possible role of these tiny RNA molecules in controlling a broad class of bodily processes. “There is growing evidence that this class of small regulatory RNAs may be involved in many processes ranging from evolution to heart disease,” he said. “MiRNAs are emerging as important players in cancer in general. Here, we are focusing on just one particular aspect of it.” In addition to those already mentioned, the research team included R. Schreiber and L.V. Matyunina, both from Georgia Tech. In addition Schreiber is affiliated with the Faculdade de Ciências Médicas – UNICAMP in Brazil. The work was supported by funds from the Deborah Nash Endowment and the Mark Light Fellowship. CITATION : R. Schreiber, et al., “Evidence for the role of microRNA 374b in acquired cisplatin resistance in pancreatic cancer cells,” (Cancer Gene Therapy, 2016).\nhttp://dx.doi.org/10.1038/cgt.2016.23 Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contacts : John Toon (404-894-6986) ( jtoon@gatech.edu ) or Ben Brumfield (404-385-1933) ( ben.brumfield@comm.gatech.edu ). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}