{"text": "Georgia Tech Chosen as Partner Institution for World-Leading Climate Center | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Chosen as Partner Institution for World-Leading Climate Center\nGeorgia Tech will be a key partner for the New York Climate Exchange (The Exchange), a first-of-its-kind international center for developing and deploying dynamic solutions to the global climate crisis.\nFacebook\nTwitter\nEmail\nApr 24, 2023\nGeorgia Tech will be a key partner for the New York Climate Exchange ( The Exchange ), a first-of-its-kind international center for developing and deploying dynamic solutions to the global climate crisis. In addition to convening the world’s leaders and climate experts, The Exchange will address the social and practical challenges created by climate change — including commercially viable research and ideas that lead to immediate action on local and global levels.\n“Today's climate issues are urgent, and environmental justice and ecological sustainability necessitate action from leaders across the world,” said Chaouki Abdallah, executive vice president for research at Georgia Tech. “As a core partner of The Exchange, Georgia Tech will provide research expertise in the areas of energy, urban planning, bi­­ological ecosystems, public policy, and more, and we look forward to playing an instrumental role in bringing its mission to fruition.”\nGeorgia Tech researchers are studying glacial melt, coral growth, sea level rise, and other climate concerns in the state of Georgia and around the world and will share their data and research results with partners at The Exchange. Likewise, research at The Exchange will be applicable for towns and cities across Georgia, allowing state leaders to take advantage of economic opportunities that arise when climate change is addressed head on.\nIn addition to contributing critical research across the many areas of climate change, Georgia Tech leads major initiatives that are focused on solving the crises laid out in the UN’s Sustainable Development Goals.\nGeneration 2 Reinvented Toilet (G2RT)\n— a solution to the world’s water and sanitation problem — is led by\nShannon Yee , associate professor in the\nGeorge W. Woodruff School of Mechanical Engineering\nat Georgia Tech. This cost-effective, globally scalable reinvented toilet with built-in human waste treatment will ensure that drinking water stays clean and will improve public health around the world.\nGeorgia Tech is also a leading partner of the\nOcean Visions\n– UN Decade Collaborative Center for Ocean-Climate Solutions, an international center headquartered at the Georgia Aquarium that aims to co-design, develop, test, fund, and deliver scalable and equitable ocean-based solutions to reduce the effects of climate change and build climate-resilient marine ecosystems and coastal communities. Championed at Georgia Tech by\nSusan Lozier,\ndean and Betsy Middleton and John Clark Sutherland Chair in the\nCollege of Sciences , the Center also supports opportunities to accelerate ocean-based carbon dioxide removal research and advance sustainable ocean economies.\n“We are looking forward to contributing and demonstrating some of the engineering sustainability solutions that have been developed at Georgia Tech with New York City and the world,” said Yee. “Many of the technical and economic solutions that serve the state of Georgia, the coastal city of Savannah, and the urban center of Atlanta can also serve the urban harbor of New York City. Similarly, the innovations and economic opportunities that address climate change can be shared with and benefit Georgia. This collaboration embodies the concept of an exchange where we share with one another.”\nAs The Exchange’s anchor institution, Stony Brook University will build and operate the center which will be located on Governors Island in New York City. The center is slated to open in 2028.\n“It is becoming clear year after year in New York, and around the world, that the impacts of climate change are real and are here,” said Kevin Reed, associate dean for Research and associate professor in the School of Marine and Atmospheric Sciences at Stony Brook. “By partnering with communities, industries, governments, and universities, The Exchange will help to accelerate the implementation of urban solutions to these climate impacts through an interactive research ecosystem where community engagement is paramount. As a climate scientist, I recognize that New Yorkers need solutions to the climate crisis now, and The Exchange will help to make that a reality.”\nContact\nNews Contact\nGeorgia Parmelee | georgia.parmelee@gatech.edu\nEmail\ngeorgia.parmelee@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}