{"text": "Cobb, Jo, Sa de Melo Honored as Lifetime AAAS Fellows | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nCobb, Jo, Sa de Melo Honored as Lifetime AAAS Fellows\nKim M. Cobb, Hanjoong Jo, and Carlos A. R. Sa de Melo are among AAAS scientists, engineers, and innovators being recognized for scientifically and socially distinguished achievements.\nFacebook\nTwitter\nEmail\nThe AAAS Fellowship Rosette symbolizes the honor that AAAS bestows upon its members whose efforts on behalf of the advancement of science or its applications in service to society have distinguished them among their peers.\nJan 26, 2022\n— Atlanta, GA\nThe American Association for the Advancement of Science (AAAS) has elected three faculty from Georgia Tech and Emory University to the newest class of AAAS Fellows, one of the highest distinctions in the scientific community:\nKim M. Cobb , Georgia Power Chair, director of the\nGlobal Change Program , and ADVANCE Professor in the\nSchool of Earth and Atmospheric Sciences ,\nCollege of Sciences\nHanjoong Jo , Wallace H. Coulter Distinguished Faculty Chair in Biomedical Engineering and the\nCoulter Department of Biomedical Engineering ’s associate chair for\nEmory University\nCarlos A. R. Sa de Melo , professor in the\nSchool of Physics , College of Sciences\nThe 2021 class of\nAAAS Fellows\nincludes 564 scientists, engineers, and innovators spanning 24 scientific disciplines who are being recognized for their scientifically and socially distinguished achievements. AAAS is the world’s largest general scientific society and publisher of the\nScience\nfamily of journals.\nTech’s trio of honorees lead a spectrum of global research spanning climate variability and trends to theoretical physics to atherosclerosis.\nKim M. Cobb\nGeology & Geography | For distinguished service to the field of paleoclimatology and in outreach and education to foster a new generation of earth scientists who are engaged with the real world.\n“As a climate scientist,” Cobb shares, “it’s thrilling to uncover some of Earth’s longest held secrets. In that way, our research has always been its own reward to me. But this honor is special, and a true testament to the outsized contributions of our team’s research faculty, students, and staff.”\nThe mission of\nCobb’s research\nis to uncover the mechanisms of global climate change — both natural and anthropogenic — to inform regional projections of future climate change.\nMore recently, her research has included the study of climate extremes in Georgia, with the aim of bolstering community resilience to climate change impacts.\nAs historically marginalized communities are most vulnerable to such impacts, Cobb explains, she works with a large team of colleagues and students that includes social scientists, as well as local officials and community organizations. Her AAAS Fellow citation recognizes her sustained efforts in communicating climate science to policymakers and the general public.\nHanjoong Jo\nBiological Science | For distinguished contributions to atherosclerosis research, especially in discovering the role of blood flow on endothelial dysfunction and atherosclerosis using novel animal models and cultured cells.\nJo’s research focuses on better understanding atherosclerosis, a buildup of artery-clogging fats and cholesterol that can lead to heart attacks and strokes.\n“I am deeply honored and humbled to be elected as an AAAS Fellow,”\nshares Jo . “This election recognizes my lifetime contribution to vascular mechanobiology and atherosclerosis by a distinguished group of AAAS Fellows, who are themselves accomplished leaders in broad [science, technology, engineering, and mathematics] fields.”\nCarlos A. R. Sa de Melo\nPhysics | For seminal contributions to superconductivity and superfluidity, particularly the crossover from BCS (Bardeen–Cooper–Schrieffer) superconductivity to Bose-Einstein condensation in ultra-cold atoms, and for communicating these advances to students and the public.\nSa de Melo’s work focuses on theoretical condensed matter and ultra-cold atomic and molecular physics: superconductors, quantum magnets, superfluids, and Bose-Einstein condensates.\n“I strongly encourage my students to be broad, deep and creative,” he shares. “Breadth of knowledge is very important in today's physics job market, as is expert (deep) knowledge in a particular area.” But most of all, he adds, it’s “the development of new directions, never explored before” comprising the dominant component of his research.\n“I am very thankful to the colleagues that have nominated me for such a recognition — to my students and postdocs for their collaboration,” Sa de Melo says, “and to the AAAS Council for electing me to the rank of Fellow for contributions to theoretical physics in the fields of superconductivity and superfluidity.”\nA tradition since 1874\n“AAAS is proud to bestow the honor of AAAS Fellow to some of today’s brightest minds who are integral to forging our path into the future,” says Dr. Sudip Parikh, AAAS chief executive officer and\nScience\nexecutive publisher. “We celebrate these distinguished individuals for their invaluable contributions to the scientific enterprise.”\nThis tradition stretches back to 1874. AAAS Fellows are a “distinguished cadre of scientists, engineers, and innovators who have been recognized for their achievements across disciplines ranging from research, teaching, and technology, to administration in academia, industry, and government, to excellence in communicating and interpreting science to the public.”\nAAAS members achieve the rank of Fellow through a rigorous annual nomination and selection process. Cobb, Jo, and Sa de Melo join\nmore than 90 faculty\nfrom Georgia Tech faculty elected as Fellows since 1954, including\nKaye Husbands Fealing , dean of the Ivan Allen College of Liberal Arts, who also serves on the AAAS Executive Board — along with\nseveral fellow Georgia Tech faculty\ninducted as AAAS members, including\nSusan Lozier , dean of the College of Sciences and Betsy Middleton and John Clark Sutherland Chair.\nThe new class of Fellows will receive an official certificate and a gold and blue rosette pin to commemorate their election (representing science and engineering, respectively) and will be celebrated at an AAAS commemoration later this year. The cohort is also featured in the AAAS News & Notes section of\nScience\nfor January 2022.\n***\nThe\nGeorgia Institute of Technology , or Georgia Tech, is a top 10 public research university developing leaders who advance technology and improve the human condition. The Institute offers business, computing, design, engineering, liberal arts, and sciences degrees. Its nearly 44,000 students representing 50 states and 149 countries, study at the main campus in Atlanta, at campuses in France and China, and through distance and online learning. As a leading technological university, Georgia Tech is an engine of economic development for Georgia, the Southeast, and the nation, conducting more than $1 billion in research annually for government, industry, and society.\nThe\nAmerican Association for the Advancement of Science\n(AAAS) is the world’s largest general scientific society and publisher of the journal\nScience , as well as\nScience Translational Medicine ;\nScience Signaling ; a digital, open-access journal,\nScience Advances ;\nScience Immunology;\nand\nScience Robotics . AAAS was founded in 1848 and includes more than 250 affiliated societies and academies of science, serving 10 million individuals. The nonprofit AAAS is open to all and fulfills its mission to “advance science and serve society” through initiatives in science policy, international programs, science education, public engagement, and more. For additional information about AAAS, visit\nwww.aaas.org .\nAdditional Images\nContact\nJess Hunt-Ralston\nDirector of Communications\nCollege of Sciences\nGeorgia Institute of Technology\njess@cos.gatech.edu\n+1 (404) 385-5207\nJoshua Stewart\nCommunications\nWallace H. Coulter Department of Biomedical Engineering\nGeorgia Institute of Technology & Emory University\njstewart@gatech.edu\n+1 (404) 385-2416\nEmail\njess@cos.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}