{"text": "Georgia Tech Aerospace Engineering Graduate James McConville Sworn in as Army’s Top Officer | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Aerospace Engineering Graduate James McConville Sworn in as Army’s Top Officer\nA decorated helicopter pilot who earned a master's in 1990, McConville is the first aviator to serve as the Army’s chief.\nFacebook\nTwitter\nEmail\nGen. James McConville, right, greets a soldier from the 4th Infantry Division in Laghman Province, Afghanistan, in October 2018. (Photo: Spc. Markus Bowling, U.S. Army)\nAug 09, 2019\n— Atlanta, GA\nA Ramblin’ Wreck from Georgia Tech is the new\nchief of staff of the U.S. Army.\nGen. James C. McConville\ntook over as the Army’s top officer August 9 . He replaces Gen. Mark A. Milley, who was confirmed in July as the next chairman of the Joint Chiefs of Staff.\nMcConville earned a master’s degree in aerospace engineering from Georgia Tech in 1990. A decorated helicopter pilot, McConville is the first aviator to serve as the Army’s chief.\n“Armed with a master’s in engineering to go with decades of flying and maintaining helicopters, he brings a unique understanding of how to operate and support complex weapons and equipment,” said Army Secretary Ryan McCarthy. “In this respect, no senior officer is better prepared to lead the Army as we undertake what will be a massive and, yes, risky and costly transformation towards more advanced weapons and war-fighting approaches.”\nMcConville has served as the Army vice chief of staff under Milley, where he already has been leading those modernization efforts. It’s work he said he has been well prepared for, in part, thanks to his graduate studies.\n“Georgia Tech is a tremendous school of higher learning, and it helped me as a leader to think critically, innovate and solve the most difficult problems. Georgia Tech also taught me the power of technology and to challenge the status quo,” McConville said. “The practical knowledge I gained helped me find tangible ways to overcome challenges while expanding my sense of what is truly possible if we work as a team and don't limit our creativity.”\nMcConville recalled sending his first email — using a dial-up modem — while he was on campus, an interesting inflection point for the man who noted at the change of responsibility ceremony that the Army “cannot be an industrial age Army in the information age. We must transform all our industrial age processes to be more effective, protect our resources, and make better decisions.”\nAt Georgia Tech, McConville played on the club hockey team and celebrated the birth of his first son. (That son and his two siblings are now all Army officers themselves.) McConville praised the professors he studied under in the Daniel Guggenheim School of Aerospace Engineering, especially Daniel Schrage and Dimitri Mavris.\n“They were great mentors and coaches, and very committed to the development of their students,” he said.\n“Even when Gen. McConville was a master’s student, we knew he would go far,” said Mavris, a Regents Professor and also McConville’s brother-in-law. “Throughout his distinguished career, he has demonstrated an exemplary level of commitment and service to our country. We are confident he is the best man for the job and that he will excel at leading and preparing the Army for the future.”\nMcConville’s career includes stints commanding the 4 th\nBrigade, 1 st\nCavalry Division, where his aviators played a decisive role in the battle of Fallujah in Iraq. Later, he became the longest-serving division commander in Army history when he led the 101 st\nAirborne Division on multiple combat tours over three years.\n“McConville is one of the most courageous and thoughtful officers I have ever served with,” Milley said. “Jim’s blend of battlefield experience, both in the Middle East and in Washington, made him the perfect officer to take over as chief. He has the drive, the background and the vision to make the Army even better.”\nAdditional Images\nRelated links\nMore about Gen. James McConville\nNew chief of staff: Taking care of people key to winning the fight\nWATCH: U.S. Army chief of staff change of responsibility ceremony\nContact\nJoshua Stewart\n404.894.6016\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}