{"text": "More Startups Join Engage | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMore Startups Join Engage\nEight startups join Engage Ventures, an early-stage venture fund created by Georgia Tech and 10 leading global corporations.\nFacebook\nTwitter\nEmail\nGeorgia Tech's Technology Square is home to a growing innovation ecosystem of startup companies, innovation centers from established companies and research from Institute students, faculty and staff.\nMar 01, 2018\n— Atlanta, GA\nEight additional technology startups will go through an early-stage venture fund created by Georgia Tech and 10 leading global corporations.\nThe Engage Ventures growth program differs from other accelerators in that it targets later stage companies and helps them develop and execute go-to-market strategies.\n“Bringing top executives from our corporate partners together with founders of high-growth companies to focus on go-to-market has unlocked immense value,” said Thiago Olson, managing director of Engage Ventures. “We’re humbled by the talent pulled together this spring.”\nCompanies in the spring cohort are pioneering technologies spanning from autonomous flight to artificial intelligence to blockchain, Olson said.\nHalf of the startups have Georgia Tech connections. Three are current portfolio companies in Georgia Tech’s\nAdvanced Technology Development Center\n(ATDC) and a fourth participated in\nCREATE-X , a series of entrepreneurship programs for undergraduate students.\nThe three-month program brings the startups to Georgia Tech’s Technology Square. Meet some of the companies:\nDev/Con – The cybersecurity company works with media and agencies to detect and prevent advertising fraud. The company is part of the ATDC Signature portfolio.\nHomee – The company offers an on-demand, home servicing app that provides instant access to electrical, HVAC, plumbing and other providers.\nIntriono – A FinTech marketplace with access to more than 200 financial data feeds that cover 350,000 global securities.\nPRYON – This company developed an AI platform with the accuracy and security features necessary for enterprise applications.\nStord – A real-time global warehousing network that connects independent, third-party warehouses via an enterprise software platform to drive inventory efficiency. This company participated in Georgia Tech’s CREATE-X.\nThingTech – An IoT service platform that connect assets, fleets, heavy equipment, sensors, machines and mobile workforces in real time. The company is part of the ATDC Signature portfolio.\nVerady – This company combines blockchain and industry thought leadership to bring accounting and audit technology to cryptocurrencies. The company is part of the ATDC Accelerate portfolio.\nEngage Ventures is the largest-ever strategic grouping of major corporations in an independent venture firm. The 10 founding companies contributing capital, expertise, time and resources in support of Engage include AT&T, Chick-fil-A, Cox Enterprises, Delta Air Lines, Georgia-Pacific, Georgia Power Foundation Inc., Intercontinental Exchange (ICE), Invesco Ltd., The Home Depot and UPS. Executives from these firms mentor companies receiving financial support from the venture fund. The fund is managed by Tech Square Ventures, which is led by managing partner Blake Patton.\nEngage offers programming and other services through a contract with ATDC, which was established at Georgia Tech by Georgia lawmakers in 1980 to launch and build technology companies.\nThe startups are the second cohort to go through the program. The first group completed the program in the fall.\nAdditional Images\nRelated links\nInnovation Ecosystem at Georgia Tech\nEngage Ventures\nContact\nLaura Diamond, laura.diamond@gatech.edu\nThiago Olson, thiago@engage.vc\nEmail\nlaura.diamond@ajc.com\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}