{"text": "Simple, Low-Cost Ventilator Builds on Available Resuscitation Bags | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nSimple, Low-Cost Ventilator Builds on Available Resuscitation Bags\nA simple, low-cost ventilator based on the resuscitation bags carried in ambulances has been designed and tested.\nFacebook\nTwitter\nEmail\nA simple, low-cost ventilator based on the resuscitation bags carried in ambulances – and widely available in hospitals – has been designed by an international team of university researchers.  (Credit: Steven Norris, Georgia Tech)\nApr 06, 2020\n— Atlanta, GA\nA simple, low-cost ventilator based on the resuscitation bags carried in ambulances – and widely available in hospitals – has been designed by an international team of university researchers. The device, which is powered by a 12-volt motor, could help meet peak medical demands in the industrialized world and serve resource-constrained countries that don’t have supplies of conventional ventilators.\n“The high transmission rate and debilitating respiratory consequences of COVID-19 are creating an unmet demand for ventilators worldwide. It is heartwarming to see U.S. manufacturers open-source some of their FDA-approved designs to stimulate production.” said\nSusan Margulies , chair of the\nWallace H. Coulter Department of Biomedical Engineering at Georgia Tech and Emory University , an expert in ventilator-associated lung injuries. “Our strategy to rapidly expand the supply of ventilators focuses on a simple, low-cost design based on common resuscitation bags carried by ambulances.”\nThe device, which can serve two patients simultaneously, can be produced from inexpensive metal stock and plastic gearing. Power comes from standard wall adapters or 12-volt vehicle batteries. The research team is working with the\nEmory University Office of Technology Transfer\nto move the design into manufacturing.\n“We are adapting the bag-valve-mask (BVM) resuscitators that are already in place, designed to be manually squeezed for reviving a patient,” said\nShannon Yee , an associate professor in\nGeorgia Tech’s George W. Woodruff School of Mechanical Engineering . “We are providing the mechanical assist that allows the bags to be squeezed continuously for days rather than for short periods of time. We are using infrastructure already in place.”\nThe device was designed at Cranfield University in the United Kingdom and built and tested at Georgia Tech in collaboration with Emory University. At Cranfield,\nProfessor Leon Williams , head of the\nCentre for Competitive Creative Design , specializes in rapid prototyping, and has been iterating the designs with researchers in Atlanta.\n“We have paid special attention to the requirements of medical specialists to ensure that the system is fit for the purpose,” said Williams. “For example, we have ensured that the operator of the system is able to manually adjust the tidal volume – the volume of air delivered to the lungs with each breath – to safeguard the patient.”\nYee said the device is intended to meet the critical needs created by the COVID-19 pandemic.\n“What’s unique about our design is that we have two BVM’s per ventilator, which allows two people to breathe with each device that is built,” Yee said. “Our goal was to provide the bare essentials for a ventilator to help with patients who have COVID-19 or acute respiratory distress syndrome.”\nThough each emergency ventilator can serve two patients simultaneously, their air flow is separate to avoid cross-contamination. Flow volumes can be controlled independently to meet the needs of each patient.\nIn addition to Yee and Williams, Kyle Azevedo, a research engineer with the\nGeorgia Tech Research Institute (GTRI) , has been supporting quality control and test procedures for the device, collaborating with GTRI researchers Jonathan Holmes and Wiley Holcombe. A small batch of the devices has already been assembled for bench testing and shared with Georgia hospitals for evaluation.\n“We believe these devices can be mass manufactured in quantities that make a tangible impact on ventilator shortages nationally or worldwide,” Azevedo said. “Leveraging the BVM resuscitators reduces the need for complex electronics, and most of the parts can be cut from flat stock or 3D printed. Actuation is via a simple DC motor and regulator, which are widely available.”\nGTRI has experience with bringing concepts to reality, and is advising on manufacturing scale-up for the devices. “It’s very important to pay attention to design for mass manufacture,” he said.\nThe automated BVM ventilation system has been designed for use in emergency situations where all other ventilators are occupied, or in resource-restricted areas where traditional ventilators are simply not available. The systems are intended to be used on a temporary basis until a conventional ventilator becomes available.\nThe system is designed to be inexpensive to produce. “The BVM system is purposely designed to be modular and reconfigurable,” Williams said. “If we need to make further improvements to the system over time, this is possible.”\nBecause it is intended for global production and use, the BVM ventilator design emphasized using as few parts as possible, Yee said. The ventilator can supply oxygen from a hospital’s built-in supply system, or from a portable oxygen generator. The device must be used in conjunction with a pulse oximeter or other device that reliably provides a real-time reading of patient oxygen levels.\n“We designed the ventilator to be simple to make, cut from sheets of steel,” Yee explained. “Kits can be assembled and packaged flat for shipping, then reassembled where needed. The manufacturing requires skills that are readily available, and hand tools could even be used.”\nWith just a few weeks until the demand for medical support from ventilators is expected to peak in some hard-hit communities, the researchers understand the race against time to get their engineering drawings out to manufacturers. “We really need to get this out to people,” Yee said. “Time is of the essence.”\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : Georgia Tech - John Toon (404-894-6986) ( jtoon@gatech.edu ); Cranfield University – ( mediarelations@cranfield.ac.uk )\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}