{"text": "Georgia manufacturers boost profits, but reduce long-term investment | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia manufacturers boost profits, but reduce long-term investment\nGeorgia manufacturers are enjoying higher profits, but they may be shortchanging investment in future-focused technology and innovation.\nFacebook\nTwitter\nEmail\nThe 2014 Georgia Manufacturing Survey shows that the state's manufacturers are enjoying higher profits, but cutting back on long-term investment.\nSep 24, 2014\n— Atlanta, GA\nGeorgia manufacturers are enjoying higher profits, but in the rush to meet the demands of a rebounding economy, they may be shortchanging investment in future-focused technology and innovation, a new survey of the state’s manufacturing companies has found. The 2014 Georgia Manufacturing Survey found that profits of Georgia manufacturers grew, on average, 13 percent between 2012 and 2014 – compared to an overall decline reported between 2010 and 2012. Despite this good news, however, the survey found fewer companies planning to invest in new technologies such as robotics, and a reduced reliance on innovation as a competitive strategy. \"Manufacturing companies in Georgia are more profitable than they have been for years,\" said Jan Youtie, director of policy research services at Georgia Tech’s Enterprise Innovation Institute and the survey’s director. \"However, we are seeing less investment in the kinds of things we would normally recommend as good practices in preparing for the future. This may indicate too much attention to the present and not enough on sustaining success in the future.\" The reduced investment may simply signal a transition between the slow economy of the past several years and one that is getting back on a growth track, said Karen Fite, director of the Georgia Manufacturing Extension Partnership program (GaMEP), a federally-supported Georgia Tech program that helps manufacturers improve their competitiveness. \"As companies are able to adjust to the new capacity needs, we're expecting them to begin investing again in the kinds of things that will ensure long-term competitiveness,\" said Fite. \"We are also hearing from manufacturers that they are waiting on some of the most exciting technologies, such as additive manufacturing and cloud-based systems, to mature and for prices to fall. Investing too early in the development cycle of new technologies can be costly.\" Results from the survey, produced by the Georgia Institute of Technology, Georgia Department of Labor, Kennesaw State University and the accounting firm Habif, Arogeti & Wynne, LLP (HA&W), were released September 24. The survey is based on responses from 504 Georgia manufacturing companies contacted during the first half of 2014. Concerns about the availability of workers with technical and basic skills were more prevalent in the 2014 survey than in earlier studies, noted Philip Shapira, a professor in Georgia Tech’s School of Public Policy and co-director of the study. “Georgia manufacturers have benefitted over the last year or so from economic recovery, and indicate problems finding workers with basic and technical skills to further grow their businesses,” said Shapira, who is also a professor of innovation management and policy at the Manchester Business School in England. “Yet, worryingly, investment in workforce training is below 2012 survey levels.” Georgia companies may be overlooking a tax credit that could help them improve the skills of their employees. “The Georgia Retraining Credit is an often overlooked tax credit that Georgia manufacturers can take advantage of to train their current employees on certain equipment, technology, processes, or software,” said Adam Beckerman, partner-in-charge of HA&W’s Manufacturing and Distribution group. “The credit creates a huge opportunity for Georgia manufacturers to provide their workforce with the technical training that many lack by covering a manufacturer’s direct expenses for training session.” Beyond improving profitability, falling energy prices also provided good news, as the survey reported a dramatic reduction in the percentage of firms concerned about energy cost. \"The cost of energy has been a significant issue for several years, but in the newest survey, it dropped to among the lowest levels,\" said Youtie. “In the 2012 survey, for example, 21 percent of respondents cited high energy costs as a concern, but just two years later, only 11 percent ranked it as a big issue.” Energy expenditures as a percentage of sales declined nearly 6 percent for the median Georgia manufacturer between 2012 and 2014. The decline was even more significant for large manufacturers, who saw a 12 percent drop. Exporting has provided new market opportunities, and past surveys had seen an increase in the percentage of Georgia manufacturers sending their goods overseas. In the 2014 survey, however, the number of companies expecting to increase exports dropped to 20 percent from 23 percent in 2012. Georgia Tech helps companies apply innovation to their products and processes. The survey found that innovation remains largely an activity for larger companies, where two-thirds of respondents said they were innovating in products, processes, organizations or marketing. Most firms reporting innovation said they were collaborating with suppliers and customers. “Companies that want to grow must shift away from low-cost strategies and innovate through new technologies, research and development, and new products and processes,” said Beckerman. Use of sustainable manufacturing techniques such as life-cycle analysis, carbon foot printing and greenhouse gas emission inventories remains low in Georgia, with only 9 percent of companies producing a carbon footprint inventory, for example. “The percentage using sustainable manufacturing technologies is very low, and a large number of respondents felt they weren’t applicable,” said Youtie. “We feel that life cycle analysis is applicable to any manufacturer, but half the companies don’t plan to do it and 26 percent say it’s not applicable.” Among other findings: The percentage of Georgia companies benefitting from in-sourcing – the transfer of production to them from another facility – dropped from 16 percent in the 2012 survey to 13 percent in 2014. The percentage losing work to other facilities dropped from 14 percent to 11 percent. The percentage of Georgia companies using robotics technology remains low, with just 10 percent using robots in their processes and only 6 percent planning to adopt them. High-use technology included enterprise resource planning software (68 percent) and computer-aided-design software (63 percent). The use of lean manufacturing techniques, which improve efficiency and reduce costs, dropped from nearly 60 percent in the 2012 survey to 44 percent in the latest survey. The profitability of companies that compete on the basis of low price nearly doubled from the 2012 to 2014 survey, reflecting the results of a higher production volume. Such companies reported profit margins of more than 9 percent, compared to 10 percent for companies competing on the basis of innovation. Companies that compete on the basis of innovation had the highest average wage rate: $43,605. Companies competing on the basis of quick delivery or low price reported wages of $37,763 and $38,006 respectively. Only 27 percent of Georgia manufacturers conduct research and development activities in-house. First produced in 1994, the Georgia Manufacturing Survey is conducted regularly to benchmark the use of modern manufacturing technology, practices and techniques. Information obtained from the survey is used to improve manufacturing assistance programs and regional innovation initiatives that help Georgia companies compete, improve their profitability, and create jobs for Georgians. More information can be found at ( www.gms-ei2.org ). Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia  30332-0181 USA Media Relations Assistance : John Toon ( jtoon@gatech.edu ) (404-894-6986) or Brett Israel ( brett.israel@comm.gatech.edu ) (404-385-1933). Writer:\nJohn Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}