{"text": "New Cell Manufacturing Research Facility will Change Approaches to Disease Therapies | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNew Cell Manufacturing Research Facility will Change Approaches to Disease Therapies\nOn June 6, Georgia Tech dedicated a Good Manufacturing Practice (GMP) like ISO 8 and ISO 7 facility.\nFacebook\nTwitter\nEmail\nA plaque is unveiled in the new Good Manufacturing Practice (GMP) like facility that is part of the Marcus Center for Therapeutic Cell Characterization and Manufacturing (MC3M). Shown are Georgia Tech President G.P. “Bud” Peterson, Center Director Krishnendu Roy, and philanthropist Bernie Marcus. (Credit: Rob Felt, Georgia Tech)\nJun 19, 2018\n— Atlanta, GA\nThe vision of making affordable, high-quality cell-based therapies available to hundreds of thousands of patients worldwide moved closer to reality June 6 with the dedication of a new cell manufacturing research facility at Georgia Tech aimed at changing the way we think about medical therapies.\nThe new Good Manufacturing Practice (GMP) like ISO 8 and ISO 7 compliant facility is part of the existing\nMarcus Center for Therapeutic Cell Characterization and Manufacturing\n(MC3M). The center was established in 2016 and made possible by a $15.75 million gift from philanthropist Bernie Marcus, with a $7.25 million investment from Georgia Tech and another $1 million from the\nGeorgia Research Alliance .\nMC3M is already helping researchers from Georgia Tech and partner organizations develop ways to provide therapeutic living cells of consistent quality in quantities large enough to meet the growing demands for the cutting-edge treatments. The center and this new facility also provide the infrastructural foundation for the Georgia Tech-led National Science Foundation Engineering Research\nCenter for Cell Manufacturing Technologies\n(CMaT), which was announced in September 2017.\nThe Marcus Foundation’s gift along with the NSF’s expected funding over ten years in CMaT, together with potential private-sector contributions and the state of Georgia’s investment in infrastructure related bio manufacturing, could result in a combined statewide investment of more than $70 million in cell manufacturing. Beyond developing technologies to help make these life-saving cell therapies broadly available and affordable, the initiative will also help train the specialized workforce needed to manufacture these therapies at large scale.\n“This initiative has the potential to change the way we think about medical treatments, to change the way we think about medicine, and the way we approach cures for different diseases,” said Georgia Tech President G.P. “Bud” Peterson, who opened the dedication event. “Here, we will develop the tools and technologies to produce these cells at lower cost, more rapidly and for more people.”\nMC3M is already supporting 23 research projects aimed at all components of the challenge, from understanding cell quality and developing scalable processes, to chip-based disease models for safety and efficacy testing and new models for supply-chain optimization and logistics. The center collaborates with several other institutions, supporting the work of 29 faculty members, and helping train 27 students and fellows for the emerging cell manufacturing industry.\nThe new facility dedicated on June 6 is a unique “sandbox” for collaboration among engineers, clinicians, and industry to develop and validate new scalable manufacturing processes for cell therapies under GMP conditions necessary to eventually obtain regulatory approvals. It will serve as the translational arm of the Marcus Center and CMaT to help researchers throughout the state of Georgia translate emerging cell therapies to clinical practice. This facility – designed to enable real time quality monitoring and control of cell products during manufacturing – is a one-of-a-kind space that will be instrumental in bringing affordable cell therapies to patients faster.\nThe new cell-based therapies being approved for use in humans can have dramatic impact. But the therapies are costly, as much as a $500,000 per patient. The MC3M will help develop new technologies and processes to make these treatments consistent in quality and available to the average person.\n“The center is about providing access for patients and enabling patients to benefit from these incredible therapies that could change their lives,” said Krishnendu Roy, who directs both MC3M and CMaT. “We need to scale these therapies up to treat hundreds of thousands of patients. This is the vision of Mr. Marcus – to make this available to everyone regardless of their socio-economic status.”\nMarcus, who recalled working as a pharmacist before co-founding home improvement retailer The Home Depot, noted that common drugs such as aspirin are chemically consistent around the world, regardless of where they are sold. The consistency of living cell therapies can’t be similarly counted on because their properties may depend on the specific skills and facilities of the research center producing them.\n“Patients receiving these cells need to know that they are getting the right things,” Marcus said. “This is a very practical question for which we have no answer now.” Beyond consistency, the cells also need to be affordable, he said.\nThe new cell manufacturing facility will connect cell-based therapies being developed in research facilities with the appropriate tools and technologies that ensure consistency in manufacturing and product quality while enabling scalability. “There is a gap right now between what we do in the research lab and what we need to do to get these therapies to a hundred thousand or even millions of patients,” Roy noted.\nBeyond developing quality control and analytical techniques to ensure consistency, the center will also develop novel feedback-controlled automation systems to lower the cost, Roy said.\nPeterson noted the potential economic impact of building a cell manufacturing industry in Georgia. “Working with our partner universities, the Technical College System of Georgia and the private sector, we will be able to attract new industries, create new jobs and help build the economy of the state of Georgia.”\nThe initiative began, he noted, with the development of a national cell manufacturing roadmap, an effort supported by the National Institute of Standards and Technology (NIST). The Marcus gift built on that foundation, and in turn, made it possible for Georgia Tech to lead a team including the University of Wisconsin, University of Georgia, University of Puerto Rico-Mayaguez, and other partners, to win the NSF Engineering Research Center award last fall.\nOther collaborators in Georgia include Emory University and Children’s Healthcare of Atlanta.\nThe NSF ERC could provide up to $40 million over ten years, and attract private and local investment that could boost that amount much higher.\n“We have incredible momentum,” Roy said. “We are bonded together by a single goal: getting these therapies to many patients at a lower cost to really help them.”\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : John Toon (404-894-6986) (jtoon@gatech.edu).\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}