{"text": "Award-winning Journalist Nikole Hannah-Jones Leads 2021 Georgia Tech Martin Luther King Jr. Lecture Discussion | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nAward-winning Journalist Nikole Hannah-Jones Leads 2021 Georgia Tech Martin Luther King Jr. Lecture Discussion\nNikole Hannah-Jones, creator of The New York Times Magazine’s  “The 1619 Project,” led a discussion of her landmark multimedia initiative at the Institute’s 10th annual Martin Luther King Jr. Lecture.\nFacebook\nTwitter\nEmail\nNikole Hannah-Jones, creator of \"The 1619 Project.\"\nJan 19, 2021\n— Atlanta, GA\nNikole Hannah-Jones, award-winning investigative journalist and creator of\nThe New York Times Magazine ’s  “ The 1619 Project ,” led a discussion of her landmark multimedia initiative at the Institute’s 10 th\nannual Martin Luther King Jr. Lecture on Jan. 14.\n“The 1619 Project” delves into the brutal history and lasting legacy of American slavery, for which Hannah-Jones’ powerful introductory essay, “America Wasn’t a Democracy Until Black Americans Made It One,” was awarded the Pulitzer Prize for Commentary.\nThe lecture was just one event in Tech’s annual\nMartin Luther King Jr. commemorative event series\nsponsored by  Institute Diversity, Equity, and Inclusion  (IDEI) and the Division of Student Life. Many of the events are held in collaboration with Atlanta’s Martin Luther King Jr. Center for Nonviolent Social Change, a resource center and community institution established in 1968 by King’s widow, Coretta Scott King.\nHannah-Jones covers racial injustice for  The New York Times\nand has spent years chronicling the way official policy has created — and maintains — racial segregation in housing and schools. She has written extensively on the history of racism, school resegregation, and the disarray of hundreds of desegregation orders. She is a 2017 MacArthur fellow and has also won a Peabody Award, two George Polk Awards, and is a three-time National Magazine Award winner.\n“It's hard for me to ever really say what the true genesis of ‘The 1619 Project’ was,” Hannah-Jones said during the discussion with IDEI’s Vice President Archie Ervin and Executive Director of Staff Diversity, Inclusion, and Engagement Pearl Alexander. “I feel like my work, and my career, and my academic trajectory had been working towards the moment where I pitched the project. I talk about being a high school student and my Black studies teacher giving me a book about the Mayflower. All those years of my education no one mentioned the White Lion,” the English ship that brought the first African slaves to Virginia in 1619. “I really spent a lot of my career trying to show that the legacy of slavery and anti-Blackness has shaped so many of the institutions we see in this country and we render it invisible. I wanted to show that nothing about American life has been untouched by the legacy of slavery.”\n“The 1619 Project” is an ongoing initiative that began in August 2019, the 400 th\nanniversary of American slavery. The first edition included 10 essays from Black writers and activists, a photo essay, and a collection of poems and fiction by an additional 16 writers. The project later grew to include live events and a podcast. Essays include “How False Beliefs in Physical Racial Difference Still Live in Medicine Today,” by Linda Villarosa and “What Does a Traffic Jam in Atlanta Have to do With Segregation? Quite A Lot,” by Kevin M. Kruse.\n“We didn't go and do our own original historical research. We didn't unearth truths that were not known before,” Hannah-Jones said. “We intentionally said we are going to tell the story of America through the lens of slavery. We are going to shift from the exceptionalism. The role of history in this country has been in service of exceptionality — in service of the idea that we were the most liberatory country ever created. We were a country of those ideals, but we were also a country of the practice of slavery.”\nGeorgia Tech President Ángel Cabrera offered closing remarks after Hannah-Jones’ discussion, saying, “As a new American myself, as an American by choice, I am fascinated by the founding narrative of the American republic.\n“The leading role that Black Americans have played in this country’s journey has been essential for all of us,” he continued. “I invite every member of our community to go to ‘The 1619 Project’ website. Dig in, read, and challenge your thinking. Come together as a community, and think about how we can make our community at Georgia Tech better — and how we can contribute to making true on the American promise.”\nTo learn more about the 2021 Georgia Tech Martin Luther King Jr. commemorative event series, visit:\nhttps://diversity.gatech.edu/mlk-celebration .\nAdditional Images\nContact\nCourtney Hill\nCommunications Manager\nInstitute Diversity, Equity, and Inclusion\ncourtney.hill@gatech.edu\nEmail\ncourtney.hill@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}