{"text": "Where Are You Christmas (Tree)? Why Can’t I Find You? | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nWhere Are You Christmas (Tree)? Why Can’t I Find You?\nPersistent global supply chain issues seem to be causing a delay in Christmas cheer. Georgia Tech supply chain expert outlines the barriers to buying holiday goods this season.\nFacebook\nTwitter\nEmail\nDec 02, 2021\n— Atlanta, GA\nIt’s time to deck the halls, but the persistent global supply chain issues seem to be the grinch stealing Christmas­ — trees. Consumers visiting their local tree farms in search of the perfect fir may be shocked by the limited choices. While environmental factors and lack of tree planting are playing a significant role in the shortage of real trees, supply chain issues are affecting the availability of both real and artificial trees — and many other holiday goods.  Timothy Brown , managing director for the Supply Chain and Logistics Institute at Georgia Tech has more than 35 years of experience in supply chain optimization and says that product delays and scarcity, as well as price increases, can be largely attributed to labor shortages, among other things.\nThe Who: Lack of Labor\nThe cost of Christmas cheer is up because Santa is in desperate need of more helpers. There are many factors affecting the flow of goods, but the most universal issue companies are seeing is labor gaps.\n“Many brands are struggling with baseline production of standard items let alone trying to keep up with the peak that comes with the holidays,” Brown explains.\nConsumers are not only seeing limited availability, but they are also being faced with higher prices for their holiday favorites. Brown says the cost of labor has gone up significantly, driving up the costs to shoppers. “Companies with a labor-intensive workforce are seeing higher turnover and demands for higher wages,” he continued. “In order to make a profit, companies are having to increase prices.”\nFeedback from many companies has been that people are just not wanting to do certain jobs anymore. For instance, long-haul truck drivers that were once willing to spend weeks at a time away from their families are less likely to work those hours now. Brown says we are also seeing an increase of people retiring early, staying home with their children, and choosing gig-based employment. There has been a rise in people choosing jobs like ride-sharing, freelance work, and entrepreneurship because it allows for flexibility.\nThe How: Transportation Pileup\nYour Christmas tree may be stuck on a truck, but where is the truck? The imbalance of supply and demand in shipping container movements is partly to blame. Brown says that “the cost of fuel, shortage of containers, and lack of drivers are huge barriers in getting these goods to consumers.”\nThe congestion seen at the ports is not only restricting the turnaround time of products but also exacerbating the labor shortage. It now takes longer to make one trip, and many drivers are quitting these jobs because it is limiting the number of turns they’re able to get paid for each shift. And companies are facing higher prices to maintain production, with the cost of containers from places like China more than doubling.\nBut another option for transportation is using railroad. “I get excited about the potential for expanded use of rail for container movement,” he explains. “A unit train might move 400 containers with a crew of two people, while trucking would require 400 drivers.” Using this form of transportation could improve the flow of goods and materials, but there are some day-to-day issues that come along with that. For example, it’s not uncommon for government officials to hear from constituents voicing concerns about street congestion and noise levels generated by railroad crossings.\nThe Why: Supply, Demand, and Everything in Between\nHoliday lists are long and filled with everything from toys, to cars, to décor. Supply chain challenges can come about through constrained supply, excess demand, or disruptions in the flow from supply to demand. In a typical year, it’s not unusual to see one of these challenges. This year is unique in that consumers are simultaneously experiencing all three. Consumer demand has spiked while, at the same time, the impacts of the Covid-19 pandemic are still taxing supply flows.\nBrown says the issues consumers are currently seeing are unique and typically don’t happen at this scale and for this long. He adds there is little indication that some of the challenges (e.g., labor shortages) will be solved anytime soon. He predicts that simple goods, like paper and food staples, may be restored to normal flow within the next six months, but the more complex goods, such as cars and computers, could take a year or more.\nOh, Christmas tree … oh, Christmas tree, it still may be hard to find you. So, it’s best consumers start shopping early and be prepared to pay higher prices.\nTim Brown serves as Managing Director of Georgia Tech’s Supply Chain & Logistics Institute (SCL). Mr. Brown has more than 35 years of experience in supply chain optimization and strategy through work in industry operations, consulting services, and as an educator. He is responsible for strategic planning and development of executive education programs at SCL. He also serves as the liaison to on- and off-campus professional associations, organizations, and individuals regarding development and delivery of programs in support of expanding SCL's global mission to enable supply chain professionals, businesses, and governments to transform complex supply chains, improve logistics performance, and increase competitiveness by applying education, innovation and emerging practices.\nAdditional Images\nContact\nAyana Isles\nMedia Relations Representative\naisles3@gatech.edu\nEmail\naisles3@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}