{"text": "Coskun Gets $50,000 Pilot Grant from SPORE to Study Cell Signaling in Lung Cancer | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nCoskun Gets $50,000 Pilot Grant from SPORE to Study Cell Signaling in Lung Cancer\nPetit Institute researcher collaborating with Emory clinicians to enable personalized precision medicine\nFacebook\nTwitter\nEmail\nCell signaling in action.   - Photo provided by Ahmet Coskun\nAug 25, 2021\n— Atlanta, GA\nAhmet Coskun is trying to solve a molecular mystery: He wants to know why some patients don’t respond to a lung cancer drug that has shown otherwise promising results. He hopes understanding why will help his team develop tools that will enable personalized precision therapies in the future.\n“Most patients are responding to this drug very well, but it fails in some patients, and why it fails is a mystery,” said Coskun, an assistant professor in the Wallace H. Coulter Department of Biomedical Engineering at Georgia Tech and Emory University and a researcher in the Petit Institute for Bioengineering and Bioscience at Georgia Tech.\nCoskun aims to take a detailed look at cellular communication and decision-making, to closely visualize cell signaling and develop a new metric to define how cells respond to drugs for lung cancer therapy. To help him get started, the Emory Lung Cancer SPORE group is awarding him $50,000 over the next year.\n“Our research will result in a molecular screening platform for imaging signaling proteins of human cell cultures and tissues,” said Coskun, who plans to decipher the role of cellular signals and explain how different cells coordinate signaling to achieve healthy or abnormal results, specifically in patients with non-small cell lung cancer.\nThis year, about 200,000 adults in the United States will be diagnosed with non-small cell lung cancer, the leading cause of cancer-related deaths in the world. About 15 percent of those people have an epidermal growth factor receptor mutation in their cancer.\nEpidermal growth factor receptor, or EGFR, is a protein involved in cell signaling. When it works correctly, it helps control cell division. But when it becomes mutated, as it does in some lung cancer cells, it causes rapid cell growth, helping the cancer spread.\nFor lung cancer patients with the EGFR mutation, there is a measure of hope thanks to a drug developed by Emory University several years ago. In a 2017 clinical study led by Emory researcher Suresh Ramalingam, patients experienced substantial improvement when treated with an EGFR inhibitor called osimertinib, compared to those who received the standard of care.\nThe drug is designed to inhibit EGFR’s haywire signaling activity in cancer. As Coskun noted, though, it doesn’t work well for every patient. It’s because no two patient tumors are exactly alike – each tumor microenvironment is unique. There are multiple biomarkers and multiple potential targets for cancer drugs to attack. So, inhibiting one protein like EGFR won’t always make a difference, Coskun said.\n“The standard clinical techniques are limited to focusing on a single marker,” said Coskun, who is using multiplex cellular imaging, a technology that allows detection of multiple markers. “Recent advances in these systems allow visualization of a larger number of markers — up to 30 unique targets. We intend to develop automated, multiplexed platforms to detect numerous markers and to feed the information into an algorithm to diagnose patients and predict their response to therapies.”\nClearly identifying other markers could pave the way for combination therapies with other inhibitor drugs to block other cancer signaling pathways — together, they’re a more comprehensive approach to attacking the disease. The ability to look at 30 different proteins or markers — potential drug targets — at one time, in a single cell, wasn’t possible before because the technology didn’t exist.\n“The emerging technology that we have developed here at Georgia Tech and Emory allow rapid and high-content signaling network studies in cells and tissues,” Coskun said.\nEssentially, researchers combine technologies to create a complete molecular profile of a patient’s cancer at the single cell level. Coskun’s team uses microfluidic instruments to acquire microscopic images and then super computers are used to process and visualize complex cellular maps.\n“These maps will enable personalized precision therapies,” Coskun said. “That is our goal.”\nCoskun and his team will work under the mentorship of Ramalingam, executive director of the Winship Cancer Institute at Emory and co-lead of the Lung Cancer SPORE, a Specialized Program of Research Excellence created in 2019 with a $9.7 million National Cancer Institute grant. It’s one of four SPORE grants in the U.S. focused on lung cancer.\nLINKS\nhttps://winshipcancer.emory.edu/research/spore-grants/lung-cancer.html\nhttps://bme.gatech.edu/bme/faculty/Ahmet-F-Coskun\nAdditional Images\nContact\nWriter:\nJerry Grillo\nEmail\nJerry.grillo@ibb.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}