{"text": "Earth Month Features Sustainability Events | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nEarth Month Features Sustainability Events\nApril is Earth Month with a full calendar of events\nopen to the campus community.\nFacebook\nTwitter\nEmail\nApr 04, 2024\nApril is\nEarth Month\nat Georgia Tech. Coordinated by the Office of Sustainability and hosted by partners across campus, it extends the Institute’s observance of Earth Day (April 22) by showcasing campus sustainability efforts and providing opportunities for students, faculty, and staff to learn and take action.\nThis year’s Earth Month holds special significance, as Georgia Tech will soon publish its first Climate Action Plan, a road map for reaching net-zero greenhouse gas emissions.\n“Earth Month presents us with a unique time to honor and safeguard our environment together,” said Vanessa Suarez, sustainability coordinator in the Office of Sustainability. “It's an opportunity for all of us to be inspired and make a positive difference, both locally and globally; a reminder that collective changes yield significant impact.”\nEvents will be hosted by organizations and departments across campus during the month to learn, celebrate, and share best practices.\nFeatured Event: Earth Day Sustainable Org Fair and Celebration\nWednesday, April 17, 11 a.m. – 1 p.m., The Kendeda Building for Innovative Sustainable Design\nThis signature event will feature sustainability-focused departments and student organizations, Earth Month BYO T-shirt screen printing and other textiles, and free King of Pops popsicles. Sign up\nhere\nto table.\nEarth Month Bird Walk – Lullwater (Emory)\nFriday, April 5, 10:25 a.m. – 12:35 p.m., Lullwater Preserve, 1463 Clifton Road\nHosted by Georgia Tech Birdwatchers with support from the Office of Sustainability, attendees can observe and learn about birds with club experts at the scenic Lullwater Preserve near Emory’s campus. Binoculars provided.\nFor registration and additional information, click\nhere .\nTech Beautification Day\nSaturday, April 6, 8:30 a.m. – 12:30 p.m. Tech Green\nCome get your hands dirty to make our campus green and beautiful at the 25th annual Tech Beautification Day, a volunteering event hosted by the Student Government Association and\nInfrastructure and Sustainability . The event is capped at 300 volunteers, so sign up today!\nFor registration and additional information, click\nhere .\nGlobal Media Festival Film Screening: ‘Bigger Than Us’ Documentary + Live Q&A\nSunday, April 7, 2:30 – 5 p.m., John Lewis Student Center, Cypress Theater\nBigger Than Us\nfollows Melati Wijsen, an 18-year-old Indonesian activist fighting plastic pollution in her country as she expands her impact by collaborating with activists across the globe. The screening will be followed by a live virtual discussion with the film’s director, Flore Vasseur.\nThis event is part of the\nGlobal Media Festival,\ntaking place March 29 – April 7 and exploring themes around the UN Sustainable Development Goals. The festival is co-sponsored by the School of Modern Languages; the Atlanta Global Studies Center; the School of Literature, Media, and Communication; and the Brook Byers Institute for Sustainable Systems.\nFor registration and additional information, click\nhere .\nEcoCommons Tour\nWednesday, April 10, Noon – 1 p.m., The Kendeda Building for Innovative Sustainable Design\nThe 80-acre EcoCommons is one of Georgia Tech’s most impressive sustainability features. Institute Landscape Architect Jason Gregory will lead attendees on a tour to learn about the native performance landscape adjacent to The Kendeda Building.\nCarbon Reduction Challenge Info Session – Virtual\nThursday, April 11, 11 – 11:50 a.m., Online\nThe Carbon Reduction Challenge is a competition focused on empowering students to become part of the climate change solution. Join the Ray C. Anderson Center for Sustainable Business for a virtual information session to learn more about participating in the challenge this summer.\nFor registration and more information, click\nhere .\nClimate FRESK Workshops\nThursday, April 11, Noon – 3:30 p.m., Kendeda Seminar Room 118\nMonday, April 15, 11 a.m. – 2:30 p.m., Kendeda Seminar Room 118\nThursday, April 19, 10 a.m. – 1:30 p.m., O’Keefe Building, third floor, Sunroom conference room*\nClimate FRESK is an internationally recognized workshop based on scientific reports from the Intergovernmental Panel on Climate Change that teaches the fundamental causes and effects of climate change through a collaborative and engaging game. The Office of Sustainability will host three FRESK Workshops throughout April.\n*The workshop on April 19 is co-sponsored by the Georgia Tech French Club and will be held partially in French.\nFor more information and registration, click\nhere .\nBBISS Seminar Series: Neha Kumar\nThursday, April 11, 3 – 4 p.m., Hybrid Event – Online and BBISS Offices, 760 Spring Street, Suite 160\nNeha Kumar is an associate professor in the School of International Affairs and the School of Interactive Computing at Georgia Tech. She will present a new paper that describes opportunities for human–computer interaction to reimagine the design of sociotechnical systems toward advancing sustainable, just, and humane futures.\nFor more information and the event link, click\nhere .\nAtlanta Global Studies Symposium: Languages of Sustainability and the Global South\nFriday, April 12, 8:30 a.m. – 7 p.m., Main Auditorium, Technology Square Research Building\nHosted by the Atlanta Global Studies Center and with support from the Emory University Office of Global Strategy and Initiatives, the symposium will present initiatives that promote global education, language learning, sustainable development, and community engagement. Partners, faculty, students, community organizers, K-12 teachers, and the public are welcome.\nFor more information and registration, click\nhere .\nFrontiers in Science: Climate Action\nThursday, April 18, 9 a.m. – 5:30 p.m., The Dalney Building\nThe College of Sciences will convene 100 campus and community stakeholders to discuss groundbreaking research on climate change, challenges, and solutions. More than 25\nspeakers and panelists\nfrom across Georgia Tech and Atlanta will share their work and ideas to address major climate and community challenges. Frontiers will also feature leadership keynotes, a\nstudent video showcase\nwith scholarships, networking lunch and reception, and a Strategic Energy Institute interdisciplinary\nseed grant challenge\nfor assistant professors.\nAttendance is by invitation, and registration is limited.\nTo suggest participants, please contact: events@cos.gatech.edu.\nCarbon Reduction Challenge Spring Showcase\nFriday, April 19, 2 – 4 p.m., The Kendeda Building for Innovative Sustainable Design\nEight teams composed of students enrolled in Earth and Atmospheric Sciences 3111, “Energy, Environment, and Society,” will present their final semester-long Carbon Reduction Challenge projects. The projects show more than 9 million pounds of carbon dioxide reductions annually while generating yearly savings of over $500 million in energy bills and carbon sequestration. Attendees can enjoy snacks and drinks and vote for their favorite project.\nFor more information and registration, click\nhere .\nSustain-X Hangout\nTuesday, April 23, 3 p.m. – 4 p.m., Hybrid/Scheller College of Business, Room 4426\nA partnership between the\nRay C. Anderson Center for Sustainable Business\nand\nCREATE-X , Sustain-X is a Sustainability Next and Georgia Tech strategic plan project. With events occurring on the fourth Tuesday of every month, this session will examine social and environmental entrepreneurship and how to access resources for projects.\nFor more information and to register, click\nhere .\nInterdisciplinary and Critical Approaches to Sustainability\nWednesday, April 24, 2024, 8:30 a.m. – 6 p.m.\nThe Atlanta Global Studies Center will present a conference entitled “Sustainability in a Planet of Diverse Knowledges and Persistent Inequalities.” The event features Georgia Tech faculty panels   and keynotes from Nelson Maldonado-Torres and Jessica Hernandez on “Colonial and Decolonial Sustainabilities” and “Indigenous Science: From Local to Global Context,” respectively.\nFor more information and registration, click\nhere .\nBBISS Seminar Series – Fani Boukouvala\nThursday, April 25, 3 – 4 p.m., Hybrid/BBISS Offices, 760 Spring Street, Suite 160\nFani Boukouvala, assistant professor in the School of Chemical and Biomolecular Engineering, will present a talk about a new approach for chemical conversion of waste plastics to their original raw materials, including a detailed process modeling of a chemical reactor validated by experimental data, and proceed with simulation of an entire pilot scale facility.\nFor the event link, click\nhere .\nAdditional events, volunteer opportunities, and campaigns are posted on the\nEarth Month calendar .  Submit your event to be featured via the Earth Month\nform .\nContact\nAbby Bower\nSustainability Program Support Coordinator\nOffice of Sustainability | sustain.gatech.edu\nInfrastructure and Sustainability\nEmail\nAbby.bower@sustain.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}