{"text": "Nine Georgia Tech-Emory Biomedical Projects Receive Coulter Foundation Funding | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNine Georgia Tech-Emory Biomedical Projects Receive Coulter Foundation Funding\nSeed funding from Coulter Foundation is designed to accelerate nine promising projects.\nFacebook\nTwitter\nEmail\nRavi Bellamkonda, Wallace Coulter Biomedical Engineering Dept. Chair\nJul 21, 2015\n— Atlanta, GA\nNine Georgia Tech and Emory University biomedical research projects have been chosen to receive funding from the Coulter Translational Research Partnership Program. The $1.6 million in seed funding is intended to accelerate promising technologies developed in research laboratories with the goal of improving patients’ lives. This year’s projects include a rehabilitation device for children, a heart drug delivery catheter and a disposable kit that checks for anemia. The Coulter program, which partners with the Wallace H. Coulter Department of Biomedical Engineering at Georgia Tech and Emory, provides annual awards to research teams that develop products with great commercial potential and meet a well-defined health care need. Each research team pairs scientists or engineers with physicians. This year’s amount also includes $100,000 contributed by the Atlanta Clinical and Translational Science Institute. “We were very happy with the number of good projects we saw during this year’s funding round,” said Rachael Hagan, who serves as program director for the Coulter Translational Partnership Program. More than 50 applications requesting funding were received this year. “In June, we vetted each application for its potential to achieve commercial success with the help of professional health care consultants in marketing, regulatory, reimbursement and intellectual property to determine the likelihood of receiving commercial follow-on funding for these health care innovations. Projects that have been selected for funding will continue to work with these business experts to commercially de-risk their technologies to ensure successfully exiting the universities.” The project awardees this year were: AnemoCheck:\na simple, disposable, handheld biochemical device that is inexpensive, accurate and provides a quantitative evaluation of anemia in less than two minutes (principal investigators: Wilbur Lam and Erika Tyburski). AngioCloud : cloud-based software that assists interventional neurologists with the selection and deployment of flow diverters for the treatment of unruptured brain aneurysms (principal investigators: Frank Tong and Alessandro Veneziani). Cardiovascular MR Imaging:\nmethod of uploading, displaying, and automatically analyzing cardiovascular magnetic resonance function, viability and perfusion studies (principal investigators: Ernest Garcia, John Oshinski, Gerald Pohost and Anthony Yezzi). InvisiCool : gel to alleviate heat-related pain while not otherwise affecting the effectiveness of laser treatments (principal investigators: Jeff Dover, Andrei Fedorov and Craig Green). KIDS : a low-volume, low-error continuous renal replacement therapy (CRRT) device for pediatric patients. There are currently no FDA-approved CRRT devices for patients who weigh less than 20 kilograms, and the KIDS technology is being developed to meet this unmet need (principal investigators: Shiva Arjunon and Matt Paden). Levit Catheter :  a drug delivery catheter for localized delivery of therapeutic-seeded hydrogels to the pericardial space (principal investigators: Andres Garcia and Rebecca Levit). MitraPlug : a transcatheter implant that seeks to “plug” the fluid path, which is seen in patients with mitral regurgitation (principal investigators: Murali Padala and Eric Sarin). Nanocomposite Scintillators:\nan imaging replacement for current, expensive crystals (principal investigators: Brooke Beckert, Eric Elder and Jason Nadler). IC3D : an imaging silicon chip for Chronic Total Occlusion (CTO) procedures with improved visualization for physicians (principal investigators: Levent Degertekin and Habib Samady).\nThese newly funded academic projects were chosen by a committee composed of Emory doctors, Georgia Tech biomedical engineers and technology transfer representatives from each school. The other half of the selection committee included industry experts, venture capital specialists, serial entrepreneurs and angel investors. “This seed funding is similar to venture capital funding, except there are no strings attached,” said Hagan. “Our committee picks projects based on a higher probability of receiving  commercial follow-on investment in hopes our best clinical research moves out of our universities to actual patient care.” “It is tremendously exciting to reinvigorate the Coulter Translational Program with an investment of over $1.5 million per year,” said Ajit Yoganathan, Regents’ Professor and associate chair for translational research in the Wallace H. Coulter Department of Biomedical Engineering. “The excitement and need for the program was obvious based on the number of initial applications. It demonstrates there is a pipeline of translational projects that has the potential for commercialization at Georgia Tech and Emory. The projects selected for funding cut across various areas of medicine including pediatrics. Funding pediatric technologies is critical, since kids are an underserved population.”  In 2001, the Wallace H. Coulter Foundation made a $25 million grant to the Georgia Tech-Emory biomedical engineering program. In recognition of this grant, the combined department is known as the Wallace H. Coulter Department of Biomedical Engineering at Georgia Tech and Emory. The department combines Georgia Tech’s College of Engineering with Emory’s School of Medicine. The grant also contains a $10 million endowment to provide ongoing funding specifically for translational research. Translational research is part of a continuum in which research findings are moved from a researcher’s laboratory to a patient’s bedside and community. Each year, co-investigators – composed of engineering faculty from Georgia Tech and medical staff and faculty from Emory – apply for commercialization funding that may lead to improvements in patient care. “Since our inception, our collaborative biomedical engineering department has leveraged academic, industry and donor support to create some of the best physician and engineering teams in the world,” said Ravi Bellamkonda, chair of the Coulter Department. “Our entrepreneurial spirit and culture combined with the world-class facilities at Georgia Tech and Emory result in a unique environment that fosters innovation.  We are fortunate to be able to provide funding to accelerate the development of these promising biomedical technologies so they can reach patients faster and be successfully translated from the laboratory to clinical use.” The Coulter Department is the Coulter Foundation’s flagship academic institution. The department’s graduate program is ranked number two by\nU.S. News & World Report . There are an additional 14 universities with Translational Research Partnership Programs supported by the foundation that include distinguished biomedical research institutions such as Johns Hopkins, Duke, Columbia, and Stanford universities.\nAdditional Images\nRelated links\nWallace H. Coulter Department of Biomedical Engineering\nContact\nWalter Rich\nCommunications Manager\nWallace H. Coulter Department of Biomedical Engineering\nEmail\nwrich@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}