{"text": "Georgia Tech Plans Tokyo Redesign Using Social Data – Including Tweets | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Plans Tokyo Redesign Using Social Data – Including Tweets\nStudents use big data and machine learning for neighborhood proposals.\nFacebook\nTwitter\nEmail\nPerry Yang with Tokyo Smart City designs, in the Eco Urban Lab\nApr 05, 2022\n— Atlanta, GA\nWhat if everyone in a neighborhood had a voice in redesigning it? How can city planners democratize future smart cities, big data analytics and decision-making by involving citizen participation?\nThat’s the vision of the Tokyo Smart City Studio, using GPS and other location data to track trends in human behavior. The studio is part of the  Eco Urban Lab , directed by  Perry Yang . In the Studio, Georgia Tech designers are changing the way we plan cities.\nAccording to Yang, designers need to know, “how urban form accommodates flows of all kinds, including information, energy, and human movements, and how patterns of flows are mapped through physical configurations that change over time.” Using advanced analytics on a massive pool of data, designers can see how people choose to use a space. Then, they can make decisions based on real behavior rather than theoretical models or small surveys, Yang said.\nProjects from the Studio recently drew Esri’s attention for their advanced use of geographic analytics. As part of the studio, students used large-scale location data to model traffic flows in different segments of Tokyo.\nEsri is best known as the company that developed GIS (geographic information system) software which is widely used by city and regional planners.  Esri's blog  covers innovative use of geospatial data.\nTo date, the Studio has delivered smart-city proposals for three different Tokyo neighborhoods: Urawa-Misono in 2017, Kyojima in 2018-2019, and Shinagawa in 2020. Yang said this year’s project will involve the Nihonbashi district, home of the Tokyo Stock Exchange and a historic origin of Tokyo’s modern urban culture.\nTokyo is one of the busiest, most populous cities in the world, and as such, it’s difficult to create sustainable, healthy environments, said Yang. His studio focuses on global collaboration to solve the problems facing cities like Tokyo.\nFor the Nihonbashi district, the Studio is collaborating with the  Department of Urban Engineering at the University of Tokyo ; the  Global Carbon Project ; the  National Institute for Environmental Studies, Japan ; and the  Mitsui Fudosan University of Tokyo Laboratory .\nThanks to the diversity of ideas that this collaboration generates, the Tokyo Smart City Studio proposals aren’t purely theoretical. Students work on real neighborhood needs identified by the local government, using real on-site data gathered and processed by groundbreaking methods. Massive amounts of data require AI techniques and algorithms to process some of them.\nDesign Makes Cities Smart\nUnlike a smartphone or a smart home, a smart city is measured by more than its Internet connection or its automation. A city is smart because its design is based on data about flows of people, resources, energy, and information. “Empowered by new tools and technologies, cities are now far more designable than ever before. Future urban design and development are to be data-driven,\" Yang said.\n\"Cities are becoming more interactive and situation-driven and have to be more responsive, adaptable, and resilient to future conditions.”\nOnly in the past few years have smartphones, GPS, and Internet-of-Things (IoT) devices made real data on a city-wide scale available. These new technologies may enable good planning that is driven by social, institutional, and physical contexts, Yang said.\nStudents Predict Mobility Using AI Techniques\nBut new data and a new design philosophy require new methods of design, which haven’t been created yet.  To meet this challenge, Yang’s students use AI techniques to create models of behavior.\nAn early test in Urawa-Misono used Tokyo traffic data. The model was “trained” using existing traffic data. Designers then check the model to see if correctly predicts congestion points. If it works, that suggests the model can be used to estimate the impact of design changes on traffic flow.\nMethods like this allow designers to move mobility analytics into the design phase. Mobility is key in the urban environment, but mobility studies usually aren’t done until we envision how future urban spaces are shaped through design.\n“Mobility research during these studios developed test processes to better integrate mobility metrics with design decisions,” Yang said.\nThe following studio in Kyojima expanded the role of deep learning techniques. Georgia Tech students participated in street experiments in Tokyo by carrying vital sensors to measure data such as  heart beat, temperature, humidity, UV, pressure and acceleration of human movement, to understand human perception and their connections to urban street environments. Students created a rapid automatic assessment of sequential urban experiences: basically, how pleasant a person would experience walking down a street.\nThe resulting article,  Computing Sequential Experience of an Urban Street using Deep Learning Technique , led by Helen Chen, a Ph.D. student in the School of City and Regional Planning, was presented at the 2019 International Conference of Urban Informatics.\nBoth the Urawa-Misono and Kyojima studio projects made mobility analysis and feedback part of the design phase, yielding designs better supporting resilience, sustainability, and community health.\nUsing Social Media to Check Risk of Heat Stress\nIn Tokyo, studio planners expanded mobility studies to include public health. Tokyo officials were concerned that heat waves would pose a risk to the 2020 Olympic crowds.\nTo address this, researchers used a combination of GPS and social networking service information to track people’s motion and response to heat “in near real-time [and] in high spatial resolution,” said Yang.\nStudents used thermal images from a helicopter to find hot zones. GPS data showed pedestrian exposure to those hot zones. The combination of heat and pedestrian exposure allowed prediction of risky areas.\nIn collaboration with partners in Japan, researchers searched geotagged twitter data for terms related to heat discomfort. They found a high correlation between the predicted risk zones and areas where people complained about heat.\nBoth the prediction of heat risk and the use of social media to check the prediction are new methods developed in the Studio.\nAdditional Images\nEmail\nann.hoevel@design.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}