{"text": "Georgia Tech Internet of Things Center Offers Perspectives on IoT-Facilitated User Engagement | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Internet of Things Center Offers Perspectives on IoT-Facilitated User Engagement\nCDAIT releases white paper titled “Driving New Modes of IoT-Facilitated Citizen/User Engagement.”\nFacebook\nTwitter\nEmail\nThe Centergy Building in Technology Square is the headquarters for the Center for the Development and Application of Internet of Things Technologies (CDAIT).\nJul 09, 2018\n— Atlanta, GA\nWith an ever-expanding research portfolio from Georgia Tech faculty, students and member companies, the Georgia Institute of Technology’s Center for the Development and Application of Internet of Things Technologies (CDAIT) has released a white paper titled “Driving New Modes of IoT-Facilitated Citizen/User Engagement.” It summarizes the collective opinion of practitioners and researchers regarding the Internet of Things (IoT), highlighting in particular the inherent intricacies of its value chain, the possible roadmaps to success, and the critical issues that must be urgently resolved.\nProduced by CDAIT’s IoT Thought Leadership Working Group, the report explores the Smart City ecosystem as “a case in point”, reviewing situations in which emerging technologies bring about radical change to traditional business models and substantial benefits to the IoT users.\n“This report is timely as the Internet of Things is currently generating a lot of questions from legislators, regulators and businesses in the United States and around the world,” said Dr. Karen I. Matthews, Technology and Market Development Manager, Science and Technology at Corning Incorporated, and Chair of the CDAIT IoT Thought Leadership Working Group.\n“On the one hand, the risks surrounding cybersecurity and privacy are a legitimate source of concern, and on the other hand, the expectations fueled by widespread enthusiasm regarding the radical transformative nature of the Internet of Things and its associated huge potential are in some cases slow to materialize,” she said.\nThe white paper introduces an original screening concept called “EPIC,” which is tailored for cities and any other organized collectivity in charge of the public interest to help them assess the attractiveness and impact of IoT-driven undertakings. Through EPIC, an IoT project is evaluated from four angles: Ethics (impact on individuals, groups and society), Profit (economic and social), Intimacy (ease of access, mutual openness and customized experience), and Connectivity (medium, computing and trustworthiness).\n“Readers will find useful discussions and references concerning pressing IoT issues such as security, privacy, platforms and device connection,” said Alain Louchez, Co-founder and Managing Director of CDAIT. “One of the paper’s appeals is that it blends academic and industry perspectives and has a bent for action.”\nAmong the key expectations regarding the IoT future are the following:\nThe IoT will grow in clusters where various use cases and their related devices, applications and connectivity shape their ecosystem.\nThere will be a natural tendency for clusters to link first to other like clusters, creating “clusters of clusters.”\nStandards and regulations will emerge that enhance the performance and interoperability of the clusters of uses.\nThe growth and integration of IoT clusters will ultimately lead to an overall IoT common platform.\nThe paper’s contributors represent a variety of industry sectors and academic disciplines, and are directly involved in building the IoT and its myriad applications. Each shared personal ideas, observations and viewpoints grounded in real-life experience.\n“We hope that this effort will provide a better understanding of what the Internet of Things is about, including benefits, critical challenges, and available avenues to address them,” Matthews said.\nDownload the white paper.\nAbout CDAIT\nThe Center for the Development and Application of Internet of Things Technologies (CDAIT, pronounced “sedate’) is a global, nonprofit, partner-funded center located in Atlanta, GA that fosters interdisciplinary research and education while driving general awareness about the Internet of Things (IoT). CDAIT bridges sponsors with Georgia Institute of Technology (Georgia Tech) faculty and researchers, as well as industry members with similar interests. Central to its value proposition is the belief that only a holistic approach, i.e., mindful of the complexity of the entire IoT value chain and the intricate relationships between the various links, can generate superior results. CDAIT’s broad overarching goal is to expand and promote IoT’s huge potential and transformational capabilities. Anchored at the Georgia Tech Research Institute (GTRI), a highly regarded applied research and development organization with a global impact and focus on real-world research for government and industry, CDAIT is backed by Georgia Tech’s diverse and distinguished community of faculty and researchers. CDAIT aims to efficiently identify, understand and solve challenges and problems that may arise along the entire Internet of Things value chain through six Working Groups: IoT Education and Training; IoT Startup Ecosystem; IoT Thought Leadership; IoT Security and Privacy; IoT Standards and Management; and IoT Research.\nLearn more about CDAIT at\nwww.cdait.gatech.edu .\nAdditional Images\nRelated links\nCDAIT\nWhite Paper - \"Driving New Modes of IoT-Facilitated Citizen/User Engagement\"\nContact\nlance.wallace@comm.gatech.edu\nEmail\nlance.wallace@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}