{"text": "Biomolecular Tweezers Facilitate Study of Mechanical Force Effects on Cells and Proteins | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nBiomolecular Tweezers Facilitate Study of Mechanical Force Effects on Cells and Proteins\nA new type of biomolecular tweezers could help researchers study how mechanical forces affect the biochemical activity of cells and proteins.\nFacebook\nTwitter\nEmail\nResearchers from Georgia Tech and Emory University have developed a new type of biomolecular tweezers that could help researchers study how mechanical forces affect the biochemical activity of cells and proteins. (Image courtesy of Lizhi Cao)\nMar 10, 2014\n— Atlanta, GA\nA new type of biomolecular tweezers could help researchers study how mechanical forces affect the biochemical activity of cells and proteins. The devices – too small to see without a microscope – use opposing magnetic and electrophoretic forces to precisely stretch the cells and molecules, holding them in position so that the activity of receptors and other biochemical activity can be studied. Arrays of the tweezers could be combined to study multiple molecules and cells simultaneously, providing a high-throughput capability for assessing the effects of mechanical forces on a broad scale. Details of the devices, which were developed by researchers at the Georgia Institute of Technology and Emory University in Atlanta, were published February 19, 2014, in the journal\nTechnology . “Our lab has been very interested in mechanical-chemical switches in the extracellular matrix, but we currently have a difficult time interrogating these mechanisms and discovering how they work in vivo,” said\nThomas Barker , an associate professor in the\nWallace H. Coulter Department of Biomedical Engineering at Georgia Tech and Emory University . “This device could help biologists and biomedical engineers answer questions that cannot be answered right now.” For example, a cell that’s binding the extracellular matrix may bind with one receptor while the matrix is being stretched, and a different receptor when it’s not under stress. Those binding differences could drive changes in cell phenotype and affect processes such as cell differentiation. But they are now difficult to study. “Having a device like this will allow us to interrogate what the specific binding sites are and what the specific binding triggers are,” Barker explained. “Right now, we know very little about this area when it comes to protein biochemistry.” Scientists have been able to study how single cells or proteins are affected by mechanical forces, but their activity can vary considerably from cell-to-cell and among molecules. The new tweezers, which are built using nanolithography, can facilitate studying thousands or more cells and proteins in aggregate. The researchers are currently testing prototype 15 by 15 arrays which they believe could be scaled up. “For me, it’s not sufficient to pull and hold onto a single protein,” said Barker. “I have to pull and hold onto tens of thousands of proteins to really use the technologies we have to develop molecular probes.” At the center of the tweezers are 2.8- micron polystyrene microbeads that contain superparamagnetic nanoparticles. The tiny beads are engineered to adhere to a sample being studied. That sample is attached to a bead on one side, and to a magnetic pad on the other. The magnet draws the bead toward it, while an electrophoretic force created by current flowing through a gold wiring pattern pushes the bead away. “The device simultaneously pushes and pulls on the same particle,” Barker explained. “This allows us to hold the sample at a very specific position above the magnet.” Because the forces can be varied, the tweezers can be used to study structures of widely different size scales, from protein molecules to cells – a size difference of approximately a thousand times, noted\nWilbur Lam , an assistant professor in the Coulter Department. Absolute forces in the nano-Newton range applied by the two sources overcome the much smaller effects of Brownian motion and thermal energy, allowing the tweezers to hold the cells or molecules without constant adjustment. “We are basically leveraging microchip technology that has been developed by electrical and mechanical engineers,” Lam noted. “We are able to leverage these very tiny features that enable us to create a very sharp electrical field on one end against an opposing short magnetic field. Because there are two ways of controlling it, we have tight resolution and can get to many different scales.” As a proof of principle for the system, the researchers demonstrated its ability to distinguish between antigen binding to loaded magnetic beads coated with different antibodies. When a sufficient upward force is applied, non-specific antibody coated beads are displaced from the antigen-coated device surface, while beads coated with the specific antibody are more strongly attracted to the surface and retained on it. Barker and Lam began working together on the tweezers three years ago when they realized they had similar interests in studying the effects of mechanical action on different biological systems. “We shouldn’t be surprised that biology can be dictated by physical parameters,” Lam explained. “Everything has to obey the laws of physics, and mechanics gets to the heart of that.” Lam’s interest is at the cellular scale, specifically in blood cells. “Blood cells also respond differently, biologically, when you squeeze them and when you stretch them,” he said. “For instance, we have learned that mechanics has a lot to do with atherosclerosis, but the systems we currently have for studying this mechanism can only look at single-cell events. If you can look at many cells at once, you get a much better statistical view of what’s happening.” Barker’s interests, however, are at the molecular level. “We are primarily interested in evolving antibodies that are capable of distinguishing different force-mediated conformations of proteins,” he explained. “We have a specific protein that we are interested in, but this technique could be applied to any proteins that are suspected to have these force-activated changes in their biochemical activity.” While the tweezers meet the specific experimental needs of Lam and Barker, the researchers hope to find other applications. The tweezers were developed in collaboration with graduate student Lizhi Cao and post-doctoral fellow Zhengchun Peng. “Because of the scale we are able to examine – both molecular and cellular – I think this will have a lot of applications both in protein molecular engineering and biotechnology,” Lam said. “This could be a useful way for people to screen relevant molecules because there currently aren’t good ways to do that.” Beyond biological systems, the device could be used in materials development, microelectronics and even sensing. “This ability to detect discrete binding and unbinding events between molecular species is of high interest right now,” Barker added. “Biosensor applications come out of this naturally.” CITATION : Lizhi Cao, et al., “A combined magnetophoresis/dielectrophoresis based microbead array as a high-throughput biomolecular tweezers,” (Technology 2014).\nhttp://dx.doi.org/10.1142/S2339547814500058 Research News\nGeorgia Institute of Technology 177 North Avenue Atlanta, Georgia  30332-0181  USA Media Relations Contacts : John Toon (404-894-6986) ( jtoon@gatech.edu ) or Brett Israel (404-385-1933) ( brett.israel@comm.gatech.edu ). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News (404) 894-6986 jtoon@gatech.edu\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}