{"text": "Researchers Discover Fate of Melting Glacial Ice | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nResearchers Discover Fate of Melting Glacial Ice\nResearchers have discovered the fate of much of the fresh water that pours into the surrounding oceans as the Greenland ice sheet melts every summer.\nFacebook\nTwitter\nEmail\nIcebergs in the Labrador Sea off the coast of Greenland (photo by Filippos Tagklis, a graduate student in the School of Earth and Atmospheric Sciences).\nApr 25, 2016\n— Atlanta, GA\nWritten by James Hataway, University of Georgia Public Relations Coordinator\nOver the past several decades, scientists have observed a significant increase in the melting of glacial land ice on the island of Greenland, spurring concerns about global sea level rise and the long-term effects of atmospheric warming. What has been less clear, however, is what happens to this meltwater once it enters the ocean. Now, a team of researchers, which is led by the University of Georgia and includes Georgia Tech scientist Annalisa Bracco, has discovered the fate of much of the fresh water that pours into the surrounding oceans as the Greenland ice sheet melts every summer. They published their findings today in the journal Nature Geoscience. “Understanding the fate of meltwater is important, because research has shown that it can carry a variety of nutrients, which may impact biological production in the ocean,” said Renato Castelao, co-author of the study and associate professor of marine sciences at UGA. “There is also evidence that large freshwater inputs could alter ocean currents and affect the normal formation of sea ice.” The researchers created a simulation that tracks meltwater runoff under a variety of atmospheric conditions, and they were surprised to discover that most of the meltwater found off the west coast of Greenland actually originated from ice on the east coast. “Meltwater from Greenland is directed by the surrounding ocean currents, but its fate depends on when and where the runoff occurs and the wind fields driving ocean currents,” said UGA Professor Thomas Mote, a co-author of the paper. According to the model, wind and ocean currents often transport meltwater around the southern tip of Greenland on a westward journey that can take upwards of 60 days. After rounding the tip, the meltwater is largely deposited into the Labrador Sea, an arm of the Atlantic between Canada’s Labrador Peninsula and the east coast of Greenland. Georgia Tech Professor Annalisa Bracco, another co-author of the paper, says the Labrador Sea is a basin of key climate relevance because it’s one of the few places in the world where “deep water” is formed in the ocean through convection. “In winter, water can mix to depths of 2,000 meters (6,000 ft.) and feed deep ocean currents,” said Bracco, a faculty member in Georgia Tech’s School of Earth and Atmospheric Sciences. “Oxygen, nutrients and atmospheric carbon dioxide also mix with the water. If the surface stratification of the ocean changes – because so much melted water reaches the central Labrador Sea – convection will be halted, which creates dangerous consequences for the global climate.” Meltwater originating from the west coast of Greenland, on the other hand, is often kept pinned to the coastline by strong winds, which push it northward toward Baffin Bay. This isn’t always how meltwater from the Greenland ice sheet disperses, as shifts in the prevailing winds can produce very different effects. But scientists must be aware of these shifts in order to fully understand how meltwater will affect the environment, Castelao said. “The meltwater that comes from the east coast could have different qualities from the meltwater on the west coast, including different nutrient compositions,” he said. “We need to take the origins of this meltwater into account when we study the effects of ice sheet melt, as it could impact the oceans differently depending on where it comes from.” And this is a problem that is only going to get worse, said Castelao, citing scientific models that suggest the amount of meltwater runoff from Greenland could more than double before the end of this century. “We need to pay careful attention to where melt and runoff is occurring and how it interacts with surrounding ocean currents, in addition to measuring the total amount of melt,” said Mote. The project also includes UGA’s Hao Luo and Patricia Yager, Asa Rennermalm from Rutgers University and Marco Tedesco of Columbia University. Their study, “Oceanic transport of surface meltwater from the southern Greenland Ice Sheet,” is available at\nhttp://www.nature.com/ngeo/journal/vaop/ncurrent/full/ngeo2708.html .\nAdditional Images\nRelated links\nAnnalisa Bracco's research page\nRead the study\nContact\nJason Maderer National Media Relations maderer@gatech.edu 404-660-2926\nEmail\nmaderer@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}