{"text": "Helping the Air Force Search for Actionable Intelligence Worldwide | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nHelping the Air Force Search for Actionable Intelligence Worldwide\nGTRI researchers are supporting the Air Force Distributed Common Ground System.\nFacebook\nTwitter\nEmail\nThe Air Force Distributed Common Ground System (AF DCGS), also referred to as the AN/GSQ-272 SENTINEL weapon system, is the Air Force’s primary intelligence, surveillance, and reconnaissance (ISR) collection, processing, exploitation, analysis, and dissemination (CPAD) system. (U.S. Air Force photo)\nMay 08, 2018\n— Atlanta, GA\nTwenty-four hours a day, seven days a week, analysts huddle around computer screens in U.S. Air Force facilities around the world scanning for information that might require immediate action. These analysts are part of the Air Force Distributed Common Ground System (AF DCGS), which is designed to sift through vast amounts of information for “needles in the haystack” that are critical to national security.\nResearchers at the\nGeorgia Tech Research Institute\n(GTRI) are supporting the mission of AF DCGS in a broad range of ways. GTRI is providing expertise from subject matter experts in an array of sensing areas in which GTRI researchers have extensive experience supporting the development and prototyping of new services needed by the Air Force, conducting training and technology transfer activities for DCGS personnel, and providing advice on the information technology that underlies the DCGS to the programmers who maintain and enhance the system.\nBy modeling the flow of information through the DCGS, GTRI is helping the Air Force continuously improve the system, boosting efficiency and enhancing its ability to bring together the massive data sets that quickly provide critical information.\n“For the Air Force analysts sitting at these workstations around the clock, we want to make sure they get the information they need as quickly, accurately, and efficiently as possible,” said Molly Gary, a GTRI principal research scientist who has led the project for nearly five years. “We want to help the Air Force improve the fusion of data so the analysts can more quickly get an understanding of what it all means and provide actionable intelligence to the commanders.”\nThe DCGS is the primary intelligence, surveillance, and reconnaissance (ISR) platform for the U.S. Air Force. As part of its operation, more than a thousand analysts sift through a broad range of information, including real-time video, geospatial intelligence, intelligence collected by humans in the field, electronic signals, and other sources to create regular reports on what is happening in global trouble spots.\nThe Air Force system provides globally-integrated ISR capabilities and feeds into subsystems operated by the Army, Navy, Marine Corps, and other agencies that provide information at the unit level.\nThe system is complex, dating back to the 1960s and involving more than two dozen facilities around the world. DCGS has been built by a number of different vendors, contributing to a “stovepipe” system in which analysts on one part of the system do not necessarily have visibility into what analysts in other parts of the system are doing. Other challenges include disparate hardware and software systems, duplicated applications, differing operating systems, redundant software solutions, network security requirements, and a variety of information technology (IT) procedures.\nTo address these challenges, the Air Force is adopting an open architecture strategy in which systems are more standardized and the connections between specialized areas are more transparent – with a goal of making the system modular, more efficient and less expensive to operate. As an independent not-for-profit university-based organization, GTRI is helping map out the full system and how it is connected to the flow of data from one part to another – and ultimately provides information useful to warfighters.\n“By going to an open architecture system, the goal is to break down the barriers between different stovepipes to realize more efficiencies,” said Louis Tirino, a GTRI senior research engineer who’s also supporting the project. “We can help leverage a lot of existing and new technologies that are available to break down those barriers to bringing data together. Ultimately, this will help reduce costs for the Air Force and ease the management burden.”\nRegents Researcher Bill Melvin and Principal Research Engineer Alan Nussbaum teamed together and initiated the partnership with AF DCGS. The program is also supported by GEOINT Specialist and Senior Research Engineer Kyle L. Davis, and SIGINT Specialist and Senior Research Associate Clayton Besse. Several of GTRI’s eight laboratories are involved in different portions of the program.\nOver the past six years, GTRI has been engaged in multiple DCGS tasks. Among them was Project Liberty, which developed and deployed a Forward Processing, Exploitation, and Dissemination (FPED) system to analyze real-time, full-motion video, signals intelligence, and other information to provide critical information to field commanders. The system was delivered just eight months after it was proposed.\nGTRI’s support to DCGS builds on earlier work done to improve the capabilities of the Nation’s Multi-Disciplinary Intelligence (Multi-INT) system, which monitors incoming data. GTRI's work in that effort, known as the Multi-INT (MINT) Data Fusion System, helped automate and rapidly transform functions within the intelligence process to maximize the efficiency and effectiveness of analysts working on this task.\nMINT also addressed issues of improving network bandwidth and information processing power to help human analysts stay on top of incoming data by focusing on the most significant information. It used the STINGER Graph tool, developed by GTRI, to assist in identifying relations between data.\nFor the GTRI researchers, the DCGS work is rewarding because it supports the people who risk their lives in the field.\n“Ultimately, the entire weapons system is to help the analyst and warfighter do their jobs,” said Tirino. “By breaking down these barriers across the different lanes of incoming information, we can help make the information more readily accessible to the analyst. All of this is here to support the warfighters.”\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : John Toon (404-894-6986) (jtoon@gatech.edu).\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}