{"text": "Georgia Tech Lands Seven Yellow Jackets on 2017 Forbes 30 Under 30 | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Lands Seven Yellow Jackets on 2017 Forbes 30 Under 30\nStudents and alumni noted for their strides in science, technology and entrepreneurship.\nFacebook\nTwitter\nEmail\nSeven Yellow Jackets are spotlighted by Forbes Magazine for their outstanding accomplishments.\nJan 13, 2017\n— Atlanta, GA\nKaran Jani , a doctoral researcher at the Center for Relativistic Physics at Georgia Tech, was part of a global team of researchers who helped discover the existence of gravitational waves.\nHis primary research\nfocus is understanding the black holes in our universe and testing Albert Einstein’s General Theory of Relativity. Because of his contributions, he was named a recipient of the 2016 Special Breakthrough Prize in Fundamental Physics awarded by Stephen Hawking. Jani was asked to meet with the prime minister of India to discuss the findings and the greater role of expanding science in India. He hails from a small town in India, and says he had never even seen a telescope until his first year of college, and now he has been part of one of the greatest scientific discoveries of the past century.  Jani also serves as vice president of the Graduate Student Government Association at Georgia Tech. http://www.forbes.com/profile/karan-jani/\nKorin Reid\nearned her Ph.D. in chemical engineering at Georgia Tech. She has now entered the field of big data. “I love data – the bigger, the better,” she says. As a senior data scientist at McKesson, Reid scales predictive modeling and machine learning on billions of medical records reaching 160 million people, all in an effort to improve the quality and efficiency of health care delivery. In her spare time, Reid also writes about pop culture and volunteers her time to teach children about the power of science, technology and engineering.\nhttp://www.forbes.com/profile/korin-reid/\nJasmine Lawrence\ngraduated with a degree in computer science from Georgia Tech and now works with Microsoft. She’s a program manager for Xbox One, working on developing cross-platform social experiences for gamers around the world – including the new Clubs feature on Xbox Live. When Lawrence was 13 she founded her own company, EDEN BodyWorks, a manufacturer of natural hair and skin care products that can be found on the shelves of Target and Wal-Mart stores. In her free time, Lawrence likes to write code, is an avid gamer and reads sci-fi novels. She also finds time to be a motivational speaker for young students to pursue their dreams.\nhttp://www.forbes.com/profile/jasmine-lawrence/\nSean Warner\nearned his degree in construction technology, but developed an idea as a senior at Georgia Tech that has grown into a full-fledged industry. With an idea to use an insect-based food source to close the loophole in agriculture, Warner launched Grubbly Farms. The company has developed a protein-rich food source for aquaculture, livestock animals and pets by collecting food waste from different organizations and feeding it to black soldier fly larvae. As the larvae eat through the food waste, they convert it into a quality fertilizer. Grubbly Farms then processes the larvae into proteins and fats that are manufactured into animal feeds.\nGrubbly Farms – named one of the top 50 disruptive startups by Kairos Society – won the 2016 Sustainable Brands Innovation Open and has been featured in\nThe Guardian.\nhttp://www.forbes.com/profile/grubbly-farms/\nPatrick Pittaluga\n– the business brains behind Grubbly Farms – drives the company’s marketing, business development and sales. He teamed up with his cousin, Sean Warner,\nto launch the company after testing with black solider fly larvae in a laundry room.\n“The flies have a nutritional profile similar to fish meal,” Pittaluga told\nForbes\nmagazine.\nGrubbly Farms has been developing a commercial facility capable of turning five tons of food waste into 500 pounds of protein a day, and looking to expand that output. As a business administration student at Georgia Tech, Pittaluga founded two companies, Predator PC (a custom computer supplier) and Harbor Point (a luxury apparel company).\nhttp://www.forbes.com/profile/grubbly-farms/\nMichael Roytman\nearned his master’s in operations research at Georgia Tech. In 2015 he co-founded Dharma Platform, a company that uses its SaaS platform to collect everything from logistics to food security data for users in the field without requiring Wi-Fi or cell service. A drag-and-drop interface, makes creating data collection and analysis easy for users with varying skill levels as well. Dharma has partnered with the World Health Organization and Doctors Without Borders and has received $1.6 million in funding.\nhttp://www.forbes.com/profile/michael-roytman/\nAs an undergraduate at Tianjin University,\nLu Zhang\ntook part in Georgia Tech’s Atlanta Summer Program, a summer exchange experience that allows students to sample a variety of course offerings and get a glimpse of American history and culture. One of Zhang’s most memorable experiences during her summer exchange was the World of Coca-Cola just a few steps from Georgia Tech’s campus. She’s only been finished with her undergraduate degree for seven short years, but in that span, Zhang has launched and sold a medical device company and has since launched her own venture capital firm in Silicon Valley. http://www.forbes.com/profile/lu-zhang-1/\nAdditional Images\nRelated links\nForbes 30 Under 30 2017\nContact\nSteven Norris\nGeorgia Tech Social Media Team\nEmail\nsnorris@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}