{"text": "Georgia Tech Joins MIT-led Digital Credentials Consortium, Co-Authors New Report on Digital Credentials of the Future | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Joins MIT-led Digital Credentials Consortium, Co-Authors New Report on Digital Credentials of the Future\nGeorgia Tech has joined MIT and 10 other international universities as founding members of the Digital Credentials Consortium, a collaborative, intercollegiate research and design group focused on the creation of verifiable digital credentials.\nFacebook\nTwitter\nEmail\nGeorgia Tech joins MIT's Digital Credentials Consortium as one of 12 founding members.\nFeb 03, 2020\n— Cambridge, Mass.\nGeorgia Tech has joined MIT and 10 other international universities as founding members of the\nDigital Credentials Consortium , a collaborative, intercollegiate research and design group focused on the creation of verifiable infrastructure for digital credentials of academic achievement. The group has released a co-authored report that charts a viable path to developing such infrastructure.\nWith contributors from 12 universities across the globe, the Digital Credentials Consortium’s new white paper,\nBuilding the digital credential infrastructure for the future , outlines a trusted, distributed, and shared infrastructure that provides viable standards for issuing, storing, displaying, and verifying digital academic credentials. While the Consortium’s research focuses on verified digital academic credentials in higher education, the group also turns a critical lens to interoperability standards for post-secondary, lifelong learning, and non-formal education providers, which extends to credentials for the workplace.\nGeorgia Tech’s Center for 21st Century Universities (C21U) serves as the Institute’s Digital Credentials Consortium liaison and key collaborating unit. The new report features C21U’s\nMatt Lisle , director of digital learning technologies, and\nStuart Freeman , applications developer, as key contributing authors.\n“C21U and the Commission on Creating the Next in Education have experimented with blockchain-based credentials for the past year and we are enthusiastic about the opportunity to collaborate with world-class researchers and technologists to build something that is interoperable across institutional boundaries,” said\nFreeman . “Georgia Tech is excited to be part of the Digital Credentials Consortium and to contribute to a report that seeks to define crucial standards for the future of digital credentials.”\nIn\nBuilding the digital credential infrastructure for the future , the authors reiterate the group’s commitment to open source and open standards. The report outlines additional credential standards that the Consortium sees as critical to the development of verifiable digital credentials, including:\nFlexible ways to express the identities of issuers and learners that tie into existing university services\nStronger privacy-by-design and privacy-by-default with attention to regional legal frameworks\nMore reliable revocation mechanisms and credential lifecycle management\nDirect learner agency over one's lifelong learning record\nHigher level of consistency between the machine-readable data of the credential, the human-readable visual representation, and the necessary output formats—paper or digital\n“We’ve set our sights on the design and governance of a technology infrastructure for academic credentials – transforming credentials into tokens of social and human capital that can create new opportunities for participation in education and industry,” said\nPhilipp Schmidt , advisor to the Vice President of Open Learning at MIT. “Our report marks the first step in the process.”\nAbout the Digital Credentials Consortium\nThe Digital Credentials Consortium (DCC) was founded in 2018 by leading universities with expertise in the design of verifiable digital academic credentials. Driven by a mission to create a trusted, distributed, and shared infrastructure that becomes the standard for issuing, storing, displaying, and verifying digital academic credentials, the DCC’s goal is to contribute to an education landscape that increases learner agency and promotes more equitable learning and career pathways. While the Consortium is primarily concerned with use-cases in higher education, their work is also part of a broader effort to bridge post-secondary and lifelong learning, connecting traditional institutions of higher education, non-formal education providers, as well as the workplace, through interoperable standards. Learn more at digitalcredentials.mit.edu.\nFounding Members, Digital Credentials Consortium\nDelft University of Technology\nGeorgia Institute of Technology\nHarvard University\nHasso Plattner Institute, University of Potsdam\nMassachusetts Institute of Technology\nMcMaster University\nTecnológico De Monterrey\nTechnical University of Munich\nUniversity of California, Berkeley\nUniversity of California, Irvine\nUniversity of Milano-Bicocca\nUniversity of Toronto\nAbout the Center for 21st Century Universities\nThe Center for 21st Century Universities (C21U) is Georgia Tech's living laboratory for fundamental change in education. As learners of all ages encounter rapidly changing workforce demands and seek to learn in new ways, Georgia Tech is committed to leading the initiatives that will define the next generation of educational practices and technologies.\nC21U functions as a research arm of the Office of the Provost and works in tandem with campus administrators and faculty to identify, develop, and test new educational platforms and methodologies. Now home to the Commission on Creating the Next in Education (CNE) Program Office, C21U fosters projects that will redefine the entire pipeline of learning. This effort requires close collaboration with and integration of K-12 education as a key part of our commitment to lifetime education. Innovation in this area is led by the Center for Education Integrating Science, Mathematics, and Computing (CEISMC).\nLearn more at\nc21u.gatech.edu\nor connect with us on Twitter\n@c21u . If you would like to find out more about the Commission on Creating the Next in Education (CNE) or become involved in the Commission’s work, please email\ned-innovation@gatech.edu .\nAdditional Images\nContact\nBrittany Aiello\nCommunications Program Manager\nCenter for 21st Century Universities\nCommission on Creating the Next in Education\nbrittany@c21u.gatech.edu\nEmail\nbrittany@c21u.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}