{"text": "Creative Destruction Lab Joins Georgia Tech Scheller College of Business | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nCreative Destruction Lab Joins Georgia Tech Scheller College\nof Business\nGeorgia Tech agreement brings CDL’s successful program for rapid scaling of science-based companies to Atlanta\nFacebook\nTwitter\nEmail\nTechnology Square, Scheller College of Business (Credit: John Toon, Georgia Tech)\nDec 13, 2019\n— Atlanta, GA\nCreative Destruction Lab (CDL), an objectives-based program for massively scalable science- and tech-based companies, is partnering with the Georgia Tech Scheller College of Business for its next North American location, CDL-Atlanta.\nThe Georgia Institute of Technology, also known as Georgia Tech, is one of the world’s leading research universities, globally recognized for its expertise in innovation and technology.\nThe nine-month CDL program employs an objectives-based mentoring process to enhance the performance of technical founders who learn from the insights of experienced entrepreneurs, with the goal of maximizing equity-value creation. The program combines 4 elements to help companies transition from science projects to scalable and financeable companies:\nFocused mentorship from experienced entrepreneurs who have founded, led, and sold significant tech companies\nTechnical advice from world-leading scientists, engineers, and economists, leaders in their respective fields\nHands-on support from top business students, who embed within the company to provide business support\nOpportunities to raise capital, including angels and VCs from Europe and North America\n“We are thrilled to welcome Georgia Tech into the CDL family. They are consistently ranked as one of the top ten engineering departments in the world. This is a significant opportunity for both parties,” said\nAjay Agrawal, founder, Creative Destruction Lab, professor, Rotman School of Management, University of Toronto.\nEstablished more than a century ago, Scheller College of Business is Georgia Tech’s globally-ranked business school, strategically positioned at the intersection of business and technology. As a leader in business education and research, Scheller College is grounded in a comprehensive understanding of how ever-evolving advancements in technology affect the way business is conducted around the world.\n“What excites us the most about bringing the CDL program to the Scheller College of Business is the ability to combine the research excellence of Georgia Tech with the unique CDL model to scale the next generation of startups operating at the scientific frontier ,”\nsaid Alex Oettl ,\nassociate professor, Georgia Tech Scheller College of Business and CDL-Atlanta co-site lead.\nScheller College of Business Dean Maryam Alavi, added, “We are excited to partner with CDL in their expansion into the United States. As part of a world-renowned research institute, Georgia Tech Scheller College is a business school focused on innovation and technology and the impact evolving technologies have in the global marketplace. CDL offers a unique and proven opportunity for emerging science and technology-based businesses to accelerate their growth and quickly develop from market concept to market impact.”\nFounded in 2012 by Professor Ajay Agrawal at the Rotman School of Management at the University of Toronto, the program has now expanded with locations in Oxford, Paris, Vancouver, Calgary, Montreal and Halifax. The successful commercialization of cutting-edge science and technology achieved through the program has led to the creation of over $4.5 billion in equity value.\nApplications for CDL-Atlanta will open in April 2020 for start-ups in the United States and beyond. Twenty-five companies will be accepted in the first cohort. CDL-Atlanta will hold four sessions over the course of the program year, culminating in a Super Session which brings to Toronto the most promising ventures from across all CDL sites.\nLearn more about the Creative Destruction Lab program here:\nhttps://creativedestructionlab.com .\nAbout Georgia Tech Scheller College of Business\nInnovation and technology are at the heart of Scheller College of Business. Incorporating Georgia Tech’s preeminence in innovation and technology with Scheller College’s leading-edge advancements in business and commerce, Scheller employs these exceptional strengths to develop business leaders equipped to leverage technology and create value in any global business setting.\nIn addition to its globally-ranked Undergraduate, MBA, and PhD programs, Scheller’s portfolio also includes the Business Analytics Center, the Institute for Leadership and Entrepreneurship, the Ray C. Anderson Center for Sustainable Business, TI:GER (Technological Innovation: Generating Economic Results, CIBER (the Center for International Business Education and Research), and the Steven A. Denning Technology and Management Program.\nTech Square Innovation Ecosystem\nScheller College is located in the heart of Atlanta’s globally recognized Technology “Tech” Square, a nexus of innovation and entrepreneurship for business and technology. Honored by the Association of University Research Parks, Tech Square is a mixed-use innovation ecosystem comprising more than 1.4 million square feet with more than 100 startups and 22 corporate innovation centers, including innovation centers for Fortune 500 corporations. In addition to Scheller College of Business, Tech Square is also home to Georgia Tech’s Enterprise Innovation Institute, Advanced Technology Development Center (ATDC), VentureLab, and CODA, a 21-story 645,000 square foot center for business innovation and institutional research. CODA houses Hive, a $5.3M supercomputer that enables data-driven discoveries in data science, computational astrophysics, biology, chemistry, and materials science.\nLearn more about Scheller College of Business\nAbout Creative Destruction Lab\nCreative Destruction Lab is a not-for-profit program for massively scalable, seed-stage science- and technology-based companies. Its nine-month program pairs founders with experienced entrepreneurs and investors to set focused, measurable objectives with the goal of maximizing equity-value creation. Founded in 2012 by Professor Ajay Agrawal at the Rotman School of Management at the University of Toronto, the program has now expanded with locations in Vancouver, Calgary, Montreal, Halifax, Oxford and Paris. Since its inception, companies that have participated in the CDL program have created more than $4.5 billion (CAD) in equity value. CDL alumni include North (Waterloo), Atomwise (San Francisco), Kyndi (Palo Alto), Xanadu (Toronto), BenchSci (Toronto), Kheiron Medical (London), and Roadbotics (Pittsburgh).\nAbout Rotman School of Management\nThe Rotman School of Management is part of the University of Toronto, a global centre of research and teaching excellence at the heart of Canada’s commercial capital. Rotman is a catalyst for transformative learning, insights and public engagement, bringing together diverse views and initiatives around a defining purpose: to create value for business and society. For more information, visit www.rotman.utoronto.ca.\nAdditional Images\nContact\nTeresa Daniel\nteresa.daniel@scheller.gatech.edu\nEmail\nteresa.daniel@scheller.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}