{"text": "Brilliant Glow of Paint-On Semiconductors Comes from Ornate Quantum Physics | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nBrilliant Glow of Paint-On Semiconductors Comes from Ornate Quantum Physics\nA new revolution in semiconductors could transform lighting and solar energy, and this is what their crazy physics look like.\nFacebook\nTwitter\nEmail\nLaser light in the visible range is processed for use in the testing of quantum properties in materials in Carlos Silva's lab at Georgia Tech. Credit: Georgia Tech / Rob Felt\nJan 14, 2019\n— Atlanta, GA\nLED lights and monitors, and quality solar panels were born of a revolution in  semiconductors  that efficiently convert energy to light or vice versa. Now, next-generation semiconducting materials are on the horizon, and  in a new study , researchers have uncovered eccentric physics behind their potential to transform lighting technology and photovoltaics yet again.\nComparing the quantum properties of these emerging so-called hybrid semiconductors with those of their established predecessors is about like comparing the Bolshoi Ballet to jumping jacks. Twirling troupes of quantum particles undulate through the emerging materials, creating, with ease, highly desirable optoelectronic (light-electronic) properties, according to a team of physical chemists led by  researchers at the Georgia Institute of Technology .\nThese same properties are impractical to achieve in established semiconductors.\nThe particles moving through these new materials also engage the material itself in the quantum action, akin to dancers enticing the floor to dance with them. The researchers were able to measure patterns in the material caused by the dancing and relate them to the emerging material’s quantum properties and to energy introduced into the material.\nThese insights could help engineers work productively with the new class of semiconductors.\nUnusually flexible semiconductors\nThe emerging material’s ability to house diverse, eccentric quantum particle movements, analogous to the dancers, is directly related to its unusual flexibility on a molecular level, analogous to the dancefloor that joins in the dances. By contrast, established semiconductors have rigid, straight-laced molecular structures that leave the dancing to quantum particles.\nThe class of hybrid semiconductors the researchers examined is called  halide organic-inorganic perovskite  (HOIP), which will be explained in more detail at bottom along with the “hybrid” semiconductor designation, which combines a crystal lattice -- common in semiconductors -- with a layer of innovatively flexing material.\nBeyond their promise of unique radiance and energy-efficiency, HOIPs are easy to produce and apply.\nPaint them on\n“One compelling advantage is that HOIPs are made using low temperatures and processed in solution,” said  Carlos Silva, a professor in Georgia Tech’s School of Chemistry and Biochemistry . “It takes much less energy to make them, and you can make big batches.” Silva co-led the study alongside  Ajay Ram Srimath Kandada  from Georgia Tech and the Istituto Italiano di Tecnologia.\nIt takes high temperatures to make most semiconductors in small quantities, and they are rigid to apply to surfaces, but HOIPs could be painted on to make LEDs, lasers or even window glass that could glow in any color from aquamarine to fuchsia. Lighting with HOIPs may require very little energy, and solar panel makers could boost photovoltaics’ efficiency and slash production costs.\nThe team led by Georgia Tech included researchers from the Université de Mons in Belgium and the Istituto Italiano di Tecnologia. The results were published  on January 14, 2019, in the journal  Nature Materials . The work was funded by the U.S. National Science Foundation, EU Horizon 2020, the Natural Sciences and Engineering Research Council of Canada, the Fond Québécois pour la Recherche, and the Belgian Federal Science Policy Office.\n[Thinking about grad school?  Here's how to apply to Georgia Tech. ]\nQuantum jumping jacks\nSemiconductors in optoelectronic devices can either convert light into electricity or electricity into light. The researchers concentrated on processes connected to the latter: light emission.\nThe trick to getting a material to emit light is, broadly speaking, to apply energy to electrons in the material, so that they take a  quantum leap  up from their orbits around atoms then emit that energy as light when they hop back down to the orbits they had vacated. Established semiconductors can  trap  electrons in areas of the material that strictly limit the electrons’ range of motion then apply energy to those areas to make electrons do quantum leaps in unison to emit useful light when they hop back down in unison.\n“These are  quantum wells , two-dimensional parts of the material that confine these quantum properties to create these particular light emission properties,” Silva said.\nImaginary particle excitement\nThere is a potentially more attractive way to produce the light, and it is a core strength of the new hybrid semiconductors.\nAn electron has a negative charge, and an orbit it vacates after having been excited by energy is a positive charge called an  electron hole . The electron and the hole can gyrate around each other forming a kind of imaginary particle, or  quasiparticle , called an  exciton .\n“The positive-negative attraction in an exciton is called  binding energy , and it’s a very high-energy phenomenon, which makes it great for light emitting,” Silva said.\nWhen the electron and the hole reunite, that releases the binding energy to make light. But usually, excitons are very hard to maintain in a semiconductor.\n“The excitonic properties in conventional semiconductors are only stable at extremely cold temperatures,” Silva said. “But in HOIPs the excitonic properties are very stable at room temperature.”\nOrnate quasiparticle twirling\nExcitons get freed up from their atoms and move around the material. In addition, excitons in an HOIP can whirl around other excitons, forming quasiparticles called biexcitons. And there’s more.\nExcitons also spin around atoms in the material lattice. Much the way an electron and an electron hole create an exciton, this twirl of the exciton around an atomic nucleus gives rise to yet another quasiparticle called a  polaron . All that action can result in excitons transitioning to polarons back. One can even speak of some excitons taking on a “polaronic” nuance.\nCompounding all those dynamics is the fact that HOIPs are full of positively and negatively charged ions. The ornateness of these quantum dances has an overarching effect on the material itself.\nWave patterns resonate\nThe uncommon participation of atoms of the material in these dances with electrons, excitons, biexcitons and polarons creates repetitive nanoscale indentations in the material that are observable as wave patterns and that shift and flux with the amount of energy added to the material.\n“In a ground state, these wave patterns would look a certain way, but with added energy, the excitons do things differently. That changes the wave patterns, and that’s what we measure,” Silva said. “The key observation in the study is that the wave pattern varies with different types of excitons (exciton, biexciton, polaronic/less polaronic).”\nThe indentations also grip the excitons, slowing their mobility through the material, and all these ornate dynamics may affect the quality of light emission.\nRubber band sandwich\nThe material, a halide organic-inorganic perovskite, is a sandwich of two inorganic crystal lattice layers with some organic material in between them – making HOIPs an organic-inorganic hybrid material. The quantum action happens in the crystal lattices.\nThe organic layer in between is like a sheet of rubber bands that makes the crystal lattices into a wobbly but stable dancefloor. Also, HOIPs are put together with many  non-covalent bonds , making the material soft.\nIndividual units of the crystal take a form called perovskite, which is a very even diamond shape, with a metal in the center and halogens such as chlorine or iodine at the points, thus “halide.” For this study, the researchers used a 2D prototype with the formula (PEA) 2 PbI 4 .\nAlso READ:\nPerking up and Crimping the 'Bristles' of Polyelectrolyte Brushes\nThe study was co-authored by Félix Thouin (co-first author), David A. Valverde-Chávez (co-first author), and Ilaria Bargigia, all of Georgia Tech; Claudio Quarti and David Beljonne of the Université de Mons in Belgium; Daniele Cortecchia and Annamaria Petrozza of the Istituto Italiano di Tecnologia. The research was funded by  EU Horizon 2020 (project 705874); the Natural Sciences and Engineering Research Council   of Canada; Fond Québécois pour la Recherche: Nature et Technologies; the National Science Foundation (grant 1838276); Interuniversity Attraction Pole program of the Belgian Federal Science Policy Office (PAI 6/27) and the Fonds de la Recherche Scientifique de Belgique (FNRS-F.R.S.). Beljonne is an F.R.S. director. Any findings, opinions, and conclusions are those of the authors and not necessarily of the funding agencies.\nAdditional Images\nContact\nMedia relations assistance : Ben Brumfield\n(404) 660-1408\nben.brumfield@comm.gatech.edu\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nWriter:  Ben Brumfield\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}