{"text": "Tech Hosts Global Climate Action Symposium | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nTech Hosts Global Climate Action Symposium\nLocal and international scientists, engineers, business and policy experts, student leaders, and artists will showcase climate change solutions.\nFacebook\nTwitter\nEmail\nSep 30, 2020\n— Atlanta, GA\nThe second annual\nGlobal Climate Action Symposium , Oct. 6 – 8, will bring together local and international scientists, engineers, business and policy experts, student leaders, and artists to showcase climate change solutions. The virtual event is jointly sponsored by Georgia Tech and six European consulates during European Climate Diplomacy Week. President Ángel Cabrera will deliver opening remarks.\n“The symposium is a great opportunity to celebrate the diverse, vibrant community that is dedicated to climate solutions here in Atlanta and across the world,” said Kim Cobb, Georgia Power Chair and ADVANCE Professor in the School of Earth and Atmospheric Sciences and director of the Global Change Program. “From science to policy, and from industry to nonprofits, Georgia Tech is thrilled to partner with our EU consulates here in Atlanta to showcase how Georgia is leading on climate solutions, through innovation and partnerships.”\nCobb said symposium attendees will hear from experts working at the intersection of climate and racial justice, and they will get a preview into how a post-pandemic future might accelerate the shift to a low-carbon economy.\n“As a global issue, climate change must be addressed from multiple vantage points, including social equity and justice,” Anna Stenport, professor of Global Studies, chair of the School of Modern Languages, and founding codirector of the Atlanta Global Studies Center, said. “The Atlanta Global Studies Center is thrilled to support an inclusive approach to advancing the Sustainable Development Goals.”\nStudents of all ages can attend and learn more about the climate challenge and how their passions can advance climate solutions.\n“The virtual format has allowed an explosion in the diversity of experiences we can offer our audience,” Cobb said. “Attendees will hear from a wider array of experts, ‘visit’ a number of sites where climate solutions are coming to life, and attend workshops with artists and thinkers located across the world. It is logistically challenging, but everyone has been so eager to work together to make it happen.”\nThe symposium is co-sponsored by\nServe-Learn-Sustain (SLS)\nand the\nAtlanta Global Studies Center , together with six Atlanta-based EU consulates, and it advances Cabrera’s\ninitiative on the United Nations Sustainable Development Goals (SDGs) .\n“The symposium’s three themes, Ecosystems and Climate; Environmental and Climate Justice; and Covid-19 and Green Recovery, overlap with several of the SDGs,” Cobb said. “And its foundation of partnership between Georgia Tech and the EU consulates illustrates how progress on global-scale challenges can happen locally, through a shared vision of what’s possible.”\nJennifer Hirsch, director of Serve-Learn-Sustain, said the event could not be timelier.\n“It will highlight connections that we need to understand and address moving forward — between public health, the natural environment, and equity — to ensure that recovery takes us to a new place, not back to the pre-pandemic normal,” Hirsch said. “The symposium will feature the work of some of our SLS community partners, like the West Atlanta Watershed Alliance. The Global Change Program is taking intersectionality and collaboration to a new level, and we’re excited to be their partner in this work.”\nRegistration is free, and the event is open to the public. Register\nhere .\nAdditional Images\nContact\nVictor Rogers\nInstitute Communications\nEmail\nvictor.rogers@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}