{"text": "Cat Locomotion Could Unlock Better Human Spinal Cord Injury Treatment | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nCat Locomotion Could Unlock Better Human Spinal Cord Injury Treatment\nResearchers at the Georgia Institute of Technology are studying cat locomotion to better understand how the spinal cord works to help humans with partial spinal cord damage walk and maintain balance.\nFacebook\nTwitter\nEmail\nJan 09, 2023\n— Atlanta, GA\nCats always land on their feet, but what makes them so agile? Their unique sense of balance has more in common with humans than it may appear. Researchers at the Georgia Institute of Technology are studying cat locomotion to better understand how the spinal cord works to help humans with partial spinal cord damage walk and maintain balance.\nUsing a mix of experimental studies and computational models, the researchers show that somatosensory feedback, or neural signals from specialized sensors throughout a cat’s body, help inform the spinal cord about the ongoing movement and coordinate the four limbs to keep cats from falling when they encounter obstacles. Research suggests that with those motion-related sensory signals the animal can walk even if the connection between the spinal cord and the brain is partially fractured.\nUnderstanding the mechanisms of this type of balance control is particularly relevant to older people who often have balance issues and can injure themselves in falls. Eventually, the researchers hope this could bring new understanding to somatosensory feedback’s role in balance control. It could also lead to progress in spinal cord injury treatment because the research suggests activation of somatosensory neurons can improve spinal neural networks’ function below the site of spinal cord damage.\n“We have been interested in the mechanisms that make it possible to reactivate injured networks in the spinal cord,” said School of Biological Sciences Professor Boris Prilutsky. “We know from previous studies that somatosensory feedback from moving legs helps activate spinal networks that control locomotion, enabling stable movement.”\nThe researchers presented their findings in “ Sensory Perturbations From Hindlimb Cutaneous Afferents Generate Coordinated Functional Responses in All Four Limbs During Locomotion in Intact Cats ” in the journal\neNeuro .\nCoordinated Cats\nAlthough genetically modified mouse models have recently become dominant in neural control of locomotion research, the cat model offers an important advantage. When they move, mice remain crouched, meaning they are less likely to have balance problems even if somatosensory feedback fails. Humans and cats, on the other hand, cannot maintain balance or even move if they lose sensory information about limb motion. This suggests that larger species, like cats and humans, might have a different organization of spinal neural network controlling locomotion compared to rodents.\nGeorgia Tech partnered with researchers at the University of Sherbrooke in Canada and Drexel University in Philadelphia to better understand how signals from sensory neurons coordinate movements of the four legs. The Sherbrooke lab trained cats to walk on a treadmill at a pace consistent with human gait and then used electrodes to stimulate their sensory nerve.\nThe researchers focused on the sensory nerve that transmits touch sensation from the top of the foot to the spinal cord. By electrically stimulating this nerve, researchers mimicked hitting an obstacle and saw how the cats stumbled and corrected their movement in response. Stimulations were applied in four periods of the walking cycle: mid-stance, stance-to-swing transition, mid-swing, and swing-to-stance transition. From this, they learned that mid-swing and the stance-to-swing transition were the most significant periods because the stimulation increased activity in muscles that flex the knee and hip joints, joint flexion and toe height, step length, and step duration of the stimulated limb.\n“In order to maintain balance, the animal must coordinate movement of the other three limbs, otherwise it would fall,” Prilutsky said. “We found that stimulation of this nerve during the swing phase increases the duration of the stance phase of the other limbs and improves stability.”\nIn effect, when the cat stumbles during the swing phase, the sensation triggers spinal reflexes that ensure the three other limbs stay on the ground and keep the cat upright and balanced, while the swing limb steps over the obstacle.\nComputational Cats\nWith these Canadian lab experiments, the researchers at Georgia Tech and Drexel University are using observations to develop a computational model of the cat’s musculoskeletal and spinal neural control systems. The data gathered are used to compute somatosensory signals related to length, velocity, and produced force of muscles, as well as pressure on the skin in all limbs. This information forms motion sensations in the animal’s spinal cord and contributes to interlimb coordination by the spinal neuronal networks.\n“To help treat any disease, we need to understand how the intact system works,” Prilutsky said. “That was one reason why this study was performed, so we could understand how the spinal networks coordinate limb movements and develop a realistic computational model of spinal control of locomotion. This will help us know better how the spinal cord controls locomotion.”\nCITATION: Merlet AN, Jéhannin P, Mari S, Lecomte CG, Audet J, Harnie J, Rybak IA, Prilutsky BI, Frigon A (2022) Sensory Perturbations from Hindlimb Cutaneous Afferents Generate Coordinated Functional Responses in All Four Limbs during Locomotion in Intact Cats. eNeuro 9: 0178-22.\nDOI: 10.1523/ENEURO.0178-22.2022\nAdditional Images\nContact\nTess Malone, Senior Research Writer/Editor\ntess.malone@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}