{"text": "It Takes More than Peer Pressure to Make Large Microgels Fit In | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nIt Takes More than Peer Pressure to Make Large Microgels Fit In\nResearchers believe they now understand why oversized microgels shrink to fit in with colloidal crystals.\nFacebook\nTwitter\nEmail\nResearchers now believe they understand why oversized microgel particles spontaneously shrink to allow formation of colloidal crystals in assemblies of smaller microparticles. Shown in a laboratory used to study the particles is Georgia Tech Associate Professor Alberto Fernandez-Nieves. (Credit: John Toon, Georgia Tech)\nApr 26, 2016\n— Atlanta, GA\nWhen an assembly of microgel particles includes one particle that's significantly larger than the rest, that oversized particle spontaneously shrinks to match the size of its smaller neighbors. This self-healing nature of the system allows the microparticles to form defect-free colloidal crystals, an unusual property not seen in systems made up of “hard” particles. In 2009, Andrew Lyon, then a professor of chemistry at the Georgia Institute of Technology, observed this dynamic resizing in a microgel system he had created, but the mechanism behind the self-healing process remained uncertain. Now, researchers believe they've finally solved the mystery, and what they've learned could also have implications for biological systems made up of soft organic particles not unlike the polymer microgels. Using small-angle X-ray and neutron scattering techniques, the researchers carefully studied the structures formed by dense concentrations of the microparticles. They also used tiny piezoelectric pressure transducers to measure osmotic pressure changes in the system. Their conclusion: In dense assemblies of microparticles, counter ions bound to the microgels by electrostatic attraction come to be shared by multiple particles, increasing the osmotic pressure which then works to shrink the oversized particle. “When the particles are close enough together, there is a point at which the cloud of ions can no longer be associated with individual particles because they overlap other particles,” said\nAlberto Fernandez-Nieves , an associate professor in the\nSchool of Physics\nat the Georgia Institute of Technology. “The ions create an imbalance between osmotic pressure inside and outside the larger particles, pushing them to de-swell – expel solvent to change size – to match the pressure of the system given by these delocalized ions. This is only possible because the microgel particles are compressible.” The research is reported April 25 in the early edition of the journal\nProceedings of the National Academy of Sciences . The work was supported by the Swiss National Science Foundation, and the research partnership between Georgia Tech and Children’s Healthcare of Atlanta. The presence of non-uniform particles normally creates point defects in the crystals or prevents the formation of crystalline structures altogether. That’s true for structures formed from atoms, but not those formed from the microgels, which are soft cross-linked polymer particles immersed in a solvent. The microgels, which range in size from about 100 nanometers up to several microns in diameter, can exist in either swollen or non-swollen states, depending on such external conditions as temperature. Lyon and his research group reported the self-healing nature of the colloidal crystals in the journal\nAngewandte Chemie International\nin 2009. They initially believed that what they were seeing resulted from energetic issues associated with formation of the crystals. “We interpreted the phenomenon in terms of the overall lattice energy – the propensity of the microgels to form an ordered array – perhaps being larger than the energy required to collapse the defect microgels,” he said. “In other words, we believed there was an energetic penalty associated with disruption of the crystalline lattice that was greater than the energetic penalty associated with individual microgel de-swelling.” Fernandez-Nieves initially supported that hypothesis, but later came believe there was more at work. For instance, the shrunken microgels, which are identifiable because of their higher optical density, freely move about just like the smaller ones, suggesting that the shrinkage doesn’t result from being crowded by the smaller particles. In a collaboration with Researcher Urs Gasser and Ph.D. student Andrea Scotti at the Laboratory for Neutron Scattering and Imaging at the Paul Scherrer Institut in Switzerland, the researchers used X-ray and neutron scattering techniques to study the structure of the suspended microgels and the degree of swelling in the large microparticles of the colloidal crystals. The work confirmed that these larger particles had indeed de-swollen, even at concentrations far larger than those initially used by Lyon’s research team. “The system is able to make point defects disappear, and the mechanism we have proposed allows us to understand why this occurs,” said Fernandez-Nieves. “What we have proposed is a mechanism to explain what we see happening, and we think this is a general mechanism that could potentially apply to a wider range of soft particles.” As a next step, the research group expects to determine the ionic structure to confirm what the existing research has suggested. Fernandez-Nieves believes the work will generate more research with soft particle suspensions, for both experimentalists and theoreticians. “There is indeed much more theory and simulation work needed to confirm what we propose and to fully understand how this self-healing process occurs,” he said. “This principle could be at play in a large number of contexts, including biological systems, in which there is a subtle balance between rigidity, osmotic pressure and ionic balance. This is a mechanism that doesn’t really involve the other particles in the assembly. It involves the ions.” Lyon, now dean of the Schmid College of Science and Technology at Chapman University, believes the findings might go beyond creating better colloidal systems to provide insights into how living cells operate. “By obtaining a deeper insight into microgel assemblies, we may be able to take advantage of the subtle energetic balances that determine the overall structures to create more complex, defect-tolerant assemblies,” he said. “The physics we uncovered here could be relevant for other crowded, soft-materials systems, such as the interior of the eukaryotic cells. Perhaps an extension of this knowledge will provide a better understanding of how the interior of a cell is organized, and how material is transported through this complex and crowded environment.” CITATION : A. Scotti, et al., “Self-healing colloidal crystals: Why soft particles feel the squeeze,”\nProceedings of the National Academy of Sciences , 2016). Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contacts : John Toon (404-894-6986) ( jtoon@gatech.edu ) or Ben Brumfield (404-385-1933) ( ben.brumfield@comm.gatech.edu ). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}