{"text": "The Search for Relief Against Extreme Heat | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nThe Search for Relief Against Extreme Heat\nTemperatures are rising and many are trying to find solutions to the heat crisis, Georgia Tech experts weigh in on risk factors and possible solutions to extreme heat.\nFacebook\nTwitter\nEmail\nAug 09, 2022\n— Atlanta, GA\nTemperatures are climbing around the globe, leaving parts of the world sweltering under extreme heat, with record-breaking temperatures fueling wildfires and severe drought in some areas.\nHeat waves around the world have dashed records, threatened public health, and buckled infrastructure, in what Georgia Tech researchers say are signs of the climate crisis' impact on day-to-day weather.\n“This is a stronger heat wave than it used to be,” says Georgia Tech heat expert Zachary Handlos in the School of Earth and Atmospheric Sciences. “But, really, the concern is that these are expected to happen more frequently as the globe warms and atmosphere warms. So, that means everything is warmer in general.”\nAccording to data from U.S. Centers for Disease Control and Prevention researchers, more than 700 people nationwide died from heat-related causes annually from 2004 to 2018. Some research suggests that the death toll will rise in the coming years as climate change makes extreme heat more common, Handlos adds.\n“It’s like the frog in a boiling pot analogy,” said School of Economics Assistant Professor Casey Wichman. “It may have been cooler five to 10 years ago, but since those temperature fluctuations changed, it seems each year we seem to break new records and have more extreme records.”\nWhile everyone is susceptible to the health effects of heat, some people are at much greater risk than others. Experts at Tech explain that there’s a clear divide broken up differentially along socio-economic lines.\n“Climate change is the greatest threat in human history, and underserved populations are the most at dire risk when it comes to the calamities of the climate crisis,” said Tarek Rakha, assistant professor and director of the\nHigh Performance Building Lab .\n“More than a quarter percent of the disabled community live below the poverty line,” said Senior Research Engineer Maureen Linden from Georgia Tech’s Center for Inclusive Design and Innovation. “So there are more people with disabilities who are living in less resourced environments who wouldn’t be able to afford air conditioning, which makes them more susceptible to extreme heat.”\nIn crowded areas such as downtown cities and underserved communities, the buildings tend to be older and not equipped to effectively provide the temporary relief the residents need on high temperature days, Rakha adds. This also leads to many\nblackouts and brownouts in such areas.\nRolling blackouts and brownouts have affected major cities in many states including Texas and California, leaving many vulnerable to high temperatures over 100 degrees.\nLinden points out that such heat-related emergencies also cause problems for the most vulnerable. Those who are unable to regulate their body temperature or rely on specialized equipment are at a critical risk due to the inability to access power and lifesaving power-dependent equipment.\nPeople with mobility issues face their own difficulty reaching cooling centers either due to distance or the struggle to access areas for relief. This is also something that affects members of the homeless community who may be unable to find adequate shelter, says Wichman.\nThose on land are not the only ones vulnerable to the heat. Handlos notes that sea creatures in the ocean are also highly vulnerable to the extreme heat affecting the temperatures and acidity of the water.\n“The prime examples of this are in the Great Barrier Reefs,” Handlos said. “The high levels of CO 2\nconcentration in the water affects the shells of creatures and gradually erodes them over time.”\nSo what steps are there to prepare for extreme heat or to find relief from sweltering temperatures? Although it may seem daunting to find a solution, Georgia Tech’s experts say small changes can lead to immediate relief for now.\nCertain mitigating measures such as spending more time indoors and altering times engaging in recreational activities, including running and cycling, can help people avoid the risk of heat exhaustion and heat stroke, says Wichman. Wearing lightweight clothing, taking cool showers or baths, and staying hydrated are also helpful tips for day-to-day activities.\nAdditionally, accessible communication and services geared toward the disabled community are vital for relief efforts, Linden said. Making sure communications from the National Weather Service are accessible to all, allowing for proper disaster preparation, could help ease the high mortality rates in natural disasters.\nUltimately, Tech experts stress that policies need to be put in place to ensure the population can survive extreme temperatures in the foreseeable future.\n“It’s a long-term project, but the outcomes of policies for climate change and extreme heat have shown to be positive in these cases,” said Wichman.\nExperts in This Story\nZachary Handlos\nMaureen Linden\nTarek Rakha\nCasey Wichman\nAdditional Images\nContact\nSiobhan Rodriguez\nInstitute Communications\nsar30@gatech.edu\nEmail\nsar30@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}