{"text": "Reinvented Toilets Could Provide Safe Sanitation for 2.5 Billion People | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nReinvented Toilets Could Provide Safe Sanitation for 2.5 Billion People\nGeorgia Tech researchers are leading a $13.5 million effort, funded by the Bill & Melinda Gates Foundation, to reinvent the toilet.\nFacebook\nTwitter\nEmail\nA $13.5 million award from the Bill &amp; Melinda Gates Foundation will improve sanitation to 2.5 billion people worldwide by reinventing the toilet, technology that hasn’t changed much in more than a century. (Photo: Rob Felt, Georgia Tech)\nJul 29, 2019\n— Atlanta, GA\nThere’s a shiny black espresso machine prominently displayed in\nShannon Yee’s\noffice in Georgia Tech’s\nGeorge W. Woodruff School of Mechanical Engineering .\nWhile Yee is indeed a coffee drinker, there is a more important reason for the machine’s presence: Its compact and efficient design may hold the key to meeting the needs of the approximately 2.5 billion people worldwide who now lack improved sanitation. An associate professor specializing in energy technologies, Yee is leading a $13.5 million effort funded by the Bill & Melinda Gates Foundation to reinvent the toilet — technology that hasn’t changed much in more than a century.\nHigh pressure, heat, and control of liquids are essential to making a good cup of espresso. They are also critical for a 21st-century toilet able to reduce human waste to clean water and benign solids, operating with no plumbing or sewerage connections – and an amount of electricity that could potentially be provided by a single solar panel.\nShifting Away from Treatment Plants\nExisting toilets still rely on a key innovation patented in 1775: the S-trap, which holds water in the toilet bowl to prevent sewer gases from entering buildings containing flush toilets. It’s not that the system doesn’t work well, but the world’s poorest cannot afford the sewage treatment infrastructure necessitated by existing toilets.\n“The Reinvent The Toilet Challenge (RTTC) wanted to create a momentous global shift away from sewerage systems,” said Yee. “It can no longer be about running pipes to a central treatment plant.”\nCentralizing the Engineering Efforts\nResearch to reinvent the toilet was launched by the Gates Foundation eight years ago and those efforts have made significant progress toward this goal. But gaps remain, and the broader team will have 42 months to bridge those gaps to produce a minimum of six reinvented toilet prototypes ready for a commercial manufacturer.\nThe new initiative is nicknamed Generation 2 Reinvented Toilet (G2RT). It will build on the exceptional innovations developed during the original RTTC program. The goal will now be to bring the dispersed efforts together to focus on demonstrating prototypes of a single user reinvented toilet (SURT) that the world’s poorest regions can afford.\n“We will have to hit a certain reduction in pathogenic markers like E. coli bacteria, and we will also have to control, treat, and handle the nitrates and phosphates associated with waste,” Yee explained. “It’s a pretty aggressive goal and those metrics will be hard to hit at a cost point of $450. And each SURT will have to operate for less than 15 cents per day.”\nThe G2RT project has formed three engineering teams, two of them headed by researchers from the\nGeorgia Tech Research Institute\n(GTRI) – Georgia Tech’s applied research group – and one from Helbling Technik, the Swiss engineering company that designed Yee’s espresso machine. The GTRI teams will be led by Principal Research Scientist Kevin Caravati and Senior Research Scientist Ilan Stern, both of whom have been involved in creating new products. The Helbling team is being led by Christian Seiler, who holds the title of Head Of Development Process Technologies at the company.\nThe engineering teams are joined by researchers from other institutions, including:\nCranfield University, led by Professors Ewan McAdam and Leon Williams\nDuke University, led by Professor Brian Stoner and Research Scientist Brian Hawkins\nUniversity of Kwazulu Natal in South Africa, led by Professor Chris Buckley\nUniversity of Applied Sciences in Northwestern Switzerland (FHNW), led by Professor Frederic Vogel\nScion, a New Zealand company, led by Environmental Engineer Daniel Gapes\nAt Georgia Tech, GTRI Research Engineer Paula Gómez and microbiologist Stephanie Richter, along with Ph.D. students Bettina Thomas and Amanda Lai and undergraduate student Magdalena Ravello, will develop concepts for features that will serve women, children, seniors, and those with special needs.\nThe research teams will be reviewing all that has been developed so far and asking existing researchers to discuss concepts that may have been discarded along the way. Centralizing the engineering should help accelerate progress toward the G2RT finish line.\n“We want to take the best concepts that have been developed and try to integrate them,” Yee said. “We will look at the problem holistically and try to deliver a series of prototypes tailored for various culturally acceptable use cases.”\nControlling Cost, Creating Value\nCost targets will require some engineering compromises, of course. Instead of using mechanical solenoids common in the developed world, for instance, the SURT will use simpler technology – perhaps a camshaft to control actuation. In addition to being inexpensive and easy to deploy, the SURT will have to be simple to maintain and repair.\nFor homeowners around the world, having an indoor toilet provides perceived value well beyond the cost. “How much are you willing to pay to have a toilet in your house versus the alternative? Once they have clean water and electricity, people start looking at sanitation,” Yee observed.\nThat perceived value provides the basis for what could be a very large market. And that doesn’t include the value of preventing disease, improving dignity, and offering better safety.\nInitially, the new toilets will likely be purchased and installed by non-governmental organizations and governments to demonstrate the potential. Then it will be up to homeowners and others to see the value and make the investment.\nThere are multiple engineering alternatives for what can happen to human waste inside the reinvented toilet. Suffice to say that heat and pressure will be required, and that the result will be water and a dry, odor-free sanitized solid that can be placed into municipal landfills, buried or even burned.\nThe Laws of Thermodynamics\nYee’s interest in the project stems from the thermodynamic issues involved. At Georgia Tech, he has pursued new methods of converting heat into useful energy and developing new cooling technologies. Success of the toilet project will depend on working within the limits of the first and second laws of thermodynamics – using the energy in solid waste, supplemented by a minimal amount of electricity, in the most efficient manner.\n“This is very much a thermodynamics and heat transfer problem,” said Yee. “It comes down to the flow of energy and how we can heat things locally to accomplish what we need with the toilet. I would say we are working at the intersection of thermodynamics, heat transfer, and chemistry.”\nThe strategy will require keeping solids separate from liquids, a practice that conventional sanitation systems abandoned long ago. Existing sewerage systems combine solids and liquids for transport to central treatment plants, where they must be separated – consuming large amounts of both water and energy in plants that are costly to build and operate.\n“A lot of our systems today are based on having large volumes of water to transport the dilute waste streams,” Yee said. “But when you treat human waste, it’s a lot easier to treat a high solid concentration and a high liquid concentration separately.”\nOriginally, the reinvented toilets were supposed to work without electricity. “However, in the last decade, we have seen a dramatic decline in the cost of distributed energy from solar and other sources,” Yee said. “When you look at how rural electrification efforts are going, this electricity input seems reasonable.”\nRecruiting Existing Manufacturers\nThe project will recruit and work with existing manufacturers – companies that can afford to invest $100 million in developing the product for manufacturing – to take over once prototypes have been built. The actual products will depend on cultural norms for each market, but will use common processing technologies.\n“It’s potentially a very large market, but the entry point will be difficult,” Yee admits. “We want to work with large companies that are aligned with the Gates Foundation’s goals of global access and societal good, and help these companies access the $10 billion-per-year market with our technologies.”\nBut fielding reinvented toilets is only part of the battle. They will have to be maintained to keep them working. While that may seem like a major challenge in parts of the world without home repair centers nearby, it could actually provide a new source of employment, Yee noted.\n“Some maintenance is required, but that’s not necessarily a bad thing,” he explained. “You can imagine having a service technician who visits periodically to change a filter.”\nOpportunities in a Grand Challenge\nWhile entrepreneurship still attracts students to universities, Yee is seeing a shift toward the excitement of tackling grand challenges like this one. “The climate is changing at universities and students seem to be focused on the big problems of the world,” he said. “We are getting into this at just the right time.”\nWhile the main technological challenges for G2RT may require professional engineering to reduce risk for manufacturing, components of the challenge will also be open to student design projects. For instance, integrating odor control technologies and potentially including health monitoring may be projects for students to take on.\n“It is quite an honor that the Gates Foundation believes we can tackle this grand challenge,” Yee said. “We are very fortunate to have the infrastructure and past investments that will allow us to do this.”\nLessons for the Developed World\nWhile the Gates Foundation and the G2RT effort are focused on parts of the globe without improved sanitation, the reinvented toilets may ultimately find applications in large cities like Atlanta, Seattle, San Francisco, or Washington where sewerage systems may be in need of replacement.\n“It is going to be far too costly to replace all of that infrastructure at the end of its lifetime,” Yee said. “Cities in the developed world may ultimately want to move in this direction, too.”\nThis publication is based on research funded by the Bill & Melinda Gates Foundation. The findings and conclusions contained within are those of the authors and do not necessarily reflect positions or policies of the Bill & Melinda Gates Foundation.\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : John Toon (404-894-6986) (jtoon@gatech.edu).\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}