{"text": "The Latest on Campus Improvement Projects | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nThe Latest on Campus Improvement Projects\nAs fall semester approaches, construction and renovation projects continue to improve the campus experience for students, faculty, and staff.\nFacebook\nTwitter\nEmail\nWith the completion in 2020 of Phase 1 of the Campus Center Project (the Exhibition Hall and the Pavilions), Phase 2 is now substantially underway and includes the renovation of the original part of the Student Center building, a new three-story addition in place of the Stamps Commons, and upgrades to the Kessler Campanile and its surrounding plaza.Rendering credit: Cooper Cary\nAug 17, 2021\n— Atlanta, GA\nAs fall semester approaches, construction and renovation projects continue to improve the campus experience for students, faculty, and staff. While the pandemic — and the associated reduced population on campus — has enabled some projects to move ahead of the original timeline, global supply chain disruptions in the construction industry are having some effect on campus projects.\nCurrently, all campus projects are moving forward with project managers communicating directly to project owners regarding any cost or scheduling implications. Because of this ever-changing scenario, Design and Construction closely monitors the situation and is adjusting schedules and costs as needed.\nRead on for detailed information about the latest campus improvements.\nIN PROGRESS\nCity of Atlanta Water Main Installation along Techwood Drive\nThe City of Atlanta is installing a 12-inch water main along Techwood Drive between North Avenue and Third Street/Bobby Dodd Way (adjacent to Bobby Dodd Stadium). The project has paused for student move-in but will resume periodically over the next two months during periods of low campus activity. During installation, the northbound lane of Techwood Drive is closed during normal business hours Monday through Friday. The southbound lane is used to maintain two-way traffic, with traffic controllers, during working hours. Both lanes of Techwood Drive are open each night. The access drives to Brittain Dining Hall and those in between Cloudman and Glenn Residence Halls will remain open. On-street parking in ER51 along Techwood Drive may be limited.\nGeorgia Tech Design and Construction is working closely with the City of Atlanta to ensure this campus improvement project remains on schedule with an expected completion date of mid-October.\nPi Mile Marker Improvement Project\nThe Pi Mile Marker improvement project features the replacement of the bronze medallion markers along the trail with the installation of new, more robust granite inlay markers, enhancing the visibility of the trail. Several vertical signs will be installed at key entry points to the trail as well as locations along the path to designate the 1-mile marks. The signage will also provide links to a website for more information.\nIn addition, the recent completion of the EcoCommons coupled with the street work along Tech Parkway/Ferst Drive has slightly altered the route — reducing the amount of road crossings and creating safer path conditions. The estimated completion date is late August. The Alumni Association will host a rededication ceremony for the improved trail in the fall.\nBoggs Building Switchgear Replacement\nCurrent work includes an upgrade to the building’s electrical infrastructure by replacing the existing electrical panelboards, transformers, and switchgear, most of which is original to the building’s 1970 construction.\n1 0 th\nStreet Chiller Plant Improvements\nThe 10th Street plant provides chilled water to the campus and currently operates 24 hours a day, 365 days a year. Improvements will increase the electrical resiliency of the plant by upgrading its four electrical substations. During these improvements, the plant will remain operational, with completion expected in April 2022.\nPhase 2 Campus Center Renovation and Expansion\nWith the completion in 2020 of Phase 1 of the Campus Center Project (the Exhibition Hall and the Pavilions), Phase 2 is now substantially underway and includes the renovation of the original part of the Student Center building, a new three-story addition in place of the Stamps Commons, and upgrades to the Kessler Campanile and its surrounding plaza.\nThe first floor of the Student Center will feature an upgraded Tech Rec (six-lane bowling alley, pool tables, and late-night dining), a revamped Post Office (with high-density mail), and indoor/outdoor dining with covered porch.\nThe second floor will house the food hall, coffee house, information desk, Burdell’s, and DePoe’s Optical, as well as organizational space for student groups. The third story will feature a graduate student lounge, LGBTQIA Resource Center, student government space, and five meeting rooms.\nA large, 298-seat theater will house a full stage and stadium-style seating. Pocket porches on the second and third floors will have the best views of the new Campanile Plaza and will surely be a favorite spot for students, staff, alumni, and visitors.\nThe iconic Campanile and surrounding plaza are being reconfigured to improve accessibility around the site. Its water feature will be updated to become more sustainable so that beloved campus traditions that occur in that space can safely continue. For more information on the Campus Center Renovation and Expansion Phase 2, visit https://studentcenter.gatech.edu/campus-center-project.\nLibrary Interactive Media Bridge\nThe construction of a large, digital screen on the underside of the connector bridge between Price Gilbert and Crosland Tower is underway. This giant screen will provide images of upcoming events, identify campus locations for incoming students, illustrate pertinent Institute data and statistics, and feature student work and departmental programs. Content will be provided by campus communicators from each respective college, division, and unit. The expected completion date is late September.\nLibrary Terraces Art\nThe seventh-floor terraces of Crosland Tower will welcome an art installation by Tristan Al-Haddad, founder of Formations Studio and 10-year faculty member in the Georgia Tech School of Architecture. Composed of spiraling, dichroic polycarbonate strips, the piece creates an incredible spectral symphony as the sun or the viewer moves, providing constant, yet shifting, shafts of light and color.\n“Light is often a metaphor for knowledge, and the library is the storehouse for knowledge on campus,” Al-Haddad said. His creation “breaks white light into its component colors, which represents how all the various streams of knowledge combine in the library to light campus.”\nThe piece will act as a “lantern” in Midtown, said Al-Haddad, allowing viewers to alter how they see the skyline, and how people across Atlanta see the library’s tower. The installation should be complete in early fall.\nJUST GETTING STARTED\nHowey Physics — Lecture Hall 5 Renovation\nFollowing the successful renovation of the four large lecture halls in the building, the design phase for the renovation of the smaller lecture hall 5 is complete and work will mobilize in December of this year. The tiered seating structure will be removed to provide a level classroom area with flexible seating. Marker boards will be installed as well as a new window to the corridor and northern entry, allowing daylight into the revitalized space.\nAdditional Images\nContact\nCathy Brim\nInstitute Communications\nAdditional information\nAbout the Pi Mile:\nSponsored by the Alumni Association, the annual Dean George C. Griffin Pi Mile 5K Road Race is one of the longest continually running races in Atlanta. It is named after former Dean of Students George C. Griffin in honor of his tenure as a track and cross-country coach. Part of the race is run along the Tyler Brown PiMile Trail, a 3.14-mile running course around well-lit areas of campus. Tyler Brown was a former Student Government Association president and ROTC member who was killed in action in Iraq in September 2004. The trail was completed in December 2004 and was dedicated in his honor in April 2005.\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}