{"text": "1.8 Million Face Shields Delivered to Protect Medical Workers from Covid-19 | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\n1.8 Million Face Shields Delivered to Protect Medical Workers from Covid-19\nAn initiative launched by Georgia Tech and supported by a community of companies has helped produce nearly 2 million face shields.\nFacebook\nTwitter\nEmail\nRobin Mauldin, RN, BSN, wears a face shield at Prisma Health Medical Group in Columbia, South Carolina. The shield was produced through a manufacturing effort launched by Georgia Tech and supported by a group of industrial collaborators. (Prisma Health Midlands Foundation)\nJul 27, 2020\n— Atlanta, GA\nPersonal initiatives by a pediatrician and by researchers to make face shields for medical workers have transformed into an industry collaboration that by June had delivered 1.8 million shields to hospitals and other organizations around the country with plans to produce 2.5 million all total. A $2 million donation from Aflac Incorporated for personal protective equipment (PPE) financed the bulk of the shields.\nTo make it happen, a team of researchers and industry partners convened at the\nGlobal Center for Medical Innovation\n(GCMI), a Georgia Tech-affiliated nonprofit that guides new experimental medical solutions to market. The group combined the physician’s vision with the researchers’ original designs, adjusted them to pass FDA emergency guidelines, and then coordinated mass production and distribution.\nA physician’s wisdom\nThe project grew wings in mid-March, after Dr. Joanna Newton became concerned that the nationwide shortage of PPE was leaving healthcare workers across the country vulnerable. Newton is a physician specializing in improving healthcare safety through technology at\nChildren’s Healthcare of Atlanta , and she was already collaborating with Georgia Tech on other projects.\nShe grabbed the phone to leverage the connection.\n“I called Sherry Farrugia to tell her about my idea to 3D-print PPE. We needed to quickly find a solution for the PPE shortage around the country, and I knew we had the right team here in Atlanta to help,” said Newton, a pediatric hematologist/oncologist at the Aflac Cancer and Blood Disorders Center of Children’s.\n“The situation was urgent, and I knew who would have the right expertise to get this done,” said Farrugia, chief operating officer and strategy officer of\nChildren’s Healthcare of Atlanta Pediatric Technology Center , which is part of Georgia Tech.\nFarrugia had Newton present her idea at GCMI to researchers, advisors, and industry partners who immediately put together a team to address the need for face shields to protect healthcare workers from droplets containing the coronavirus. She also discussed the need with\nDevesh Ranjan , associate chair of the\nGeorge W. Woodruff School of Mechanical Engineering , who suggested connecting the effort to a parallel initiative in that school.\nBringing in engineers\nAt the same time, along with Ranjan,  Sam Graham , chair of the\nGeorge W. Woodruff School of Mechanical Engineering , and\nSusan Margulies , chair of the\nWallace H. Coulter Department of Biomedical Engineering , were coordinating efforts across campus to develop various medical devices in response to the pandemic. Graham, Margulies, and Ranjan quickly connected GCMI with\nChristopher Saldana\nand\nSaad Bhamla , faculty members in Georgia Tech’s College of Engineering, who were leading an simultaneous effort to address the face shield problem with their students using rapid fabrication techniques like 3-D printing, laser cutting, and waterjet cutting.\n“The Georgia Tech mechanical engineering team used rapid fabrication equipment and quickly produced multiple face shield designs that could be manufactured in high volumes for the rapid response environment that Covid-19 required,” Saldana said.\nMaking a few thousand shields in a lab had likely already saved lives, but the Georgia Tech researchers and GCMI put their designs on the internet, where they have been downloaded thousands of times by organizations manufacturing them around the world. And the manufacturing partners they engaged have been turning out hundreds of thousands of shields to save many more lives.\n“You may need 45 minutes for a headband with a 3D printer, but manufacturers turn out six of them every 19 seconds. Then making a million face shields becomes a real possibility,” said Mike Fisher, who leads product development at GCMI.\nGCMI opened a GoFundMe page, which brought in $20,000, and then engaged their first manufacturing partner, Delta Air Lines.\nA manufacturing explosion\n“Delta converted one of their groups from manufacturing airplane interiors to doing the face shields. They started off by manufacturing 6,000 shields, and that got the momentum going,” Leiter said. “Two thousand shields went to Mount Sinai Hospital in New York; 2,000 went to Piedmont Healthcare in Atlanta; and 2,000 went to Children’s Healthcare of Atlanta.”\nThings began to snowball.\nGraham engaged Siemens Industries to fulfill a face shield order from the Georgia Emergency Management Agency (GEMA) for distribution in Georgia. Partners from ExxonMobil began looking for more potential manufacturers. And Aflac contacted Children’s looking for worthy Covid-19 related efforts to support.\n“We asked for a donation of $500,000 for manufacturers to retool their operations. Aflac made a gift of $2 million to GCMI to promote the production of PPE,” Farrugia said. “We were able to buy tooling for an automotive plastics manufacturer called Quality Model in South Carolina, and they have made over 750,000 face shields so far.”\nGCMI won a bid from the Federal Emergency Management Agency (FEMA) for 1,141,600 face shields, which are being made by Quality Model, where ExxonMobil helped rearrange production lines for shields.\nSiemens made an additional 100,000 shields from Aflac’s gift, which is also being used to purchase existing PPE to donate to healthcare workers. Kia Motors quickly produced an initial 15,000 shields, which the company financed itself.\n“Kia got the open source design from the Georgia Tech website and ran with it on their own,” Saldana said.\nThese partners are delivering the following number of shields: Quality Model, 1,251,600; Kia Motors, 300,000; Siemens Industries, 205,000; Delta Air Lines, 106,100; Georgia Tech, 20,000; and EIS, 15,000. And more are still to come.\nThe shields went across the country, from hospitals in New York City to Prisma Health in South Carolina, to nursing homes in the Pensacola area, and to rural Louisiana and Mississippi, Leiter said.\nThanks in large part to Aflac’s gift, GCMI and Farrugia are coordinating with partners, including Georgia Tech engineers, to produce N95 masks, hospital gowns, and hand sanitizer, all redesigned for the Covid-19 age.\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Assistance : John Toon (404-894-6986) (jtoon@gatech.edu).\nWriter : Ben Brumfield\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}