{"text": "Some Climate Change Impacts May Appear Sooner than Expected | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nSome Climate Change Impacts May Appear Sooner than Expected\nSome impacts of global climate change will appear much sooner than others.\nFacebook\nTwitter\nEmail\nChildren are shown with buildings in Majuro, the Marshall Islands, with the sea nearby. The Marshall Islands are facing effects of climate change as sea levels rise. (Credit: Wikimedia Commons)\nDec 07, 2015\n— Atlanta, GA\nFor the 70,000 residents of the Marshall Islands, global climate change isn’t a theoretical concern with far-off potential consequences. The island nation is nowhere more than six feet above the Pacific Ocean, and because sea levels are already rising, the nation’s leaders have made plans to move to higher ground in the Fiji Islands. Some impacts of global climate change will appear much sooner than others – with only moderate increases in global temperature. While rising sea levels may one day threaten the commuter tunnels and subway lines of New York City, it will have effects much sooner in other parts of the world. Rising temperatures may one day make parts of the globe uninhabitable, but far lower temperatures may have already begun to decimate coral reefs. Agriculture may also begin to feel the effects well before temperatures rise more than a few degrees globally. Only immediate and aggressive efforts to mitigate the effects of climate change can head off these accelerating near-term impacts, argues a commentary paper published this week in the journal\nNature Geoscience . As more impacts occur, the incentives for addressing the causes of climate change will themselves change, the paper’s authors warn. “Our argument is that if you want to do something, you’d better do something now because over time, you are going to lose the ability to have an impact,” said\nJuan Moreno-Cruz , an assistant professor in Georgia Tech’s\nSchool of Economics\nand one of the paper’s five co-authors. “If we delay action on climate change, the likelihood of doing something will be reduced because the damages will be accelerating. The incentives to address it are going to disappear as more damage occurs.” Climate impacts are often assumed to increase steadily with global temperature increases, but that’s not true for all impacts. The scaling of many climate change impacts with temperature may have a nonlinear sigmoidal pattern, with a dramatic initial impact followed by a leveling off as warming continues, says the paper, which was co-authored by Katharine Ricke and Ken Caldeira at the Carnegie Institution for Science at Stanford, and Jacob Schewe and Anders Levermann at the Pottsdam Institute of Climate Impact Research. At relatively low levels of warming, for instance, rising sea level will impact low-lying nations such as the Marshall Islands and Bangladesh. Relatively modest water temperature increases may kill corals, while a relatively low temperature rise may affect agriculture in equatorial areas, the paper notes. Once significant portions of the Marshall Islands or Bangladesh are destroyed by rising seas, the rate of damage will reach an inflection point, continuing at a decreasing rate so that further temperature increases have little additional effect. The authors call that “saturation” – a point at which most of the harm has already been sustained. The paper, authored by a team of climate scientists, economists and oceanographic experts, was intended to add this notion to the global climate policy discussion. “Once the Marshall Islands are uninhabitable, there is not more damage that can be done there,” Moreno-Cruz said. “For them to benefit, we should have had a climate agreement a long time ago. Once that level of saturation has been reached, they will not have an incentive to participate because they won’t have anything more to lose.” For sectors or countries where climate impacts come early and then begin to saturate, there may be two sets of optimum cost-benefit policies – at different levels of mitigation with different environmental and cultural preservation resulting, the paper notes. For these sectors, there may be strong incentives to limit emissions at low levels of warming before the bulk of the impacts occur. And for certain levels of impact, humans may be able to adjust. For instance, New York City may be able to build walls to keep out the rising Atlantic Ocean, and some coastal communities may be able to move to higher ground. In some parts of the world, wealthy people will simply be able to install air conditioning to address rising temperatures. Once those investments have been made, however, those who have protected themselves will have less incentive to address the causes of climate change because they will have already made an investment, Moreno-Cruz said. For each of these impacts, there will be an optimal point of investing to protect existing capital. To find this optimal amount of protection, “we need to look at climate change impacts not as a total amount, but a rate,” Moreno-Cruz said. “Everything changes at a particular pace. We need to understand those rates, not levels and overall amounts, because that’s how climate change impacts are working.” As an economist, Moreno-Cruz is interested in the policy implications of these accelerating impacts. He is working with other scientists to develop a better understanding of the economic issues involved in climate change impacts. “We have a relatively small window of opportunity in terms of economic incentives underlying the climate science,” Moreno-Cruz said. “Once we pass a certain threshold, we won’t be able to go back because we will lose the incentives to do so. We think it is time to re-think this problem from the ground up, and this paper is our effort to begin that.” Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contact:\nJohn Toon (404-894-6986) ( jtoon@gatech.edu ). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}