{"text": "Canadian Wildfire Smoke Affects Atlanta | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nCanadian Wildfire Smoke Affects Atlanta\nGeorgia Tech experts watch dangerous air quality issues in Atlanta spurred by smoke from hundreds of wildfires ablaze in Canada.\nFacebook\nTwitter\nEmail\nHazy conditions seen around Atlanta due to Canadian wildfires. Orange hazy smoke seen against Atlanta skyline.\nJul 19, 2023\n— Atlanta, GA\nAtlanta is seeing some of the worst air quality in the nation, and the culprit is actually thousands of miles away.\nMore than\n900 wildfires blazing in Canada\nare creating smoke and dust particles that are being carried by the jet stream all the way down to the Deep South. Georgia Tech scientists and researchers are watching closely.\nWildfires themselves aren’t uncommon. But what  is different and, at times, dangerous is the number of particles in the air.\n“It is unusual to experience high concentrations of smoke aerosols within the contiguous U.S. such as what we have been observing recently,” said\nZachary Handlos , meteorologist and s enior academic professional in the\nSchool of Earth and Atmospheric Sciences  at\nGeorgia Tech.\nThe federal government, via AirNow.gov, updates air quality data in real time. This map from Tuesday shows dangerous levels of fine particulates in the air around Atlanta.\nFine particulate matter (also known as PM2.5) levels exceeded 55 micrograms per cubic meter of air south of Atlanta. This is the reason for the recent air quality alerts, which indicated that the air quality in metro Atlanta sat in the orange zone Monday and Tuesday, meaning the air has been potentially hazardous for the most at-risk people.\nOlder persons, pregnant women, young children, and anyone with preexisting health conditions are among the most vulnerable populations. However, anyone can be affected by poor air quality.\nPM2.5 is fine enough to penetrate deep into the lungs,” said\nTalat Odman , principal research engineer and air quality expert from the Georgia Tech\nSchool of Civil and Environmental Engineering .\nBoth Odman and Handlos say an N95 mask can be a big help in filtering out this particulate matter.\nAccording to the Centers for Disease Control and Prevention, wildfire smoke is dangerous\nbecause it contains higher levels of particles that can irritate the eyes, invade and harm the respiratory system, and worsen existing heart and lung diseases.\nHandlos explained that there’s a specific weather pattern helping to create the conditions necessary for all this smoke to travel such far distances.\n“Within the past few days, a large-scale trough feature in the upper troposphere moved through the eastern U.S., which has led to a shift in upper-level winds out of the Northwest,” he said. “This allows for the transport of smoke from Southwestern Canada southeastward all the way into our region.”\nThis same weather pattern has been bringing the smoke from these Canadian wildfires to other cities across the U.S. including Minneapolis, Washington, D.C., and New York. This week has been the first time the smoke has made it so far south.\nWe see this same type of atmospheric conditions during other parts of the year in Atlanta.\n“ Remember the freezing temperatures in Atlanta back in December?” asked Odman. “Similar to those days when air masses coming from Canada brought extremely cold temperatures here, they are bringing smoke from wildfires in Canada now.\"\nThis map from colleagues at the University of Wisconsin shows how wind flow and speed from the jet stream can carry smoke from Canada thousands of miles south toward Atlanta.\nAs Handlos explains, the summer heat and climate change are only working to complicate an already tenuous atmospheric environment.\nAerosols, like the smoke from a wildfire or from synthetic air pollutants, serve as surfaces to which water vapor molecules can attach. These tiny cloud droplets suspend in the air and create the hazy conditions that have been occurring in Atlanta.\n“With global climate change, regions experiencing an increase in temperature could become more susceptible to increased ozone concentration, a pollutant common in cities, as well as smoke blown in by wildfires, which are expected to occur more frequently,” said Handlos.\nWarmer regions are also seeing less rainfall, which puts them at greater risk for wildfires, perpetuating the cycle. This means regions with poor air quality may observe even worse air quality as a result.\nHandlos says climate change models only seem to point to an increased probability of heat waves or warmer-than-average conditions. While the current situation is due to the Canadian wildfires, Handlos says wildfires are generally likely to happen more often due to global climate change.\n“ There is an increase in the frequency and severity of fire events throughout the world. We should expect more events like this when smoke from fires in western U.S. and Canada pollute the air in Atlanta,” Odman concurred.\nBut can anything be done to make the situation better? The answer is complicated. Georgia Tech researchers have been working on ways to capture and clean air pollutants and to\ndetermine certain days where it may be best to\nadjust which power plants were operating\nin specific parts of the state in an effort to control emissions.\n“There aren’t great strategies for eliminating the forest fire haze that reaches Georgia,” explained\nValerie Thomas , the Anderson-Interface Chair of Natural Systems and p rofessor in the\nH. Milton Stewart School of Industrial and Systems Engineering at Tech .\nBut, she says, air pollution created by cars and trucks in major metropolitan areas like Atlanta is only compounded by conditions like the wildfire smoke we’ve been seeing.\n“Staying inside and not driving on days with poor air quality will reduce exposure to air pollution and reduce emissions,” said Thomas.\nAs shared by the New York Times from data supplied by the AirNow.gov, Atlanta still has the worst air quality in the entire country as of Thursday, July 19.\nAdditional Images\nContact\nSteven Norris\nDirector, Media Relations and Social Media\nGeorgia Institute of Technology\nEmail\nsnorris@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}