{"text": "New Research Indicates Political Preferences Influence Online Lending Decisions | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNew Research Indicates Political Preferences Influence Online Lending Decisions\nResearch by Georgia Tech Scheller College of Business faculty member Eric Overby shows political bias exists between investors and borrowers in red or blue states.\nFacebook\nTwitter\nEmail\nMay 25, 2023\nIf you need a loan, you might try walking into a bank branch and meeting with a loan officer. But you might also try a peer-to-peer online lending platform such as\nProsper.com\nor\nKiva . These platforms publish your loan request and interested investors – individuals or companies – fund your loan. In contrast to a bank loan in which the money comes from the bank, the money in a peer-to-peer loan comes from a group of investors, many of whom may be individuals similar to the borrower. If your credit score looks good and your request is reasonable, you should have no problem attracting investors to fund your loan. But what if attracting investors to your loan depends on whether you live in a “red” or a “blue” state?\nThat’s the question two faculty members,\nEric Overby , Catherine and Edwin Wahlen Professor of Information Technology Management at the Georgia Tech Scheller College of Business, and\nHongchang Wang , assistant professor of Information Systems at the University of Texas -Naveen Jindal School of Management, investigated in their paper “ Do Political Differences Inhibit Market Transactions? An Investigation in the Context of Online Lending , ” forthcoming in\nManagement Science .\nLocation and Ideology\nSuppose an investor in Alabama – generally considered a red state – is choosing between two loans to fund. The borrowers have similar profiles, with one living in South Dakota (also a red state) and the other living in Vermont (a blue state). Wang and Overby asked the question: Would the Alabama investor be more likely to fund the South Dakota borrower because they are more likely to share political ideologies and personal worldviews?\nThe researchers used data on who lent to whom in the peer-to-peer lending market prosper.com from 2006 to 2011 to study this question. They applied multiple models, including a gravity model and a difference in differences (DID) model that looked at how investors reacted to California’s legalization of same-sex marriage. They found a nuanced effect. Lending offers dropped by as much as 11.6% when the investor’s state was more conservative than the borrower’s state. But when the investor’s state was more liberal than the borrower’s state, there was no significant relationship.\n“When California legalized same-sex marriage, we found that investors from most states reacted by issuing more lending offers to California borrowers, except for investors from states with much more conservative political ideologies,” said Professor Wang.\n“The difference between investors from liberal and conservative states relates to an on-going debate in the psychology literature,” Professor Overby said. “The ‘prejudice gap’ hypothesis posits that conservatives are more intolerant of liberals than vice versa, whereas the ‘ideological conflict’ hypothesis posits that conservatives and liberals are equally intolerant of each other. Our results are consistent with the ‘prejudice gap’ hypothesis.”\nRelated, the researchers found that borrowers from states that are more liberal than those of the investors active on the platform were less likely to have their loans funded. As Professor Overby explained, “The negative effect of political distance interfered with the basic function of the platform because fewer loans were getting funded.”\nExperience Matters\nHowever, the political distance effect was not apparent for experienced investors. As Wang described, “We found that the political distance between a borrower and the group of investors funding the loan doesn’t affect the loan’s repayment performance. It may be that investors learn this as they gain experience, so they stop considering a borrower’s likely political ideology in their lending decisions.”\nWang and Overby’s research speaks to the negative effects of political polarization. In many cases, those with opposing political ideologies can’t agree on basic facts. The study shows that the negative effects of polarization also apply to peer-to-peer lending, at least for inexperienced investors. But as Overby put it, “The issue we document is not unsolvable. It goes away with experience, likely as investors learn that differences in political ideology don’t predict loan performance. We think education from peer-to-peer lending platforms about the factors that\ndo\npredict loan performance can substitute for this experience.”\nAdditional Images\nRelated links\nWatch the video to hear Dr. Overby talk about his research.\nContact\nLorrie Burroughs\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}