{"text": "Georgia Tech Meets Big Data Challenges by Uniting Under New Institute | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Meets Big Data Challenges by Uniting Under New Institute\nGeorgia Tech announces the new Interdisciplinary Research Institute for Data Engineering and Science, formed to unite researchers across Georgia Tech, foster important partnerships with industry, and play a key role in building the new Coda community.\nFacebook\nTwitter\nEmail\nJul 05, 2016\n— Atlanta, GA\nThe Georgia Institute of Technology is tackling the challenges of big data by creating the new\nInstitute for Data Engineering and Science\n(IDEaS). Announced today, the new Interdisciplinary Research Institute (IRI) will unite researchers across Georgia Tech, foster important partnerships with industry, and play a key role in building the community of the\nrecently announced Coda building\nin Technology Square. IDEaS is jointly led by Co-Executive Directors Srinivas Aluru and Dana Randall, both professors in the College of Computing, and includes researchers and faculty that span all six colleges, creating critical interdisciplinary research opportunities, and positioning Georgia Tech at the forefront of big data solutions.   “As Georgia Tech becomes more visible as a thought leader in data science and engineering, the big idea for IDEaS is to provide the coordination and expertise necessary to link researchers across the Institute, strengthening our position in big data,” said Steve Cross, executive vice president for Research. “Doing so better equips them to take on important and complex problems. It creates meaningful partnerships and accessible resources, and educates future data science leaders. It also addresses long-standing challenges in the world of big data, creating critical push points through the innovation stage, enabling and accelerating the adoption process.”  Data-driven research is becoming commonplace in many fields of science and engineering, with devices, sensors, and scientific instruments collecting enormous amounts of data that must be analyzed with both discipline-specific knowledge and data science skills. The need to forge partnerships and unify resources in this area is widely recognized, as the National Science Foundation recently established four Regional Innovation Hubs.  Aluru co-leads one of these, the\nSouth Big Data Hub , that unites partners across 16 Southern states and Washington, D.C. “The IRI will link research centers and efforts horizontally in foundational areas such as machine learning, high-performance computing, and algorithms,” said Aluru. “It will also drive research within disciplines such as precision medicine, materials science, energy, and smart cities, giving researchers what they need to innovate and pursue challenges on a much bigger scale.” IDEaS will facilitate new ventures and industrial collaboration between Technology Square’s recently announced Coda building research neighborhoods, providing a unique opportunity for academia to rub shoulders with industry, and be an asset to other premier education, research, and public-serving institutions in Georgia, particularly Emory University and the Centers for Disease Control.  It will also collaborate with several stakeholders in the State of Georgia, including the Technology Association of Georgia, and the Georgia Manufacturing Extension Partnership, and serve as an incubator for economic development opportunities.  “Data is a critical part of research and applications everywhere,” said Randall. “Despite impressive advances, many in research and industry remain ill-equipped to derive the most benefits from data. IDEaS exists to change that.”\nAdditional Images\nContact\nJennifer F. Salazar Director of Communication and Grant Writing, Institute for Data Engineering and Science 404-385-4074 jsalazar@gatech.edu\nEmail\njsalazar@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}