{"text": "Tech researchers team up for advanced materials | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nTech researchers team up for advanced materials\nTech researchers use collaboration to push the frontiers of advanced materials research.\nFacebook\nTwitter\nEmail\nJun 01, 2017\n— Atlanta, GA\nBy Renay San Miguel\nAsk Georgia Tech researchers working with advanced materials for examples, and they give a pop culture reference. Two of them even cite the same reference.\n“It’s like\nThe Terminator , liquid metal that then becomes a solid,” says\nAlberto Fernandez-Nieves , associate professor in the School of Physics.\n“Think of\nThe Terminator ,” says another School of Physics associate professor,\nJennifer Curtis .\nPop culture so effectively appropriates next-level science research, that it comes as no surprise that these scientists first thought of Oscar-winning director James Cameron’s shapeshifting “mimetic polyalloy” assassin from the future in\nTerminator 2: Judgment Day .\n“Or that animated movie,\nBig Hero 6 ,” Curtis adds, referring to a 2014 Disney film about nanobots combining to form bigger objects. “We would love to find an original way to create small shapes. And then make them intelligent enough to properly reconfigure in some other way.”\nGeorgia Tech scientists aim to make those science-fiction scenarios real through collaborative, interdisciplinary research at the\nCenter for the Science and Technology of Advanced Materials and Interfaces\n(STAMI).\nLaunched in 2016, STAMI comprises four groups:\nCenter for Organic Photonics and Electronics\n(COPE)\nGeorgia Tech Polymer Network\n(GTPN)\nCommunity for Research on Active Surfaces and Interfaces\n(CRĀSI, pronounced crazy)\nSoft Matter Incubator\n(SMI)\nOf all those acronyms, COPE’s has been around the longest, since 2003. COPE helped develop the optical technologies that enable flat-screen HDTV to deliver sharper resolutions on any monitor size while consuming less power.\nOver the years, COPE has attracted some $84 million in research funding and\nresearch-related\nawards , says\nSeth Marder , Regents Professor in the School of Chemistry and Biochemistry and COPE’s founding director. That’s because “we were able to create multi-investigator proposals with a very high degree of success,” Marder says.\nBecause proposals from centers with teams of researchers tend to attract more funding, Marder and colleagues set up STAMI to brew ideas and foster collaboration among researchers across Georgia Tech.\n“People who work in advanced materials recognize that collaborative approaches are critical,” Marder says. At COPE and now in STAMI, he adds, “we recognize that if you build the strong human relationships, the strong collaborative scientific relationships will be that much stronger, that much more fun, and it will lead to that much more productivity and the opportunity to do other things.”\nThe promise of advanced materials\nWhen subjected to stimuli – such as current, light, heat, or chemicals – liquids, foams, gels, liquid crystals, and other substances may respond and change, or even acquire new functions.\nThe liquid crystal displays (LCDs) and organic light-emitting diodes (OLEDs) in smartphones and TV/computer monitors are organic photonic technologies in action. They are marvelous combinations of thin films, electrolytic gels, and molecules that respond to light and electricity.\nSoft matter is anything that can be prodded, poked, folded, warped, or deformed by weak external causes, including heat and mechanical forces. Examples abound but the science around them is relatively young.\nPolymers, strings of repeating molecular units, can be natural, like the DNA in cells, or synthetic, like the plastics in houses. Manipulating them can yield stronger construction materials or more effective medical treatments.\nAdvanced materials can mean progress from healthcare to defense technology and consumer electronics. But getting materials to work together – and allowing users to program, control, and predict their behaviors – is key to realizing the next-generation promises.\nCOPE: Collaboration before collaborating was cool\nIt was the spirit of teamwork that first brought Marder to Georgia Tech in 2003, after appointments at the\nJet Propulsion Laboratory ,\nCalifornia Institute of Technology , and the\nUniversity of Arizona .\nHe and three others who were focused on optical sciences started COPE shortly after they arrived at Tech. They believed that a center like COPE would help them brainstorm research ideas while increasing their chance of funding.\nThat teamwork helped Marder ignore temptations to move to other universities. “What kept me at Georgia Tech is the people,” he says. “If you’re fundamentally connected with the people around you, that’s a pretty strong adhesive.”\nTo that end, Marder became a strong protagonist for COPE’s collaborative propensity. Materials science can involve physics, chemistry, biology, and engineering, and reaching across Tech’s colleges and schools is key. COPE pioneered this approach.\n“You’re not just bringing people together to work on a problem; you need the right culture,” says\nBernard J. Kippelen , a professor in the School of Electrical and Computer Engineering and current COPE director. “Georgia Tech is uniquely positioned in that respect because interdisciplinary research is part of Georgia Tech’s DNA.”\nResearch themes exemplify the intrinsic interdisciplinarity:\nOrganic photovoltaic materials, for solar cell technology\nFlexible organic materials that can go inside or on the body, for medical and sensing applications\nOrganic materials to protect sensors and human eyes from laser pulses, of interest to the Defense Department\nOrganic materials to enable rapid and safe removal of heat from its source, for computers and consumer electronics\n“We focus on organic – carbon-based – materials,” Kippelen says, because they can be processed at room temperature, making manufacturing easier. And because the building blocks are molecules, physical properties can be controlled by changing chemical structure.\n“As we study more of these materials to understand why they work, we come across new surprises, new breakthroughs that were not anticipated,” Kippelen says. “It’s the gift that keeps giving.”\nGTPN: Pushing polymers for fun and profit, but mostly fun\nWhen\nJohn Reynolds\njoined\nIBM Research\nin the late 1970s, scientists had just discovered that plastics can conduct electricity. Until then, “if you wanted high conductivity, you had to get a piece of metal,” says Reynolds, a polymer chemist. “That an organic polymeric material could do that was earth-shattering.” The breakthrough eventually won the\n2000 Nobel Prize in Chemistry .\nNow Reynolds is a professor in the School of Chemistry and Biochemistry and in the School of Materials Science and Engineering.  He also serves as director of GTPN, which launched shortly after he joined Tech in 2012. Reynolds leads with co-directors\nDavid Collard ,\nZhiqun Lin ,\nElsa Reichmanis , and\nPaul Russo .\n“Georgia Tech and the interdisciplinary atmosphere is why I moved here,” he says. “The walls between colleges and schools here are very low, and that makes Georgia Tech special.”\nReynolds has had a front-row seat for many advances his GTPN colleagues are making in polymer science.  He anticipates new materials for applications such as:\nElectrochromism, reversibly changing a material’s color in the presence of an electric field\nEnergy savings through separation of hydrocarbon and industrial chemicals using nanoporous membranes\nEnergy storage, such as batteries and capacitors to store chemical energy and electrical charge\nDrug and active-molecule release using polymer-modified nanoparticles\nWhen it comes to electrochromic application, Reynolds notes, this technology using polymer gel electrolytes has allowed automakers to eliminate the mechanical switch on rear-view mirrors to suppress blinding high-beam lights from the vehicle behind. Most mirrors now use light sensors and color-changing electrochemical systems to dim that harsh glare.\n“That’s a $1 billion a year sales business for a\ncompany\nin Michigan,” Reynolds says.\nYet the most innovative aspect of GTPN, Reynolds says, is its impact on graduate students and researchers at Tech. They’re not just increasing their knowledge of chemistry and physics. “They grow professionally by participating in meetings and seminars, hosting people, and learning how to be professionally social. And they get contacts with companies.”\nSMI: Fundamental science from soft matter\nSoft matter is described by the\nUniversity of Edinburgh School of Physics and Astronomy\nas “all things squishy.”\nIn that spirit, the\nSchool of Physics\nhas been hosting\nSquishy Physics\npublic events since 2012. Restaurant chefs from Atlanta and beyond prepare foods that illustrate aspects of soft matter: “gelation (jams and jelly), phase transitions (melting chocolate ice cream), emulsions (Hollandaise and other sauces), foams (meringue), and glass formations (confections),” says the Squishy Physics web page.\n“In many cases, soft materials are mixtures of phases – solids in liquids, gases in liquids, or liquid-liquid mixtures, for example,” says Fernandez-Nieves, director of SMI. “A polymer gel may be 99% water, but it behaves like a spring. If you push on it, it deforms and retains its shape due to the presence of restoring forces, and thus it’s a solid from that perspective. It’s an elastic material. And it’s made of 99% water and 1% polymer.”\nSMI is itself in its early phase, launching in July 2016 to coalesce soft matter research interest at Tech and provide brainstorming opportunities, workshops, and seed grants.\nSo what exactly is SMI incubating: ideas or specific research projects?\n“Both,” Fernandez-Nieves says. “You can use soft materials as models to address interesting questions beyond soft matter.” The holy grail in the field is matter with controllable and predictive qualities. “What do I need to do to make that happen? That’s where fundamental science comes in.”\nA recent research\npape r co-authored by Fernandez-Nieves offers an example of soft matter’s potential. Microgels and polymer networks made of natural fibrin, a blood-clotting protein, self-assemble to form tunnels that could allow healing substances to pass through. The Department of Defense, hoping for battlefield applications, supported part of the research.\nSMI is a place “where you can incubate ideas and so they can come to fruition,” Fernandez-Nieves says. “I think of SMI as driven by people with ideas and drive, and the desire to do new things.”\nYou don’t have to be CRĀSI to study interfaces, but it helps\nSince 1978,\nOdyssey of the Mind\nhas staged global problem-solving competitions for students in kindergarten through college. The competition stresses teamwork. Thinking outside the box isn’t just encouraged; it’s necessary.\nAt Tech,\nJennifer Curtis\nand\nMichael Filler , CRĀSI co-directors, are hosts of their own Odyssey of the Mind-style competitions for professors only. The focus is on thinking\nway\noutside the box in getting advanced materials – their surfaces, actually – to communicate, work together, and respond to human commands.\nThese gatherings of the minds are needed, because none of the next-level advances in materials science happens without figuring out surfaces and interfaces, says Filler, an associate professor in the\nSchool of Chemical and Biomolecular Engineering .\n“There is an opportunity to target interfaces, the position where materials change from A to B,” he says. “They’re ubiquitous, and they’re really hard to study, because they’re dynamic.”\n“The big thing we would love to do is control how smaller objects interact with each other to make programmable, reconfigurable matter,” Curtis says.\nThe idea of assembling matter is not new. But with the types of assemblies Curtis and Filler are talking about, it might be easier to kill the Terminator. Why?\n“We’re just not good enough with the interfaces, programming them and controlling them,” Filler says.\nThat’s the obstacle CRĀSI wants to topple. Like SMI, CRĀSI also launched in the summer of 2016 to start conversations about possible solutions to tough science problems. So far, CRĀSI has hosted a total of 10 events, mostly Odyssey of the Mind competitions. Curtis and Filler never share the agenda for their meetings because they don’t want any biases to creep into the discussion.\nCurtis is pleased with the buy-in from researchers. “There’s a critical mass of people who want to be in the same room to talk science and explore ideas,” she says. “We’re really trying to identify the grand challenge of the next decade.”\nAdditional Images\nContact\nRenay San Miguel\nCommunications Officer/Science Writer\nCollege of Sciences\n404-894-5209\nEmail\nrenay.san@cos.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}