{"text": "Musical Table Teaches Basics of Computer Programming | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMusical Table Teaches Basics of Computer Programming\nA musical, interactive tabletop teaches the basics of computer coding.\nFacebook\nTwitter\nEmail\nCoasters can be moved along TuneTable's projection surface to make music using elements of computer programming\nDec 14, 2016\n— Atlanta, GA\nMuseums are the next places K-12 students will have a chance to learn about computer programming. As part of a $3 million grant from the National Science Foundation, researchers at the Georgia Institute of Technology and Northwestern University have built a musical, interactive tabletop exhibit that teaches the basics of computer coding.\nIt’s called TuneTable . Students move coasters along the table’s projection surface to make a musical piece using elements of computer programming.  Then they tap the surface to play a series of beats, beeps and samples. The table will be installed at the Museum of Design Atlanta in early 2017 and Chicago’s Museum of Science and Industry in the summer.\nThe project addresses a national need to make major strides in computer programming literacy for K-12 students.\n“It’s also about changing the attitude about computation and exposing it to people that might not have sought it out otherwise,” said project lead Brian Magerko, an associate professor in Georgia Tech’s Ivan Allen College of Liberal Arts. “Hopefully some of them will think it is a cool, new way to express themselves.”\nThe table includes basic computing programming elements that people would use when learning programming formally for the first time, such as iteration and go-to statements.\nTuneTable’s interactive surface uses computer vision to detect printed markers — officially they’re called fiducials —  on the coasters. Each coaster is assigned a sound or programming command, such as a splitter or repeater. People link them together to form a chain of electronic and hip hop sounds.\n“Manipulating notes, chords and rests requires a lot of music theory knowledge,” said Magerko, who also leads Georgia Tech’s\nAdaptive Digital Media lab . “Instead, we’re opting to manipulate music samples with code. And certain genres, such as electronic and hip hop, map very well computationally.”\nMagerko said they’re also very appealing to underserved populations, such as women, African-Americans and Latinos. He and Georgia Tech College of Design Professor Jason Freeman learned that after designing a software program called\nEarSketch\nthat teaches Python and Javascript at nearly 200 high schools across the country. EarSketch students use digital audio workstations and the programming languages to manipulate loops and compose music. TuneTable reimagines this experience within a museum exhibit.\n“The table allows us bring the basics of computer programming out of the classroom and into more informal settings such as museums,” said Freeman, a co-principal investigator on the NSF grant. “Kids can be playful and social, just by walking up and giving it a try.”\nOnce the exhibit arrives in museums, people will be able to create their own music and email it to themselves. They can continue tinkering with the code when they get home using EarSketch or a tablet version of the software, which is being designed by Northwestern’s Mike Horn.\n“We see the tablet app as a crucial connection point between what kids experience at the museum with TuneTable and what they learn in school with EarSketch,” said Horn. “We want it to give kids space and time to build up foundational computational literacy skills before the deep dive into learning Python or JavaScript.”\nThe project is supported in part by NSF grant AISL-1612644 . Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the sponsors.\nAdditional Images\nRelated links\nWhite House Recognizes EarSketch\nLearn More About EarSketch\nContact\nJason Maderer\nNational Media Relations\nmaderer@gatech.edu\n404-660-2926\nEmail\nmaderer@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}