{"text": "Antibiotics, Taken Strategically, Could Actually Help Defeat Antibiotic Resistance | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nAntibiotics, Taken Strategically, Could Actually Help Defeat Antibiotic Resistance\nThose same antibiotics driving the rise in antibiotic resistant bacterial strains could help defeat them if used as part of an informed strategy.\nFacebook\nTwitter\nEmail\nGroup A Streptococci, colored yellow, are the most common culprits in bacterial upper respiratory infections. Credit: National Institute of Allergy and Infectious Diseases of the NIH\nMay 20, 2019\n— Atlanta, GA\nIn the war on antibiotic-resistant bacteria, it's not so much the antibiotics that are making the enemy stronger as it is how they are prescribed. A\nnew study\nsuggests that doctors can beat antibiotic resistance using those same antibiotics but in a very targeted manner and in combination with other health strategies.\nThe current broad application of antibiotics helps resistant bacterial strains evolve forward. But using data about bacteria’s specific resistances when prescribing those same drugs more precisely can help put the evolution of resistant strains in reverse, according to researchers from the Georgia Institute of Technology, Duke University, and Harvard University who conducted the study.\nOne researcher cautioned that time is pressing: New strategies against resistance that leverage antibiotics need to be in place before bacteria resistant to most every known antibiotic become too widespread. That would render antibiotics nearly useless, and it has been widely reported that this could happen by mid-century, making bacterial infections much more lethal.\n“Once you get to that pan-resistant state, it’s over,” said Sam Brown, who co-led the study and is an\nassociate professor in Georgia Tech’s School of Biological Sciences . “Timing is, unfortunately, an issue in tackling antibiotic resistance.”\nThe new study, which was co-led by game theorist David McAdams, a\nprofessor of business administration and economics at Duke University , delivers a mathematical model to help clinical and public health researchers devise new concrete prescription strategies and those supporting health strategies. The measures center on the analysis of bacterial strains to determine what drugs they are resistant to, and which not.\nSome medical labs\nalready scan human genomes for hereditary predispositions to certain medical conditions. Bacterial genomes are far simpler and much easier to analyze, and though the analytical technology is currently not standard equipment in doctors’ offices or medical labs they routinely work with, the researchers think this could change in a reasonable amount of time. This would enable the study’s approach.\nThe researchers published their study\nin the journal\nPLOS Biology\non May 16, 2019. The work was funded by the Centers for Disease Control and Prevention, the National Institute of General Medical Sciences, the Simons Foundation, the Human Frontier Science Program, the Wenner-Gren Foundations, and the Royal Physiographic Society of Lund.\nQ&A\nHere are some questions and answers on how the study’s counterintuitive approach could beat back antibiotic resistance:\nIsn’t prescribing antibiotics the problem? How can it fight resistance?\nThe real problem is the broad application of antibiotics. They treat human infections and farm animals, and in the process are killing off a lot of non-resistant bacteria while bacteria resistant to those drugs survive. The resistant strains can then reproduce and with fewer competitors in their space, then they dominate bacterial communities in the host animals and people.\nThe resistant bacteria get passed to other hosts and become\nmore prevalent in the world\naltogether. New prescription strategies would outsmart that evolutionary scenario by exposing through genomic (or other) analysis bacteria’s resistance but also their vulnerabilities.\n“Right now, there are rapid tests for the pathogen. If you’ve got strep throat, the clinic swabs the bacteria and does a rapid assay that says yes, that’s streptococcus,” Brown said. “But it won’t tell you if it’s resistant to the drug usually prescribed against it. In the future, diagnostics at the point-of-care could find out what strain you’ve got and if it’s resistant.”\nThen clinicians would choose the specific antibiotics that the bacteria are not resistant to, and kill the bacteria, thus also stopping them from spreading the genes behind their resistance to other antibiotics. So, identifying an infector’s resistance hits two birds with one stone.\n“It’s great for fighting antibiotic resistance, but it’s also good for patients because we’ll always use the correct antibiotic,” Brown said.\n[Thinking about grad school?  Here's how to apply to Georgia Tech. ]\nAre there enough effective antibiotics left to do this with?\nPlenty. Antibiotics still work as a rule.\nIn addition, searching out and destroying resistant bacteria could help refresh existing antibiotics’ effectiveness.\n“The idea is prevalent that we will use antibiotics up, and then they’re gone,” Brown said. “It doesn’t have to be that way. This study introduces the concept that antibiotics could become a renewable resource if we act on time.”\nAs mentioned above, prescription strategies by themselves won’t beat resistance, right?\nCorrect. Resistance evolution has some tricky complexities.\n“A lot of bacteria with the potential to make us sick like\nE. coli\nspend most of their time just lurking peacefully in our bodies. These are bystander bacteria, and they are exposed to lots of antibiotics that we take for other things such as sore throats or ear aches,” Brown said. “This frequent exposure is probably the major driver of resistance evolution.”\nThe antibiotic prescription strategy needs those additional health care measures to win the fight, but those measures are pretty straightforward.\nWhat are those additional measures?\nDiagnostics need to apply to bystander bacteria, too.\nE. coli\nin the intestine or, for example,  Strep pneumoniae\nliving peacefully in nostrils would be checked for resistance, say, during annual checkups.\n“If the patient is carrying a resistant strain, you work to beat it back before it can break out,” Brown said. “There could be non-antibiotic treatments that do this like, perhaps, bacteria replacement.”\nBacteria replacement therapy  would introduce new bacteria into the patient’s body to outcompete the undesirable antibiotic-resistant bacteria and displace it. Also, people would stay home from school and work for a few days so as not to spread the bad bacteria to other people while their immune systems and possibly  alternative therapies, such as bacteriophages or non-antibiotic drugs  battle the bad bacteria.\nThis sounds hopeful, but are there other real-world circumstances to consider?\n“The study’s mathematical models are broad simplifications of real life,” Brown said. “They don’t take into account that pathogens spend a lot of time in other antibiotic-exposed environments such as farms. Dealing with that is going to require some more research.”\nThe study also purposely leaves out \"polymicrobial infections,\" which are infections by multiple kinds of bacteria at the same time. The researchers believe that the study’s models can still be relevant to them.\n“We expect the logic of combating drug resistance to still hold in these more complex scenarios, but diagnostics and treatment rules will have to be honed for them specifically,” Brown said.\nAlso read:\nWant to beat antibiotic resistance? Rethink that strep throat prescription\nThese researchers coauthored the study: David McAdams from Duke University, Kristofer Wollein Waldetoft from Georgia Tech, and Christine Tedijanto and Marc Lipsitch from Harvard University. The research was funded by the Centers for Disease Control and Prevention (grant OADS BAA 2016-N-17812), the National Institute of General Medical Sciences at the National Institutes of Health (grant U54GM088558), the Simons Foundation (grant 396001), the Human Frontier Science Program (grant RGP0011/2014), the Wenner-Gren Foundations, and the Royal Physiographic Society of Lund.\nMedia contact/writer : Ben Brumfield\n(404) 660-1408\nben.brumfield@comm.gatech.edu\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nAdditional Images\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}