{"text": "U.S. Carbon and Pollution Emissions Policies Are ‘Up in the Air’ | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nU.S. Carbon and Pollution Emissions Policies Are ‘Up in the Air’\nThis easy-to-read companion piece to a new ozone modeling study explains legal snags energy-clean air policies currently face.\nFacebook\nTwitter\nEmail\nThe coal-fired Jeffrey Energy Center near Emmett Township, Kansas. Credit: Wikicommons CC Bounzie66\nOct 29, 2019\n— Atlanta, GA\nIf endangered air quality energy regulations and incentives fall flat, carbon gas emissions are predicted to accelerate. Additional pollutants from coal power plants would synergize with global warming to hamper the thus far successful fight against harmful ozone, according to\na new study . Then ground-level O 3 , which damages the human respiratory system, may eventually resurge.\nEnergy policy expert Marilyn Brown explained to\nResearch Horizons\nonline the current peril facing many emissions-related policies face. This is a companion article\nto one written about the study .\nBrown is a\nRegents Professor and Brook Byers Professor\nof Sustainable Systems in the Georgia Institute of Technology’s School of Public Policy. She  co-authored the new ozone study\nwith researchers in the School of Civil and Environmental Engineering that modeled what stripping away the policies could do to future ozone levels.\nResearch Horizons:\nBefore we get to emissions and energy regulations, there is a perhaps larger, very serious issue: What is happening to the generous tax incentives for people and companies who contribute to cleaner air and lower carbon emissions?\nMarilyn Brown:\nSome incentives are being retired early like production and investment tax credits, which have been very influential in the spread of solar and wind power. A major one, the Investment Tax Credit gives a 30% tax reduction for investments in solar or wind farms or the purchase of solar rooftop panels by homeowners. The Production Tax Credit for utilities reduces tax liabilities by 23 cents for each kilowatt-hour of electricity generated by solar, wind or other renewable energy sources. These measures have been absolutely transformational in the U.S. power industry.\nRH:\nWhere did these incentives come from, and how long have they been in place?\nBrown:\nThey started spreading at the state level probably about 30 years ago. Iowa was the first state with its significant wind resources. With the Energy Policy Act of 1992, the incentives became national policy. Tax credits have been an on-and-off policy but mostly on, and they have really helped remake the energy landscape. But the incentives have to be renewed periodically, and then they go up for debate in Congress.\nRH:\nHas this been a partisan issue? One party came up with the incentives, and the other has tried to knock them down?\nBrown:\nThat’s not what we’ve seen. These were not partisan agendas in particular in their implementation. For example, the last extension of the Production Tax Credits two years ago benefitted the economics of\nPlant Vogtle ’s two new units, because nuclear power now qualifies as an eligible resource. These incentives have been on a planned gradual retirement trajectory.\nIn our new study, we just removed them entirely, along with other key policies under threat to see the effect on ozone levels with them completely gone. Such removal actions are occasionally debated in Congress, so it’s not unrealistic to see them suddenly disappear. The paper quantifies the resulting ozone penalty, and that is a first. Our results show that we would have less success fighting ozone, and eventually it would resurge, which would be bad for the health of many people. Costs would rise sharply for places in ozone non-attainment to try to meet healthy targets, and many of them would fail, as many do today.\n[Ready for graduate school?  Here's how to apply to Georgia Tech. ]\nRH:\nBut there was recently a more political back-and-forth over a plan by the previous administration, correct?\nBrown:\nThe last administration created the Clean Power Plan (CPP), and it was stayed – not approved – by federal courts in 2016, so it was not implemented. The current administration basically replaced it with the Affordable Clean Energy (ACE) plan. CPP would have phased out coal-fired electricity generation in favor of natural gas and sustainable energy solutions. ACE, on the other hand, emphasizes improvement in the efficiency of coal plants, but there is a strong a consensus that coal plants can’t be made much more efficient.\nRH:\nFoundational clean air regulations, the iconic Corporate Average Fuel Economy, or CAFE, standards – first enacted in 1975 – are also under threat.\nBrown:\nThe CAFE standards are very much up in the air right now. They could be frozen or done away with, but the automobile industry appears to be divided on this. Seventeen auto makers – Ford and Honda among them – came out in support of CAFE’s progressive tightening of fuel standards because they said doing away with them could destabilize their industry. CAFE lays down a trajectory of improvement that car makers are already anticipating in their product engineering. But CAFE is also being litigated. Also, California has the right to have its own emissions standards, which have a strong influence on fuel economy for all cars sold in the U.S., and that’s being challenged, too.\nRH:\nWhy the concentration on ozone in the study as opposed to, say, particulates?\nBrown:\nThe Clean Air Act regulates many pollutants, but it seems that ozone is the one we are having the most trouble with. Thirty percent of Americans live with levels exceeding public health targets. Progress has been quite slow because ozone’s precursors come from coal plants, and those precursors are what have to be regulated. There are no new coal plants under construction or plans to build any, but many coal plants are still active, and they can boost capacity a lot. For example, you could get about 250% more coal being used in the Great Lakes region by 2050. That would come from existing coal plants being dispatched much more.\nRH:\nIt sounds like many things could converge at once.\nBrown:\nIf they did, it could make for a perfect ozone storm. But keep in mind that there are other forces at work like the market and technology as well as consumer choices and other innovations that could help keep the fight against ozone going — actually against many pollutants and greenhouse gases.\nAlso READ the main article:  This study shows what could happen to harmful ozone levels if endangered federal energy-air quality regulations are not rescued.\nWriter & Media Representative : Ben Brumfield (404-272-2780)\nEmail:  ben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nAdditional Images\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}