{"text": "New Instrument Will Uncover Structure and Chemical Composition on Sub-Cell Scale | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNew Instrument Will Uncover Structure and Chemical Composition on Sub-Cell Scale\nA new imaging instrument will be able to simultaneously study both the surface of a biological sample and its chemical composition.\nFacebook\nTwitter\nEmail\nBeamMap uses an electron beam to image topology, provide localized heating to promote desorption and allow precise determination of the location of the spray capillary and electrospray impact area for imaging. The electrosprayed liquid beam at a controlled energy level is used to desorb and charge analytes for chemical imaging in BeamMap.\nJan 11, 2021\n— Atlanta, GA\nA new imaging instrument able to simultaneously study both the surface of a biological sample and its chemical composition is the goal of a three-year, $1.2 million National Institutes of Health (NIH) research award. Combining information from analysis of the chemical composition and physical structure of the surface of cells, tissues and even individual biomolecules inside the cells could provide a new way to study tumor growth, disease progression, cell function, and other key issues.\nThe technology being developed, termed Beam Enabled Accurate Mapping & Molecular Analyte Profiling (BeamMap), combines data from scanning electron microscopy and a new mode of desorption electrospray ionization mass spectrometry (DESI-MS) to simultaneously determine surface topology and chemical makeup. BeamMap uses an electron beam and a focused nanospray of electrified liquid to gather the two types of information, which is correlated with help of image processing software. The research is funded by the National Institute of Health’s National Institute of General Medical Sciences (NIGMS).\n“To make this breakthrough tool, we need to be able to provide both topological and chemical information at resolutions on the scale of micrometers and sub-micrometers to be able to discover molecular makeup and biological function at a sub-cellular level,” said\nAndrei Fedorov , Professor and Rae S. and Frank H. Neely Chair in the\nGeorge W. Woodruff School of Mechanical Engineering\nat the Georgia Institute of Technology. “This will require simultaneous advances, and we will be pushing the limits of both imaging tools and what mass spectrometers can do.”\nBecause of the use of mass spectrometry for molecular sensing, BeamMap will be able to characterize proteins, metabolites, and lipid chemistry without requiring an a priori knowledge of what chemical species are present. With its ability to correlate chemical information with topological information acquired with focused electron and ion-spray beams in vacuum, the new instrument is expected to provide an order of magnitude improvement in the resolution of electrospray-based techniques, with chemical imaging resolution of approximately 250 nanometers and electron microscopy topological resolution of about 50 nanometers. BeamMap should be useful in fundamental and clinical biology, medicine, analytical chemistry, and bioengineering.\n“Processes that are currently invisible to us could actually be seen using BeamMap, so we will have evidence for things we can only speculate about now,” Fedorov said. “Being able to see what is happening at the subcellular level will allow us to get a better understanding of how biological systems behave. That will allow us to create hypotheses for how cells and tissues interact with the environment, potentially leading to a whole host of new therapeutic applications.”\nAmong the major challenges that require an innovative research approach are the creation of soft ionization and highly local sample extraction necessary for keeping the biomolecules intact and the ability to effectively deliver the charged molecules to the vacuum environment of the mass spectrometer, he said.\n“We will need to fine-tune the energy of the beam that sprays on the substrate to provide the resolution we need,” Fedorov said. “We need to extract live biomolecules and ionize them without disrupting their structure. To do this, we will have to use the softest possible ionization.”\nThe instrument will use the electrospray technique to create charged molecules of solvent focused in a beam about 100 nanometers in diameter. As the beam of charged solvent molecules hits the surface of the biological sample, it will ablate molecules from sample’s surface and move them into the surrounding vacuum environment of the SEM imaging chamber. The molecules will be charged and volatilized by the impinging nano-electrospray at a precisely tuned energy input, and then be extracted for immediate analysis in the mass spectrometer.\nIn parallel, an electron beam that can be focused down to 10 nanometers will be scanning and profiling the structures and features of the surfaces from which the molecules are being extracted by the electrospray. Correlating data from the two beams will provide information about the chemical makeup of the cell surface, the organelles and intracellular structures being imaged topologically.\nUsing multiple passes of the two beams will allow removal of layers from the samples, allowing internal structures to be mapped. Fedorov said producing each image will require several minutes, the timing limited by the speed at which the samples can be moved into the mass spectrometer and analyzed.\nThe characterization will be done in an electron microscope vacuum chamber, with the samples on a stage that can be moved in three dimensions. The stage will also provide cooling and hydration for the living samples during the imaging process.\nThe idea for the instrument came from a discussion with\nAndrés García , Regents' Professor in the George Woodruff School of Mechanical Engineering and executive director of Georgia Tech’s\nInstitute for Bioengineering and Bioscience . García studies pancreatic cells as part of research into diabetes, and plans to use information from the new technique to develop a better understanding of the disease.\n“BeamMap is an exciting technological advance that will provide unparalleled biological and chemical information with high spatial resolution to analyze complex biological processes,” García said. “We are very much looking forward to applying it to understand diabetes disease progression.”\nThis research was supported by Award 1R01GM138802-01 from the National Institute of General Medical Sciences (NIGMS) of the National Institutes of Health. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the NIH.\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : John Toon (404-894-6986) (jtoon@gatech.edu)\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}