{"text": "InVenture Prize Mixes Virtual Rounds Into 2021 Competition | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nInVenture Prize Mixes Virtual Rounds Into 2021 Competition\nThe road to the 2021 InVenture Prize will be different, but the pandemic won’t stop the 13th edition of Georgia Tech’s signature invention competition from recognizing students' best new ideas.\nFacebook\nTwitter\nEmail\nThe InVenture Prize trophies await the judges' decision during the 2020 InVenture Prize finals. (Photo: Christopher Moore)\nNov 18, 2020\n— Atlanta, GA\nThe live finals will still happen — and still air on GPB stations across Georgia. The preliminary and semifinal rounds are on track, too. And in the end, one student invention will win $20,000, a patent filing, and a spot in the\nCREATE-X Startup Launch program .\nThe road to the\n2021 InVenture Prize\nwill be different, but the pandemic won’t stop the 13 th\nedition of Georgia Tech’s signature invention competition from recognizing the best new ideas from students across campus.\n“In the most challenging and turbulent of times, when societal problems become magnified, is often when we see human ingenuity become hyper-focused and some of the most impactful innovations are realized,” said Chris Reaves, executive director in the Office of Undergraduate Education. “We look forward to offering this year’s InVenture Prize as it will provide a platform to showcase our students’ work to the world and celebrate their determination and creativity, even in the most taxing of environments.”\nAmong the key changes this year: virtual presentations and judging in the preliminary and semifinal rounds, which presented the opportunity to capitalize on Georgia Tech students’ creativity in a new way. The virtual rounds will use two platforms created by Tech students — Gatherly and RocketJudge — for meeting with competitors and for judges to submit their assessments of the teams.\n“In a world of constant disruptions and innovation challenges, the InVenture Prize has been able to pivot and embrace these disruptions,” said Nakia Melecio, entrepreneur-in-residence at the Advanced Technology Development Center, “and what’s helped make that possible are the virtual tools\nGatherly\nand\nRocketJudge , platforms created by some fantastic Georgia Tech students.”\nApplications for the 2021 competition are open now on the InVenture Prize website, and the competition will move briskly toward the finals:\nJan. 18 – Registration Deadline\nJan. 27 – Preliminary Round\nFeb. 11 – Semifinal Round\nMarch 17 – 2021 InVenture Prize Finals\nStudents who compete get help with prototyping, implementing their business, formulating their pitch, and understanding the patenting process. Teams can sign up to be paired with an innovation coach through\nIdeaBuzz , where they’ll learn about practical steps they can use to develop their idea. Students also can join a preexisting team or recruit members for their team through\nCofounder Buzz . Teams also can\napply for grants up to $500\nto help cover the costs of building prototypes.\n“Within our dynamic workforce and economy, innovation and entrepreneurship are skillsets that allow students to create their own opportunities,” said Joy Harris, associate director of the CREATE-X LEARN program. “The InVenture Prize is one of the most influential experiences for students because of how this competition fosters and facilitates these two skillsets.”\nTodd Sulchek, an InVenture Prize faculty advisor, said the competition has helped spark a thriving ecosystem of student innovation and invention, and it “remains the preeminent competition at Tech, reaching an audience of tens of thousands, connecting with investors and customers alike, and inspiring future inventors from elementary to high school.”\nAll told, the InVenture Prize competition awards $35,000 in prize money, including an audience-voted People’s Choice Award. Last year,\nQueues won first place for an app\nthat gives students live wait times at campus dining spots and helps restaurants plan for the ebbs and flows of demand. During the pandemic, Queues has pivoted to also offer live wait times at Covid-19 testing sites on the Georgia Tech campus. Aerodyme Technology won second place and has gone on to win the\nTiE University Global Pitch Competition .\n“Over the past 12 years, the InVenture Prize has inspired inventors and audiences alike to dream about changing the world with their inventions,” said InVenture Prize co-founder Craig Forest, who leads the CREATE-X MAKE program. “We are more committed than ever to host this competition in 2021, not in spite of, but because of the global challenges that society faces.”\nAdditional Images\nRelated links\nInVenture Prize\nApply for Prototype Awards\nIdeaBuzz\nCoFounder Buzz\nContact\nJoshua Stewart\n404.894.6016\nEmail\njstewart@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}