{"text": "Georgia Tech EDA University Center Funds Redevelopment and Housing Studies for Two Georgia Towns | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech EDA University Center Funds Redevelopment and Housing Studies for Two Georgia Towns\nAnalyses to help community leaders create long-term residential home development growth strategies\nFacebook\nTwitter\nEmail\nThe AB&A Historic Train Depot in Fitzgerald, Georgia, is one of the community's key attractions. The Depot is home to the Blue & Gray Museum, the Genealogy Research Center, and Collins Railroad Collection.\nAug 23, 2023\nFITZGERALD, Ga. —  In many ways, this South Georgia town boasts the best of small rural communities. Just 23 miles east of Interstate 75,  Fitzgerald  has a busy downtown thoroughfare with shops, antique stores, and eateries. It has a modern airport with a 5,000-foot runway, an active mainline railroad, and industrial parks. It’s also home to a museum with a nod to its 1895 beginnings as a community and haven for veterans who fought on both sides of the Civil War.\nFitzgerald also has a successful history of industrial recruitment that has provided the community with a significant manufacturing base. Recent capital investments in wood products, food and beverage processing, plastics, and manufacturing have increased employment, personal income growth, and the community’s GDP.\nWith its local economy steadily improving, this community of 9,000 is also looking to boost its new home development construction activity. Now, city leaders and officials from surrounding Ben Hill County are working with the  Center for Economic Development Research  (CEDR) and  EDA University Center  at Georgia Tech’s  Enterprise Innovation Institute to produce a study to figure out a viable strategy.\nThe study is funded in part through an  Economic Development Research Program (EDRP)  grant, which is administered by the EDA University Center. These grants are targeted toward economically distressed communities that can’t afford the cost of this type of comprehensive economic development research. EDA University Center grants offset some expenses that would otherwise be cost-prohibitive to rural communities.\nCEDR is conducting the six-month research and analysis project in Fitzgerald, which entails looking at housing that's for sale, determining what the rental rates are, and developing housing development strategy recommendations for the entire city, said Betsy McGriff, a CEDR associate project manager and lead researcher on the study. It will also include ways to maximize cost effective development strategies, such as new home construction in historic neighborhoods to help revitalize them.\n“Our objective is to get a much better understanding of the factors that are deterring new home development,” said Jason Dunn, executive director of the  Fitzgerald and Ben Hill County Development Authority . “We want to create more homeownership and have the data needed to influence new residential development in Ben Hill County.\nThe need for the Fitzgerald study comes as the community has seen increased demand for more housing with options in both single family, owner-occupied homes, as well as rentals. But the city’s existing inventory isn’t enough to meet the demand, nor is it energy efficient, comprised of buildings that are at least 100 years old.\n“We believe the study will give us the market data needed to pursue a public-private partnership to meet the community needs and lead to residential development that will provide housing solutions in one of Georgia's most rural areas,” Dunn said.\nCEDR is also doing a nine-month study for the  City of Jefferson  Downtown Development Authority, located in North Georgia’s Jackson County, about 22 miles northwest of Athens. That multifaceted project, which is also partly funded by an EDRP grant, includes a housing market analysis to create a strategy to get more residential housing units built closer to its downtown.\nIt also includes a retail market analysis to determine what goods and services are needed in the area. It also includes visioning sessions to advise the Downtown Development Authority and help its leaders prioritize strategies and future steps needed for maximum community impact.\nThe Missing Middle\nThe two projects reflect the growing housing challenge that scores of communities face across the country said Alan Durham, a CEDR researcher and director of the  Basic Economic Development Course .\n“Across the U.S., right now we're short about 4 million housing units. And a lot of those missing units are entry level affordable housing, and workforce housing for police, fire fighters, nurses, and teachers. That's what's called the missing middle,” said Durham, who has been researching the national trends and leads the Jefferson project research.\nAs costs rise, developers are trending toward building very high-end homes. While the high-end housing market is doing well, not enough at the other end — entry-level housing — is being built, squeezing out a market segment communities need to attract.\n“Millennials and Gen Z, they can't even get their foot in the door in the housing market anymore,” Durham said. “The ideal range on housing expenditures is 25% to 30% of gross income. In reality, many are spending over 50% of their wages on housing, leaving them cash-poor to deal with basic necessities and unforeseen expenses.”\nPart of the research CEDR will do includes data analyses of both communities. The research will break both communities into their respective income tiers to see how many people make a set amount of money per year, Durham said.\nBased on the different income tiers, the CEDR analyses in Fitzgerald and Jefferson will guide the types of housing price points leaders in both communities should pursue.\nDetailed Analysis\nIn addition to the income tiers and bands major employers in each community pay, the CEDR studies will analyze employee commuting patterns, where residents shop for staple goods and services, and other factors that shape where people decide to live.\n“These are very rural markets so our work to pull meaningful and actionable data will be different than in a metro area where it’s a little clearer or there’s just more data to be had,” McGriff said. “Our focus and approach will be a lot more granular to assess the demands of a rural market and pull out really meaningful data.”\nArmed with that data, both communities will be positioned to develop strategies for targeted engagement with the right mix of investors and developers, McGriff said.\n“They’re going to have to sell their communities to investors using the data we produce and the recommendations that we develop together for development strategies,” McGriff said. “These EDA University Center grants are really an investment tool for economic development, and they can leverage that money to attract investments to their communities, which could lead to more jobs and increased tax base, which just then cycles into helping these communities thrive.”\nAdditional Images\nContact\nPéralte C. Paul\n404.316.1210\nperalte@gatech.edu\nEmail\nperalte@gatech.edu\nAdditional information\nAbout the Georgia Tech EDA University Center\nThe Georgia Tech EDA University Center is a program funded by the  U.S. Department of Commerce’s Economic Development Administration (EDA)  through its  EDA University Center  program. Led by the Georgia Institute of Technology’s Enterprise Innovation Institute, the Georgia Tech EDA University Center supports outreach activities that seek to promote job creation, development of high-skilled regional talent pools, business expansion in innovation clusters, and create and nurture regional economic ecosystems in the state of Georgia and other states within the EDA Atlanta region (Alabama, Florida, Kentucky, Mississippi, North Carolina, South Carolina, and Tennessee). The Center’s primary focus areas are innovation-led ecosystem support for universities and communities and strategic economic development support for distressed communities. To learn more, please visit\ngrow.gatech.edu/eda-university-center .\nAbout the Center for Economic Development Research\nThe Center for Economic Development Research (CEDR) is a collaborative team of economists, city planners, and economic development practitioners. Our talented economic development professionals have the research and implementation experience needed to help economic developers, community leaders, and industries alike understand the opportunities and challenges in fostering local economic development. CEDR is a unit of the Enterprise Innovation Institute, Georgia Tech’s chief business outreach and economic development organization. To learn more, please visit\ncedr.gatech.edu .\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}