{"text": "Smoke from Wildfires Can Have Lasting Climate Impact | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nSmoke from Wildfires Can Have Lasting Climate Impact\nResearchers have found that carbon particles released into the air from burning trees and other organic matter are much more likely than previously thought to travel to the upper levels of the atmosphere, where they can interfere with rays from the sun.\nFacebook\nTwitter\nEmail\nSmoke rises from the wildfire burning across 150,000 acres of the Okefenokee Swamp in Georgia and Florida. (Credit: USFWS)\nMay 22, 2017\n— Atlanta, GA\nThe wildfire that has raged across more than 150,000 acres of the Okefenokee Swamp in Georgia and Florida has sent smoke billowing into the sky as far as the eye can see. Now, new research published by the Georgia Institute of Technology shows how that smoke could impact the atmosphere and climate much more than previously thought.\nResearchers have found that carbon particles released into the air from burning trees and other organic matter are much more likely than previously thought to travel to the upper levels of the atmosphere, where they can interfere with rays from the sun – sometimes cooling the air and at other times warming it.\n“Most of the brown carbon released into the air stays in the lower atmosphere, but a fraction of it does get up into the upper atmosphere, where it has a disproportionately large effect on the planetary radiation balance – much stronger than if it was all at the surface,” said Rodney Weber, a professor in Georgia Tech’s School of Earth & Atmospheric Sciences.\nThe study, which was published May 22 in the journal\nNature Geoscience , was sponsored by the NASA Radiation Sciences Program and the NASA Tropospheric Composition Program.\nThe researchers analyzed air samples collected in 2012 and 2013 by NASA aircraft from the upper troposphere – about seven miles above the earth’s surface – at locations across the United States. They found surprising levels of brown carbon in the samples but much less black carbon.\nWhile black carbon can be seen in the dark smoke plumes rising above burning fossil or biomass fuels at high temperature, brown carbon is produced from the incomplete combustion that occurs when grasses, wood or other biological matter smolders, as is typical for wildfires. As particulate matter in the atmosphere, both can interfere with solar radiation by absorbing and scattering the sun’s rays.\nThe climate is more sensitive to those particulates as their altitude increases. The researchers found that brown carbon appears much more likely than black carbon to travel through the air to the higher levels of the atmosphere where it can have a greater impact on climate.\n“People have always assumed that when you emit this brown carbon, over time it goes away,” said Athanasios Nenes, a professor and Georgia Power Scholar in the School of Earth & Atmospheric Sciences and the School of Chemical & Biomolecular Engineering.\nAfter the brown carbon is carried by smoke plumes into the lower atmosphere, it mixes with clouds. Then it hitches a ride on the deep convection forces that exist in clouds to travel to the upper atmosphere.\nAlthough the researchers couldn’t explain how, they also found that during the journey through the clouds, the brown carbon became more concentrated relative to black carbon.\n“The surprise here is that the brown carbon gets promoted when you go through the cloud, compared to black carbon,” Nenes said. “This suggests that there may be in-cloud production of brown carbon that we were not aware of before.”\nThis material is based upon work supported by the NASA Radiation Sciences Program under grant No. NNX14AP74G and the NASA Tropospheric Composition Program under grant Nos. NNX12AB80G, NNX12AC03G and NNX15AT96G. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of NASA.\nCITATION : Yuzhong Zhang, Haviland Forrister, Jiumeng Liu, Jack Dibb, Bruce Anderson, Joshua P. Schwarz, Anne E. Perring, Jose L. Jimenez, Pedro Campuzano-Jost, Yuhang Wang, Athanasios Nenes and Rodney J. Weber, “Top-of-atmosphere radiative forcing affected by brown carbon in the upper troposphere,” (Nature Geoscience, May 2017).  http://dx.doi.org/10.1038/NGEO2960\nAdditional Images\nContact\nJohn Toon\nResearch News\nEmail\njohn.toon@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}