{"text": "Georgia Tech Research Finds Fan Communities Are Reshaping the Social Web for the Better | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Research Finds Fan Communities Are Reshaping the Social Web for the Better\nIn a new study, Georgia Institute of Technology researchers have found that one successful online community could serve as a model to help make the future social web a safer, more inclusive space.\nFacebook\nTwitter\nEmail\nCasey Fiesler and Amy Bruckman\nMay 09, 2016\n— Atlanta, GA\nModern fan groups predate the Internet by more than half a century (think Star Trek conventions), and their shared interests include everything from science fiction to knitting. But replicating the connections fans make in person in a digital space has proved difficult. Instead, groups with special interests are often forced onto Facebook and other social media with a one-size-fits-all approach to interacting online. In a new study, Georgia Institute of Technology researchers have found one group of fan fiction writers that has created a successful online community, which might serve as a model to help make the future social web markedly different from today’s landscape. By adopting a user-centric approach to design, this community has created a rarity on the web, a “digital commons” without advertising where harassment is almost nonexistent, and a large installed audience enjoys a culture of genuine diversity. The study, from Georgia Tech and University of Colorado-Boulder, is based on the website\nArchive of Our Own\n(AO3), an 840,000 member community of fan fiction or “fanfic” writers who post and share user-generated content. The site was launched in 2008 and boasts nearly 2 million story posts to date. Its web traffic outpaces such heavyweights as CareerBuilder and FoxSports, among others, ranking number 418 in U.S. web metrics, according to alexa . com. “AO3’s success demonstrates how beneficial it is to have a technology’s users as part of its development team,” said Casey Fiesler, lead researcher on the study while a Ph.D. candidate at Georgia Tech, and now assistant professor at University of Colorado-Boulder. “This is particularly striking when users are mostly women, who are traditionally underrepresented in tech. Because there was no existing technology that reflected their values, they built their own and it has been massively successful.” A small team of coders, coordinators and designers from the ranks of AO3 members took input from users and coupled it with the guiding values of the fan fiction community ­­– which are accessibility and inclusivity – to create the basic structure of AO3. After more than eight years, this structure remains largely unchanged. During interviews with users and developers, researchers discovered that AO3’s intentional design approach, which baked the ethos of the community right into the website, accounts for much of the site’s organic growth and success. “What makes the rise of this online platform exceptional is that it was built primarily by its fans, some of whom started with little or no programming experience,” said Amy Bruckman, a professor of Interactive Computing at Georgia Tech and author on the study . She added, “Fanfic writers, mostly women, who felt exploited or that other platforms weren’t meeting their needs, started this open source project and invited the larger community of fanfic writers to provide input. AO3 is a case study in building a digital commons around a group of users and addressing nuanced technical issues in order to successfully engage the community.” One of the technical issues AO3 faced early on, tag structure, has since become a favorite feature and essential to the website’s success. Designers did not limit what or how many tags can be used with published stories, but rather created an open-ended system. AO3 “tag wranglers,” member volunteers, manually combine tags submitted by users (such as “mermaid,” “merman,” and “merfolk”) into one meta tag (“merpeople”), allowing for a robust search of multiple terms. This level of control allows users to find a wide cross section of relevant content, something that is often not possible on other platforms beyond giant search engines, according to the research. Fiesler notes that the tag system also gives writers more control over how to describe their work, and this contributes to the inclusiveness and diversity of the community. But like any online space, there are competing values among users. Anonymity, like elsewhere on the web, can allow for more openness and sharing, but it can also invite harassment. To limit this, the AO3 site allows users to post comments anonymously, but it also allows users to turn off incoming anonymous comments so they do not have to see them. The site also prohibits the intentional “outing” (revealing real identities) of users, does not offer tier accounts and never collects personal data. All of this means the AO3 community can enjoy a high degree of privacy while respecting the rights of all of its users. Although AO3 makes every effort to limit harassment, it does not censor or restrict content on the site, unless it is illegal. However, to ensure readers know they are reading content “at their own risk,” warning labels are required on mature content that is posted. Another concern among users is how to preserve the entirety of the archive while also respecting users’ rights to erase their own work. AO3 again turned to its members for a solution. For writers wanting to remove their fiction, the site gives them the option to “orphan” their work. This removes their pseudonym or name from the work, but allows the content to remain in the community. “Other sites would do well to understand their users as well as AO3 does in order to achieve long-term goals and address some of the emerging issues on the social web, such as those involving harassment, privacy, security and sustainability,” says Fiesler, the lead researcher. The research, “ An Archive of Their Own: A Case Study of Feminist HCI and Values in Design ,” co-authored by Fiesler, Bruckman and Shannon Morrison (a former visiting undergraduate at Georgia Tech), will be presented at CHI 2016, the Association for Computing Machinery’s Conference on Human Factors in Computing Systems, taking place May 7-12 in San Jose, Calif. The conference is the largest gathering of human-computer interaction researchers worldwide, with more than 2,000 authors in this year’s technical program.     Research was funded by NSF IIS Award #1216347. The views expressed are those of the researchers and do not necessarily represent those of the National Science Foundation.\nAdditional Images\nContact\nJoshua Preston College of Computing, GVU Center 678.231.0787\nEmail\njpreston@cc.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}