{"text": "National Search Launched for VP and Director of Enterprise Innovation Institute | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNational Search Launched for VP and Director of Enterprise Innovation Institute\nGeorgia Tech is beginning a search for a new vice president for the Enterprise Innovation Institute\nFacebook\nTwitter\nEmail\nChris Downing, vice president and director of the Enterprise Innovation Institute, has announced his retirement after 31 years of service to Georgia Tech. (Photo: Péralte Paul, Georgia Tech)\nApr 27, 2019\n— Atlanta, GA\nGeorgia Tech will begin a national search for the position of vice president and director of the\nEnterprise Innovation Institute\n(EI2) to replace Chris Downing, who has announced his retirement effective June 1, 2019. An interim vice president and director will be named for the position.\nDowning, who has served Georgia Tech for 31 years, will leave behind a legacy of leadership in technology-based economic development, university outreach and technical assistance, entrepreneurship and start-up support.\n“I feel very fortunate for such a diverse and challenging career and to have shared so many good years with the Georgia Tech family, and I am very appreciative of the many faculty, staff and students who have made my time at Georgia Tech so interesting and inspiring,”\nDowning\nsaid. “Although I am leaving my full-time duties, I look forward to staying connected to Georgia Tech and supporting its mission of progress and service.”\nThe Enterprise Innovation Institute is nation’s largest and most comprehensive university-based program of business and industry assistance, technology commercialization and economic development.\nWith state and federal support, for example, it operates a statewide network of assistance to Georgia manufacturers through the\nManufacturing Extension Partnership , and supports startup companies through the\nAdvanced Technology Development Center . Other EI2 programs help faculty members commercialize technology developed in Georgia Tech labs, serve minority businesses, support economic development activities, and provide a connection to Georgia Tech’s talent and resources.\n“The Enterprise Innovation Institute is critical component of Georgia Tech’s service to our state,” said\nChaouki Abdallah , Georgia Tech’s executive vice president for research. “During his tenure, Chris has expanded our economic development initiatives and increased collaboration among these programs while more closely aligning them with the needs of the state, region and nation.”\nGeorgia Tech President\nG. P. “Bud” Peterson\npraised Downing’s long service to Georgia Tech and the state of Georgia.\n“Chris has been a tireless champion and supporter of our economic development initiatives, working to maintain strong partnerships across the state while creating new collaborations,” Peterson said. “We appreciate his leadership role as Georgia Tech partners with the state to strengthen Georgia’s economy.”\nAfter leaving IBM, where he was a mechanical facilities engineer, Downing joined Georgia Tech in 1988 as a senior research engineer with the Georgia Tech Research Institute.\nIn 1996, he joined EI2 — then called the Economic Development Institute — as the Griffin regional office manager and provided industrial extension and economic development services to the south metro Atlanta region.\nIn 2005, he was tapped to lead the Industry Services group of the newly-organized Enterprise Innovation Institute. That role included several key outreach programs: the Georgia Manufacturing Extension Partnership, the Energy and Environmental Management Center, the Georgia Tech Procurement Assistance Center (GTPAC), the Southeast Trade Adjustment Assistance Center (SETAAC), and the Georgia Tech Regional Office Network.\nDowning was named EI2’s associate vice president in 2013 and vice president in 2016.\nIn that time, he spearheaded the three-fold expansion of the Advanced Technology Development Center (ATDC) and created the Venture Center space that has helped to attract Fortune 100 corporate innovation centers to Technology Square.\nHis technology-based economic development efforts helped Georgia Tech and the EI2 win the prestigious “2014 Innovation Award” from the Association of Public and Land-grant Universities, and the “2014 Outstanding Research Park Award” from the Association of Research Parks.\nMost recently, Downing led the feasibility study for the expansion of Georgia Tech’s second research park, Technology Enterprise Park, into a broader life sciences and technology innovation district.\nDowning is a graduate of the University of Florida, where he earned his bachelor’s and master’s degrees in mechanical engineering.\nThe national search process will be led by the EVPR office, which will also name the interim vice president and director by May 30, 2019.\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : Péralte Paul (404-316-1210); (peralte.paul@comm.gatech.edu).\nAdditional Images\nContact\nPéralte Paul\n(404-316-1210)\nEmail\nperalte.paul@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}