{"text": "Music Technologists Find Inspiration, Community at Guthman | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMusic Technologists Find Inspiration, Community at Guthman\nIn its 12th year, musical instrument competition showcases the newest and most innovative ideas in music.\nFacebook\nTwitter\nEmail\nGrace Leslie, left, works with students on a human feedback music technology project. (Photo: School of Music)\nMar 03, 2020\n— Atlanta, GA\nWhen you make music with technology, said David Zicarelli, the CEO of Cycling’74, it can change your life.\nZicarelli might be biased: his lifelong career is music technology.\nSince the 1980s, he’s worked on interactive composition technology. “I think the intersection of music and technology and creativity is a really cool problem, just something that is endlessly interesting to think about.”\nBut there’s also something incredibly practical about it, he said. “Instead of spending your entire life learning to play a very difficult instrument, you can participate in and make music more readily with technology.”\nWhile the concept of music technology is fairly well-grasped by the modern world, Zicarelli said, as an industry he and his peers aren’t as easy to pin down.\n“Music Technology is a big space. There’s not one community. In my experience, there are a lot of different communities that tend to focus around a particular tool or approach,” he said. Often they meet each other at large events like Moogfest or the Ableton Conference, focused on creativity or learning new technical skills.\nThey also come to the Guthman Musical Instrument Competition at Georgia Tech, for demonstrations in performance and technology innovation.\nThis year, Zicarelli will judge the contest as well as cohost the Music, Art, and Technology Fair.\n“I was fortunate enough to attend [the Guthman Competition] a few years ago, and I still remember and am actively inspired by what I saw,” he said, “in terms of this amazing variety of creative approaches.”\nThe Competition does two important things for music technologists, Zicarelli said. One, it shows that the invention of an instrument is a valid form of creative expression. And two, it provides an opportunity to observe emerging technologies.\n“For example, Roli came and demonstrated the Seaboard a few years ago at Guthman, and now you can buy that product and have it in your house.”\nThe Intersection of Music Technology and … Everything\nAs an assistant professor for the Georgia Tech School of Music and a researcher in the Center for Music Technology, Grace Leslie’s work often includes human computer interface, electrical engineering, experimental psychology, and acoustics.\n“There’s a lot of different things that music technology can be,” she said. “We professors who have labs in the Center are kind of like a Venn diagram. We do work that’s at the intersection of music technology and other things.” Leslie runs the Brain Lab, where she and her graduate students develop brain-music interfaces and other physiological sensor systems.\nThe ways in which this year’s Guthman Competition instruments cross over into other areas of study and design are especially compelling, she said.\n“This year we have a lot of really exciting instruments that are designed as assistive technologies,” Leslie said, “to help encourage and inspire people to make music, when traditional musical instruments might not be accessible to them physically.”\n“It really broadens our horizon [as music technologists] in terms of what musical instruments are, and the kind of innovations that they’re able to bring to our lives. Innovation doesn’t just have to be about creativity and newness or novelty. It can also be about helping people.”\nEven the Guthman Competition’s setting — hosted by a Georgia Tech school with a uniquely rigorous music technology program — is valuable for music technologists in terms of sharing ideas.\nBecause music technologists are used to sharing ideas in academic settings and in music venues, Leslie strives to teach her students how to communicate their work to a broader community. She fosters concerts that blend technological demonstrations with compelling musical performances. As an electronic music composer and improviser, Leslie maintains a brain-body performance practice.\nInfluencing the Next Generation of Music Technologists\nAs part of the Guthman Competition festivities, this year the School of Music, Cycling ’74, and the Atlanta Science Festival are teaming up with Georgia Tech’s Center for Education Integrating Science, Mathematics, and Computing (CEISMC)\nfor a GoSTEAM workshop.\nDesigned for the middle school audience, the workshop will take place prior to the Fair. Students will learn how to use Cycling ‘74’s Max/MSP software to create music. Sabrina Grossman, the science education program director for CEISMC, will help run the event.\n“There’s so many opportunities with this intersection of music technology and art,” Grossman said. “I think a lot of times, students don’t even know this exists.”\n“[My colleague] has a great quote. When people ask her, ‘How did you become an engineer?’, she says, ‘Well, my dad told me I couldn’t major in music.’,” Grossman said. “Ten, fifteen years ago, there weren’t many music technology programs in schools.”\nBut through increasingly national reach of programs like EarSketch, students with strong music preferences can envision broader career options, Grossman said.\n“I definitely think that it allows them to think outside the box about music and outside the box of what their future could be in music or computer science.”\nAdditional Images\nRelated links\nExplore the Guthman Competition\n2020 Guthman Competition Finalists\nTickets - Guthman Musical Instrument Competition\nGuthman Musical Instrument Competition\nSchool of Music\nContact\nAnn Hoevel\n404.385.0693\nEmail\nann.hoevel@design.gatech.edu\nAdditional information\nTHE GUTHMAN MUSICAL INSTRUMENT COMPETITION Saturday, March 7, 2020\n7 p.m.\nFerst Center for the Arts\n– Free Admission – TICKETS\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}