{"text": "High Temperature Step-by-Step Process Makes Graphene from Ethene | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nHigh Temperature Step-by-Step Process Makes Graphene from Ethene\nResearchers have developed a new way to produce single-layer graphene from a simple precursor: ethene.\nFacebook\nTwitter\nEmail\nA sequence of images at rising temperatures shows through microscopy (top row) and modeling (bottom row) how ethene molecules adsorbed on a rhodium catalyst transform into graphene. (Figure credit: R. Schaub).\nMay 04, 2017\n— Atlanta, GA\nAn international team of scientists has developed a new way to produce single-layer graphene from a simple precursor: ethene – also known as ethylene – the smallest alkene molecule, which contains just two atoms of carbon.\nBy heating the ethene in stages to a temperature of slightly more than 700 degrees Celsius -- hotter than had been attempted before – the researchers produced pure layers of graphene on a rhodium catalyst substrate. The stepwise heating and higher temperature overcame challenges seen in earlier efforts to produce graphene directly from hydrocarbon precursors.\nBecause of its lower cost and simplicity, the technique could open new potential applications for graphene, which has attractive physical and electronic properties. The work also provides a novel mechanism for the self-evolution of carbon cluster precursors whose diffusional coalescence results in the formation of the graphene layers.\nThe research, reported as the cover article in the May 4 issue of the\nJournal of Physical Chemistry C , was conducted by scientists at the Georgia Institute of Technology, Technische Universität München in Germany, and the University of St. Andrews in Scotland. In the United States, the research was supported by the U.S. Air Force Office of Scientific Research and the U.S. Department of Energy’s Office of Basic Energy Sciences.\n“Since graphene is made from carbon, we decided to start with the simplest type of carbon molecules and see if we could assemble them into graphene,” explained Uzi Landman, a Regents’ Professor and F.E. Callaway endowed chair in the Georgia Tech School of Physics who headed the theoretical component of the research. “From small molecules containing carbon, you end up with macroscopic pieces of graphene.”\nGraphene is now produced using a variety of methods including chemical vapor deposition, evaporation of silicon from silicon carbide – and simple exfoliation of graphene sheets from graphite. A number of earlier efforts to produce graphene from simple hydrocarbon precursors had proven largely unsuccessful, creating disordered soot rather than structured graphene.\nGuided by a theoretical approach, the researchers reasoned that the path from ethene to graphene would involve formation of a series of structures as hydrogen atoms leave the ethene molecules and carbon atoms self-assemble into the honeycomb pattern that characterizes graphene. To explore the nature of the thermally-induced rhodium surface-catalyzed transformations from ethene to graphene, experimental groups in Germany and Scotland raised the temperature of the material in steps under ultra-high vacuum. They used scanning-tunneling microscopy (STM), thermal programed desorption (TPD) and high-resolution electron energy loss (vibrational) spectroscopy (HREELS) to observe and characterize the structures that form at each step of the process.\nUpon heating, ethene adsorbed onto the rhodium catalyst evolves via coupling reactions to form segmented one-dimensional polyaromatic hydrocarbons (1D-PAH). Further heating leads to dimensionality crossover – one dimensional to two dimensional structures – and dynamical restructuring processes at the PAH chain ends with a subsequent activated detachment of size-selective carbon clusters, following a mechanism revealed through first-principles quantum mechanical  simulations.  Finally, rate-limiting diffusional coalescence of these dynamically self-evolved cluster-precursors leads to condensation into graphene with high purity.\nAt the final stage before the formation of graphene, the researchers observed nearly round disk-like clusters containing 24 carbon atoms, which spread out to form the graphene lattice. “The temperature must be raised within windows of temperature ranges to allow the requisite structures to form before the next stage of heating,” Landman explained. “If you stop at certain temperatures, you are likely to end up with coking.”\nAn important component is the dehydrogenation process which frees the carbon atoms to form intermediate shapes, but some of the hydrogen resides temporarily on, or near, the metal catalyst surface and it assists in subsequent bond-breaking process that lead to detachment of the 24-carbon cluster-precursors.  “All along the way, there is a loss of hydrogen from the clusters,” said Landman. “Bringing up the temperature essentially ‘boils’ the hydrogen out of the evolving metal-supported carbon structure, culminating in graphene.”\nThe resulting graphene structure is adsorbed onto the catalyst. It may be useful attached to the metal, but for other applications, a way to remove it will have to be developed. Added Landman: “This is a new route to graphene, and the possible technological application is yet to be explored.”\nBeyond the theoretical research, carried out by Bokwon Yoon and Landman at the Georgia Tech Center for Computational Materials Science, the experimental work was done in the laboratory of Professor Renald Schaub at the University of St. Andrews and in the laboratory of Professor Ueli Heiz and Friedrich Esch at the Technische Universität München. Other co-authors included Bo Wang, Michael König, Catherine J. Bromley, Michael-John Treanor, José A. Garrido Torres, Marco Caffio, Federico Grillo, Herbert Frücht, and Neville V. Richardson.\nThe work at the Georgia Institute of Technology was supported by the Air Force Office of Scientific Research through Grant FA9550-14-1-0005 and by the Office of Basic Energy Sciences of the U.S. Department of Energy through Grant FG05-86ER45234. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the author(s) and do not necessarily reflect the views of the sponsoring organizations.\nCITATION : Bo Wang, et al., “Ethene to Graphene: Surface Catalyzed Chemical Pathways, Intermediates, and Assembly,” (Journal of Physical Chemistry C). http://dx.doi.org/10.1021/acs.jpcc.7b01999\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contacts : John Toon (404-894-6986) (jtoon@gatech.edu) or Ben Brumfield (404-385-1933) (ben.brumfield@comm.gatech.edu).\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}