{"text": "First Optical Rectenna – Combined Rectifier and Antenna – Converts Light to DC Current | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nFirst Optical Rectenna – Combined Rectifier and Antenna – Converts Light to DC Current\nResearchers have demonstrated the first optical rectenna, a device that converts light directly into DC current.\nFacebook\nTwitter\nEmail\nThis schematic shows the components of the optical rectenna developed at the Georgia Institute of Technology. (Credit: Thomas Bougher, Georgia Tech)\nSep 28, 2015\n— Atlanta, GA\nUsing nanometer-scale components, researchers have demonstrated the first optical rectenna, a device that combines the functions of an antenna and a rectifier diode to convert light directly into DC current. Based on multiwall carbon nanotubes and tiny rectifiers fabricated onto them, the optical rectennas could provide a new technology for photodetectors that would operate without the need for cooling, energy harvesters that would convert waste heat to electricity – and ultimately for a new way to efficiently capture solar energy. In the new devices, developed by engineers at the Georgia Institute of Technology, the carbon nanotubes act as antennas to capture light from the sun or other sources. As the waves of light hit the nanotube antennas, they create an oscillating charge that moves through rectifier devices attached to them. The rectifiers switch on and off at record high petahertz speeds, creating a small direct current. Billions of rectennas in an array can produce significant current, though the efficiency of the devices demonstrated so far remains below one percent. The researchers hope to boost that output through optimization techniques, and believe that a rectenna with commercial potential may be available within a year. “We could ultimately make solar cells that are twice as efficient at a cost that is ten times lower, and that is to me an opportunity to change the world in a very big way” said\nBaratunde Cola , an associate professor in the\nGeorge W. Woodruff School of Mechanical Engineering\nat Georgia Tech. “As a robust, high-temperature detector, these rectennas could be a completely disruptive technology if we can get to one percent efficiency. If we can get to higher efficiencies, we could apply it to energy conversion technologies and solar energy capture.” The research, supported by the Defense Advanced Research Projects Agency (DARPA), the Space and Naval Warfare (SPAWAR) Systems Center and the Army Research Office (ARO), was reported September 28 in the journal\nNature Nanotechnology . Developed in the 1960s and 1970s, rectennas have operated at wavelengths as short as ten microns, but for more than 40 years researchers have been attempting to make devices at optical wavelengths. There were many challenges: making the antennas small enough to couple optical wavelengths, and fabricating a matching rectifier diode small enough and able to operate fast enough to capture the electromagnetic wave oscillations. But the potential of high efficiency and low cost kept scientists working on the technology. “The physics and the scientific concepts have been out there,” said Cola. “Now was the perfect time to try some new things and make a device work, thanks to advances in fabrication technology.” Using metallic multiwall carbon nanotubes and nanoscale fabrication techniques, Cola and collaborators Asha Sharma, Virendra Singh and Thomas Bougher constructed devices that utilize the wave nature of light rather than its particle nature. They also used a long series of tests – and more than a thousand devices – to verify measurements of both current and voltage to confirm the existence of rectenna functions that had been predicted theoretically. The devices operated at a range of temperatures from 5 to 77 degrees Celsius. Fabricating the rectennas begins with growing forests of vertically-aligned carbon nanotubes on a conductive substrate. Using atomic layer chemical vapor deposition, the nanotubes are coated with an aluminum oxide material to insulate them. Finally, physical vapor deposition is used to deposit optically-transparent thin layers of calcium then aluminum metals atop the nanotube forest. The difference of work functions between the nanotubes and the calcium provides a potential of about two electron volts, enough to drive electrons out of the carbon nanotube antennas when they are excited by light. In operation, oscillating waves of light pass through the transparent calcium-aluminum electrode and interact with the nanotubes. The metal-insulator-metal junctions at the nanotube tips serve as rectifiers switching on and off at femtosecond intervals, allowing electrons generated by the antenna to flow one way into the top electrode. Ultra-low capacitance, on the order of a few attofarads, enables the 10-nanometer diameter diode to operate at these exceptional frequencies. “A rectenna is basically an antenna coupled to a diode, but when you move into the optical spectrum, that usually means a nanoscale antenna coupled to a metal-insulator-metal diode,” Cola explained. “The closer you can get the antenna to the diode, the more efficient it is. So the ideal structure uses the antenna as one of the metals in the diode – which is the structure we made.” The rectennas fabricated by Cola’s group are grown on rigid substrates, but the goal is to grow them on a foil or other material that would produce flexible solar cells or photodetectors. Cola sees the rectennas built so far as simple proof of principle. He has ideas for how to improve the efficiency by changing the materials, opening the carbon nanotubes to allow multiple conduction channels, and reducing resistance in the structures. “We think we can reduce the resistance by several orders of magnitude just by improving the fabrication of our device structures,” he said. “Based on what others have done and what the theory is showing us, I believe that these devices could get to greater than 40 percent efficiency.” This work was supported by the Defense Advanced Research Projects Agency (DARPA), the Space and Naval Warfare (SPAWAR) Systems Center, Pacific under YFA grant N66001-09-1-2091, and by the Army Research Office (ARO), through the Young Investigator Program (YIP), under agreement W911NF-13-1-0491. The statements in this release are those of the authors and do not necessarily reflect the official views of DARPA, SPAWAR or ARO. Georgia Tech has filed international patent applications related to this work under PCT/US2013/065918 in the United States (U.S.S.N. 14/434,118), Europe (No. 13847632.0), Japan (No. 2015-538110) and China (No. 201380060639.2) CITATION : Asha Sharma, Virendra Singh, Thomas L. Bougher and Baratunde A. Cola, “A carbon nanotube optical rectenna,” (Nature Nanotechnology, 2015).\nhttp://dx.doi.org/10.1038/nnano.2015.220 Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contact : John Toon ( jtoon@gatech.edu ) (404-894-6986) Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}