{"text": "Can Metro Atlanta Handle 1.8 Million More Residents? | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nCan Metro Atlanta Handle 1.8 Million More Residents?\nGeorgia Tech experts examine how the Atlanta region can prepare for the projected addition of nearly 2 million residents by 2050.\nFacebook\nTwitter\nEmail\nApr 04, 2024\nContinued growth will transform metro Atlanta, and the\nAtlanta Regional Commission\n(ARC) projects 1.8 million new residents across the 21-county region by 2050.\nThe increase would bring the regional population to 7.9 million, but to accommodate that growth, Georgia Tech experts say improvements in the housing, transportation, and labor markets must be made.\nHousing\nThe five-county core around Atlanta — Fulton, Gwinnett, Cobb, DeKalb, and Clayton — will account for nearly half of the new residents and continues to grow.\nGregory Randolph , an assistant professor in Georgia Tech’s School of City and Regional Planning, says the region must start by reexamining its approach to urbanism as new census data shows Atlanta has become the sixth most-populated metro area in the country.\n\"For the second half of the 20th century, little of the population growth in metro Atlanta was happening in the City of Atlanta, but that has changed over the past two decades. With the urban core growing, we have an opportunity. to pursue a different kind of urban form that is higher density and more walkable. A lot of the recent growth in Atlanta is adding density without necessarily improving the quality of urbanism.”\nHe explains that, especially in downtown Atlanta, retrofitting existing properties will play a key role in transforming neighborhoods through the replacement of \"lower-value infrastructure,\" such as surface parking lots, with higher-density housing. In a post-pandemic environment, the conversion of office space to mixed-use properties is emerging as a strategy in urban areas\nlike Atlanta .\nA 2023 report\nidentified the need for 391,878 housing units\nwithin the five-county core at the current population level.\nMike Dobbins , professor of the practice in the School of City and Regional Planning, credits efforts made by the mayor's office and nonprofit organizations such as the\nUrban Land Institute\nto increase availability.\n\"We're living in a situation where housing values are too high because big money investors are bidding up real estate prices throughout the region. Even nationally, it's double the rate of wage increases. The biggest question is how can we bring down housing costs,” he said.\nRandolph and Dobbins agree that addressing Atlanta’s housing needs is more complicated than simply adding supply.\n“Our priority must be building housing that is affordable to low- and middle-income households, and in a way that promotes mixed-income, walkable neighborhoods with equitable, car-free access to amenities like parks, schools, and community-serving retail,” Randolph said.\nLabor\nAlong with population growth, the region will add an estimated 856,000 jobs, with significant gains in healthcare, technology, and waste management. To maintain a labor force that can fill the jobs of the future, Dobbins stresses that continued investment in K-12 education, especially in traditionally underserved communities, is vital to accommodate new growth and overcome existing challenges of inequity.\nAtlanta has the highest income inequality in the nation. According to\nthe Atlanta Wealth Building Initiative , the average white family’s median income is $83,722 compared to $28,105 for Black families and $43,110 for Latino families. That gap widens when examining wealth, which for white households is\n46 times higher than that of Black households in Atlanta .\nThe ARC study notes that \"virtually all the net growth will come from racial and ethnic minority groups.” Randolph points to policy as a necessary tool in improving workforce development for current and future residents to support equitable and inclusive growth across the region. He adds that institutions like Georgia Tech can play a role in expanding access to the advanced degrees often needed to fill the jobs created by the city’s emerging status as a technology hub, with an emphasis on ensuring access to these degrees among historically disadvantaged groups in the city.\nTransportation\nThe other 900,000 projected new residents will reside among the remaining 16 counties in the Atlanta region. The ARC predicts the most rapid growth in Forsyth, Barrow, Paulding, Cherokee, Walton, and Coweta, and the need for affordable housing will extend to the surrounding counties, as will the need to travel throughout the region.\nRyan Gravel , the Georgia Tech alumnus and mind behind the Atlanta BeltLine, says transit improvements are needed to ensure each county is connected to Atlanta’s city center.\n“We haven't made a substantial new transit investment since 2000,” he said. “Meanwhile, the region has grown substantially since then. We haven't been laying the foundation for that future growth, which means it will come in ways that we don't want: more traffic, more congestion, and more inequities in communities of color.”\nGravel, founder of the consulting firm Sixpitch, rejects adding lanes to existing highways, saying that strategic improvements to MARTA — the rail system constructed in 1979 — will reduce traffic while allowing residents to live outside of the five-county core.\n“As the saying goes, the best time to plant a tree is 20 years ago,” he said. “The second-best time is now. We didn’t do it 20 years ago, but we could start now.”\nIn his 2024 State of the City address, Dickens announced plans to construct a new MARTA rail station on the Southside at the Murphy Crossing redevelopment project site, connecting the system to Beltline for the first time. The mayor revealed preliminary plans to add three infill MARTA stations throughout the city, however, specific locations were not announced.\nPlans to add a portion of the light-rail system around the BetlLine are currently under review, with construction on the Streetcar East expansion project — extending Atlanta Streetcar service from downtown Atlanta to Ponce de Leon Avenue — projected to begin construction in 2025 and begin service in 2029. In 2025, the\nMARTA Rapid Summerhill project\nwill begin service from downtown to Capitol Gateway, Summerhill, Peoplestown, and the BeltLine through dedicated bus lanes with transit signal priority to bypass traffic.\nA “Beloved Community”\nThe Atlanta region’s transformation will not happen overnight, but anchor institutions like Georgia Tech can contribute along the way. Randolph sees current plans to revitalize portions of the city’s Westside as an example of how neighborhoods can be revitalized for current residents while simultaneously building with future growth in mind.\n“It’s important that we continue to play a positive role in not just physically developing the Westside but also thinking about how we can strengthen the economy of Westside neighborhoods through our own procurement and purchasing practices. It's an example of how Georgia Tech, as an engine of economic development, can play a positive role in propelling that growth while ensuring that the growth is inclusive.” Randolph said.\nThe solutions to the ARC’s projected growth will not be cheap or easily attained, but as Gravel points out, it’s an opportunity for Atlanta to honor its past as it marches toward its future, aspiring to Martin Luther King Jr.’s idea of the beloved community.\n“The prosperity of the metropolitan region stands on the shoulders of the Civil Rights Movement,” he said. “If that's who we are when we're at our best, then we should use that as a model for how we move forward. How we accommodate that future change should be based on decisions to ensure that this place is a place for everyone.”\nContact\nSteven Gagliano\n- Institute Communications\nEmail\nSteven.gagliano@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}