{"text": "Georgia Clinical & Translational Science Alliance Receives $51 Million NIH Grant | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Clinical & Translational Science Alliance Receives $51 Million NIH Grant\nThe Georgia Clinical & Translational Science Alliance has received a $51 million NIH grant\nFacebook\nTwitter\nEmail\nAndrés García, a Regents’ Professor in the Woodruff School of Mechanical Engineering at the Georgia Institute of Technology and Jessica Weaver, a Georgia Tech postdoctoral researcher, discuss pancreatic islet cells being studied in their laboratory. (Credit: Christopher Moore, Georgia Tech)\nSep 25, 2017\n— Atlanta, GA\nAfter a decade of research collaboration, the Atlanta Clinical & Translational Science Institute (ACTSI) will welcome a new partner and change its name, reflecting a new statewide focus. The University of Georgia will officially become the fourth academic partner, and ACTSI will now be known as the\nGeorgia Clinical & Translational Science Alliance\n(Georgia CTSA).\nThis alliance is celebrating 10 years of research advancement by expanding across the state through a five-year, $51 million Clinical and Translational Science Award (CTSA) from the National Institutes of Health (NIH). The Emory University-led Georgia CTSA will focus on transforming the quality and value of clinical research and translating research results into better outcomes for patients.\nThe Georgia CTSA unites the strengths of its academic partners:\nEmory University ,\nMorehouse School of Medicine , the Georgia Institute of Technology, and the\nUniversity of Georgia . Emory is a national leader in health care and biomedical research as well as an outstanding leader in clinical and translational research training and education. Morehouse School of Medicine is a nationally recognized historically black institution that brings ethnic diversity to biomedical research, addresses health disparities through successful community engagement research, and serves as a pipeline for training minority researchers. Georgia Tech is a national leader in biomedical engineering, bioinformatics  and the application of innovative systems engineering to health care solutions. The University of Georgia has a proven track record in outstanding basic and translational research and, as the state’s land grant institution, offers a robust statewide network that enhances community outreach, service and research.\n“Continuing such an alliance and involving these leading state institutions is extremely important and in line with Georgia’s goals for the promotion of clinical and translational research, innovation and development,” said Georgia Governor Nathan Deal. “Having an active Clinical & Translational Science awardee in Georgia has brought our citizens cutting edge cures and the latest in clinical and translational research.”\nGeorgia CTSA is one of 64 Clinical and Translational Science Awards (CTSA) at major academic medical centers across the country, funded by the National Institutes of Health’s\nNational Center for Advancing Translational Science , and it is the only CTSA in Georgia. The award will fund cores focused on improving quality, efficiency and collaboration of the research process; provide consultative support and new tools in informatics and biostatistics; pilot funding for new research projects, training and workforce development, while integrating special populations and focusing on participant interactions, and creating local centers tackling clinical trial inefficiencies.\nThe Georgia CTSA welcomes contact principal investigator (PI) at Emory, W. Robert Taylor, M.D., Ph.D., and a new multi-PI leadership structure:\nW. Robert Taylor, MD, PhD\nContact Principal Investigator, Georgia CTSA\nInterim Chair, Department of Medicine\nDirector, Division of Cardiology\nMarcus Chair in Vascular Medicine\nProfessor of Medicine and Biomedical Engineering\nEmory University School of Medicine\nElizabeth O. Ofili, MD, MPH\nPrincipal Investigator, Morehouse School of Medicine, Georgia CTSA\nProfessor of Medicine, Cardiology\nSenior Associate Dean of Clinical and Translational Research\nDirector, Clinical Research Center\nMorehouse School of Medicine\nAndrés J. García, PhD\nPrincipal Investigator, Georgia Institute of Technology, Georgia CTSA\nRae S. and Frank H. Neely Endowed Chair and Regents' Professor, Woodruff School of Mechanical Engineering and Petit Institute for Bioengineering and Bioscience\nDirector, Interdisciplinary Bioengineering Graduate Program\nGeorgia Institute of Technology\nBradley G. Phillips, PharmD, BCPS, FCCP\nPrincipal Investigator, University of Georgia, Georgia CTSA\nMillikan-Reeve Professor and Head, Clinical & Administrative Pharmacy, College of Pharmacy\nDirector, Clinical and Translational Research Unit (CTRU), Office of Research\nUniversity of Georgia\nHenry M. Blumberg, MD\nPrincipal Investigator, KL2 and TL1, Georgia CTSA\nProfessor of Medicine and Epidemiology, Division of Infectious Diseases\nEmory University School of Medicine\n\"The Georgia CTSA creates a unique opportunity for synergy among historic partners in health care, education, and cutting edge research, and has emerged as an innovative and integrated environment where clinical and translational researchers can flourish,\" said Taylor. \"The Georgia CTSA is a catalyst and incubator for clinical and translational research across the state, with impacts throughout the Southeast and nation.\"\nThe Georgia CTSA has improved health care and research for Georgia citizens through collaboration with the Grady Health System, Children’s Healthcare of Atlanta, Atlanta VA Medical Center, Georgia Research Alliance, Georgia Bio, and multiple community medical groups throughout the state.\n\"Georgia CTSA continues established, strong clinical and research partnerships by leveraging the infrastructure support of the NIH-funded Research Centers at Minority Institutions (RCMI) at Morehouse School of Medicine. We will continue to implement innovative patient centered and participatory care delivery models, toward the elimination of health disparities,\" said Ofili.\n“Georgia CTSA’s innovative support of discovery and collaborative partnerships help to rapidly translate scientific discoveries and new technology, which positively impacts patient care in Georgia. This is an exciting story for the state,” said Garcia. “The new alliance is improving health care and clinical research for the citizens of Georgia and continues to create synergies that foster and accelerate new and emerging technologies and discoveries.”\n“The addition of the University of Georgia provides the Georgia CTSA a statewide footprint to connect with every county in the state to address health and wellness needs, particularly in rural and underserved populations; opportunities for continued excellence in research by strengthening existing and expanding new research collaborations; and the ability to enrich interprofessional education to include students and trainees from pharmacy and other disciplines so that they can learn how to work together as a team to discover new approaches and treatments that improve health and patient care,” said Phillips. “As a new member of the Georgia CTSA, faculty and students across our campus will have unique support and infrastructure that builds upon current capabilities and increases our trajectory in fostering clinical and translational science in the state and beyond.”\nWritten by Georgia Clinical & Translational Science Alliance .\nFor more information, please visit\nwww.GeorgiaCTSA.org\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}