{"text": "Two Georgia Tech Faculty Members Named to Governor’s Teaching Fellows Program | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nTwo Georgia Tech Faculty Members Named to Governor’s Teaching Fellows Program\nGeorgia Tech faculty members Flavio Fenton and Anna Holcomb have been chosen to take part in the 25th annual Governor’s Teaching Fellows Program for the 2020-2021 school year.\nFacebook\nTwitter\nEmail\nSep 30, 2020\n— Atlanta, GA\nGeorgia Tech faculty members  Flavio Fenton  and  Anna Holcomb  have been chosen to take part in the 25 th annual  Governor’s Teaching Fellows Program  for the 2020-2021 school year. This year’s cohort of fellows was announced earlier this month by the  Institute of Higher Education  (IHE) at the University of Georgia.\nOnly two faculty members from each of the 26 University System of Georgia institutions are invited to participate in the program. Fenton is a professor in the  School of Physics , and Holcomb is a lecturer in the  School of Electrical and Computer Engineering  (ECE) and serves as its assistant director of the  Undergraduate Professional Communication Program  (UPCP). Each invitee must work on a project during their fellowship year that will benefit both the faculty member and their school.\nAccording to the IHE’s web page, the Teaching Fellows Program was established in 1995 by former Governor Zell Miller to provide Georgia's higher education faculty with expanded opportunities for developing important teaching skills. Participants are selected “on the basis of their teaching experience, their interest in continuing instructional and professional development, their ability to make a positive impact on their own campus, and a strong commitment by their home institution for release time and other forms of support for the duration of their participation in the program.”\nFor his fellowship project, Fenton is creating a large database of physics demonstrations to be used in Georgia Tech’s Physics I course, taken by nearly 2,000 students each year.\n“The idea is to have at least two real-life demos for each class given in the semester to help exemplify the physics concept introduced in the class, which will be over 80 experimental demonstrations,” Fenton says. “The demos can also help students stay focused and motivated and provide new opportunities for students to engage with the material as they connect theory with reality in an interactive way. The demos will also be recorded while being demonstrated so that they can be used by instructors in other institutions if they do not have direct access to the equipment.”\n“Being a Governor’s teaching fellow is a great honor for me,” Fenton continued. “Not only is it allowing me to further my teaching skills, but also it is making me transform how I approach teaching. This year-long program allows me to spend three days a month interacting closely with enthusiastic and thoughtful educators from other colleges and universities of Georgia and learning about several instructional techniques that have been new to me. The diverse composition in teaching fields of the teaching fellows cohort has opened me to new ways of thinking that will have an impact on how I select and organize course content and delivery in all my future courses.”\nFenton came to Georgia Tech in 2012 as an associate professor, and was made a full professor in 2018. He received his B.S. in Physics from Universidad Nacional Autonoma de Mexico in Mexico City, and a M.S. and Ph.D. in Physics from Northeastern University in Boston, Massachusetts. Fenton and School of Physics colleague Carlos Silva were elected in 2019 to the American Physics Society Fellows program. Fenton has also won the 2017 Junior Faculty Outstanding Undergraduate Research Mentor Award, the 2017 Geoffrey B. Eichholz Faculty Teaching Award, and the 2018 Faculty Award for Academic Outreach.\nHolcomb’s fellowship project is a formative evaluation of the new early-intervention communications course that is now being redeveloped as the new 1000-level ECE Discovery Studio.\n“The 1000-level ECE Discovery Studio will be a required course for incoming ECE students, including all first-years and transfers. The purpose for the course is to introduce students to the world of ECE and real-world problems that are being addressed in the field,” Holcomb said. “Students will be introduced to the new ECE curriculum threads and learn about possible career paths for electrical engineering and computer engineering majors. The ECE Discovery Studio will also allow students to begin building the professional communication skillset needed to explore early career opportunities like internships, co-ops, undergraduate research, and extracurriculars.”\n\"The Governor’s Teaching Fellows Program provides me with dedicated time to perform a formative evaluation of the content and instructional practice of ECE’s new Discovery Studio as it launches this semester,” Holcomb continued. “I am collecting student insights and performing in-time calibrations in preparation for the second run of the new course in Spring 2021, which will be incredibly beneficial to the School and our students. The program also facilitates continued development of my teaching skills in a diverse professional learning community. During a time when so many of us are working remotely, connecting with the other fellows, even remotely, has provided a surge of excitement for the new school year and teaching virtually.\"\nHolcomb joined ECE in 2017 and previously worked in the Center for Education Integrating Science, Mathematics, and Computing in the Georgia Tech College of Sciences. She received her M.S. in Educational Research with a concentration in Research, Measurement, and Statistics at Georgia State University and B.S. in Public Policy at Georgia Tech. Holcomb is also highly involved in the faculty development programs offered at Georgia Tech by both the Center for Teaching and Learning and the Office of Faculty Affairs and by the American Society for Engineering Education (ASEE). She presented at Georgia Tech’s Celebrating Teaching Day in 2018 and will co-present with ECE UPCP Director Christina Bourgeois at a session at ASEE's annual conference in 2021, which will be held in Long Beach, California.\nWriters:\nJackie Nemeth, School of Electrical and Computer Engineering, and Renay San Miguel, College of Sciences Dean's Office\nAdditional Images\nRelated links\nFlavio Fenton\nAnna Holcomb\nSchool of Physics\nSchool of Electrical and Computer Engineering\nGeorgia Tech\nContact\nJackie Nemeth\nSchool of Electrical and Computer Engineering\n404-894-2906\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}