{"text": "Georgia Tech Starter Offers Alternative Funding Method for Medical Research | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Starter Offers Alternative Funding Method for Medical Research\nDoctoral student seeking new medicines derived from Fijian red algae\nFacebook\nTwitter\nEmail\nNov 07, 2013\n— Atlanta, GA\nFunding for research is a highly competitive endeavor under the best of circumstances. For Georgia Tech doctoral student Troy Alexander, a new avenue for funding has opened. Alexander works as a researcher in\nSchool of Biology Professor Julia Kubanek’s group . His latest project seeks to accelerate the discovery of new medicines for the treatment of cancer and infectious diseases by studying Fijian red algae. To help raise funds to support this research, Alexander and Kubanek posted the project on Georgia Tech Starter, a university-based, peer-reviewed crowdfunding platform for faculty-sponsored scientific research projects. Alexander established a fundraising goal of $9,450 to fast-track the discovery of these new medicines through a combination of biomedical screening, nuclear magnetic resonance spectroscopy, and multivariate statistical analysis of his library of marine chemical compounds from the Fijian organisms. By identifying unknown molecules, the research will prioritize exploration of previously unseen structures that can exhibit strong potency toward microbial and human cancer cell lines. “These molecules previously unknown to science will be carried forward for purification, structure determination, and development as treatments for disease,” Alexander said. Georgia Tech Starter is a perfect venue for making human medicine research advances more accessible to a general audience, he added. According to Allison Mercer, an applied physicist at Georgia Tech Research Institute – and the mastermind behind\nGeorgia Tech Starter\n– using crowdfunding for science means there is a community of people invested in the research, witnessing its benefits and outcomes. “There is incredible potential for contributors to engage with scientists in a way that hasn’t been done before: A project that is successfully funded converts into a blog through which only project supporters can monitor the progress of the project, ask the scientists questions, and witness world-class research at Tech as it unfolds.” But, before taking a step to gain the world’s attention through\nTech Starter , researchers need to consider several things, Alexander said: One is the amount of funding to request. “The amount we seek to raise should be large enough to make an impact on our research, but it shouldn’t be so large to sound insurmountable to potential donors,” he said. “Another item to consider is how easily one can make their research appeal to a broader audience,” he said. “Do you have any tangible goals that can be achieved within the first year as proof of progress to donors? Are you willing to commit to engaging with the audience – from making the video to maintaining social media contact? These are huge commitments, and they need to be managed without becoming a drain on research time.” Lastly, Alexander advises that the goals of the project need to be easy to explain and justify. Short-term goals should be clear to give investors something to anticipate. And, he said, researchers should be prepared for the contingency that the funds might not be raised. Like other crowdfunding platforms, Georgia Tech Starter operates with an all-or-nothing funding strategy. Only if the project goal amount is reached within a 60-day window, are donors’ credit cards charged. This helps assure supporters that the researchers will only receive the pledged money if they have enough total funds to achieve the stated project goals. Some research efforts are scalable, but many are not. “If it costs a million dollars to launch a telescope into space, it doesn’t do you any good to get halfway there,” said Mercer. Students interested in taking advantage of Tech’s crowdfunding site can visit starter.gatech.edu to submit their contact information. The process for getting a project posted on Georgia Tech Starter includes a comprehensive peer review of the project to ensure that: it is achievable; the requested funding amount is enough to complete the project; and the researchers on the project have the knowledge, skills, and abilities to get the research done right. Through the peer review process, researchers will receive feedback on how to better craft the project’s message for posting. “We do everything we can to support the project creators so they can be successful,” said Mercer.\nRelated links\nAccelerating Discovery of Antibiotics from Algae\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}