{"text": "The Sustainability Next Plan Transforms Vision Into Reality | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nThe Sustainability Next Plan Transforms Vision Into Reality\nOn the one-year anniversary of the launch of Sustainability Next, a publicly available version of the plan is being released and several plan initiatives are coming to life.\nFacebook\nTwitter\nEmail\nCover of the Sustainability Next Plan\nSep 20, 2023\nOn the one-year anniversary of the launch of Sustainability Next, a publicly available version of the plan is being released and several plan initiatives are coming to life.\nFollowing the creation of Georgia Tech’s 2020 – 2030 strategic plan, the Institute’s executive leadership team launched a task force to create a strategic sustainability roadmap — the\nSustainability Next Plan\n— to help advance some of its most important goals.\n“Sustainability Next is central to Georgia Tech’s commitment to developing leaders who advance technology and improve the human condition,” said President Ángel Cabrera. “As one of the largest technological universities in the world, we have the opportunity and responsibility to help find solutions to the biggest problems we face, achieve the United Nations Sustainable Development Goals, and support a human population that will soon rise to 10 billion while reducing the stress we’re causing on our planet.”\nThe plan calls on Georgia Tech to:\nBe a global sustainability thought leader.\nCatalyze innovation through education and research.\nLead by example in the practice and culture of sustainability.\nSince the fall of 2022, Sustainability Next has begun to implement projects, including:\nThe Climate Action Plan\nto develop a roadmap for integrating climate action strategies across operations, research, and education focusing on climate justice and reducing emissions.\nSustainable X , which supports students interested in and passionate about developing climate tech, sustainability, and social impact startups.\nSustainability Education Innovation Grants\nfor faculty to expand Sustainable Development Goals concept and skill integration across the undergraduate curriculum.\nResearch Seed Grants\nto support interdisciplinary climate and sustainability research initiatives.\nLiving Campus\nconnecting Georgia Tech’s built environment and surrounding landscape to serve as opportunities for collaborations between academics, research, industry, operations, and community partnerships.\nThese initiatives alone have created collaborations between several sustainability-focused departments on campus, including the Office of Sustainability, the Brook Byers Institute for Sustainable Systems, the Ray C. Anderson Center for Sustainable Business, and the Center for Teaching and Learning.\nCreating the Foundation for Successful Implementation\nAs an outcome of the strategic plan to more intentionally integrate sustainability and lead by example with campus operations, Georgia Tech restructured its facilities management into Infrastructure and Sustainability (I&S) in 2021. The following year, the Office of Campus Sustainability was restructured into the Office of Sustainability within I&S to bridge sustainability efforts across research, education, and operations. It was later expanded to integrate the departments of utilities, sustainable building operations, and The Kendeda Building for Innovative Sustainable Design.\nAdditionally, Sustainability Next has supported the Brook Byers Institute in becoming a transformative unit focused on climate and sustainability that integrates research and education. It has also strengthened ties in the sustainability cluster of the Vice President for Institutional Research, comprising the Byers Institute, the Renewable Bioproducts Institute, and the Strategic Energy Institute — including the permanent integration of Serve-Learn-Sustain into the newly established Center for Sustainable Communities Research and Education.\nLooking Ahead\nIn the next few months, the Sustainability Next Plan will be supported by a refreshed website, a schedule of sustainability-related events, and calls to action, reinvigorating the sustainability charge set forth in the Institute’s strategic plan.\nThe Sustainability Next co-chairs invite every member and unit of the Georgia Tech community to join in bringing the Sustainability Next Plan to life and expanding its ambitions over time so that we can build a just, equitable, and sustainable future — together.\nFor continuous updates and to find out how you can get involved, visit the new\nSustainability Next webpage.\nAdditional Images\nRelated links\nSustainability Next\nContact\nEmma Blandford\nProgram and Portfolio Manager\nInstitute for Sustainable Systems\nEmail\neblandford3@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}