{"text": "New Athletic Director Named | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNew Athletic Director Named\nGeorgia Tech named J Batt as its new director of Athletics. He will join Tech on Oct. 24.\nFacebook\nTwitter\nEmail\nJ Batt\nOct 14, 2022\n— Atlanta, GA\nGeorgia Tech named J Batt as its new director of Athletics. Batt is departing the role of executive deputy director of Athletics, chief operating officer, and chief revenue officer at the University of Alabama and will join Georgia Tech on Oct. 24.\n“We’re excited to welcome J to Georgia Tech. His leadership experience at one of the most competitive programs in the nation and his extraordinary track record in fundraising and revenue generation will bring great value to Georgia Tech,” said Georgia Tech President Ángel Cabrera. “As a former ACC student-athlete, J has a keen appreciation for what it takes for students to compete at the highest level while pursuing a degree at a top academic institution. He values and shares our culture of excellence and integrity and our commitment to student well-being and success. I look forward to working with him to secure and invest the resources necessary for a successful athletics program.”\nAs athletic director at Georgia Tech, Batt will report directly to Cabrera and serve as a member of his cabinet. He will be responsible for planning, developing, administering, and advancing Georgia Tech's intercollegiate athletic programs, with a focus on building an environment that inspires and empowers student-athletes to be champions in academics, competition, and life.\n“My family and I truly appreciate President Cabrera and his team for this opportunity, and we are incredibly excited to join the Georgia Tech family,” said Batt. “I look forward to working with our student-athletes, coaches, staff, supporters, and fans to reach new heights, on and off the field, and to build on the rich tradition and history of this storied athletics department. We can’t wait to become a part of the Atlanta community. Go Jackets!”\nBatt was named the top candidate by Cabrera following a national search. The selection process included interviews with a committee comprised of a coach, senior athletics administrator, student-athlete, student-athlete alum, and faculty member who recommended a set of finalists for consideration by the president. The board of trustees of the Georgia Tech Athletic Association voted unanimously to approve Cabrera’s proposal to appoint Batt.\nBatt joined the University of Alabama as senior associate athletic director in 2017. He was responsible for guiding revenue generating, including charitable giving, ticketing, Tide Pride, and other revenue sources. He was promoted to COO and senior deputy athletic director in 2021 and to executive deputy director, COO, and chief revenue officer in 2022. Batt oversaw the successful development, implementation, and launch of the Crimson Standard, a 10-year, $600 million capital initiative. He also provided day-to-day leadership of the department as a member of the Athletics executive team and served as the sport administrator for men's basketball.\nFrom 2013 to 2017, Batt was senior associate athletic director at East Carolina University and executive director of the Pirate Club. As a member of the ECU athletics executive leadership team, Batt oversaw a development operation that increased total fundraising in 2016 by more than 60% over ECU's previous best year. He also served as an associate AD and executive director of the Terrapin Club for the University of Maryland from 2011 to 2013. He joined the Terrapin Club staff in 2009 and served as executive director beginning in September 2011. Before his tenure at Maryland, Batt worked in athletics fundraising at James Madison University, the College of William & Mary, and his alma mater, the University of North Carolina at Chapel Hill.\nA member of the Tar Heels' 2001 NCAA champion men's soccer team, Batt graduated from UNC with a bachelor's degree in journalism and mass communications and a master's degree in sports administration.\n“On behalf of Yellow Jackets fans everywhere, I'm grateful to Frank Neville for stepping up to serve and guiding our program through this transition,” Cabrera said. “His leadership brought stability to our teams and student-athletes and paved the way for a new era at Georgia Tech Athletics.”\nAdditional Images\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}