{"text": "The Transformation-Ready Institution | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nThe Transformation-Ready Institution\nA new report reveals how university leaders are preparing for changing market forces and disruption in higher education.\nFacebook\nTwitter\nEmail\nOct 23, 2019\n— Atlanta, GA\nThe higher education landscape continues to be immersed in change, with institutions navigating declines in federal and state funding, increased competition, and a shrinking, yet more diverse, student population. As competition in higher education continues to intensify, college and university leaders face a growing sense of urgency to prepare for the future and transform.\nTogether, the Georgia Institute of Technology, American Council on Education (ACE), and Huron surveyed nearly 500 leaders at four-year, nonprofit colleges and universities to better understand how they are preparing for the inevitable change and disruption.\nThe collective research, shared in a report titled \" The Transformation-Ready Higher Education Institution: How Leaders Can Prepare for and Promote Change ,\" revealed that very few higher education leaders are highly confident that their institutions are prepared to respond to these changing market forces. Additionally, leaders are challenged by public perceptions of the value of higher education and increased competition for students both domestically and internationally.\n“Higher education leaders have our work cut out for us,\" remarks Dr. Ángel Cabrera, president of Georgia Institute of Technology. \"This joint research underscores the opportunity and available tools we have to evolve our institutions and reinforce their essential role in our communities.\"\nNelson Baker, dean of Georgia Tech Professional Education, and Richard DeMillo, executive director of the Georgia Tech's Center for 21st Century Universities, were among the key contributors behind the report. As part of the Educational Innovation Ecosystem at Georgia Tech, their units help to lead and guide the educational innovation mission for the institute.\nReport Highlights:\nFew higher education leaders are highly confident that their institutions are adequately prepared for changing market forces.\nLeaders have more confidence about the future at institutions with longer planning horizons and integrated performance management structures.\nA majority of institutions are planning three to five years out with less than 20% planning 10 years or beyond.\nFour transformation-readiness imperatives:\nEmpowering and promoting a shared leadership model\nPlanning differently for the immediate- and long-term\nPursuing data-driven performance management\nCreating student-first engines to meet new demand\nBuilding a Strong Future\nThere is no universal solution for how institutions can successfully evolve the higher education business model. The report suggests creating a culture of shared leadership that considers multiple perspectives rather than a single person or governing body. This model can help institutions prepare and be nimble enough to respond to these changes.\nMost leaders recognize changes are needed to respond to the competitive landscape and acknowledge these investments should align with the evolving student population, with the majority of respondents indicating they are rapidly overhauling their academic programs, investing in technological improvements, and expanding online offerings.\n“The fastest growing population in higher education is adult learners, now comprising nearly half of the total learner population. Working professionals have vastly different needs than those of the traditional student,” said Baker. “That shift coupled with the fact that technology allows us to provide educational opportunities on a global scale makes it imperative that we plan more strategically and prioritize agility in order to meet the needs of learners today and in the future.”\nYet only 14% of the leaders planning technology investments have strategic technology management integrated across their institutions—suggesting a potential gap between intentions and leadership’s capacity to realize the value of these investments.\n“Many institutions subscribe to planning models that were built for a different time and a different competitive market,” said Peter Stokes, managing director in Huron’s education business. “To become truly transformation-ready, institutions’ short- and long-term planning efforts should link directly to the needs of increasingly empowered, discerning audiences for whom higher education is not simply a next step after high school.”\nGeorgia Tech's Role in Transformation Readiness\nLeaders that consider a long-term, yet adaptive, strategic planning approach can better anticipate these market trends and make the necessary changes to thrive now and in the future. Yet only 16% of the survey respondents are looking 10 years or beyond in terms of strategic planning.\nIn April 2018, Georgia Tech’s Office of the Provost released  Deliberate Innovation, Lifetime Education , a report that explores the future of higher education. Using the year 2040 as a long-term vantage point, Deliberate Innovation makes recommendations on alternative educational models to reduce costs, improve the effectiveness of current methodologies, and increase opportunities to serve the needs of the next generation of learners.\n\"At a research university like Georgia Tech, people think very hard about how to structure their research programs to anticipate future needs, but they spend relatively little time thinking about how to innovate on the academic front,\" said DeMillo. \"We want to create an immersive culture where all of the incentives and all the rewards flow to individual institutional leaders and faculty members who are consciously rethinking how to deliver education.\"\nIn addition to the survey, several participants were interviewed to offer their perspectives on innovation and its impact on the higher education industry. Portions of those interviews are included in the report, which can be viewed on the  Huron website .\nAdditional Images\nContact\nGeorgia Tech Professional Education gtpe-communications@pe.gatech.edu\nEmail\ngtpe-communications@pe.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}