{"text": "The Link Between Transit Use and Early Covid Cases | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nThe Link Between Transit Use and Early Covid Cases\nA new study looks at the link between America’s mass transit use and Covid-19 cases at the beginning of the pandemic.\nFacebook\nTwitter\nEmail\nMichael Thomas, John Taylor, and Neda Mohammadi\nApr 15, 2022\n— Atlanta, GA\nResearchers from Georgia Tech’s Colleges of Engineering and Computing have completed the first published study on the link between America’s mass transit use and Covid-19 cases at the beginning of the pandemic.\nUsing data from the Federal Highway Administration’s\nNational Household Travel Survey , the team looked at the nation’s 52 largest metropolitan areas and each community’s likelihood of riding buses and trains. They then compared the numbers with the 838,000 confirmed Covid cases on the Johns Hopkins Center for Systems Science and Engineering's dashboard from Jan. 22 – May 1, 2020.\nThe timeframe covers the initial days, weeks, and months of the pandemic, before mask mandates were in place and prior to widespread social distancing. Ventilation on public transit had yet to be addressed, along with other public health measures that have since become the norm.\nThe study found that cities with high-usage public transportation systems displayed higher per capita Covid incidence. This was true when other factors, such as education, poverty levels, and household crowding, were accounted for. The association continued to be statistically significant even when the model was run without data from transit-friendly New York City.\nThe paper, “ Investigating the association between mass transit adoption and COVID-19 infections in US metropolitan areas ,” is published in the journal\nScience of the Total Environment . While the researchers don’t suggest that transit is the sole cause of the high incidence rates, they say it could have been an important factor early in the pandemic.\n“This is what we expected, but we wanted to run the models to know for sure. Policymakers shouldn’t make decisions based on what they assume to be true,” said\nMichael Thomas , one of the study’s co-authors and a Ph.D. student in Georgia Tech’s\nSchool of Computational Science and Engineering . “This study is similar to dusting off a dinosaur dig site and finding a leg bone. This isn’t the entire dinosaur. There are many ways of making the argument about Covid spread, and transit is just part of it.”\nThe team got the idea of tracking transit and Covid cases after watching early reports from Wuhan, China, and reflecting on how differences in public transportation systems may factor into pandemic spread patterns. As assumptions were being made about how American cities should react based on ridership patterns on the other side of the globe, Professor\nJohn Taylor\nthought the pandemic shouldn’t be treated as a “one size fits all” situation.\n“In the initial months of the pandemic, models were being developed here at home based on incidence rates in Wuhan. But, in terms of mass transit ridership behavior, China’s may be far different than what we see in American cities,” said Taylor, Frederick Law Olmsted Professor and associate chair for graduate programs and research innovation in the\nSchool of Civil and Environmental Engineering . “For instance, people in Chinese urban areas often stand in long, single file lines as they wait for trains and buses. We don’t. Different spread patterns can develop because of differences in mass transit behaviors.”\nTaylor’s primary research focuses on the dynamics that can occur at the intersection of human and engineered networks, such as how people change electricity consumption behaviors and changing mobility patterns in natural disasters. Pandemics were on his research radar before Covid became a household name, as Taylor wanted to create better models to forecast the spread of illnesses. His first research effort in this direction was tracking the Ebola virus that reached Texas in 2014.\nIn the fall of 2019, Thomas was working as a biostatistician at the Georgia Department of Public Health when he spoke with Taylor about pursuing his Ph.D. Thomas submitted his application to Georgia Tech that November — just four months before Covid shut down America.\nThe two, along with study co-author and senior research engineer\nNeda Mohammadi , are now creating models to predict the spread of future illnesses among populations. They’re also looking to demonstrate how researchers can modify those models for better accuracy.\n“If engineers and scientists can better understand the factors of community spread, policymakers can make faster, more accurate decisions to protect public health,” said Thomas. “In transportation, for example, it could lead to quicker decisions to restrict the number of people on buses. Or policies to stagger vehicle departure times more consistently. Studies like ours provide a basis for those decisions.”\nHaving more accurate models also takes varying human behavior into account, according to the researchers. Just as people in Wuhan wait for public transportation differently than those here in America, cities can differ from each other.\n“Your pandemic is different than your neighbor’s,” said Mohammadi. “Pandemic spread isn’t the same from city to city, nor is ridership. Decision makers often look to other communities to see how they’re responding to shape their actions. That’s not always accurate. Models need to be customizable because populations don’t react uniformly. It’s our goal to improve decision making to be easier, faster, and more accurate for the next pandemic.”\nCITATION:  Thomas, M., Mohammadi, N., Taylor, J. Investigating the association between mass transit adoption and COVID-19 infections in US metropolitan areas. Science of the Total Environment Vol 811, 152284 (2022).\nhttps://doi.org/10.1016/j.scitotenv.2021.152284\nThis material is based upon work supported by the National Science Foundation (NSF) under Grant No. 1837021. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the NSF.\nAdditional Images\nContact\nJason Maderer\nCollege of Engineering\nmaderer@gatech.edu\nEmail\nmaderer@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}