{"text": "Manufacturing Disaster Assistance Program to help Georgia companies prepare for natural disasters | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nManufacturing Disaster Assistance Program to help Georgia companies prepare for natural disasters\nManufacturers in seven Georgia counties can participate in new\nprogram offered by the Georgia Manufacturing Extension Partnership.\nFacebook\nTwitter\nEmail\nBen Cheeks, is the Georgia Manufactuing Extension Partnership’s coastal region manager.\nJan 30, 2018\n— Savannah, GA\nThe Georgia Manufacturing Extension Partnership (GaMEP) is seeking eligible manufacturers to participate in a disaster assistance program designed to help companies that are located in the state’s coastal areas assess their preparedness and develop operational solutions to minimize the impact of future hurricanes and other natural disasters.\nThe $173,859 grant from the National Institute of Standards and Technology (NIST) funds the GaMEP’s Manufacturing Disaster Assistance Program (MDAP), which was developed to address the needs of Georgia manufacturers.\nThe funds for the two-year effort are specifically designated toward assisting manufacturers with operations in Coastal Georgia in Camden, Chatham, Charlton, Glynn, Liberty, and McIntosh counties. It also includes Coffee County, which is not on the coast, but was also severely impacted by flooding during 2017’s Hurricane Irma.\nThe counties are home to 408 manufacturing facilities that employ 23,000.\nThe MDAP creation follows a devastating 2017 hurricane season in which Hurricane Irma led to a mandatory evacuation of the coast’s nearly 540,000 residents and business owners, and resulted in estimated damages of more than $670 million. That’s on top of a 2016 evacuation of the Georgia coast following Hurricane Matthew, which caused more than $500 million in damages.\nThe goal with this tailored approach to help manufacturers on the Georgia Coast is two-pronged, said Ben Cheeks, GaMEP’s coastal region manager.\n“First, we want to assist as many manufacturers as possible and get them operating at pre-Hurricane Irma levels — that includes employment and fully contributing to the regional and state economies,” Cheeks said. “The second part of this effort is to help them develop plans that they will already have in place to address future hurricanes and other natural disasters so they will positioned for as little disruption as possible in resuming operations.”\nAs part of the offering, GaMEP will leverage its expertise and resources at Georgia Tech, as well as its local, state, and federal economic development partners, including the Technical College System of Georgia and the MEP network, among other organizations, Cheeks said. Pooling resources at all levels ensures maximum impact for the affected companies and communities, he added.\nThe MDAP initiative will include assessments of the manufacturers’ needs, helping prioritize opportunities for sustainability and growth. It also will incorporate the development of pre and post-natural disaster protocols that address challenges manufacturers will face following hurricanes and other natural disasters, such as supply chain and infrastructure disruption, labor displacement, and financial constraints.\n“We’re taking a 360-degree approach with this effort,” Cheeks said. “It’s designed to help position our coastal manufacturers proactively and ahead of the likely after-effects we will see in future storms that will affect the Georgia Coast.”\nEligible manufacturers are encouraged to email Ben Cheeks, GaMEP’s coastal region manager at\nben.cheeks@innovate.gatech.edu .\nAdditional Images\nRelated links\nGeorgia Manufacturing Extension Partnership\nContact\nFor media inquiries, contact:\nPéralte C. Paul\n404.894.8727\nperalte.paul@comm.gatech.edu\nFor information about GaMEP, contact:\nBen Cheeks\n912.571.1902\nben.cheeks@innovate.gatech.edu\nEmail\nperalte.paul@comm.gatech.edu\nAdditional information\nAbout the Georgia Manufacturing Extension Partnership (GaMEP):\nThe Georgia Manufacturing Extension Partnership (GaMEP) is an economic development program of the Enterprise Innovation Institute at the Georgia Institute of Technology. The GaMEP is a member of the National MEP network supported by the National Institute of Standards and Technology. With offices in 10 regions across the state, the GaMEP has been serving Georgia manufacturers since 1960. It offers a solution-based approach to manufacturers through coaching and education designed to increase top-line growth and reduce bottom-line cost. For more information, please visit\ngamep.org .\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}