{"text": "How the Pandemic is Shaping U.S. Security Policy | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nHow the Pandemic is Shaping U.S. Security Policy\nIn the wake of the pandemic, the U.S. is changing its national security policy.\nFacebook\nTwitter\nEmail\nNov 07, 2023\nThe Covid-19 pandemic was one of the most serious crises since the end of World War II, taking a staggering human and economic toll across the planet. As the world gets up again, groggily, like a punch-drunk fighter, it’s become increasingly clear that this coronavirus changed everything in our society. And it’s forcing leadership to consider new and evolving paths forward.\nIn the U.S., one of the more challenging and complicated post-pandemic deliberations is around national security and how to respond to the next infectious disease run amok. Georgia Institute of Technology researcher Margaret Kosal addresses the issue in her study,\n“How Covid-19 is Reshaping U.S. National Security Policy,”\npublished recently in the journal\nPolitics and the Life Sciences .\nThe study was inspired, in part, by Kosal’s participation in National Academy of Sciences (NAS) committees focused on reducing bioterrorism and chemical terrorism.\n“My work with NAS prompted me to think about how we are designing our strategies and what is driving these choices,” said Kosal, associate professor in the\nSam Nunn School of International Affairs\nwithin the\nIvan Allen College of Liberal Arts .\nIn the wake of the pandemic, the U.S. is actively changing part of its national security enterprise. Kosal researched Department of Defense documents, among other sources, and noted that recent trends are moving policy in a different direction. Directing the national response to infectious disease is a task that has moved from public health into the domain of national security.\nIt’s a process called securitization. And based on Kosal’s findings, the current trend, “turns the securitization debate on its head.” That is, instead of treating an emerging infectious disease, like Covid-19, as a national security problem, there has been a noticeable shift to treat biological weapons and bioterrorism as a public health problem.\nIt’s not quite the “public healthization” of biodefense programs, according to Kosal, “but rather, it is an intermingling of the two, especially in the context of critical aspects of politics and warfare.”\nAnd that presents a potentially confusing problem for national defense and security where clarity and specificity are most important. The use of biological weapons, or an act of bioterrorism, “are fundamentally political decisions, choices of warfare,” Kosal said. “But a disease is not something that depends on political will, and it isn’t influenced by power.”\nAn emerging infectious disease like Covid-19 is clearly a public health issue and should be treated as such, falling under the purview of the National Institutes of Health or Centers for Disease Control, she added, then emphasized, “but biological weapons and bioterrorism should not be treated like infectious diseases. They are different in very important ways.”\nThe Danger of Bad Information\nComplicating any national security discussion, according to Kosal, are misinformation and disinformation, and the resultant erosion of confidence in institutions, “including but not limited to governments,” she wrote. “ This is a missing aspect of the current discussions about\nU.S. policies to reduce biological threats, whether from states or terrorists, in the wake of the Covid-19 pandemic.”\nThe pandemic revealed a significant weakness in governments’ ability to adequately address the problem of misinformation and disinformation, a failure that manifested in conspiracy theories and the flouting of public health recommendations.\nKosal cited numerous articles and studies that demonstrate how a global crisis opened the door to distortion of the facts, as extremist groups worked to leverage fears and anxieties, usually to broaden the appeal of their own narratives. Some of the more radical included: an al-Qaeda faction that claimed Covid, “is a hidden soldier sent by God to fight his enemies; a leader of Boko Haram faction who told followers the pandemic was, “divine punishment for the world.”\nKosal observed, too, that economic hardships and other impacts of the pandemic have made it easier for extremist groups to exploit the fragility of weak governments, while gaining followers and resources, and putting a halt to peace-building efforts in some regions. Technology, like the content-generating algorithms used in social media, has helped spread wrong information, too.\n“The misinformation and disinformation problem is serious because it leads to this loss of confidence in government,” Kosal said. “That confidence is crucial in the context of disease and in responding to bioterrorism.”\nUltimately, she hopes her study will have an impact on defense policymakers who are helping to form and clarify our nation’s security plans.\n“I’d really like to see more recognition of the political piece,” she said. “It’s critically important for our counter proliferation efforts and for our efforts to reduce the threat of these weapons more broadly.”\nPlacing extremist ideologies and manufactured weapons in a public health context, she argued, lessens the emphasis on the political will and the importance of the relevant strategic choices necessary to address a potential conflict.\nAnd the nature of conflict, she said, “is all about people and power. Diseases don’t care really care about those things.”\nAdditional Images\nContact\nWriter:\nJerry Grillo\nEmail\njerry.grillo@ibb.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}