{"text": "Metabolic Profiles Distinguish Early Stage Ovarian Cancer with Unprecedented Accuracy | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMetabolic Profiles Distinguish Early Stage Ovarian Cancer with Unprecedented Accuracy\nA new study has produced a set of biomarkers that may enable development of an accurate ovarian cancer screening test.\nFacebook\nTwitter\nEmail\nGeorgia Tech research scientist David Gaul places samples into an ultra-performance liquid chromatography-mass spectrometry (UPLC-MS) instrument for testing. The UPLC-MS technique was used to help identify 16 metabolites associated with early-stage ovarian cancer. The work, utilizing serum samples, could lead to an accurate screening test for the disease.\nNov 17, 2015\n— Atlanta, GA\nStudying blood serum compounds of different molecular weights has led scientists to a set of biomarkers that may enable development of a highly accurate screening test for early-stage ovarian cancer. Using advanced liquid chromatography and mass spectrometry techniques coupled with machine learning computer algorithms, researchers have identified 16 metabolite compounds that provided unprecedented accuracy in distinguishing 46 women with early-stage ovarian cancer from a control group of 49 women who did not have the disease. Blood samples for the study were collected from a broad geographic area – Canada, Philadelphia and Atlanta. While the set of biomarkers reported in this study are the most accurate reported thus far for early-stage ovarian cancer, more extensive testing across a larger population will be needed to determine if the high diagnostic accuracy will be maintained across a larger group of women representing a diversity of ethnic and racial groups. The research was reported November 17 in the journal\nScientific Reports , an open access journal from the publishers of\nNature . “This work provides a proof of concept that using an integrated approach combining analytical chemistry and learning algorithms may be a way to identify optimal diagnostic features,” said\nJohn McDonald , a professor in the\nSchool of Biolog y at the Georgia Institute of Technology and director of its Integrated Cancer Research Center. “We think our results show great promise and we plan to further validate our findings across much larger samples.” Ovarian cancer has been difficult to treat because it typically is not diagnosed until after it has metastasized to other areas of the body. Researchers have been seeking a routine screening test that could diagnose the disease in stage one or stage two – when the cancer is confined to the ovaries. Working with three cancer treatment centers in the U.S. and Canada, the Georgia Tech researchers obtained blood samples from women with stage one and stage two ovarian cancer. They separated out the serum, which contains proteins and metabolites – molecules produced by enzymatic reactions in the body. The serum samples were analyzed by ultra-performance liquid chromatography-mass spectrometry (UPLC-MS), which is two instruments joined together to better separate samples into their individual components. Heavier molecules are separated from lighter molecules, and the molecular signatures are determined with enough accuracy to identify the specific compounds. The Georgia Tech researchers decided to look only at the metabolites in their research. “People have been looking at proteins for diagnosis of ovarian cancer for a couple of decades, and the results have not been very impressive,” said\nFacundo Fernández , a professor in Georgia Tech’s\nSchool of Chemistry and Biochemistry\nwho led the analytical chemistry part of the research. “We decided to look in a different place for molecules that could potentially provide diagnostic capabilities. It’s one of the places that people had really not studied before.” Samples from each of the 46 cancer patients were divided so they could be analyzed in duplicate. The researchers also looked at serum samples from 49 women who did not have cancer. The work required eliminating unrelated compounds such as caffeine, and molecules that were not present in all the cancer patients. “We used really high resolution equipment and instrumentation to be able to separate most of the components of the samples,” Fernández explained. “Otherwise, detection of early-stage ovarian cancer is very difficult because you have a lot of confounding factors.” The chemical work identified about a thousand candidate compounds. That number was reduced to about 255 through the work of research scientist David Gaul, who removed duplicates and unrelated molecules from the collection. These 255 compounds were then analyzed by a learning algorithm which evaluated the predictive value of each one. Molecules that did not contribute to the predictive accuracy of the screening were eliminated. Ultimately, the algorithm produced a list of 16 molecules that together differentiated cancer patients with extremely high accuracy – greater than 90 percent. “The algorithm looks at the metabolic features and correlates them with whether the samples were from cancer or control patients,” McDonald explained. “The algorithm has no idea what these compounds are. It is simply looking for the combination of molecules that provides the optimal predictive accuracy. What is encouraging is that many of the diagnostic features identified are metabolites that have been previously implicated in ovarian cancer.” As a next step, McDonald and Fernández would like to study samples from a larger population that includes significant numbers of different ethnic and racial groups. Those individuals may have different metabolites that could serve as biomarkers for ovarian cancer. Though sophisticated laboratory equipment was required to identify the 16 molecules, a screening test would not require the same level of sophistication, Fernández said. “Once you know what these molecules are, the next step would be to set up a clinical assay,” he said. “Mass spectrometry is a common tool in this field. We could use a clinical mass spectrometer to look at only the molecules we are interested in. Moving this to a clinical assay would take work, but I don’t see any technical barriers to doing it.” The Fernández and McDonald groups have used a similar approach with prostate cancer and plan to explore its utility for detecting other types of cancer. The research was supported by grants from The Laura Crandall Brown Ovarian Cancer Foundation, The Ovarian Cancer Research Fund, The Ovarian Cancer Institute, Northside Hospital (Atlanta), The Robinson Family Fund, and the Deborah Nash Endowment Fund. CITATION : David A. Gaul, et al., “Highly-accurate metabolomics detection of early-stage ovarian cancer,” (Scientific Reports, 2015).\nhttp://www.dx.doi.org/10.1038/srep16351 Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contact : John Toon ( jtoon@gatech.edu ) (404-894-6986). Writer : John Toon\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}