{"text": "The Pursuit of Happiness | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nThe Pursuit of Happiness\nA couple of Georgia Tech courses are in pursuit of happiness. One is offered by the School of Psychology.\nFacebook\nTwitter\nEmail\nIrene Daboin teaches Psychology and the Pursuit of Happiness\nAug 05, 2019\n— Atlanta, GA\nEDITOR'S NOTE: This story by Victor Rogers was published originally on\nJuly 19, 2019, in the Georgia Tech News Center .  It has been slightly revised for the College of Sciences' website.\nA couple of Georgia Tech courses are in pursuit of happiness. The newest course was inspired by a\nNew York Times\nstory in spring 2018 about Yale University’s most popular class — a class on happiness.\n“After reading the article I thought, ‘This is something our school needs,’” said Irene Daboin, coordinator of Georgia Tech Counseling Center’s Peer Coaching Program and the instructor for PSYC 2803: Psychology and the Pursuit of Happiness. “Working in the Counseling Center, I get to see first-hand the things that students are struggling with and the stress on campus.”\nDaboin had been looking for a way to promote a healthy campus culture through a wider lens. So, she talked to John Stein, vice president of Student Life and the Brandt-Fritz Dean of Students, who had read the same article and was also thinking about a happiness course at Tech. He suggested that Daboin collaborate with the School of Psychology to figure out how to make it work.\n“It took us a little while,” Daboin said, referring to a couple of failed attempts to offer the class. “We were hoping for a certain number of students to enroll and didn’t get enough. This year we decided to focus less on the number of students, and instead just get the class going.”\nThe class, offered for the first time this summer, has 10 students.\n“It’s a very intimate class, which is great,” said Daboin, who has a Ph.D. in clinical and community psychology from Georgia State University and is a licensed psychologist. “It lends itself to discussion and a more in-depth way of talking about issues and applying it on a personal level. The class is sort of our pilot to see if this is something the students like and if we can do it on a larger scale in fall and spring.”\nThe class is designed to teach students scientifically-validated strategies for living a healthier, happier, and more satisfying life at Georgia Tech and beyond. Students explore psychological concepts related to mental health and well-being and learn to apply the concepts to better manage their own stress and improve their habits, which will lead to more fulfilling lives.\nThe class begins and ends by measuring the students’ happiness. It also measures the students’ psychological wealth, including their satisfaction with life and their emotional wellbeing. Students also must envision their best possible self, identify their personal strengths and values, do acts of kindness, and keep a gratitude journal.\nDaboin wants students who have taken the class to become wellness ambassadors by sharing strategies they have learned, and promoting a healthier campus culture.\n“It’s exciting to see students immediately connecting the lessons learned in class to their personal lives,” said Daboin, who thought she would have to sell the class every step of the way.\n“But it’s hitting home,” she said. “If these students can walk out of this class leading healthier lives and their psychological well-being improves, then hopefully it will be a little contagious.”\nMore Happiness\nChris Martin, a postdoctoral fellow in the Wallace H. Coulter Department of Biomedical Engineering, taught a happiness course at Emory University and brought it with him to Tech in 2018.\nHe teaches BME 2803 Special Topics: Happiness. The class was created by Emory sociology professor Corey Keyes, and Martin taught it for three sessions while earning a Ph.D. in sociology at Emory. Martin taught the course at Tech last fall and spring, and his third session will be this fall.\nThe class covers three big themes: maximizing pleasure and minimizing pain; the meaning of life; and coping with suffering.\nThe course explores various theories of happiness, such as how money does or does not help one’s level of happiness.\n“In the modern world, we have too many choices and that tends to inhibit happiness,” he said. “Making the choice is burdensome. You think about all of the things you didn’t choose. And, you feel like you lost out on all of the things you didn’t choose because of what you chose.”\nMartin said there is an underlying idea that one’s circumstances are the result of their choices. And part of a person’s level of happiness is tied to expectations.\n“Happiness can sometimes be elusive because we think a possession or purchase will make us happy for months, but it only makes us happy for a few days,” he said. “This is called the hedonic treadmill; you experience some pleasure and some pain, but you end up pretty much in the same place.”\nThe two things that seem to help sustain happiness are variety and appreciation. If there is variety in what you purchase, that will help. Also, take time to consciously appreciate what you bought.\n“Otherwise, once you purchase something ‘nice’ your aspiration level goes up,” Martin said. “So, you have to keep purchasing things that are significantly more expensive than the last thing you purchased, which is impossible.”\nThis fall, there will be two sections of Martin’s happiness course: a regular section and one for the  Honors Program. The regular class is housed in BME but is open to all undergraduates. Most students who take the class are engineering majors who have an interest in the humanities. About 25 students usually enroll.\nThe curriculum covers a discussion of happiness, the hedonic treadmill and if it is realistic (for the students) to increase happiness, and students’ idea of a good relationship. The final paper is on what they have learned from the class and also what they have learned about life overall. The class also talks about character strengths, careers, and relationships.\n“The students enjoy having discussions,” Martin said. “The assignments are reflections, so I get to know each student’s unique personality. I get to hear stories about their lives, and it’s quite an honor.”\nNOTE: Students may register for BME 2803 Special Topics: Happiness. Students interested in PSYC 2803: Psychology and the Pursuit of Happiness should check the course catalog to see if the course will be offered this fall.\nAdditional Images\nContact\nVictor Rogers\nInstitute Communications\nEmail\nvictor.rogers@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}