{"text": "Platinum-Graphene Atomically-thin Fuel Cell Catalysts Show Superior Stability Over Bulk Platinum | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nPlatinum-Graphene Atomically-thin Fuel Cell Catalysts Show Superior Stability Over Bulk Platinum\nFilms of platinum only two atoms thick supported by graphene could enable fuel cell catalysts with unprecedented catalytic activity and longevity, according to a study published recently by researchers at the Georgia Institute of Technology.\nFacebook\nTwitter\nEmail\nSeung Soon Jang, an associate professor, Faisal Alamgir, an associate professor, and Ji Il Choi, a postdoctoral researcher, all in Georgia Tech’s School of Materials Science and Engineering, examine a piece of platinum-graphene catalyst. (Credit: Allison Carter)\nSep 18, 2019\n— Atlanta, GA\nFilms of platinum only two atoms thick supported by graphene could enable fuel cell catalysts with unprecedented catalytic activity and longevity, according to a study published recently by researchers at the Georgia Institute of Technology.\nPlatinum is one of the most commonly used catalysts for fuel cells because of how effectively it enables the oxidation reduction reaction at the center of the technology. But its high cost has spurred research efforts to find ways to use smaller amounts of it while maintaining the same catalytic activity.\n“There’s always going to be an initial cost for producing a fuel cell with platinum catalysts, and it’s important to keep that cost as low as possible,” said Faisal Alamgir, an associate professor in Georgia Tech’s School of Materials Science and Engineering. “But the real cost of a fuel cell system is calculated by how long that system lasts, and this is a question of durability.\n“Recently there’s been a push to use catalytic systems without platinum, but the problem is that there hasn’t been a system proposed so far that simultaneously matches the catalytic activity and the durability of platinum,” Alamgir said.\nThe Georgia Tech researchers tried a different strategy. In the study, which was published on September 18 in the journal  Advanced Functional Materials\nand supported by the National Science Foundation, they describe creating several systems that used atomically-thin films of platinum supported by a layer of graphene – effectively maximizing the total surface area of the platinum available for catalytic reactions and using a much smaller amount of the precious metal.\nMost platinum-based catalytic systems use nanoparticles of the metal chemically bonded to a support surface, where surface atoms of the particles do most of the catalytic work, and the catalytic potential of the atoms beneath the surface is never utilized as fully as the surface atoms, if at all.\nAdditionally, the researchers showed that the new platinum films that are at least two atoms thick outperformed nanoparticle platinum in the dissociation energy, which is a measure of the energy cost of dislodging a surface platinum atom. That measurement suggests those films could make potentially longer-lasting catalytic systems.\nTo prepare the atomically-thin films, the researchers used a process called electrochemical atomic layer deposition to grow platinum monolayers on a layer of graphene, creating samples that had one, two or three atomic layers of atoms. The researchers then tested the samples for dissociation energy and compared the results to the energy of a single atom of platinum on graphene as well as the energy from a common configurations of platinum nanoparticles used in catalysts.\n“The fundamental question at the heart of this work was whether it was possible that a combination of metallic and covalent bonding can render the platinum atoms in a platinum-graphene combination more stable than their counterparts in bulk platinum used commonly in catalysts that are supported by metallic bonding,” said Seung Soon Jang, an associate professor in the School of Materials Science and Engineering.\nThe researchers found that the bond between neighboring platinum atoms in the film essentially combines forces with the bond between the film and the graphene layer to provide reinforcement across the system. That was especially true in the platinum film that was two atoms thick.\n“Typically metallic films below a certain thickness are not stable because the bonds between them are not directional, and they tend to roll over each other and conglomerate to form a particle,” Alamgir said. “But that’s not true with graphene, which is stable in a two-dimensional form, even one atom thick, because it has very strong covalent directional bonds between its neighboring atoms. So this new catalytic system could leverage the directional bonding of the graphene to support an atomically-thin film of platinum.”\nFuture research will involve further testing of how the films behave in a catalytic environment. The researchers found in earlier research on graphene-platinum films that the material behaves similarly in catalytic reactions regardless of which side – graphene or platinum – is the exposed active surface.\n“In this configuration, the graphene is not acting as a separate entity from the platinum,” Alamgir said. “They’re working together as one. So we believe that if you’re exposing the graphene side, you get the same catalytic activity and you could further protect the platinum, potentially further enhancing durability.”\nThis research was supported by the National Science Foundation (NSF) under grant Nos. 1103827 and 106913. The content is solely the responsibility of the authors and does not necessarily represent the official views of the sponsoring organizations.\nCITATION :  Ji Il Choi, Ali Abdelhafiz, Parker Buntin, Adam Vitale, Alex Robertson, Jamie Warner, Seung Soon Jang and Faisal M. Alamgir, “Contiguous and Atomically-Thin Pt Film with Supra-bulk Behavior Through Graphene-Imposed Epitaxy,” (Advanced Functional Materials, September 2019). http://dx.doi.org/10.1002/adfm.201902274\nAdditional Images\nContact\nJohn Toon\nResearch News\nEmail\njohn.toon@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}