{"text": "Three ISyE Researchers Receive 2016 Golden Goose Award for the Honey Bee Algorithm | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nThree ISyE Researchers Receive 2016 Golden Goose Award for the Honey Bee Algorithm\nJohn Bartholdi III, Craig Tovey, and John Vande Vate, all researchers who hail from Georgia Tech’s No. 1-ranked Stewart School of Industrial & Systems Engineering (ISyE) – are part of an interdisciplinary team that has been designated as recipients of the\nFacebook\nTwitter\nEmail\nSep 22, 2016\n— Atlanta, GA\nJohn Bartholdi III, Craig Tovey, and John Vande Vate, all researchers who hail from Georgia Tech’s No. 1-ranked Stewart School of Industrial & Systems Engineering (ISyE) – are part of an interdisciplinary team that has been designated as recipients of the 2016\nGolden Goose Award .\nThe Golden Goose Award honors scientists whose federally funded work may have been considered silly, odd, or obscure when first conducted, but has resulted in significant benefits to society.\nAlong with Cornell University professor Thomas Seeley and data scientist Sunil Nakrani (who received his M.S. in computer science in 1998 from Tech and also completed post-doctoral work with Tovey), the team studied honey bee foraging behavior and the development of the\nHoney Bee Algorithm\nto allocate shared webservers to internet traffic. The original honey bee research, funded by the National Science Foundation (NSF) and Office of Naval Research, unexpectedly led to the algorithm that major web-hosting companies now use to streamline internet services and increase revenues in a global market worth more than $50 billion.\n“The bees turned out to be even smarter than we thought,” said Tovey. The team developed a model for how the colonies’ decentralized foraging system works, which Tovey and Nakrani adapted over a decade later to develop the Honey Bee Algorithm for allocating shared web hosting servers to variable internet traffic. Their algorithm beats the competition by up to 20 percent in revenue generation for the web hosts and ensures servers are serving the applications internet clients need, when they need them.\nThe team is being cited for their curiosity-driven research on how honey bee foragers are able to maximize nectar collection in ever-changing environments.\n“The ISyE faculty members who were recently presented with the Golden Goose Award deserve this recognition for not only their research, but for their vision and commitment to connect science with societal needs,” said Gary S. May, dean of Georgia Tech’s College of Engineering and Southern Company Chair. “It reaffirms the fact that engineers are creative problem-solvers who have the ingenuity to develop solutions. The impact of the Honey Bee Algorithm will increase as internet use continues to climb worldwide.”\nBartholdi, Tovey, and Vande Vate were inspired to study honey bee foraging after Vande Vate heard Seeley describing his own honey bee research on National Public Radio. “I wonder if the bees would do any better if they hired us as consultants?” Vande Vate mused to his colleagues after hearing the program. The tongue-in-cheek question led to a years-long examination of the honey bees’ decentralized foraging patterns from a systems engineering perspective.\nToday, major web-hosting companies are using Tovey and Nakrani’s Honey Bee Algorithm and other similar biologically-inspired methods to boost revenues and more efficiently allocate their servers. Every internet user benefits when servers are ready in the right place and in the shortest time.\n“The internet is one of mankind’s greatest accomplishments, and these scientists studied one of the smallest parts of nature to make it better,” said Rep. Jim Cooper (D-TN), who had the original idea to create the Golden Goose Award. “Their ingenuity is the kind of talent that makes America’s scientific and research community the best in the world.”\nAll five researchers who worked on the honey bee project -- Bartholdi, Nakrani, Seeley, Tovey, and Vande Vate -- accepted the award in a ceremony held at the Library of Congress in Washington, D.C. on September 22, 2016, with about 500 people in attendance. The ceremony included speeches by several congressional representatives, as well as the president of the American Association for the Advancement of Science, Geraldine L. Richmond. Official congratulations were read into the Congressional Record.\nAbout the ISyE Recipients of the Golden Goose Award\nJohn Bartholdi III\nis the Manhattan Associates/Dabbiere Chair in ISyE and the co-executive director of the Georgia Tech Panama Logistics Innovation & Research Center in Panama. Bartholdi teaches supply chain issues, primarily warehousing, at both the undergraduate and graduate levels and in SCL's professional education program. His research centers on problems in warehousing and distribution, but he reserves some time to pursue wider-ranging interests, including mechanics, politics, computer science, geography, and biology. He was named a Presidential Young Investigator by the NSF for 1984-1989.\nHis research work has been supported by the Defense Logistics Agency, the Office of Naval Research, and the Air Force Office of Scientific Research, among others.\nCraig Tovey\nis a professor and Stewart Faculty Fellow in ISyE with a courtesy appointment in the College of Computing at Tech. He also co-directs CBID, the Georgia Tech Center for Biologically Inspired Design\nTovey's principal research and teaching activities are in operations research and its interdisciplinary applications to social and natural systems, with emphasis on sustainability, the environment, and energy. His current research concerns inverse optimization for electric grid management, classical and biomimetic algorithms for robots and webhosting, the behavior of animal groups, sustainability measurement, and political polarization.\nHe received a Presidential Young Investigator Award from the NSF in 1985 and the 1989 Jacob Wolfowitz Prize for research in heuristics. He was granted a Senior Research Associateship from the National Research Council in 1990, was named an Institute Fellow at Georgia Tech in 1994, and received the Georgia Tech Class of 1934 Outstanding Interdisciplinary Activity Award in 2011.\nJohn Vande Vate , a professor in ISyE, is the founder and executive director of Georgia Tech's Executive Master's in International Logistics and Supply Chain Strategy (EMIL-SCS) program. He held visiting professor positions at MIT Sloan School of Management, Carnegie Mellon Tepper School of Business, and the University of Pittsburgh’s Department of Economics, among others.\nDuring the past 30 years, he has consulted for a variety of companies on a range of management science applications. His research has been published in\nEconometrica ,\nMathematics of Operations Research ,\nOperations Research ,\nMathematical Programming ,\nQuesta ,\nJournal of Theoretical Biology ,\nMechanics of Structures and Machines , and other established journals.\nVande Vate served on the board of the Supply Chain Council as the global treasurer and was named among Supply & Demand Chain Executive's Pros to Know in 2006.\nAdditional Images\nContact\nShelley Wunder-Smith\nStewart School of Industrial & Systems Engineering\n404.385.4645\nEmail\nshelley.wunder-smith@isye.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}