{"text": "April Survey of Faculty and Staff to Assess Campus Culture | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nApril Survey of Faculty and Staff to Assess Campus Culture\nSurvey input from faculty and staff will help identify the areas within our culture where we are succeeding and where we can improve.\nFacebook\nTwitter\nEmail\nLOVE GT\nApr 05, 2023\nBeginning April 11, the Institute will once again deploy the Georgia Tech Culture Survey to allow faculty and staff to share their experiences, and will use the results to gather comparative insights about whether, and how, Tech’s culture has changed during the past year. The survey will take no more than 10 to 15 minutes, and all responses will remain anonymous. It will be accessible until the close of business on Friday, April 28.\n“I encourage all faculty and staff to complete the survey to ensure that their voices are heard. The results of the survey will be used to shape our actions and priorities for the 2023-2024 academic year,” said Frank Neville, senior vice president for Strategic Initiatives and chief of staff.\nResults from last year’s survey were used to identify priority actions for Tech’s cultural strengthening initiative, also known as L.O.V.E. GT, which seeks to ensure that\nGeorgia Tech values\nare at the heart of our organizational culture and are reflected in how we deliver on our mission, pursue our vision, and achieve our goals.\nL.O.V.E. GT operates in three dimensions: leadership, engagement, and systems. The leadership component seeks to train and equip leaders to “lead by example” in living our values every day. The engagement effort is focused on communication and connecting values to the fabric of our daily work. The systems dimension works to ensure that internal policies, practices, and procedures reflect Georgia Tech’s values.\nProgress Across the Institute\nActions taken over the past year include:\nLeadership\nLeadership 360 Feedback and Development — We have rolled out a 360 assessment for Institute leaders to receive feedback from institutional peers, direct reports, supervisors, and others while also completing a self-evaluation to understand what leadership practices are working well and potential areas of growth.\nInternal Coaching Cadre — We have expanded access to coaching services by building capacity through training Georgia Tech staff and contracting with external vendors.\nLeadership Competency Model — We have defined the competencies expected of leaders as we rely on them to model our values and practice them consistently.\nWorkshops — More than 100 leaders engaged in workshops (Psychological Safety and Leading Congruently) that provided tools and strategies to align their own practices and behaviors with the Institute’s values.\nEngagement\nGeorgia Tech Culture Survey and Action Planning - We assessed the experience of students, faculty, and staff through the inaugural survey and actively engaged several units in action planning efforts to improve culture.\nCulture Councils — Five Staff Culture Advisory Councils were created across the administrative, research, and academic units in order to promote healthy and productive cultures.\nGT Cares Week — We launched the first-ever “L.O.V.E. GT Day” during the inaugural GT Cares Week, engaging more than 600 faculty, staff, and students in celebration of our values.\nEmployer Branding — A new social media campaign has been launched, featuring testimonials and videos to amplify Georgia Tech’s brand as an employer of choice.\nSystems\nPerformance Management — We have revised the performance management process to make the values a prominent part of every step: self-assessments, performance feedback, and goal setting.\nOnboarding — We have embedded the new leadership competency model into the recruiting and orientation processes for leadership roles.\nPresident’s Goals — The President’s FY23 goals include 11 items specific to improving our culture.\nRecognition — We have begun to integrate the Institute values into recognition and awards.\nWhat Is Next?\nIn addition to the Georgia Tech Culture Survey, here are a few of the key actions planned for L.O.V.E. GT in the coming months:\nIncorporate the newly developed Georgia Tech leadership competencies into next year’s performance management cycle.\nContinue to celebrate and recognize our community through the annual staff and faculty awards, peer-to-peer recognition, and GT Cares Week.\nDeploy a toolkit to equip the community with resources to understand, recognize, and identify how Georgia Tech’s values can be implemented into daily practices and behaviors.\nMore broadly, faculty and staff are actively working to improve their culture in numerous efforts. To nurture community well-being, some leaders are participating in, and encouraging employees to attend, campus wellness events, workshops, and programs to improve holistic well-being. Some teams are working to improve employee well-being by increasing internal communication and fostering team development.\n“Our culture is what we make of it. Through the strategic planning process as a community we identified the values that we embraced and to which we aspired. It’s now up to all of us to be active participants in shaping our culture by striving to Live Our Values Every Day,” said Neville.\nTo learn more or become involved in L.O.V.E. GT, contact\nByron Fitch ( byron.fitch@consulting.gatech.edu ) or Kendra Lewis-Strickland (klewis-strickland@consulting.gatech.edu).\nAdditional Images\nRelated links\nGeorgia Tech Values\nContact\nVictor Rogers\nInstitute Communications\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}