{"text": "Teaching Leadership Skills to Engineers and Scientists | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nTeaching Leadership Skills to Engineers and Scientists\nDennis Hess helps prepare engineers and scientists with the skills required for leadership roles, and he recently published a book on the subject.\nFacebook\nTwitter\nEmail\nDennis Hess photo\nJul 31, 2018\n— Atlanta, GA\nDennis Hess wants to help prepare engineers and scientists with the skills required for leadership roles. So, not only has he developed a leadership course for chemical engineering majors, he also recently published his first book on the subject.\n“The whole effort on leadership was an outgrowth of one of our required courses in chemical engineering,” said Hess, professor and Thomas C. DeLoach, Jr. chair, in the School of Chemical and Biomolecular Engineering.\nChemical engineering seniors must take a course in chemical and process safety (CHBE 4515).  About 15 years ago, Hess began teaching the course, which had been offered for about six years before he started teaching it. After teaching the course for one semester, he decided to incorporate some exercises on ethics, professionalism, and decision-making.\n“When you make decisions in a chemical process — or any process — you’re looking at cost, profits, safety, ethics, and all the interactions of these different things. And, of course, there isn’t a clean answer,” Hess said. “You’re optimizing, trying to get the best situation. I found that students had very little insight into how to think about that. They knew how to make good decisions if they based it on technical information. But when you take other things into account — the ethical and behavioral questions — this is what a leader deals with all of the time.”\nFour years ago, Hess wondered if students could benefit from having some background in leadership as viewed through their technical background and mindset. He reflected on his time as a leader and how he, as a technical person, interacted with non-technical people and dealt with biases, values, priorities, and beliefs of individuals.\n“I realized that I think about things in a certain way. I interact mostly with technical people, and with very few people outside [the technical field]. The biggest issues you encounter are soft-skill issues,” he said.\nSo, Hess approached David Sholl, the department chair, with an idea to teach a course focusing on the problems that leaders face early in their career. He could not find many books or articles that dealt with early career leadership issues.\n“Leadership books are usually written by MBAs because they are frequently the people in high-level leadership positions,” he said. “And, people in those positions deal with somewhat different types of problems than the ones you deal with early in your career.”\nHe likes a particular quote that sums up the situation nicely: \"Good judgment is the result of experience, and experience is the result of bad judgment.\"\nHess says, “That is how we learn. It’s instructive, but it’s a slow process because you aren’t going to make all of the mistakes within a reasonable time frame.”\nIn class, Hess likes to present scenarios and then ask students to make decisions or suggest approaches to dilemmas based on that information. For example, he asks them to imagine they are the project leader in charge of putting a team together. There is a person who is among the most talented in the field, but he is rude, arrogant, impatient, and people quit the team when they have to work with him. Should you put him on the team? What are the consequences of putting him on the team or not putting him on the team? If you put him on the team, how do you manage that?\n“There is no good, hard answer,” Hess said. “And, that drives technical people up the wall! They want to know the answer. There is no right answer to most of these situations. You figure out the best thing to do given all of your constraints, analogous to solving design problems, but with people difficulties added to the mix.”\nOne of the points he makes is that the same leadership dilemma can exist in two different organizations or teams, but the best approach may be different. That’s because the people, personalities, cultures, and time frames are different.\n“I don’t claim that the course will take care of these problems,” he said. “What it is intended to do is build awareness that these kinds of situations exist and to discuss ways to think about addressing such issues.”\nHis advice to students is: Don’t get frustrated. Use your technical skills — organization, critical thinking, and creative problem-solving — to solve the people issues.\nThe class is offered to graduate students in the fall and to undergraduates in the spring. So far, the course has been available only to chemical engineering students. After his second time teaching the course, Hess decided to turn his class notes and slides into his first book. The title is\nLeadership by Engineers and Scientists: Professional Skills Needed to Succeed in a Changing World , and it was published in April by the American Institute of Chemical Engineers in association with Wiley.\nThe book is brief by design, fewer than 250 pages, with lots of references for more information. It is written as a textbook, with homework questions as well as many discussion questions and scenarios, and ways to think about some of the situations. Hess will use the book in his class this fall, but he said the book also will be useful for others.\n“Anyone who is considering or has recently been placed in a leadership position should benefit from the perspective offered in this book,” he said. “If you aren’t in a formal leadership position, it will help you to understand what your manager is going through. And, this should help you become a better employee.”\nAdditional Images\nContact\nVictor Rogers\nInstitute Communications\nEmail\nvictor.rogers@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}