{"text": "It's My Turn | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nIt's My Turn\nTwo staff members who are usually behind the scenes are taking their turn in the spotlight as they earn Tech degrees.\nFacebook\nTwitter\nEmail\nGrace Wyner is graduating with a bachelor's degree in literature, media, and communication. She is pictured at her last home football game with her boyfriend, Ben Goldenthal.\nMay 06, 2021\n— Atlanta, GA\nAs staff members in Institute Communications, Grace Wyner and Steven Norris are usually the ones asking questions. But now the tables have been turned. Wyner, a student worker, and Norris, director of Media Relations and Social Media, are in the spotlight as they earn Tech degrees.\nWyner is graduating with a bachelor’s degree in literature, media, and communication with a minor in public policy. She has been a writer in Institute Communications since January 2019, covering campus events for the\nDaily Digest\nand\nThe Whistle.\n“I never anticipated a student job would be like this,” Wyner said. “I was very connected to everything that was happening on campus. And I got to express it in different ways, either through writing a story or just entering an event into the campus calendar.”\nWyner said that at times she felt like she was an encyclopedia of campus news and upcoming events. She also gained insights into what makes people tick.\n“I realized how much people like to talk about what they’re doing and how willing they are to talk about something that they enjoy and want to share with other people,” she said. “If they’re passionate about it, it comes shining through.”\nLast year the pandemic shaped Wyner’s outlook on life.\n“I went through a lot of ‘lasts’ without realizing they were my lasts — looking at you, game days,” said Wyner, who played trombone in the Georgia Tech Yellow Jacket Marching Band. “I had just joined the campus band sorority, Tau Beta Sigma, when Covid-19 hit, and I took on a committee chair role in the SGA in the fall. It’s been hard to push aside the ‘You’ll never get the true experience’ thoughts. On the bright side, I realized just how nice exercise endorphins are and I am now in what’s arguably the best shape of my life.” She played basketball at home and worked out at the Campus Recreation Center.\nThe pandemic also changed Wyner’s job as a writer and affected her internship plans.\n“For a while there weren’t any campus events or really anything to write about, but everything started to pick up again,” she recalled. Her summer internship was canceled because of Covid-19.\n“I’m taking my internship again this summer, to give myself a little more time to find a job,” she said. She will work online from Atlanta for Global Strategy Group, a public affairs firm in Washington, D.C. Ultimately she would like to work in public affairs or maybe for a political campaign.\nTo celebrate her graduation, Wyner will be joined by her parents, her grandfather and his significant other, her boyfriend, and her brother, who is graduating from high school this month.\nCommencement Live and More\nSteven Norris is a familiar face and voice on Georgia Tech’s social media channels. He came to Georgia Tech in December 2012 as director of social media, to start the Institute’s official social media program. He was recently promoted to director of media relations and social media.\n“I get to tell the stories of Georgia Tech through media outlets such as CNN and\nThe Wall Street Journal . And through social media I help prospective students learn about the Institute and remind our alumni of why they came here,” Norris said.\nHe and the social media team often host live chats on Facebook during key events such as Homecoming, move-in day, and New Student Convocation. He was an integral member of the team that created “Commencement Live,” a pre-Commencement show that combines video stories with live interviews of the graduates.\n“Commencement is special,” he said. “Before the ceremony there is a captive audience of family and friends anxiously waiting for ‘Pomp and Circumstance’ to play.” Norris and his colleagues introduced “Commencement Live” to entertain and inform the audience and to celebrate the graduates.\nThis year he will pull double duty at Commencement. In addition to working, he is also marching in the ceremony because he is earning a master’s degree in global media and culture.\n“I am so lucky to be in the first cohort of students in the program,” he said. “It’s a blend of media studies and foreign language. I was drawn to the program because I grew up reading atlases and almanacs. I’m a bit of a nerd, so I gravitated toward this.”\nTo get accepted into the program Norris needed to speak another language.\n“I started taking French courses after work,” he said. “I didn’t know any French. But I had to get to a point where I could take master’s level classes completely in French.” In three months he was ready to interview for the program, in French.\nFor his class project he planned to give a presentation at the University of Sydney. But Covid-19 canceled his travel plans, so he decided to create a documentary instead. He directed, produced, and edited an hour-long\ndocumentary on the Eurovision Song Contest , the world’s most-watched live music event, exploring the possibility of the contest expanding to the United States.\nNorris, who has a bachelor’s degree in broadcasting and international relations, worked at television stations in Birmingham, Mobile, and New Orleans before coming to Tech. The graduate program has brought him back to his love of combining media and international relations.\n“I have been working with the U.S. Agency for International Development (USAID), helping them develop media kits,” he said. “I am working in-depth with media analysis and media theory. All of these experiences make me a better employee at Georgia Tech.”\nNorris said his educational journey is, in part, inspired by the memory of his father who died in 2018.\n“I remember him studying late at night to earn his master’s. I remember him typing his papers on a typewriter,” he said. “One of the things he was most proud of was getting his master’s. That inspires me.”\nNorris will be joined at Commencement by his mom, his stepdad, his two brothers, his sister, and his partner, Matt.\nAdditional Images\nContact\nVictor Rogers\nInstitute Communications\nEmail\nvictor.rogers@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}