{"text": "Georgia Tech Partners to Launch MARTA Reach Pilot Program Across Atlanta | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Partners to Launch MARTA Reach Pilot Program Across Atlanta\nNew on-demand program will connect riders to stations\nFacebook\nTwitter\nEmail\nGeorgia Tech and MARTA are partnering on a 6-month pilot of a new on-demand rideshare service, connecting riders in three zones across the region to MARTA bus and rail service. This pilot is meant to test how on-demand shuttles can be used to make it easier and faster for riders to get to and from their destinations using MARTA.\nFeb 28, 2022\n— Atlanta, GA\nGreat solutions often start with a simple idea.\nFor Georgia Tech industrial engineering professor\nPascal Van Hentenryck , it started four years ago: an idea to tackle one of the biggest challenges for America’s eight largest rapid transit systems.\n“One of the big issues is connecting to and from the system. First and last mile,” Van Hentenryck said.\nSo, during the pandemic, Van Hentenryck decided to contact MARTA officials directly, and, with his team of student researchers at Georgia Tech,\nhe developed a system to make MARTA more efficient\nand able to better serve communities that have a vital need for reliable transit.\nThat’s how MARTA Reach was born.\n“We were contacted by Pascal in late 2020 about the possibility of an on-demand network,” said MARTA Interim General Manager and CEO Collie Greenwood.\nVan Hentenryck describes MARTA Reach as an on-demand multimodal transportation solution — smartphones and shuttles outfitted with tablets connected to an app that helps riders find a quick route to their nearest MARTA station. Think ridesharing platforms like Lyft or Uber — except this ride is a flat, low-cost fee. MARTA says this program is meant to work with the city of Atlanta’s existing transportation services and will help minimize waiting and walking, eliminating the inconvenience of users having to walk a mile or more to their nearest MARTA station.\n“Public transit is the most cost-effective way to move people,” said Van Hentenryck ,\nA. Russell Chandler III Chair and Professor in the\nH. Milton Stewart School of Industrial and Systems Engineering .\n“But in Atlanta, some people may face challenges getting to the MARTA station.” Thanks to this new pilot program, they can download the smartphone app and request a ride.\nOn March 1, MARTA and Georgia Tech will begin pilot testing this program in three strategic neighborhoods: West Atlanta, Belvedere Park, and Fort Gillem. Van Hentenryck says there’s never been a piloted on-demand public transit system like this in a major U.S. metropolitan area like Atlanta.\nThe chosen neighborhoods were selected not only because they are lacking in transportation options but because of the different communities they serve. Fort Gillem is an area with a high number of distribution centers with employees who could use more efficient transportation. West Atlanta is highly residential, with roads often too narrow for MARTA’s full-sized buses. And Belvedere Park is a mixed-use neighborhood that combines business and residential zoning.\nDuring the pilot test, folks in these areas can use the MARTA Reach app to call for a shuttle to pick them up and take them to the nearest MARTA transportation hub.\nWhen users call for a pickup, their requests will be routed through a server at Georgia Tech that connects to the drivers on MARTA’s new fleet of Reach vehicles.\n“We developed the cloud computing platform, connected riders and drivers, and we’re making sure the whole system is synchronized,” said Van Hentenryck.\n“We couldn’t be happier they are willing to study our ridership to see what the needs are and tailor a solution,” said Greenwood.\nFor the Georgia Tech researchers, it’s a perfect partnership as well.\n“We’ve been thinking about transportation for years. It connects people to everything from jobs and education to groceries,” explained Van Hentenryck. “It’s amazing that a large agency like MARTA would allow us to come in and test this.”\nThe pilot has been funded by a grant from the National Science Foundation, and from March until August, the service will be available from 6 a.m. to 7 p.m. every weekday.\n“Georgia Tech’s mission calls us to develop leaders who advance technology and improve the human condition. To use our research and expertise to improve lives and livelihoods. That’s why we’re here,\" said Georgia Tech president Ángel Cabrera.  \"We’re grateful for the opportunity, for the support of MARTA and the National Science Foundation, and for the great work by Professor Van Hentenryck’s team.\"\nMARTA officials will be looking to see how many users take advantage of this new first-and-last-mile option. Georgia Tech’s researchers will be watching closely, too, analyzing data including how long it takes to fulfill riders’ requests.\nMARTA officials say if the data shows positive impacts, the pilot could expand to other parts of the city. Georgia Tech researchers say this on-demand project could also serve as a model for more major metropolitan areas to follow.\n“We can take on projects that are not just technologically cool and exciting, but at the same time they also have a big impact on society,”   said Van Hentenryck.\nLearn more about the MARTA Reach program and download the app here.\nAdditional Images\nContact\nSteven Norris\nDirector, Media Relations & Social Media\nEmail\nsnorris@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}