{"text": "Georgia Tech Welcomes Three New ACC Member Institutions | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Welcomes Three New ACC Member Institutions\nTech leadership applauds the addition of three new members of the ACC, strengthening the conference’s commitment to world-class athletics and academic achievement.\nFacebook\nTwitter\nEmail\nPhoto by Danny Karnik/Georgia Tech Athletics\nSep 01, 2023\nAs the landscape of collegiate athletics continues to shift, Georgia Tech is excited to welcome the University of California-Berkeley, Southern Methodist University, and Stanford University as the newest members of the Atlantic Coast Conference (ACC).\nAdding the three westward institutions expands the ACC footprint from coast to coast. Georgia Tech leadership was at the forefront of discussions with Commissioner Jim Phillips to add the three institutions while ensuring student-athletes' well-being and the long-term strength of the ACC and its members.\n\"Georgia Tech is delighted to welcome California, Stanford, and SMU to our conference,\" Georgia Tech President Ángel Cabrera said. \"Each of these schools shares our mission and drive toward athletic, academic, and research excellence. This expansion will increase Georgia Tech's presence in parts of the country many of our alumni call home, it will make the ACC stronger, and it will create exciting new opportunities for our student-athletes and our athletic program.\"\nBringing the total number of member institutions to 18, today's announcement brings enhanced guaranteed revenue to all conference members and the conference's new\nSuccess Initiative , allowing the ACC and its members to continue to compete at the highest level.\n\"Georgia Tech Athletics proudly welcomes California, SMU, and Stanford to the Atlantic Coast Conference,” Director of Athletics J Batt said. “With long traditions of athletic success and elite academic credentials, our three newest partners are a terrific fit for the ACC. A big thanks goes out to Commissioner Jim Phillips and the leaders of our member institutions for delivering three excellent new institutions to our conference while prioritizing student-athlete experience, well-being, and the long-term strength of our league. We're excited to begin working and competing with the Golden Bears, Mustangs, and Cardinal.”\nWith the student-athlete experience a top priority, Tech leadership worked to ensure that travel would not be significantly affected in any sport. Teams are not expected to be required to travel to the West Coast more than once a season, and some teams will not travel west annually.\nThe expansion will enhance Georgia Tech's ability to recruit world-class athletes in key regions and increase access for the thousands of Tech alumni in these major markets.\nLike Georgia Tech, the three new members bring world-class academic success to the conference, along with storied athletic traditions. Also considered one of the country's top universities, 36 Stanford Cardinal teams compete at the D1 level, winning 134 NCAA championships in school history. SMU's 17 D1 sports have won a total of 17 conference team championships in the past five years while maintaining a student-athlete graduation rate 20% higher than the D1 average. Renowned for its academic reputation, Cal's 28 athletic teams have delivered at least one national champion in 88 of the last 103 years.\nThe three institutions will officially join the ACC in 2024, with additional details to be announced in the coming months.\nAdditional Images\nRelated links\nRead the Full ACC Announcement\nContact\nSteven Gagliano\n- Communications Officer\nInstitute Communications\nEmail\nSteven.gagliano@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}