{"text": "What to Read During Winter Break | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nWhat to Read During Winter Break\nMembers of the campus community recommend a variety of books to read during the break.\nFacebook\nTwitter\nEmail\nNov 21, 2023\nWinter break is the perfect time to curl up with a warm beverage and a good book. So, we asked several members of the campus community for recommendations. Their selections range from a look at the lives of barred owls, to a series of essays by Alexander Hamilton and James Madison explaining provisions of the Constitution in detail, to a memoir by actor Andrew McCarthy.\nNote: Books are available at the Georgia Tech Library, other USG institutions, or Emory University. Click on the book title for more information.\nFirekeeper’s Daughter\nBy Angeline Boulley, Henry Holt and Co., 2021\n“This book is totally engaging, and it draws you in from the very beginning. Through the eyes of the main character, Daunis, you experience every emotion. She’s on her way to college but must navigate a host of life situations before she gets there\n— family culture, loss, love, betrayal, and more. The book is warm, funny, insightful, shocking, suspenseful, and sometimes sad. There’s also intrigue for those that like mysteries.\nOur reading group, led by Miranda Garcia in the Women’s Resource Center, is enjoying it immensely.”\n— Criss Miller, assistant to the vice provost for Undergraduate Education and senior program manager, Office of Undergraduate Education\nThe Creative Act: A Way of Being\nBy Rick Rubin with Neil Strauss, Penguin Press, 2023\n“Quincy Jones, Jimmy Iovine, and Dr. Dre all agree — Rick Rubin is the greatest music producer of our generation. He’s the common ingredient in the best records by Adele, the Avett Brothers, Jay-Z, Tom Petty, Red Hot Chili Peppers, and Run DMC. So how exactly did he bring out ‘the best’ in them?\nWhile Rubin\nset out\nto write a book about his creative process — he instead found himself writing about how to be.\nThrough 78 Areas of Thought (brief chapters), we observe his habits, his awareness, his intention, and discover why he’s the best.\nCome for his hot takes on cultural appropriation and competition. Stay for the lessons on how to overcome self-doubt and tuning out undermining voices.”\n—Tad Roberts, assistant director of Creative Services, Georgia Tech Professional Education\nWhere the Crawdads Sing\nBy Delia Owens, Putnam, 2018\n“The book was a holiday gift to me from my sister, who knew it would be very meaningful for me. It is set in the North Carolina Outer Banks\n—\nboth beautiful and dangerous, fragile, and formidable. This is a mystery, drama, and romance all rolled up in one. It is a deeply moving story about grit, resilience, and the struggle to find belonging when one feels like an ‘other.’ I related to it on a personal level because it is about surviving and overcoming trauma, as well as about healing oneself to realize your full potential as a human being.”\n—Luoluo Hong, vice president for Student Engagement and Well-Being\nWalking With Sam: A Father, a Son, and Five Hundred Miles across Spain\nBy Andrew McCarthy, Grand Central Publishing, 2023\n“In this memoir, actor Andrew McCarthy recounts a transformative five-week, 500-mile trek across the renowned Camino de Santiago in northern Spain, undertaken with his 19-year-old son, Sam. The narrative delves into the evolving dynamics of their parent-child relationship, weaving in reflections on McCarthy’s nostalgia for his first Camino walk at 25. While literal milestones in each chapter mark the distance to Santiago, the memoir unveils the emotional waypoints of McCarthy’s journey — embracing external challenges, moments of beauty, and encounters with a diverse cast of characters. Whether you reminisce about the Brat Pack era, are parenting your own teen or young adult, or harbor dreams of walking the Camino, this book — especially the audiobook, narrated by Andrew McCarthy and featuring Sam reading his own quotes — offers an intimate exploration of personal growth and connection.”\n— Marlee Givens, team lead for Instruction and Scholarly Research, Library\nLessons in Chemistry\nBy Bonnie Garmus, Doubleday, 2022\n“This novel weaves an intricate story around Elizabeth Zott, a chemist who faces harassment and sexism as she strives to achieve the career that matches her scientific brilliance. I was wary of reading a book that might feel cliché around the disparities that women face in STEM (and society), but I became captivated and thoroughly enjoyed the nuances of the story. I listened to the audiobook (excellent narration!) and have not yet tried the successful Apple TV series.”\n— Linda Green, director, Tutoring and Academic Support; director, Experiential Learning in Environmental Science; and faculty, School of Biological Sciences\nWhat an Owl Knows: The New Science of the World’s Most Enigmatic Birds\nBy Jennifer Ackerman, Penguin Random House, 2023\n“ What an Owl Knows\nis an easy-to-read nonfiction book about the lives of these fascinating birds. I enjoy the diversion from my technology driven world and it’s great to learn more about these magnificent birds, especially the barred owls who I have\nseen and heard around campus .”\n—Laurence “Larry” Jacobs, senior vice provost for Education and Learning\nMaid: Hard Work, Low Pay, and a Mother’s Will to Survive\nBy Stephanie Land, Hachette Books, 2019\n“This book is a thought-provoking memoir by a young woman who works as a house cleaner to support herself and her young daughter in Washington state, and who aspires to go to college and become a writer. But the core tale of this book is how difficult many Americans have it who earn low hourly wages doing (literally) back-breaking work, and how that combined with housing insecurities, the complicated processes in obtaining government assistance, and the cost of child care makes the so-called working poor at constant risk. I appreciated this book as someone who is a first-generation student and who was also raised by a single (divorced) parent who sometimes struggled to make ends meet. This book is a must-read for anyone who wants to learn more about social class divisions in America and who cares about how class-based practices and assumptions become sedimented obstacles that are difficult to overcome. This book has also been recently made into a series on Netflix, but I recommend the book over the series for its nuances and for the author’s strong, unflinching style and perspective.”\n—Kelly Ritter, chair, School of Literature, Media, and Communication, and professor of writing and communication\nThe Federalist Papers: A Collection of Essays Written in Support of the Constitution of the United States\nBy Alexander Hamilton, James Madison, and John Jay, The Independent Journal, 1787\n“Hands down for me in 2023 are\nThe Federalist Papers , published as 85 newspaper articles in New York between 1787 and 1788 and written by Alexander Hamilton, James Madison, and John Jay under the collective pseudonym ‘Publius.’\nIt does not matter where you reside on the political spectrum. These smartly narrated and exquisitely researched essays are a premier example of American revolutionary scholarship. Each chapter leads the reader through a series of debates around the foundations of the American democratic experiment, and ultimately posit a call to ratify the constitution of the United States.\nIt’s impossible to give away the plot, as the power of the text is evenly distributed across the many historical surveys of various forms of government. I know you all read it in 11th grade civics, but give it another shot. It is a tour de force.”\n—Mi chael Gamble, associate professor, College of Design, and chair, Academic Research Council, The Kendeda Building for Innovative Sustainable Design\nRelated links\nWhat to Read Summer 2023\nWhat to Read Spring Break 2023\nWhat to Read Winter Break 2022\nContact\nVictor Rogers\nInstitute Communications\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}