{"text": "ZipString Founders Find Success at World’s Largest Toy Fair | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nZipString Founders Find Success at World’s Largest Toy Fair\nFrom 'Shark Tank' to Nuremberg, Germany, the product that started in a Georgia Tech dorm room is making waves.\nFacebook\nTwitter\nEmail\nZipString founders Stephen Fazio (right) and Austin Hillam (middle) at Spielwarenmesse in Nuremberg, Germany.\nFeb 15, 2024\nStephen Fazio and Austin Hillam bet on themselves when they withdrew from classes to focus on developing ZipString in 2021.\nThree years later, the toy that was developed as a prototype in a Georgia Tech dorm room brought the pair to Nuremberg, Germany, to participate in Spielwarenmesse — the world's largest toy fair. They were one of nearly 3,000 exhibitors and their product was on display for a week as 70,000 industry traders from around the world perused the displays.\nUsing gravity, lift, tension, and drag to keep a standard loop of string airborne, ZipString allows the user to perform tricks, and watching consumers interact with their product is what keeps Fazio and Hillam motivated.\n\"The first time someone uses a ZipString, there is this expression in their face of pure, raw wonderment. Whether they're 3 or 103 years old, it's the same expression. We call it the ‘smile of wonderment,’\" Hillam said.\nNuremberg Mayor Marcus König stopped by the tent to check out ZipString during the fair, and after meeting with traders, the business partners left another step closer to their goal of expanding internationally.\nDomestically, an ongoing partnership with internet sensation Dude Perfect has landed their product in Walmart stores nationwide, and a memorable 2022 appearance on ABC’s Shark Tank further solidified ZipString's viral presence.\nThe success they've found so far is something the pair only dreamed of when Hillam returned to Johns Creek after withdrawing from BYU in September 2021, soon after the two met at church. Fazio quickly followed suit, leaving Tech to pursue a dream of succeeding in the toy industry.\n\"We just looked at each other and thought, we're going to totally regret this if we don't try. It's a once-in-a-lifetime opportunity, and I knew that Georgia Tech would still be there,\" he said.\nBut as the ZipString founders work to expand their business out of the basement of Hillam's parents’ home, Fazio has returned to Tech to finish his electrical and computer engineering degree. Balancing coursework and the business is difficult, but Fazio says what he's picked up in the classroom has directly contributed to the development of ZipString Luma — a new, glow-in-the-dark version of the product.\nIn conversations with colleagues and fellow students, Fazio is often reminded that he isn't taking the most traditional path, but he wouldn't have it any other way.\n\"We often get the question, 'How did you get into the toy industry?' Because when you go into electrical engineering, it's as if you’re either going to work for Lockheed or Boeing,” he said. “Now, I'm finding myself with my own business in the toy industry. It's very hard work. You're stressed all the time, but it's just an awesome experience.\"\nThe same sense of wonderment that Fazio and Hillam see on the faces of customers is what drew them to this entrepreneurial endeavor, and through the ups and downs, Hillam says that, sometimes, \"You have to make time to play with the toys.\"\nAdditional Media\nNuremberg Mayor Marcus König stopped by ZipString's tent at Spielwarenmesse — the world's largest toy fair.\nContact\nSteven Gagliano\n- Institute Communications\nEmail\nSteven.gagliano@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}