{"text": "Georgia Institute of Technology and Morehouse School of Medicine Announce Collaborative Effort for Health Technology Startup Development | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Institute of Technology and Morehouse School of Medicine Announce Collaborative Effort for Health Technology Startup Development\nInitiative aims to expand Morehouse School of Medicine’s research commercialization efforts, and support focus on the needs of underserved minority and rural populations.\nFacebook\nTwitter\nEmail\nThe Morehouse School of Medicine is part of the the Atlanta University Center in downtown Atlanta\nJul 09, 2019\n— Atlanta, GA\nThe Georgia Institute of Technology and Morehouse School of Medicine (MSM) today announced the launch of a new initiative that will support MSM’s commercialization efforts to create health technology (HealthTech) startups.\nThe effort brings the Institute’s globally recognized technology incubator — the Advanced Technology Development Center (ATDC) — to the MSM campus, ranked the No. 1 medical school in the nation in fulfilling its social mission and the top ranking historically black college or university for producing patents (2009-2019).\n“We’re excited to forge this effort between our two schools that will help translate ideas that may start in the lab to real-world solutions for minority and rural populations in healthcare,” said James W. Lillard, Ph.D., MSM’s associate dean for research and director of the Office of Translational Technologies. “This initiative leverages the research rigor and innovations developing at Morehouse School of Medicine with Georgia Tech’s proven ATDC model of helping technology entrepreneurs create viable, scalable companies.”\nThe collaboration with MSM, the eighth for ATDC through its  ATDC @ program, continues the incubator’s mission of working with technology startups across Georgia. The catalyst for this initiative was an i6 Challenge grant the U.S. Department of Commerce  awarded to Georgia Tech  in 2015.\nThat $500,000 grant, secured by Tech's  Innovation Ecosystems  group, supported wide-ranging innovation and entrepreneurship initiatives across the state. In Atlanta, it called for the Institute to collaborate with Georgia State and Clark Atlanta universities, Morehouse College, the Morehouse School of Medicine, and Spelman College to develop entrepreneurship programs that supported their unique visions.\nThe  ATDC @ MSM  will provide the medical school with a full suite of services and educational programming to support entrepreneurship in the HealthTech arena among faculty, staff, and students on the MSM campus. The core goal is to help entrepreneurs gain insight into successful HealthTech commercialization, through the program, which includes curriculum, connections, and coaching.\nATDC was founded in 1980 to help technology entrepreneurs learn, launch, scale, and succeed in the creation of successful businesses in the state. Since its founding, ATDC has developed a global reputation for fostering technological entrepreneurship, with Forbes naming ATDC to its list of “Incubators Changing the World” in 2010 and 2013, alongside Y Combinator and the Palo Alto Research Center.\nKirk Barnes, ATDC’s HealthTech catalyst, said the effort is a great example of how two world-class institutions can collaborate to create a medically-oriented innovation ecosystem. It also brings focus to the needs of minority and rural populations that are traditionally underserved from a medical standpoint, just as state leaders in Georgia are looking at the issue more closely.\n“This is a great collaborative undertaking that takes our \"Startup Success, Engineered\" model into the clinical setting and gives particular focus on black entrepreneurs who are an underrepresented community in tech,” Barnes said.\n“This will help expand the pace and flow of innovation and commercialization of research coming out of the Morehouse School of Medicine as well as give them access to the broader resources at Georgia Tech and the ATDC model will formalize and expedite how that happens.”\nAbout the Advanced Technology Development Center\nThe Advanced Technology Development Center (ATDC), a program of the Georgia Institute of Technology, is the state of Georgia’s technology startup incubator. Founded in 1980 by the Georgia General Assembly which funds it each year, ATDC’s mission is to work with entrepreneurs in Georgia to help them learn, launch, scale, and succeed in the creation of viable, disruptive technology companies. Since its founding, ATDC has grown to become one of the longest running and most successful university-affiliated incubators in the United States, with its graduate startup companies raising more than $3 billion in investment financing and generating more than $12 billion in revenue in the state of Georgia. To learn more, visit  atdc.org .\nAbout Morehouse School of Medicine\nMorehouse School of Medicine (MSM), located in Atlanta, Georgia, was founded in 1975 as a two-year Medical Education Program at Morehouse College with clinical training affiliations with several established medical schools for awarding the M.D. degree. In 1981, MSM became an independently chartered institution and the first medical school established at a Historically Black College and University in the 20th century. MSM is among the nation's leading educators of primary care physicians and was recently recognized as the top institution among U.S. medical schools for our social mission. Our faculty and alumni are noted in their fields for excellence in teaching, research, and public policy, and are known in the community for exceptional, culturally appropriate patient care.\nMorehouse School of Medicine is accredited by the Commission on Colleges of the Southern Association of Colleges and Schools to award doctorate and master’s degrees. To learn more, visit  msm.edu .\nAbout the Office of Translational Technologies\nThe Office of Translational Technologiesat MSM was established in 2011 to leverage MSM’s intellectual property, research and infrastructure to develop and commercialize product and services that advance health equity. To learn more, visit  msm.edu/Research/translational-technologies .\nAdditional Images\nRelated links\nAdvanced Technology Development Center\nMorehouse School of Medicine\nThe Office of Translational Technologies\nInnovation Ecosystems\nContact\nPéralte C. Paul\n404.316.1210\nperalte.paul@comm.gatech.edu\nEmail\nperalte.paul@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}