{"text": "Simple Robots, Smart Algorithms: Meet the BOBbots | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nSimple Robots, Smart Algorithms: Meet the BOBbots\nInspired by a theoretical model of particles moving around on a chessboard, new robot swarm research shows that, as magnetic interactions increase, dispersed “dumb robots” — dubbed BOBbots — can gather in compact clusters to accomplish complex tasks.\nFacebook\nTwitter\nEmail\nA collection of \"BOBbots\" in motion (Credit: Shengkai Li, Georgia Tech)\nApr 29, 2021\n— Atlanta, GA\nAnyone with children knows that while controlling one child can be hard, controlling many at once can be nearly impossible. Getting swarms of robots to work collectively can be equally challenging, unless researchers carefully choreograph their interactions — like planes in formation — using increasingly sophisticated components and algorithms. But what can be reliably accomplished when the robots on hand are simple, inconsistent, and lack sophisticated programming for coordinated behavior?\nA team of researchers led by\nDana Randall , ADVANCE Professor of\nComputing\nand\nDaniel Goldman , Dunn Family Professor of\nPhysics , sought to show that even the simplest of robots can still accomplish tasks well beyond the capabilities of one, or even a few, of them. The goal of accomplishing these tasks with what the team dubbed \"dumb robots\" (essentially mobile granular particles) exceeded their expectations, and the researchers report being able to remove all sensors, communication, memory and computation — and instead accomplishing a set of tasks through leveraging the robots' physical characteristics, a trait that the team terms \"task embodiment.\"\nThe team's simple BOBbots, or \"behaving, organizing, buzzing bots\" were named for granular physics pioneer Bob Behringer,\" explains Randall. \"Their cylindrical chassis have vibrating brushes underneath and loose magnets on their periphery, causing them to spend more time at locations with more neighbors.\" The experimental platform was supplemented by precise computer simulations led by Georgia Tech physics student\nShengkai Li , as a way to study aspects of the system inconvenient to study in the lab.\nDespite the simplicity of the BOBbots, the researchers discovered that, as the robots move and bump into each other, \"compact aggregates form that are capable of collectively clearing debris that is too heavy for one alone to move,\" according to Goldman. \"While most people build increasingly complex and expensive robots to guarantee coordination, we wanted to see what complex tasks could be accomplished with very simple robots.\"\nTheir work,\nas reported April 23, 2021 in the journal\nScience Advances ,\nwas inspired by a theoretical model of particles moving around on a chessboard. A theoretical abstraction known as a self-organizing particle system was developed to rigorously study a mathematical model of the BOBbots. Using ideas from probability theory, statistical physics and stochastic algorithms, the researchers were able to prove that the theoretical model undergoes a phase change as the magnetic interactions increase — abruptly changing from dispersed to aggregating in large, compact clusters, similar to phase changes we see in common everyday systems, like water and ice.\n\"The rigorous analysis not only showed us how to build the BOBbots, but also revealed an inherent robustness of our algorithm that allowed some of the robots to be faulty or unpredictable,\" notes Randall, who also serves as a professor of\ncomputer science\nand adjunct professor of\nmathematics\nat Georgia Tech.\nThe collaboration is based on experiments and simulations also designed by Bahnisikha Dutta, Ram Avinery and Enes Aydin from Georgia Tech, as well as on theoretical work by Andrea Richa and Joshua Daymude from Arizona State University, and Sarah Cannon from Claremont McKenna College, who is a recent Georgia Tech graduate.\nThis work is part of a Multidisciplinary University Research Initiative (MURI) funded by the Army Research Office (ARO) to study the foundations of emergent computation and collective intelligence.\nFunding: This work was supported by the Department of Defense under MURI award no. W911NF-19-1-0233 and by NSF awards DMS-1803325 (S.C.); CCF-1422603, CCF-1637393, and CCF-1733680 (A.W.R.); CCF-1637031 and CCF-1733812 (D.R. and D.I.G.); and CCF-1526900 (D.R.).\nThis story was first published on\nEurekAlert!\nby Georgia Tech.\nAdditional Images\nContact\nJess Hunt-Ralston\nDirector of Communicaitons\nCollege of Sciences\nGeorgia Institute of Technology\nTracey A. Reeves\nAssociate Vice President for Research and Academic Communications\nInstitute Communications\nGeorgia Institute of Technology\nEmail\njess@cos.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}