{"text": "Looking for love? Use Reddit to give Cupid tech support | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nLooking for love? Use Reddit to give Cupid tech support\nReddit serves as a valuable tool for people signing up for onilne dating websites.\nFacebook\nTwitter\nEmail\nKeith Edwards is a professor in the School of Interactive Computing.\nFeb 12, 2015\n— Atlanta, GA\nWhen looking for love on the Internet, people who use dating websites have experiences unlike most in the online social world. Interactions are one-on-one, private, directed primarily between strangers—and not always smooth or easy. That’s why, according to new Georgia Institute of Technology research, many men and women head to Reddit after signing up for two popular dating web services. The study found that users on OKCupid and mobile-based Tinder aren’t able to determine social norms or effective match-making techniques on the services, so they use Reddit to learn tips about online dating. Once there, they also find ways that allow them to “cheat the system” to interact with more potential dates.  “We found that participants used these Reddit forums to share experience and to offer advice, and the forums played a major role in shaping how participants used the dating sites,” says researcher and Professor Keith Edwards of Georgia Tech’s School of Interactive Computing. “There are  two thriving subreddit groups for OkCupid and Tinder that are vital to helping users understand dating techniques, both on the sites and in general.” Researchers interviewed participants on the subreddits and observed the public forums, which collectively have more than 95,000 members and 1,400 new posts a day at any given point. Many subreddit discussions centered on what\nnot\nto do, with users providing cautionary examples of harassing or unwanted messages and other anti-social behavior. Others warned users against risking their own privacy by sharing their own photos from other social networks on the dating sites, which might allow others to determine the user’s real identity. Discussions also focused on strategies to take advantage of how the dating sites are set up in order to improve the chances of finding a match. Researchers say some of the techniques might actually enable anti-social behavior, a common problem on dating sites in general, with upwards of a quarter of users reporting unwanted behavior. Some people even bend the rules a little to tip the odds more into their favor for meeting Mr. and Ms. Right. Some examples on OKCupid: -       Indiscriminately give all profiles 4 or 5 stars to get noticed by potential partners; -       Create a fake profile to browse anonymously and ignore future requests; -       Scan profiles (without clicking) to glean basic information; -       Share “response rate,” a subjective score of how often a private message worked; -       Ballpark “dating value,” where men used the color scale (for showing how often a user replies to private messages) to instead seek hard-to-catch women (red) or disregard women who message too frequently (green). Tinder, which pairs users only after both people swipe “like” on the mobile app, was also manipulated by users.  -       Men swiped “like” on all profiles to increase likelihood of a match. -       Users spoofed location to find more matches in a wider radius. -       Structured experiments to see which profile pictures worked best. Findings from the study also showed persistent frustrations with the online dating experience. Users complained of trolling and catfishing (the use of false photos to deceptively engage users). Men, primarily, were frustrated with non-responses to their messages. Users also talked about “the fade,” when a potential romantic partner slowly stops responding to messages. A more benign problem on the dating sites: boring or generic profiles. “As one user commented ‘everyone is always fun-loving, loves to laugh, loves to travel and hangout with friends,’” says Edwards. “Lack of novelty and lack of spontaneity in conversation came up quite often. We saw discussions about first dates being stilted, and connections were difficult to make.” Forum users shared tips on how to shape profiles for maximum appeal, something not possible on the dating sites because of the one-on-one nature of the platforms. Some users said the discovery of a forum for sharing tips about particular dating sites made the difference in whether they used the site or not, according to the researchers. The authors suggest design changes that could bring dating sites more in line with modern user expectations of socializing on the web. One possibility is developing online dating sites to be more community-centric, as shown by the value of outsourced communities on Reddit. This could possibly mitigate anti-social behaviors or rule-bending on the websites as well. The research study, “ Understanding the Role of Community in Online Dating ,” co-authored by graduate student Christina Masden, will be presented at the Association of Computing Machinery’s conference on Human Factors in Computing Systems (CHI 2015), April 18-23, in Seoul, Korea.\nAdditional Images\nRelated links\nRead the study\nRomance and social sharing\nContact\nJoshua Preston College of Computing 678-231-0787 jpreston@cc.gatech.edu\nEmail\njpreston@cc.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}