{"text": "She Slept in a Car on her Campus Tour, Now She's Graduated With Highest Honors | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nShe Slept in a Car on her Campus Tour, Now She's Graduated With Highest Honors\nJasmine Hornbeck overcame some big challenges to finish her Georgia Tech degree. Now she's back to earn a master's in mechanical engineering.\nFacebook\nTwitter\nEmail\nJasmine and her late father.\nNov 04, 2021\n— Atlanta, GA\nWhen Jasmine Hornbeck and her mother, Junko, hit the road from Jacksonville, Florida, one evening during her senior year of high school, to tour the Georgia Tech campus, she didn’t think about where they would stay that night.\n“We got [to campus] around 1 a.m. and I was like, ‘Mom, did you not get a hotel?’” remembered Hornbeck. “She pulled into the Coca-Cola building parking lot, and I realized that she had pillows and blankets back there and I was like, ‘Wow, so this is what we’re doing.’”\nThe two created a makeshift bed in the back of the family SUV and settled in for the night.\n“My back hurt the next morning, but I didn’t care about sleeping in the car at all,” said Hornbeck. She didn’t mind because, that morning, she was getting the opportunity to visit her dream school.\nShe wanted to pursue a college career at Georgia Tech in mechanical engineering and had already been accepted after applying during the Early Decision phase, but out-of-state tuition would place a heavy financial burden on her family back in Florida. So, Hornbeck and her mom agreed that they would go to visit the campus and see if Tech was the place for her. Neither had ever been to Atlanta.\n“We weren’t the type of family that traveled very often,” she said. “The longest road trip we’d ever been on was like two hours.”\nAfter multiple hours on I-75 and an impromptu car campout, she finally got her first glimpse of campus. While on the tour, Hornbeck and her mom shared a moment.\n“We looked at each other, and we just kind of knew. My mom simply stated, ‘This is where you belong,” recalled Hornbeck.\nReturning to Jacksonville after the tour, Hornbeck and her parents came up with a plan for her to attend Georgia Tech. She enrolled and completed the fall semester then spent the holidays at home. But when she returned to Tech in January she received some difficult news.\n“My Dad was diagnosed with stage 4 lung cancer during my senior year of high school,” said Hornbeck. “I couldn’t comprehend the gravity of what was going on, so when I left home, it didn’t register that this decision would impact the rest of my life, having such limited moments with him and still choosing my studies.”\nAt the start of spring classes, Junko sent a text to Hornbeck about her father’s worsening condition.\n“When she told me to come home, I was so selfishly caught up in how it would affect my studies that I almost didn’t,” Hornbeck remembered. But, she booked a ride on a megabus and made it home to see her father hours before he passed away. Within 24 hours, Hornbeck was on another bus back to Georgia Tech.\n“I don’t think I felt the full effect of grief for six, seven, eight months,” she said. “I was in a bubble of disbelief.”\nDuring that spring semester, Hornbeck, a first-generation college student, worried about her future. Her father was the main source of income for the family. So, she now faced the reality that she may not have been able to stay at Tech.\n“I couldn’t wrap my head around that. I worked so hard to get here, and, suddenly, it seemed as if my circumstance was going to prevent me from reaching my dreams,” recalled Hornbeck.\nPicking up multiple jobs on and off campus, she was unwilling to give up. She went to financial aid every day for two weeks after her father’s death, seeking possible solutions. Meanwhile, she kept her father’s passing mostly to herself, electing not to tell professors, and leaning only on a handful of friends. She felt alienated from the rest of the Georgia Tech community. She waited until May for the financial aid packages to be released, continuing to work and attend classes without knowing her future at Georgia Tech.\n“Everything was out of my hands,” said Hornbeck. “That was a concept I struggled to grasp. I’d like to think that I can solve any problem, but, for once, I had no idea how to help myself.”\nAt the end of the semester, help arrived. Hornbeck had earned enough scholarships to remain at Tech. She’ll never know, for sure, why she was awarded the aid but credits her perseverance.\nAfter a tumultuous first year, Hornbeck continued her collegial path in the wake of her father’s death, but toward the end of her undergraduate studies found a sector of campus that could identify with her journey.\n“I didn’t realize that other people [at Georgia Tech] were struggling with similar situations, until I found out about grief counseling my senior year,” she said. “That was so helpful. These people actually understand how the gravity of such a loss can affect your life, implicitly, for years to come. I found comfort in that community.”\nThis past summer, Hornbeck completed her degree in mechanical engineering and is now pursuing a master’s degree at Georgia Tech.\nFor a long time, she felt as if talking about grief was taboo, but she now feels sharing her story has been cathartic.\n“Telling this heals me in a way. I feel like I’ve come to terms with all of this,” she said. “In his last months, my dad would always tell me that he knew he made the right decision in letting me come here and that he was proud of me. I hold on to that dearly. There is no right way or timeline in which I was supposed to process this, which I didn’t understand at the time. With or without what was going on in my personal life, I was at Georgia Tech because I loved engineering. Once I realized that, I had my fire back.”\nAdditional Images\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}