{"text": "Planetary Exploration Rover Avoids Sand Traps with “Rear Rotator Pedaling” | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nPlanetary Exploration Rover Avoids Sand Traps with “Rear Rotator Pedaling”\nUsing the Mini Rover, researchers have studied locomotion techniques that could help future rovers work on granular lunar and planetary surfaces.\nFacebook\nTwitter\nEmail\nBuilt with multifunctional appendages able to spin wheels that can also be wiggled and lifted, the Mini Rover was modeled on a novel NASA rover design and used in the laboratory to develop and test complex locomotion techniques robust enough to help it climb hills composed of granular material, here ordinary beach sand. (Credit: Christopher Moore, Georgia Tech)\nMay 13, 2020\n— Atlanta, GA\nThe rolling hills of Mars or the moon are a long way from the nearest tow truck. That’s why the next generation of exploration rovers will need to be good at climbing hills covered with loose material and avoiding entrapment on soft granular surfaces.\nBuilt with wheeled appendages that can be lifted and wheels able to wiggle, a new robot known as the “Mini Rover” has developed and tested complex locomotion techniques robust enough to help it climb hills covered with such granular material – and avoid the risk of getting ignominiously stuck on some remote planet or moon.\nUsing a complex move the researchers dubbed “rear rotator pedaling,” the robot can climb a slope by using its unique design to combine paddling, walking, and wheel spinning motions. The rover’s behaviors were modeled using a branch of physics known as terradynamics.\n“When loose materials flow, that can create problems for robots moving across it,” said\nDan Goldman , the Dunn Family Professor in the\nSchool of Physics\nat the Georgia Institute of Technology. “This rover has enough degrees of freedom that it can get out of jams pretty effectively. By avalanching materials from the front wheels, it creates a localized fluid hill for the back wheels that is not as steep as the real slope. The rover is always self-generating and self-organizing a good hill for itself.”\nThe research was reported on May 13 as the cover article in the journal\nScience Robotics . The work was supported by the NASA National Robotics Initiative and the Army Research Office.\nA robot built by NASA’s Johnson Space Center pioneered the ability to spin its wheels, sweep the surface with those wheels and lift each of its wheeled appendages where necessary, creating a broad range of potential motions. Using in-house 3D printers, the Georgia Tech researchers collaborated with the Johnson Space Center to re-create those capabilities in a scaled-down vehicle with four wheeled appendages driven by 12 different motors.\n“The rover was developed with a modular mechatronic architecture, commercially available components, and a minimal number of parts,” said Siddharth Shrivastava, an undergraduate student in Georgia Tech’s\nGeorge W. Woodruff School of Mechanical Engineering . “This enabled our team to use our robot as a robust laboratory tool and focus our efforts on exploring creative and interesting experiments without worrying about damaging the rover, service downtime, or hitting performance limitations.”\nThe rover’s broad range of movements gave the research team an opportunity to test many variations that were studied using granular drag force measurements and modified Resistive Force Theory. Shrivastava and School of Physics Ph.D. candidate Andras Karsai began with the gaits explored by the NASA RP15 robot, and were able to experiment with locomotion schemes that could not have been tested on a full-size rover.\nThe researchers also tested their experimental gaits on slopes designed to simulate planetary and lunar hills using a fluidized bed system known as SCATTER (Systematic Creation of Arbitrary Terrain and Testing of Exploratory Robots) that could be tilted to evaluate the role of controlling the granular substrate. Karsai and Shrivastava collaborated with Yasemin Ozkan-Aydin, a postdoctoral research fellow in Goldman’s lab, to study the rover motion in the SCATTER test facility.\n“By creating a small robot with capabilities similar to the RP15 rover, we could test the principles of locomoting with various gaits in a controlled laboratory environment,” Karsai said. “In our tests, we primarily varied the gait, the locomotion medium, and the slope the robot had to climb. We quickly iterated over many gait strategies and terrain conditions to examine the phenomena that emerged.”\nIn the paper, the authors describe a gait that allowed the rover to climb a steep slope with the front wheels stirring up the granular material – poppy seeds for the lab testing – and pushing them back toward the rear wheels. The rear wheels wiggled from side-to-side, lifting and spinning to create a motion that resembles paddling in water. The material pushed to the back wheels effectively changed the slope the rear wheels had to climb, allowing the rover to make steady progress up a hill that might have stopped a simple wheeled robot.\nThe experiments provided a variation on earlier robophysics work in Goldman’s group that involved moving with legs or flippers, which had emphasized disturbing the granular surfaces as little as possible to avoid getting the robot stuck.\n“In our previous studies of pure legged robots, modeled on animals, we had kind of figured out that the secret was to not make a mess,” said Goldman. “If you end up making too much of a mess with most robots, you end up just paddling and digging into the granular material. If you want fast locomotion, we found that you should try to keep the material as solid as possible by tweaking the parameters of motion.”\nBut simple motions had proved problematic for Mars rovers, which got stuck in granular materials. Goldman says the gait discovered by Shrivastava, Karsai and Ozkan-Aydin might be able to help future rovers avoid that fate.\n“This combination of lifting and wheeling and paddling, if used properly, provides the ability to maintain some forward progress even if it is slow,” Goldman said. “Through our laboratory experiments, we have shown principles that could lead to improved robustness in planetary exploration – and even in challenging surfaces on our own planet.”\nThe researchers hope next to scale up the unusual gaits to larger robots, and to explore the idea of studying robots and their localized environments together. “We’d like to think about the locomotor and its environment as a single entity,” Goldman said. “There are certainly some interesting granular and soft matter physics issues to explore.”\nThough the Mini Rover was designed to study lunar and planetary exploration, the lessons learned could also be applicable to terrestrial locomotion – an area of interest to the Army Research Laboratory, one of the project’s sponsors.\n\"This basic research is revealing exciting new approaches for locomotion in complex terrain,\" said Dr. Samuel Stanton, program manager, Army Research Office, an element of the U.S. Army Combat Capabilities Development Command's Army Research Laboratory. \"This could lead to platforms capable of intelligently transitioning between wheeled and legged modes of movement to maintain high operational tempo.\"\nBeyond those already mentioned, the researchers worked with Robert Ambrose and William Bluethmann at NASA, and traveled to NASA JSC to study the full-size NASA RP15 rover.\nThis work was supported by the Army Research Office (W911NF-18-1-0120) and the NASA National Robotics Initiative (NNX15AR21G). Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the sponsoring agencies.\nCITATION : Siddharth Shrivastava, Andras Karsai, Yasemin Ozkan-Aydin, Ross Pettinger, William Bluethmann, Robert O. Ambrose, Daniel I. Goldman, “Material remodeling on granular terrain yields robustness benefits for a robophysical rover.” (Science Robotics, May 2020)\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : John Toon (404-894-6986) (jtoon@gatech.edu)\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}