{"text": "Improved Telemedicine System Connects Doctors to Autism Patients in Rural Georgia | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nImproved Telemedicine System Connects Doctors to Autism Patients in Rural Georgia\nA recently improved telemedicine system was optimized by scientists at the Georgia Tech Research Institute (GTRI) and Cisco Systems, Inc.\nFacebook\nTwitter\nEmail\nFelissa Goldstein, M.D., is the primary doctor using the improved telemedicine system at the Marcus Autism Center. Goldstein uses the system for providing early screening and continuing care for children with autism spectrum disorders.  Credit: Marcus Autism Center/Children’s Healthcare of Atlanta\nJul 17, 2014\n— Atlanta, GA\nTo get the best care for her three autistic children, Mandi Larkin would drive three hours from her family’s home in Tifton, Ga., to Marcus Autism Center in Atlanta. The drive to and from Atlanta was exhausting. Missed work, missed school and the long drive were constant sources of stress. Today, Larkin’s children receive world-class medical care at her local hospital via a state-of-the-art telemedicine link to Marcus Autism Center. The recently improved telemedicine system was optimized by scientists at the Georgia Tech Research Institute (GTRI) and Cisco Systems, Inc. Marcus Autism Center’s telemedicine room is now a showcase for providers of telemedicine, where improved video capabilities and an ergonomic suite allow patients in rural Georgia to meet face-to-face with medical specialists in Atlanta. “The accessibility to the doctors in Atlanta is the big thing,” Larkin said. “Not everyone has the means to make that kind of a drive. Telemedicine gives us access to the doctors that we normally wouldn’t have access to.” A major goal of the telemedicine redesign is to create telepresence, clinical workflow, and diagnostic processes that can enable clinicians to identify rural children with autism spectrum disorders as early as 18 months. Today, these children are often diagnosed as late as seven years old. GTRI’s telemedicine efforts are supported by a donation from Allen Ecker ,\na Georgia Tech alum and executive vice president of Scientific Atlanta. “One of the biggest issues facing our country is both the cost of healthcare and the scarcity of healthcare providers as the demands of healthcare get larger,” Ecker said. “I think that telemedicine will address both of those problems. It reduces the cost of an appointment and it also reduces the time needed for the clinician.” Cisco, as a provider of telemedicine equipment at Children’s Healthcare of Atlanta,also donated approximatelyhalf-a-million dollars’ worth of equipment and software toward telemedicine enhancements at both Marcus Autism Center and Children’s. “Cisco worked hand-in-hand with us from the beginning,” said Courtney Crooks, a senior research scientist at GTRI, who is leading the project. “In a patient-provider relationship, the experience is really important. We wanted to ensure that the telepresence is at least as good as when you’re sitting in the office with a provider. Plus, we wanted to use technology to enhance the clinical workflow and capabilities of the provider, beyond what they may be able to accomplish through manual means.” Felissa Goldstein, M.D., is the primary doctor using the improved telemedicine system at the Marcus Autism Center. Goldstein, a child and adolescent psychiatrist, is one of the most active providers of telemedicine in the state of Georgia. She uses the system for providing early screening and continuing care for children with autism spectrum disorders. Until this past summer, Goldstein had been using a telemedicine system in her office that, among other human factors problems, had poor lighting, muffled sound, and displaced monitors which created heavily reduced eye contact. The GTRI systems engineers applied their expertise to Goldstein’s clinical setting. They studied the best way to orient the telemedicine monitors so that the eye contact and visual connection between doctor and patient was optimized without either person having to crane their neck. The old telemedicine system used two monitors side-by-side. The monitor on the left displayed medical records, while the monitor on the right provided a view of the patients via a webcam atop the monitor.  “I’d have to tell the family when I would start that ‘If I look away, it’s not because I’m not paying attention to you. It’s because I’m looking at your chart,’” Goldstein said. The GTRI engineers saw that a redesign of the monitors was required; one which did not require the doctor to turn their head or shift their gaze in an obvious way. Crooks’ team shadowed Dr. Goldstein during her appointments and developed a streamlined, ergonomic telemedicine system.Now the monitor that displays medical records is above the patient monitor. A powerful webcam sits in the space between the monitors. If Goldstein moves her gaze from the top monitor to the bottom monitor, all the patients see is a slight movement of her head. Goldstein said the improved eye-contact is the biggest advantage to the new system. “GTRI worked with us really carefully to maximize eye contact, and I feel like it’s really adding to my ability to provide good patient care by telemedicine,” Goldstein said. The new telemedicine system is now in a room of its own. The lighting in the larger space was designed to make Goldstein appear natural, and not dark and shadowy like in the old system. The desk and monitors are now ergonomic, and the room is soundproof. Gone is the need for the old-fashioned webcam remote control, and in its place is an iPad which acts as the central control station for the telemedicine system. Goldstein now can tap the screen to control the camera. She can pan and zoom to follow children around the room as they play with toys, or tightly focus on the parents as they praise or discipline their children. The iPad is also enabled for capabilities such as touchpad tagging of behavioral events of interest that may occur during a session. If Goldstein needs to note a significant event, she can flag it in the system. Later, she analyzes the data to look for trends, such as how a symptom develops over time. Another improvement is the system’s ability to load unique settings for individual families. Goldstein can also share her screens remotely, as she does when giving lectures. This feature can also be used to share educational materials with families during session, as needed. The new telemedicine system was transitioned over the summer of 2013. Crooks’ research team is in discussions with several other funders for ways to use the system for different clients’ needs, such as teletraining, parent education, and dependent care in the military. Those applications are still under development, but the system’s value to families with children is already changing their lives. When Mandi Larkin arrives to her appointment at Tift Regional Medical Center with her children -- ages three, four and six -- a nurse guides them through registration and paperwork, then takes the kids’ vital signs and leads the family to the telemedicine room. When they arrive, Goldstein is already on the telemedicine video screen. “It’s usually very prompt, and that’s something I really like,” Larkin said. “Once you get there you have your appointment time and there’s never more than a 5 minute wait.” After her telemedicine session, Larkin is faxed a report detailing the visit. Before, she had to bring a pen and notepad to every appointment to have a record of what transpired. Larkin said she would prefer to be with the doctor in person, but that isn’t realistic, so telemedicine is the next best thing. In some cases, telemedicine is even better than being with the doctor in person, Larkin said. “I think the doctor gets a little bit more interaction from the kids through the screen because they more or less shut down around new people,” Larkin said. “With telemedicine, to the kids it’s just somebody on a TV screen talking to them. The doctor can see a little bit more and get a little bit more from them than if she was in the room in front of them.” Research shows that children in rural areas, on average, aren’t diagnosed with autism spectrum disorders until age seven. Ideally, diagnosis should take place as early as 18 months so the children can benefit from proper care as early as possible. The new telemedicine system could help bring earlier diagnosis to rural children. “We’re helping to screen a lot of children with developmental disabilities so that it’s no longer seven years until they are diagnosed,” Goldstein said. “The younger you can diagnose, the better off you are.” Goldstein also travels to rural clinics throughout the state, where many of the families have never seen a specialist for children with developmental disabilities. Future work with the telemedicine system will convert all six of her outreach clinics to video conferencing clinics. Overall, Children’s Healthcare of Atlanta partners with Georgia Partnership for Telehealth (GPT) to see patients at more than 30 telemedicine sites throughout the state of Georgia in a variety of specialties ranging from Cardiology to Sports Medicine. GTRI’s work with Marcus Autism Center will also be applied to other telemedicine suites at Children’s Healthcare of Atlanta.   “ In collaboration with Cisco, we came up with a standard that other clinics can adopt,” Crooks said.  If enhancements to remote site systems are desired, this standard can be used to customize a suitable package that will be interoperable with the system at Marcus Autism Center. Sites may be eligible for funding for these upgrades through a variety of sources. The work between GTRI, Cisco and Marcus is continuing with the ultimate goal of being able to perform diagnosis and therapy in the child patient's home, with the parents as the caregivers, directed by clinicians using the telemedicine system. In the meantime, the new telemedicine system is already improving lives. Larkin has been using telemedicine for about three and a half years. To her family, it’s meant a major improvement in the quality of life. “It’s all worth it because I get to see the doctor and I don’t have to drive three hours with my three autistic kids,” Larkin said. Research News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA @GTResearchNews Media Relations Contacts : Brett Israel ( @btiatl ) (404-385-1933) ( brett.israel@comm.gatech.edu ) or John Toon (404-894-6986) ( jtoon@gatech.edu ) Writer : Brett Israel\nAdditional Images\nContact\nBrett Israel 404-385-1933 brett.israel@comm.gatech.edu\nEmail\nbrett.israel@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}