{"text": "Four Communities Selected for Inaugural Georgia Smart Communities Challenge | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nFour Communities Selected for Inaugural Georgia Smart Communities Challenge\nAlbany, Chamblee, Chatham County and Gwinnett County will implement smart development through a Georgia Tech-led program.\nFacebook\nTwitter\nEmail\nAlbany, Chamblee, Chatham County and Gwinnett County won the Georgia Smart Communities Challenge, a Georgia Tech-led initiative that brings together industry and public agencies to help local governments.\nJun 12, 2018\n— Atlanta, GA\nFour Georgia communities developed and will implement smart design solutions to some of the biggest challenges facing the state. The projects, which tackle housing, traffic congestion, sea level rise and shared autonomous vehicles, are supported through the\nGeorgia Smart Communities Challenge .\nThis new Georgia Tech-led initiative brings together industry and public agencies to help local governments implement smart development. The strategies developed by the selected communities will serve as models that could be implemented elsewhere across Georgia.\nThe program provides seed funding and access to technical assistance, expert advice and a network of peers. A Georgia Tech researcher will advise and conduct research in support of each group’s goals.\nThe winning proposals are:\nAlbany Housing Data Initiative . Led by the city of Albany the project will evaluate an automated housing registry. The system will allow for improved neighborhood infrastructure and revitalization and encourage a safe and sustainable housing inventory for the city. Assigned Georgia Tech researcher: Omar Isaac Asensio, assistant professor in the School of Public Policy.\nShared Autonomous Vehicle Study . Led by the city of Chamblee the project will study improvements in mobility through the use of autonomous vehicles that travel from MARTA stations into the community. This will reduce road congestion and increase pedestrian and traveler safety. Assigned Georgia Tech researcher: Ellen Dunham-Jones, professor in the School of Architecture.\nSmart Sea Level Tools for Emergency Planning and Response . Led by Chatham County, this project will develop and test a pilot sensor network for measuring sea level flood risk during natural disasters and storms. The network will improve flood warnings, emergency response action plans and predictions for future flood events. Assigned Georgia Tech researcher: Kim Cobb, Georgia Power Chair and professor in the School of Earth and Atmospheric Sciences.\nConnected Vehicle Technology Master Plan . Led by Gwinnett County, this project will evaluate traffic management technologies for improved vehicle mobility throughout the region. The technology will improve safety and connectivity. Assigned Georgia Tech researcher: Angshuman Guin, senior research engineer in the School of Civil and Environmental Engineering.\n“Georgia Tech is excited at the opportunity to collaborate with four of Georgia’s dynamic communities in this inaugural Georgia Smart Communities Challenge,” President G.P. “Bud” Peterson said. “The enthusiasm for this new program has been gratifying, and we look forward to seeing how Georgia Tech’s research expertise and the communities’ vision of smart development mesh together to improve the lives of their citizens. These groundbreaking projects have the potential to become models for other communities around our state.”\nGeorgia Smart supports communities of all sizes, including smaller towns, which may not have been as prominent in smart development because of a lack of resources. Seventeen communities applied for the program.\nWhile each selected team is led by a local government, the work will be a collaboration between different government agencies and nonprofits.\nThe teams will each receive $50,000 in grants and $25,000 from Georgia Tech in researcher support. The selected communities each raised an additional $50,000.\nGeorgia Power is the lead sponsor of the program, with additional financial support from the Atlanta Regional Commission.\n“At Georgia Power, we’re committed to investments in smart technologies and collaborative partnerships that improve service to our customers, as well as the quality of life in local communities,” said Latanza Adjel, vice president for sales at Georgia Power, who leads the company’s efforts in energy efficiency and other areas. “We’re proud to have worked with some of the most innovative public leaders in the state as part of this project, and congratulate the winners of the Smart Communities Challenge for exploring and embracing new technologies that can benefit thousands of our Georgia neighbors.”\nDoug Hooker, executive director of the Atlanta Regional Commission, noted the diversity and quality of the applications for the program. The winners emphasized a highly collaborative approach that includes working across multiple jurisdictions and agencies, he said.\nAdditional partners include: Association County Commissioners of Georgia, Georgia Centers for Innovation, Georgia Chamber of Commerce, Georgia Department of Community Affairs, Georgia Municipal Association, Global City Teams Challenge, Metro Atlanta Chamber and Technology Association of Georgia.\nGeorgia Tech and some of the Georgia Smart partners will celebrate the winners during a special event in Albany Tuesday morning.\nWork on the projects will begin in September and continue through September 2019.\n“The four selected communities show cities of all sizes can work on smart development and that these projects are strongest when done through collaboration,” said Debra Lam, managing director of\nSmart Cities and Inclusive Innovation at Georgia Tech . “Other cities will not be excluded from the broad Georgia Smart community as we remain committed to supporting smart development across the state and beyond.”\nAdditional Images\nRelated links\nGeorgia Smart Communities Challenge\nSmart Cities and Inclusive Innovation\nContact\nFor media inquiries about Georgia Smart, contact Laura Diamond,  laura.diamond@gatech.edu\nFor all other inquiries, email  scii@ipat.gatech.edu\nEmail\nlaura.diamond@gatech.edu\nAdditional information\nGeorgia Smart Communities Challenge Plans\nFour communities are the first winners of the Georgia Smart Communities Challenge. Learn more about their plans:\nAlbany Housing Data Analytics and Visualization Initiative\nLead: Albany\nCollaborators: Department of Community and Economic Development; Dougherty County; Albany, Georgia Initiative for Community Housing; and Fight Albany Blight\nThis initiative seeks to bridge the gap between available data and the need for a comprehensive, flexible and accurate database to effectively manage the Albany housing inventory. The end result will allow a better measurement of public funds allocated for housing and neighborhood structure repairs and enhancements, using an automated data analytics and visualization tool. The initiative also allows the city and its collaborators to engage with residents and become part of the solution to the communities’ housing issues.\nSmart Sea Level Tools for Emergency Planning and Response\nLead: Chatham County\nCollaborators: Savannah and Creative Coast\nThis project will develop and test a pilot sensor network for measuring sea level flood risk during natural disasters and storms. Sea level rise presents a risk to coastal communities and those risks become more pronounced during hurricane landfalls when extreme flooding exacts a major toll on public safety and key infrastructure. The proposed sensor network will improve flood warnings, emergency response action plans and predictions for future flood events. This project is considered the first of its kind for the region and the expectation is it will serve as a model for future smart designs along Georgia’s coastline.\nShared Autonomous Vehicle Study\nLead: Chamblee\nCollaborators: Doraville, MARTA, Stantec and Assembly Community Improvement District (CID)\nThis project will study improvements in mobility through the use of shared autonomous vehicles, which travel from MARTA stations into the community. This option will reduce road congestion, increase pedestrian and traveler safety and improve equity in the community. While the project will look at challenges surrounding the “last mile” – getting from a transportation hub to a final destination – there will be additional implications. The research will look at the potential impacts of autonomous vehicle technology on land use, attracting residents and employees, expanding access to MARTA, prioritizing pedestrian and bike mobility; and improving public health.\nConnected Vehicle Technology Master Plan\nLead by Gwinnett County\nCollaborators: Berkeley Lake, Duluth, Norcross, Suwanee and Georgia Department of Transportation\nThis project will evaluate traffic management technologies for improved vehicle mobility throughout the region. It will use the latest technological advances in traffic management systems to improve traffic congestion and reduce crashes along the Peachtree Boulevard corridor. In addition to modeling how to set up a connected vehicle system, this project will help agencies charged with new traffic safety and mobility to manage expectations and costs, and fully realize the benefits of these new technologies.\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}