{"text": "Making Money from Lignin: Roadmap Shows How to Improve Lignocellulosic Biofuel Biorefining | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMaking Money from Lignin: Roadmap Shows How to Improve Lignocellulosic Biofuel Biorefining\nA new review article in the journal Science points the way toward a future where lignin is transformed from a waste product into valuable materials such as low-cost carbon fiber for cars or bio-based plastics.\nFacebook\nTwitter\nEmail\nProfessor Arthur Ragauskas prepares samples containing cellulose, lignin and hemicellulose for analysis using advanced nuclear magnetic resonance techniques.\nMay 15, 2014\n— Atlanta, GA\nWhen making cellulosic ethanol from plants, one problem is what to do with a woody agricultural waste product called lignin. The old adage in the pulp industry has been that one can make anything from lignin except money. A new review article in the journal\nScience\npoints the way toward a future where lignin is transformed from a waste product into valuable materials such as low-cost carbon fiber for cars or bio-based plastics. Using lignin in this way would create new markets for the forest products industry and make ethanol-to-fuel conversion more cost-effective. “We’ve developed a roadmap for integrating genetic engineering with analytical chemistry tools to tailor the structure of lignin and its isolation so it can be used for materials, chemicals and fuels,” said\nArthur Ragauskas , a professor in the School of Chemistry and Biochemistry at the Georgia Institute of Technology. Ragauskas is also part of the Institute for Paper Science and Technology at Georgia Tech. The roadmap was published May 15 in the journal\nScience . Co-authors of the review included scientists from the National Renewable Energy Laboratory and Oak Ridge National Laboratory. The growth of the cellulosic fuel industry has created a stream of lignin that the industry needs to find valuable ways to use. At the same time, federal agencies and industry are funding research to simplify the process of taking biomass to fuels. “One of the very promising approaches to doing that is to genetically engineer plants so they have more reactive polysaccharides suitable for commercial applications, but also to change lignin’s structural features so that it’ll become more attractive for materials applications, chemicals and fuels.” Ragauskas said. Research highlighted in the review has shown it’s theoretically possible to genetically alter lignin pathways to reduce undesirable byproducts and more efficiently capture the desired polysaccharides – which are sugars that can be converted to other products – and enhance lignin’s commercial value. “There are sufficient publications and data points out there to say that say, ‘Yes, we can do this,’” Ragauskas said. Through work on transgenic plants and wild plants that naturally have fewer undesirable constituents, biologists, engineers and chemists have recently improved the biorefinery field’s understanding of the chemistry and structure of lignin, which provides a better idea of the theoretical chemistry that lignin can do, Ragauskas said. “We should be able to alter the structure of lignin and isolate it in such a manner that we can use it for green-based materials or use it in a blend for a variety of synthetic polymers,” Ragauskas said. Doing so would create a stream of polysaccharides for use as ethanol fuels, with lignin waste that has structural features that would make it attractive for commercial applications such as polymers or carbon fibers. The science could be applied to a variety of plants currently used for cellulosic biofuel production, such as switchgrass and poplar. Today, lignin is mostly burned for energy to fulfill a small amount of the power requirements of the ethanol biorefineries. But the new roadmap emphasizes how, through genetic engineering tools that currently exist, lignin could become much more valuable to industry. “Our primary mission is to reduce the cost of taking biomass to biofuels,” Ragauskas said, “But in the process we’ve learned a lot about lignin, and we might be able to do more than just reduce cost. We might be able to tailor lignin’s structure for commercial applications.” Co-authors on the review article included scientists from the National Renewable Energy, the University of British Columbia, the University of North Texas, Oak Ridge National Laboratory, and the University of California, Riverside. CITATION : Arthur J. Ragauskas, et al., “Lignin Valorization: Improving Lignin Processing in the Biorefinery.” ( Science , May 2014). http://dx.doi.org/10.1126/science.1246843  Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA @GTResearchNews Media Relations Contacts:\nBrett Israel ( @btiatl ) (404-385-1933) ( brett.israel@comm.gatech.edu ) or John Toon (404-894-6986) ( jtoon@gatech.edu ) Writer:\nBrett Israel\nAdditional Images\nContact\nBrett Israel 404-385-1933\nEmail\nbrett.israel@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}