{"text": "Transfer Technique Produces Wearable Gallium Nitride Gas Sensors | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nTransfer Technique Produces Wearable Gallium Nitride Gas Sensors\nA new technique allows gallium nitride gas sensors to be grown on a standard substrate and then transferred to a different support.\nFacebook\nTwitter\nEmail\nAbdallah Ougazzaden, director of Georgia Tech Lorraine in Metz, France and Chris Bishop, a researcher at Institut Lafayette, example a sample being processed in a lab at Georgia Tech Lorraine. (Credit: Rob Felt, Georgia Tech).\nNov 09, 2017\n— Atlanta, GA\nA transfer technique based on thin sacrificial layers of boron nitride could allow high-performance gallium nitride gas sensors to be grown on sapphire substrates and then transferred to metallic or flexible polymer support materials. The technique could facilitate the production of low-cost wearable, mobile and disposable sensing devices for a wide range of environmental applications.\nTransferring the gallium nitride sensors to metallic foils and flexible polymers doubles their sensitivity to nitrogen dioxide gas, and boosts response time by a factor of six. The simple production steps, based on metal organic vapor phase epitaxy (MOVPE), could also lower the cost of producing the sensors and other optoelectronic devices.\nSensors produced with the new process can detect ammonia at parts-per-billion levels and differentiate between nitrogen-containing gases. The gas sensor fabrication technique was reported November 9 in the journal\nScientific Reports .\n“Mechanically, we just peel the devices off the substrate, like peeling the layers of an onion,” explained\nAbdallah Ougazzaden , director of Georgia Tech Lorraine in Metz, France and a professor in Georgia Tech’s\nSchool of Electrical and Computer Engineering\n(ECE). “We can put the layer on another support that could be flexible, metallic or plastic. This technique really opens up a lot of opportunity for new functionality, new devices – and commercializing them.”\nThe researchers begin the process by growing monolayers of boron nitride on two-inch sapphire wafers using an MOVPE process at approximately 1,300 degrees Celsius. The boron nitride surface coating is only a few nanometers thick, and produces crystalline structures that have strong planar surface connections, but weak vertical connections.\nAluminum gallium nitride (AlGaN/GaN) devices are then grown atop the monolayers at a temperature of about 1,100 degrees Celsius, also using an MOVPE process. Because of the boron nitride crystalline properties, the devices are attached to the substrate only by weak Van der Waals forces, which can be overcome mechanically. The devices can be transferred to other substrates without inducing cracks or other defects. The sapphire wafers can be reused for additional device growth.\n“This approach for engineering GaN-based sensors is a key step in the pathway towards economically viable, flexible sensors with improved performances that could be integrated into wearable applications,” the authors wrote in their paper.\nSo far, the researchers have transferred the sensors to copper foil, aluminum foil and polymeric materials. In operation, the devices can differentiate between nitrogen oxide, nitrogen dioxide, and ammonia. Because the devices are approximately 100 by 100 microns, sensors for multiple gases can be produced on a single integrated device.\n“Not only can we differentiate between these gases, but because the sensor is very small, we can detect them all at the same time with an array of sensors,” said Ougazzaden, who expects that the devices could be modified to also detect ozone, carbon dioxide and other gases.\nThe gallium nitride sensors could have a wide range of applications from industry to vehicle engines – and for wearable sensing devices. The devices are attractive because of their advantageous materials properties, which include high thermal and chemical stability.\n“The devices are small and flexible, which will allow us to put them onto many different types of support,” said Ougazzaden, who also directs the International Joint Research Lab at Georgia Tech CNRS.\nTo assess the effects of transferring the devices to a different substrate, the researchers measured device performance on the original sapphire wafer and compared that to performance on the new metallic and polymer substrates. They were surprised to see a doubling of the sensor sensitivity and a six-fold increase in response time, changes beyond what could be expected by a simple thermal change in the devices.\n“Not only can we have flexibility in the substrate, but we can also improve the performance of the devices just by moving them to a different support with appropriate properties,” he said. “Properties of the substrate alone makes the different in the performance.”\nIn future work, the researchers hope to boost the quality of the devices and demonstrate other sensing applications. “One of the challenges ahead is to improve the quality of the materials so we can extend this to other applications that are very sensitive to the substrates, such as high-performance electronics.”\nThe Georgia Tech researchers have previously used a similar technique to produce light-emitting diodes and ultraviolet detectors that were transferred to different substrates, and they believe the process could also be used to produce high-power electronics. For those applications, transferring the devices from sapphire to substrates with better thermal conductivity could provide a significant advantage in device operation.\nOugazzaden and his research team have been working on boron-based semiconductors since 2005. Their work has attracted visits from several industrial companies interested in exploring the technology, he said.\n“I am very excited and lucky to work on such hot topic and top-notch technology at GT-Lorraine,” said Taha Ayari, a Ph.D. student in the Georgia Tech School of ECE and the paper’s first author.\nIn addition to Ougazzaden, the research team includes Georgia Tech Ph.D. students Taha Ayari, Matthew Jordan, Xin Li and Saiful Alam; Chris Bishop and Youssef ElGmili, researchers at Institut Lafayette; Suresh Sundaram, a researcher at Georgia Tech Lorraine; Gilles Patriarche, a researcher at the Centre de Nanosciences et de Nanotechnologies (C2N) at CNRS; Paul Voss, an associate professor in the Georgia Tech School of ECE; and Jean Paul Salvestrini, a professor at Georgia Tech Lorraine and adjunct professor in the Georgia Tech School of ECE.\nThe research was supported by ANR (Agence Nationale de Recherche), the National Agency of Research in France through the “GANEX” Project.\nCITATION : Taha Ayari, et al., “Gas sensors boosted by two-dimensional h-BN enabled transfer on thin substrate foils: towards wearable and portable applications,” (Scientific Reports, 2017). http://dx.doi.org/10.1038/s41598-017-15065-6\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contacts : John Toon (404-894-6986) (jtoon@gatech.edu).\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}