{"text": "Mycorrhizal Types Control Biodiversity Effects on Productivity | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nMycorrhizal Types Control Biodiversity Effects on Productivity\nAn international, collaborative team of researchers shed light on how fungi and plant roots work together to gather nutrients — and how the diversity of plant species may impact the process.\nFacebook\nTwitter\nEmail\nFungi growing on plants in a forest\nFeb 23, 2023\n— Atlanta, GA\nThis news release first appeared in the\nChinese Academy of Sciences  newsroom, and has been tailored for Georgia Tech readers.\nMycorrhizal symbiosis — a symbiotic relationship that can exist between fungi and plant roots — helps plants expand their root surface area, giving plants greater access to nutrients and water. Although the first and foremost role of mycorrhizal symbiosis is to facilitate plant nutrition, scientists have not been clear how mycorrhizal types mediate the nutrient acquisition and interactions of coexisting trees in forests.\nTo investigate this crucial relationship,  Lingli Liu , a professor at the Institute of Botany of the Chinese Academy of Sciences (IBCAS) led an international, collaborative team, which included  School of Biological Sciences professor  Lin Jiang . The team studied nutrient acquisition strategies of arbuscular mycorrhizae (AM) and ectomycorrhizal (EcM) trees in the Biodiversity–Ecosystem Functioning (BEF) experiment in a subtropical forest in China, where trees of the two mycorrhizal types were initially evenly planted in mixtures of two, four, eight, or 16 tree species.\nThe researchers found that as the diversity of species increased, the net primary production (NPP) of EcM trees rapidly decreased, but the NPP of AM trees progressively increased, leading to the sheer dominance (>90%) of AM trees in the highest diversity treatment.\nThe team's analyses further revealed that differences in mycorrhizal nutrient-acquisition strategies, both nutrient acquisition from soil and nutrient resorption within the plant, contribute to the competitive edge of AM trees over EcM ones.\nIn addition, analysis of soil microbial communities showed that EcM-tree monocultures have a high abundance of symbiotic fungi, whereas AM-tree monocultures were dominated by saprotrophic and pathogenic fungi.\nAccording to the researchers, as tree richness increased, shifts in microbial communities, particularly a decrease in the relative abundance of Agaricomycetes (mainly EcM fungi), corresponded with a decrease in the NPP of EcM subcommunities, but had a relatively small impact on the NPP of AM subcommunities.\nThese findings suggest that more efficient nutrient-acquisition strategies, rather than microbial-mediated negative plant-soil feedback, drive the dominance of AM trees in high-diversity ecosystems.\nThis study, based on the world’s largest forest BEF experiment, provides novel data and an alternative mechanism for explaining why and how AM trees usually dominate in high-diversity subtropical forests.\nThese findings also have practical implications for species selection in tropical and subtropical reforestation—suggesting it is preferable to plant mixed AM trees, as they have a more efficient nutrient-acquisition strategy than EcM trees.\nThis study was published as an online cover article in  Sciences Advances  on Jan. 19 and was funded by the Strategic Priority Research Program of CAS and the National Natural Science Foundation of China.\nAdditional Images\nRelated links\nTree mycorrhizal association types control biodiversity-productivity relationsh…\nCenter for Teaching and Learning Recognizes Sciences Faculty for Educational Ex…\nContact\nGeorgia Tech Editor:\nAudra Davidson\nCommunications Officer II\nCollege of Sciences\nEmail\njess@cos.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}