{"text": "Entering the Strange World of Ultra-Cold Chemistry | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nEntering the Strange World of Ultra-Cold Chemistry\nGeorgia Tech has received a grant from the U.S. Air Force Office of Scientific Research to study the unusual chemical and physical properties of atoms and molecules at ultra-cold temperatures.\nFacebook\nTwitter\nEmail\nImage shows results from massive parallel computer quantum simulations of two and three ultra-cold fermionic atoms trapped in a double well confinement and interacting via strong replusive and attractive contact interactions, showing formation of entangled states and highly correlated Wigner molecules. See additional figure description. (Credit: Georgia Tech Center for Computational Materials Science)\nOct 29, 2015\n— Atlanta, GA\nResearchers at the Georgia Institute of Technology have received a $900,000 grant from the U.S. Air Force Office of Scientific Research (AFOSR) to study the unusual chemical and physical properties of atoms and molecules at ultra-cold temperatures approaching absolute zero – the temperature at which all thermal activity stops. Developing and employing advanced computational methodologies, they will explore the formation of novel types of molecular aggregates at these extreme conditions, where quantum mechanical principles govern and dramatically alter the ways that atoms and molecules interact. The work could help provide a better understanding of the reaction processes underlying strongly correlated atoms and molecular quantum systems in conditions unlike those seen in conventional chemistry. “Bringing atoms together to make a new material is the basis of chemistry, but here we are synthesizing new materials through quantum mechanical forces,” said\nUzi Landman , a Regent’s and Institute Professor and Callaway Chair Professor in the Georgia Tech\nSchool of Physics . “We expect to help lay the foundation for a new theory describing the chemistry of ultra-cold atoms. To do this, we will develop a different type of computational theory.” Absolute zero is the temperature at which all thermal activity stops. The researchers will be studying matter at ultra-cold temperatures, which are in the micro-kelvin or nano-kelvin ranges closely approaching that level. At these extremely low temperatures, atoms and molecules move much more slowly and have different kinds of interactions. These atoms and molecules interact via their wave nature, with interference between waves either destroying or amplifying one another. At these ultra-cold temperatures, the wave nature of matter also changes. For instance, the size of the de Broglie wavelength is inversely proportional to the square of the temperature, meaning wavelengths become larger as the temperature drops. “The wavelength of a particle, say a lithium atom, taken from room temperature to one nano-kelvin, grows by a factor of about 600,000, from about 0.04 nanometers at room temperature to 24,000 nanometers (24 microns) at the lower temperature – which is a very dramatic change,” Landman explained. In conventional chemistry, activation barriers must be overcome before atoms can exchange electrons to bind together. Because they have so little energy at ultra-cold temperatures, atoms cannot overcome this activation barrier, meaning interactions must occur through other mechanisms – including quantum tunneling effects. And at these conditions, quantum mechanical effects become more pronounced, with the long-distance entanglement of atoms affecting the physical and chemical states of the matter. “These are pure and deep quantum mechanical objects, and they exist only at these low temperatures because the wave effect takes over,” noted Landman, who is also director of the Georgia Tech Center for Computational Materials Science (CCMS). At Georgia Tech, Landman’s group will study first the activity of small numbers of atoms and molecules – a phenomenon that CCMS Senior Research Scientist Constantine Yannouleas calls “few-body interactions.” The calculations will begin with just two atoms and build into larger groups of atoms and molecules. “One of the things that is most interesting to us is how smaller systems combine to make larger systems,” Landman added. “We will study this from the bottom up.” The ultra-cold temperatures will allow study of synthetic solids created by the formation of optical lattices that control the location of atoms at ultra-cold temperatures. Over the past two decades, scientists have learned to trap neutral atoms by lowering their temperature and building optical structures from laser beams to capture these slow-moving atoms. By constructing layers of atoms held together in this way, scientists can create synthetic solids that are unlike any materials that can be created at conventional chemical reaction temperatures. “Instead of chemical bonds, what holds them together are photons of light from the laser beams,” Landman noted. In conventional systems, thermal noise acts as a veil to prevent direct study of certain phenomena. By nearly eliminating thermal energy at these ultra-cold temperatures, researchers will be able to study interactions without these complicating effects. Landman’s research group has been studying for over three decades the interactions of matter using advanced computational techniques. In this new research, those techniques often complement experimental work, enabling an iterative process that more rapidly leads to results. Studying matter in these extreme conditions will require new computational techniques. “We can apply these methodologies of ultra-cold atom simulations to solve problems that we cannot solve otherwise,” said Landman. “We will attempt to revolutionize the ability to compute things that aren’t computable at this point. Experiments with ultra-cold atoms emulate an analog-simulator mapping onto the requisite microscopic Hamiltonian, approaching realization of Richard Feynman’s vision of quantum simulators that ‘will do exactly the same as nature.’ In our work, we develop and implement exact benchmark computational microscopy solutions of the system Hamiltonian, uncovering the spectral evolution, wave function anatomy, and entanglement properties of the interacting fermions in the entire system parameter range. In this way we may address some outstanding problem, like high-temperature superconductivity, quantum magnetism, highly correlated quantum systems, and chemistry at the ultra-cold extreme,” he added. All of this makes for exciting new science that is being explored both experimentally and theoretically at nearly a dozen laboratories around the world. Landman and Yannouleas hope to use the strong background and expertise of the CCMS in computational physics and materials science to make contributions to the computational techniques and modeling used to study these effects. “The reason this is so exciting is that it will push our ability to calculate interactions a notch farther, advancing beyond what’s known right now,” Landman said. “We’re especially interested in entanglement of atoms, which Einstein called ‘spooky action at a distance.’ The higher the degree of entanglement we have, the more robust the system is and the more certain we can be of the results. This is likely to be of importance for future progress in the areas of quantum information and computations.” The CCMS recently published a paper on this topic, “Double-Well Ultra-cold Fermions Computational Microscopy: Wave-Function Anatomy of Attractive Pairing and Wigner-Molecule Entanglement and Natural Orbitals.” The paper was co-authored by graduate student Benedikt Brandt, Yannouleas, and Landman. CITATION : B.B. Brandt, C. Yannouleas, U. Landman, “Double-Well Ultra-cold-Fermions Computational Microscopy: Wave-Function Anatomy of Attractive Pairing and Wigner Molecule Entanglement and Natural Orbitals.” Nano Letters 15, 7105?7111 (2015). Research News Georgia Institute of Technology 177 North Avenue Atlanta, Georgia 30332-0181 USA Media Relations Contact : John Toon ( jtoon@gatech.edu ) (404-894-6986) Figure 1 Description : In this figure, we show results obtained for two and three ultra-cold fermionic atoms (Li) trapped in a double-well (2000 nanometer). Each quadrant of the figure shows the ground (below) and first excited (above) states. In the upper left and lower right of the figure we display illustrative configurations for two ultra-cold atoms in a symmetric double well (blue), and in the lower left and upper right we display examples of three particle configurations in a tilted double well (purple). The atoms are depicted by yellow and red balls, with corresponding down and up spins (up/down-pointing black arrows). The calculated total atom densities are shown in green.  The atomic configuration in the ground state of the strong attraction regime favors maximum overlap of the wave functions (lower plot in the top left and bottom left quadrants), whereas the atom configuration in the ground state of the strong repulsion regime favors a separation of the atoms into different wells (lower plot in the top right and bottom right quadrant). Left-right symmetry of the solutions for the two-atom system reflects the symmetry of the double well confinement (blue) for this system. Furthermore, higher energy, excited states where all particles are located on the same side of the double well confinement, exhibit double-humped atomic densities for the two-atom system (blue), and triple-humped densities for the case of the three particles one (purple). These states are present even in the case of infinite interatomic repulsion and form in this regime the so-called Wigner Molecules (see upper states in the very strong repulsion regime of both the two and three atom systems.) These highly correlated states are also found for very strong attraction, a regime in which they are known as Super Tonks states. Such strongly correlated states, are of significant theoretical and experimental interest and a better understanding of their properties is likely to lead to the development of future applications in quantum information and computation, quantum magnetism and advances in ultra-cold chemistry. Figure 2 Description : The two diagrams on the right serve to illustrate the concept and different modes of entanglement (three-atom entanglement, in particular). The diagram at the top displays the coat of arm of the Borromean family, owners of the Borromean islands on Lake Maggiore in northern Italy. The rings express the idea of ‘united we stand, divided we fall’ – indeed, the rings are entangled with each other, in a manner that if one of the rings gets broken, the other two will not remain linked as well. On the other hand in the case of the Hopf rings, the three rings are entangled in a way that if one of the rings is broken the other two remain interlocked. These diagrams point to connections between quantum mechanical entangled states and topological characteristics of knots. The physical phenomenon of quantum entanglement occurs when groups of two or more particles (for example: photons, electrons, atoms) are prepared or interact in ways such that the quantum state of each individual particle cannot be described independently. Instead, in the entangled state the quantum state may be given for the system as a whole; mathematically, such states cannot be expressed as the product of the states of the individual constituents of the system. A two-atom maximally entangled state (called a Bell state after the Irish physicist John S. Bell who described it first in the 1960s) is shown as a superposition of two states in the first row; the total density distribution of the atoms is shown in green, and atoms with up and down spins (white arrows) are depicted by the red and yellow balls, respectively. In the second row we display a N00N [here (20-02)] state, where in each of the four superposed configurations, the two atoms are either in the left or right potential well, with the strong repulsive interatomic interaction bringing about formation of a Wigner molecule in each of the four configurations; the 2-atom Wigner molecule corresponds to the two-humped density distribution (green); pairs of Wigner molecule configurations form Bell states. Such entangled states are of importance in quantum information. A three-atom entangled state (named a W-state) is shown in the bottom row; here too the strong repulsive interatomic contact interaction leads to formation a 3-atom Wigner molecule.\nAdditional Images\nContact\nJohn Toon Research News jtoon@gatech.edu (404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}