{"text": "What's Behind the Construction Fences | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nWhat's Behind the Construction Fences\nThe progress of campus construction keeps a steady pace year-round.\nFacebook\nTwitter\nEmail\nArtist rendering (subject to change) of the new residence hall planned for the west side of campus along Northside Drive.\nFeb 26, 2024\nWith the recent publication of the\nComprehensive Campus Plan , the possibilities for the evolution of the Georgia Tech campus over the next 10 years are coming into focus.\nSeveral projects with more immediate impact are underway, such as new construction, building renovations, critical campus infrastructure improvements, and exterior installations. As the campus evolves, here’s the latest on what’s behind the construction fences and on the design tables.\nRecently Completed\nGeorgia Tech Veterans Walk of Honor\nThis\ntribute project , located outside the Veterans Resource Center, honors Georgia Tech alumni, students, and staff who have served in the U.S. armed forces. The space was dedicated in a ceremony on Jan. 10.\nNational Pan-Hellenic Council – Divine Nine Plaza\nThe Divine Nine are the nine historically Black fraternities and sororities that comprise the National Pan-Hellenic Council. A\nplaza area\nwith nine distinct circular gathering spaces is located adjacent to the John Lewis Student Center parking deck.\nSoon to Wrap Up\nScience Square\nLocated just off North Avenue near Northside Drive, Phase 1 of Science Square features a 13-story tower with clean rooms, labs, offices, and research space, as well as the Grace Residences, which include 500 residential units and ground floor retail space. BioSpark Labs, also located in Science Square, are fully furnished and available for lease. A ribbon-cutting celebration for this 18-acre biomedical research and technology community is scheduled for April. Learn more about\nScience Square\nand\nBioSparks Labs .\nIn Progress\nAdministrative Services Center Parking Lot Closure\nAs a result of the construction activities related to the\nCampus Connectivity Plan , HR services provided by the Administrative Services Center are temporarily moving from 500 Tech Parkway across the street to 755 Marietta Street. The parking lot at 500 Tech Parkway is closed until June. Visitor parking is available in the 755 Marietta Street parking lot. For any questions, please call the ASC customer service team at 404.385.1111.\nLearn more .\nAerospace Engineering Aircraft Hangar\nThe Aircraft Hangar is located in the North Avenue Research Area. It will serve as a facility to design, assemble, and house small aircraft for research in the Daniel Guggenheim School of Aerospace Engineering. The hangar will be approximately 10,000 square feet and feature a high bay with a mezzanine level. Site work is scheduled for March, with an expected completion date of mid-2025.\nD.M. Smith Building Renewal\nRenovations include upgrades to the building’s infrastructure, including strengthening compliance with the Americans With Disabilities Act by creating wheelchair access and adding an elevator, and new mechanical, electrical, and plumbing systems. A virtual lab and hoteling space will be created for the School of Public Policy. Interior demolition and abatement are underway, with the project targeting a high LEED certification. In support of our campus climate goals, electrification plans are in place, and the renovated building will no longer rely on steam from the central plant for daily operation. Renovations should be complete by mid-2025.\nEast Campus Streetscape\nRenovation of sidewalks and roadways on the east side of campus is underway to improve pedestrian and micromobility (lightweight, single-person vehicles such as bicycles, scooters, and skateboards) access while supporting the Institute’s safety, connectivity, and carbon neutrality goals. Improvements to sidewalks, bicycle infrastructure, and lighting will align with paving, new curbing, and reconfigured access to Peters Parking Deck for alternative-mode routes. All updates will cohesively coordinate with the campus bus systems. Phase 1, addressing Fourth Street, Brittain Drive, and areas adjacent to Peters, is complete. Phase 2a is underway, encompassing the areas near the Third Street tunnel and adjacent sections of Techwood Drive. The project is expected to be complete by the end of 2024.\nRead more\nhere .\nFerst Drive Realignment and Cycle Track\nThis realignment, safety, and connectivity project will provide bicycle infrastructure and safety improvements via separation of bikes, pedestrians, vehicles, and buses at the bus stops. Phase 1 of the cycle track installation is underway along Ferst Drive near the CRC field to Atlantic Drive. Phase 2 will include installation of the cycle track from Atlantic Drive through Fowler Street. This project will also eventually address the realignment of Ferst Drive at Regents Drive, which will eliminate the traffic signal and enable connectivity to the planned bicycle infrastructure southwest of campus. The project is slated for completion by early 2025.\nRead more here .\nInfrastructure Improvements for Campus Chilled Water System\nThe chilled water distribution system is responsible for indoor air cooling and has served the campus well for many years. Current system improvements include the replacement or installation of isolation valves, which will allow problem areas to be easily repaired with less interruption of service to the entire system.\nThe first phase of improvements occurred during winter break and reached completion ahead of schedule. Currently, teams from Infrastructure and Sustainability and the Office of Emergency Management are working with building managers to prepare for the next planned outage, scheduled to occur during spring break.\nThomas A. Fanning Student-Athlete Performance Center\nThe 100,000-square-foot facility will be built in the footprint of the current Edge Center in the northeast corner of Bobby Dodd Stadium. The Fanning Center will feature strength and conditioning space, nutrition areas, sports medicine offices, ticket sales, dining, and academic support space, as well as state-of-the art sport science and analytics spaces and balcony views of Midtown Atlanta. The project is in the early stages of permitting and site work, with Techwood Drive lane closures beginning soon. Project completion is scheduled for early 2026.\nRead more here .\nTech Square Phase 3\nThis final phase of Tech Square will include 415,000 square feet of academic and research space within two high-rise towers. The 14-story Scheller Tower will house the MBA and Executive Education programs for the Scheller College of Business and is named in recognition of the philanthropic commitment of Roberta and Ernest Scheller Jr., IM 1952, HON Ph.D. 2013. The 18-story George Tower, named to recognize Penny and Bill George, IE 1964, HON Ph.D. 2008, for their support for the facility, will be the new home for the H. Milton Stewart School of Industrial and Systems Engineering. A large plaza and retail space are planned for the street level. Ground and utilities work are underway, with a projected occupancy date of early 2026.\nRead more here .\nCelebrating Women at Georgia Tech\nLocated in the heart of campus near the John Lewis Student Center, this installation will celebrate the history of women at Georgia Tech, including staff, faculty, and alumnae. It honors women’s accomplishments and contributions to the Institute and to a wide range of fields in which they have made an impact. It will also allow space for reflection and contemplation. The project has broken ground and construction fencing has been installed, and it is scheduled for completion in October 2024.\nOn the Horizon\nArts Square\nArts Square, an adaptive reuse project planned for the site of the former Randall Brothers buildings, will be a destination space designed to explore the intersection of art and technology. Supporting education, research, and culture, Arts Square will help Georgia Tech engage with Georgia's multibillion-dollar creative media industries. Programming and feasibility studies are underway to explore the best use of these 7.5 acres along Marietta Street.\nNew Residence Hall\nThe first new residence hall on campus since 2005, this new facility for first-year students will be on the west side of campus along Northside Drive between Eighth and Ninth streets. The 191,000-square-foot building will contain approximately 860 beds with rooms configured for double occupancy and the flexibility to customize or rearrange the in-room furniture layout. Each bedroom will have individualized climate control. Student support areas will include collaborative learning spaces, community lounges, and group kitchens. Completion is slated for August 2026.\nRead more here.\nHowell and Smith Residence Halls Renovation\nHowell and Smith residence halls will be renovated to meet current housing needs and expectations. Plans are to update building systems as well as interior spaces. A new connecting structure will join the two halls, creating a central entry point. Improvements also include additional study spaces and student gathering areas.\nWestside Community Connector Pedestrian Bridge\nA pedestrian and micromobility bridge, envisioned by\nGeorgia Tech students in a joint Civil and Architecture design studio , will cross the CSX and Norfolk Southern freight rail corridor to connect the heart of campus with Science Square, Arts Square, Westside communities, and the recently completed Westside Connector of the Atlanta BeltLine. Concept design will begin this summer. Pending full funding and successful coordination with district partners, construction could start as early as 2026.\nAdditional Media\nArtist rendering (subject to change) of the Student Athlete Performance Center.\nRelated links\nInfrastructure and Sustainability\nContact\nCathy Brim\nCommunications Officer II\nInfrastructure and Sustainability\nEmail\ncathy.brim@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}