{"text": "Filtration Engineers Offer Advice on Do-It-Yourself Face Masks | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nFiltration Engineers Offer Advice on Do-It-Yourself Face Masks\nA new website has been launched to share information and recommendations about creating your own face masks.\nFacebook\nTwitter\nEmail\nCoping with COVID-19\nApr 06, 2020\n— Atlanta, GA\nThe continuing shortage of face masks and new recommendations on their use by the general public have led many individuals and organizations to make their own masks using available materials. While homemade protection as simple as scarves and bandanas can be helpful, there are ways to optimize the benefit of do-it-yourself personal protective equipment (PPE).\n“Our expectation is that frontline healthcare workers interacting with COVID-19 patients will use certified PPE,” said\nRyan Lively , an associate professor in Georgia Tech’s\nSchool of Chemical and Biomolecular Engineering . “But for situations that don’t involve intimate and prolonged interactions with COVID-19 infected individuals, we believe that DIY cloth face masks combined with proper social distancing etiquette will help slow the spread of this virus.”\nWhile the underlying physics of filtration are complicated, Lively and colleagues believe that two or more layers of a tightly woven, knitted, or nonwoven fabric can provide at least a partial barrier to virus-containing droplets, which combined with social distancing, can reduce the likelihood of virus transmission.\n“Equally, important though, is the way that users fit, wear, handle, and remove the face mask,” said\nMark Losego , an assistant professor in Georgia Tech’s\nSchool of Materials Science and Engineering . “Because the mask will be touching your face, it and your hands should be clean before putting it on. The mask should be snug but not uncomfortable.”\nGaps around the nose and chin should be minimized. Once wearing the mask, you should avoid touching or moving the mask; don’t pull the mask down to cough or sneeze! The mask is expected to capture germs, so it should be removed by touching only the straps; otherwise, you will contaminate your hands.\nEqually important to blocking virus-containing droplets is that the mask materials be breathable and non-hazardous for inhalation. “For example, there is some danger of glass fibers within HEPA or MERV filters being inhaled if appropriate blocking layers are not included,” said Lively. “Most apparel or home goods textiles are safe. However, if you smell a chemical odor from the material, you should probably avoid using it for a mask.”\nUpon returning home from an errand, the mask should be discarded or thrown in the clothes washer and cleaned before being used again.  If the fabric mask does get wet from another individual’s cough or sneeze, the mask should be removed quickly at a safe distance. The team recommends reviewing both the World Health Organization (WHO)\nlink\nand Centers for Disease Control and Prevention (CDC)  guidelines\nfor mask wearing.\nA new website ( www.research.gatech.edu/rapid-response ) has been created to bring together recommendations and templates for making face masks. The website provides guidance for making unsewn, sewn, glued, or 3D-printed face masks.\nThe recommendations resulted from consulting with a team of experts in materials, chemical and mechanical engineering, filtration processes, and production design. “We have also interacted with relevant stakeholders, including hospitals and manufacturers, and studied the peer-reviewed literature to make recommendations based on scientific evidence,” said Lively.\nOn the website, the researchers suggest alternatives for materials that are in short supply. For instance, high-performance HEPA furnace filters can be used with 3D printed masks to create a respirator, provided the HEPA filters are installed in between two blocking layers of nonwoven fabric. Reusable polypropylene grocery bags without a shiny film can be used as the droplet-repelling outer shell of the masks.\nThe new website includes directions, recommendations, files for 3D printers and more. The team is actively testing fabric materials to provide more specific recommendations for which fabrics to use and which to avoid. A rudimentary DIY test using a water spray bottle is described to make an initial assessment of how suitable a fabric is for a mask.\nMasks produced or tested with directions from the site do not meet the standards of federal agencies such as NIOSH, OSHA or the FDA.\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : John Toon (404-894-6986) (jtoon@gatech.edu)\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}