{"text": "Will Caitlin Clark's Star Power Raise WNBA Salaries?  | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nWill Caitlin Clark's Star Power Raise WNBA Salaries?\nAs Caitlin Clark becomes a household name, she elevates a question WNBA players, fans, and advocates have asked for decades: why is there such a significant pay disparity between men's and women's basketball?\nFacebook\nTwitter\nEmail\nApr 25, 2024\nThe 2024 women's basketball NCAA tournament championship game boasted more viewers than the men's final for the first time in history. Yet, NCAA star Caitlin Clark will earn an average of only $84,000 a year as the number one WNBA draft pick this summer. In contrast, the number one pick in last year's NBA draft, Victor Wembanyama, is earning about $13 million per year.   As Clark becomes a household name, she elevates a question WNBA players, fans, and advocates have asked for decades: why is there such a significant pay disparity between men's and women's basketball?  Mary McDonald,\na professor of sociology and Homer C. Rice Chair of Sports and Society in the\nSchool of History and Sociology , explains how racism, sexism, cultural narratives, and under-investment all have helped perpetuate the long-standing wage gap between the NBA and WNBA. She also discusses how a confluence of changes, including Clark's star power and a new bargaining agreement in 2025, may affect it.  WNBA Players Earn Less Than 1% of Their Male Counterparts  McDonald begins with a statistic: while women across all occupations make roughly 84 cents on the dollar compared to men, Black women make only 64 cents when compared to white men.   \"This racialized gendered devaluing of labor is important to highlight given the WNBA's predominantly Black playing force,\" McDonald says. In sports, the wage gap is even more pronounced, she says, pointing to estimates from economist David Berri that WNBA players earn less than 1% of what NBA players make.   \"There is much more at play than simple market economics,\" she says. \"A legacy of exclusion, a complicit sports media, and differing levels of investment by NBA owners have disadvantaged the women's game and ability to earn a fair wage.\"  Anticipated Changes in 2025  WNBA players like WNBA Player’s Association President Nneka Ogwumike of the Seattle Storm have not only argued the need to build the basketball-related revenue pie but also to provide WNBA players with a larger percentage of the resulting revenue, McDonald explains. The NBA founded the WNBA in 1997 and still owns 42% of the league. However, NBA players receive 50% of the NBA basketball-related revenue while WNBA players receive only an estimated 10% of the WNBA pot.   But this may change in 2025 when the current WNBA collective bargaining agreement expires and the players negotiate a new contract, McDonald says. Importantly, this is also when the WNBA's current TV rights deal expires, she adds. Based upon their long-standing advocacy, the players will likely continue to ask for what NBA players receive in the form of 50% of the basketball-related revenues from both the teams and the league.   \"Receiving 50% of total basketball revenue would greatly elevate player salaries. Before scaling for rookie and veteran salary differences, this translates into an average of over $500,000 per player per year. And this is based on 2022 figures — the pot of money available in 2025 will likely be much larger, especially with a new TV deal on the horizon,\" McDonald says. “The open question is: Will WNBA owners realize the opportunity they have to grow the league and the game by investing in player salaries and improving travel and working conditions?”   Caitlin Clark, ESPN, and Social Media  Although basketball experts have long known about Clark, \"her national exposure during Iowa's 2022-23 national championship runner-up season last year certainly elevated her status, cultural visibility, and marketability,\" McDonald says.   Clark's rise occurred at the same time as two other important factors: ESPN increasing coverage and promotion of the Women's NCAA tournament and players' ability to use social media to bypass the legacy media gatekeepers and narrate their own \"fresh and appealing\" storylines, McDonald says. Both of these factors have generated greater interest in women's sports.   \"Clark's celebrity has helped to generate new public interest in the pay of WNBA players, as did the 2022 detainment of Phoenix Mercury player Brittany Griner in a Russian prison for nearly ten months,\" McDonald says. \"That story had people questioning why stars like Griner have to play overseas in the offseason to earn greater salaries than they receive in the WNBA.\"  The Takeaway  Clark is entering the WNBA in a period of league expansion and increased media attention. As revenues expand and WNBA players continue their work to gain more leverage in the next round of collective bargaining, McDonald anticipates compensation increases for WNBA players in the coming years.   \"The new TV contract in 2025 — which will likely exceed $100 million compared to the existing $65 million deal — will provide greater exposure for the league and its players,\" McDonald explains. \"This, in addition to public pressure generated by WNBA players' advocacy — now including Clark's advocacy — and social media activism, all bolster the push for what WNBA players have desired and fought for since the league's inception: better marketing, more media exposure, higher salaries, and improved working conditions.\"  McDonald has\npublished extensively\non the intersection of sports and gender and is currently writing a book on the WNBA tentatively titled\n'We Got Next': The Affective Politics of the WNBA.\nLearn more in\nher faculty profile\nor our\nMarch Madness Q&A with McDonald\nin 2022.\nContact\nDi Minardi Ivan Allen College of Liberal Arts\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}