{"text": "As 'Flesh-Eating' Leishmania Come Closer, a Vaccine Against Them Does, Too | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nAs 'Flesh-Eating' Leishmania Come Closer, a Vaccine Against Them Does, Too\nA potentially deadly parasite that can ulcerate skin, nose, mouth and organs could someday meet its match in an experimental vaccine that has now worked in lab tests on humanized mice.\nFacebook\nTwitter\nEmail\nThere are some 30 species of Leishmania parasites, which take on two different forms in their life cycle. Illustrated here are promastigotes (top) and amastigotes (bottom) with a typical boil caused by a leishmaniasis infection. Rights: iStock / Getty / purchased / not transferable\nSep 13, 2017\n— Atlanta, GA\nParasites that ulcerate the skin, can disfigure the face, and can fatally mutilate internal organs are creeping closer to the southern edges of the United States.\nNo vaccine is available against  Leishmania  yet, but researchers have now come closer to changing that. A new experimental vaccine, made with a proprietary biological particle developed at the Georgia Institute of Technology, has immunized laboratory mice that were genetically altered to mimic the human immune system.\nThe vaccine exploits a weakness in\nLeishmania ’s tricky chemical camouflage, which normally hides it from the victim’s disease-fighting cells, to trigger\na forceful immune response against the parasite, according to a new study.\nSecond-deadliest parasite\nLeishmania\nare\nthe second-deadliest parasite s\nin the world, topped only by malaria, according to the World Health Organization. There are some 30 strains of\nLeishmania .\nThey are transmitted mainly through the bite of a\nphlebotomine sand fly , which feeds on blood, and global warming is expanding the insect’s potential habitat northward from Latin America. The outbreak regions closest to the United States of\nleishmaniasis, the disease caused by the parasite , have come within roughly 300 miles of the border.\nAs with many diseases, many people who contract\nLeishmania,\nthe parasite, may develop leishmaniasis, the disease, with varying symptoms, or perhaps even show no outward signs of the disease. But when it breaks out, it can cause large skin boils, and some forms severely eat away at the nose and lips, even removing parts of them.\nIf another form of the parasite gets into the bloodstream, it can damage the liver and spleen in a deadly form of the disease called visceral leishmaniasis, also known as black fever.\n“If you don’t treat it, within 20 to 40 days visceral leishmaniasis very often kills the victim,” said Alexandre Marques, a professor in the parasitology department of the Universidade Federal de Minas Gerais in Brazil, and one of the lead researchers on the new experimental vaccine. Conventional treatment, though mostly effective, can leave behind small numbers of the parasite, which can lead the patient to relapse or act as a carrier, in a similar manner as malaria.\nA vaccine could be better at halting or averting outbreaks.\nLong-awaited vaccine\nLeishmania , which are single-cell organisms about the size of large bacteria, have been a scourge in about 90 countries in South America, Africa, the Middle East, Asia and southern Europe. For decades, researchers have worked to find a vaccine against them and similar parasites without success.\n“In comparison to viruses and bacteria, these are much more complex organisms and more difficult to crack,” said M. G. Finn, who also led work on the new vaccine. Finn is a\nprofessor in Georgia Tech’s School of Biological Sciences\nand in\nthe School of Chemistry and Biochemistry, which he also chairs .\nThe new vaccine leverages intimate knowledge that Marques’s team has gained living and working on the edge of leishmaniasis outbreak regions. “Alex’s (Marques’s) students collect the sand flies, then they extract the parasites in the lab and do complex mass spectrometry and other tests to study their molecular makeup in impressive detail,” Finn said.\nThe team has uncovered minute details on the outer surface of\nLeishmania\nthat make it vulnerable to a human immune reaction. The potential new vaccine, invented at Georgia Tech, employs a fake virus as bait to attract major immune system forces to these weaknesses to attack them.\nThe fake virus, or virus-like particle, is not infectious, and the body destroys it after use. Finn’s lab has developed many variations of such particles in recent years, and other products containing it have already been through phase II human clinical trials.\nMarques and Finn\npublished the results of their vaccination development and testing on September 13, 2017, in the journal ACS Central Science.\nThe research was funded by the National Institutes of Health, Children’s Healthcare of Atlanta, and Brazil’s National Council for Scientific and Technological Development.\nLeishmaniasis vaccine Q & A\nHere are some questions and answers to help readers better understand how the vaccine would leverage\nLeishmania ’s chemical camouflage.\nWhat’s so tricky about\nLeishmania ’s chemical camouflage?\nThe parasites cover themselves in carbohydrates, which look like food and also cover all other cells in the body. So, to the body, the\nLeishmania\ncells look inoffensive, and the immune system mostly leaves them alone.\nWhat’s the chink in the camouflage?\nSome of those carbohydrates do actually trigger a mild human immune response. It’s not strong enough to really battle leishmaniasis, but it gives Marques and Finn’s vaccine a foot in the door.\nIt’s lucky that humans, and some other primates, have this particular immune reaction, because other mammals don’t, so this vaccine wouldn’t work on them. Incidentally, that’s why, to test the new vaccine, the laboratory mice have to be genetically altered to make their immune systems react to the carbohydrates the way ours does.\nHow does the fake virus work?\n“We use the virus-like particle to highlight a\nkey carbohydrate\non the surface of\nLeishmania\nclearly to the body. This coaxes its immune system into reacting strongly against it as a foreign structure,” Finn said.\nThe immune system goes after the fake virus like guard dogs after an invader. The researchers attach the odd carbohydrate to the fake virus, and that makes the immune system recognize that carbohydrate as a serious threat. Immune cells then hunt it down, and, in the process, destroy the parasite that produces it.\nWhen could a vaccine be on the market?\nIt’s too early to stoke hopes because a lot has to happen before any drug or vaccine can hit the market. But the researchers have some interesting arguments for moving on to human testing.\n“Normally, in medical testing, you would test next in rabbits or infected cats or dogs,” Finn said. “But they don’t have the right immune system. The only other possibilities are genetically altered pigs, or certain primates, or humans.”\nAs mentioned, the fake virus is a biological nanoparticle that has been tested in humans before without showing toxicity. Also, the researchers want to add some more kinds of\nLeishmania\ncamouflage carbohydrates to the fake virus to give the vaccine even more punch.\nIsn’t leishmaniasis limited to poverty regions with poor hygiene?\nAbsolutely not.\nIt can take hold anywhere people and animals live in high density and certain species of sand flies, and some other insects, can thrive. The insects like warmer weather, which is why climate change is causing the sand fly’s habitat to spread north.\n“People in developed countries in climates that were cooler will have to start caring about this, as global warming encourages this to spread to them,” Marques said.\nAnother potentially deadly\ninsect-borne tropical disease called Chagas disease\nhas already made it to three southern U.S. states, and the same researchers are working on a vaccine against it, too.\nHighly cited chemist\nM. G. Finn is a highly cited award-winning chemist. The\nThompson Reuters news agency included Finn in its 2013 predictions of possible winners of that year’s Nobel Prize in Chemistry . (That year’s prize went to different well-deserving researchers and their achievements.)\nFinn is most widely known for his research on click chemistry. A famous study in partnership with\nNobel Prize winning chemist Karl Barry Sharpless , and Harmuth Kolb, \" Click Chemistry: Diverse Chemical Function from a Few Good Reactions ,\" has been cited more than 10,000 times,\naccording to Google Scholar .\nFinn also holds the James A. Carlos Family Chair for Pediatric Technology at Georgia Tech.\nCo-authors of this study were Ana P. Venuto,\nLuiza C. B. Santos,\nCarlos Ramon Nascimento Brito,\nEdward Valencia,\nCaroline Junqueira,\nAdalberto A. P. Filho,\nMauricio R. V. Sant'Anna,\nNelder F. Gontijo,\nDaniella C. Bartholomeu,\nRicardo T. Fujiwara,\nRicardo T. Gazzinelli from the\nUniversidade Federal de Minas Gerais , and Craig S. McKay and Carlos A. Sanhueza from Georgia Tech. Funders of the research were: T he Conselho Nacional de\nDesenvolvimento Científico e Tecnológico (CNPQ) Brazil, the\nNational Institute of General Medical Sciences at the National Institutes of\nHealth ( grant number\nR01 GM101421), and\nChildren’s Healthcare of Atlanta.\nAny opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of those sponsors.\nAdditional Images\nContact\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : Ben Brumfield (404-660-1408)\nWriter : Ben Brumfield\nEmail\nben.brumfield@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}