{"text": "Yellow Jackets Featured in ‘Georgia Trend’ List of Influential Georgians | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nYellow Jackets Featured in ‘Georgia Trend’ List of Influential Georgians\nGeorgia Tech alumni are being recognized for work in their communities in Georgia Trend’s Most Influential Georgians for 2023.\nFacebook\nTwitter\nEmail\nGeorgia Trend 2023 Influential Georgians - Top row (from left to right): John Avery, Brian Blake, Ángel Cabrera, Lisa Cupid, Andre Dickens, Jimmy Etheredge. Bottom row: Tom Fanning, Paul Judge, Jerald Mitchell, Valerie Montgomery Rice, Raphael Bostic, James Quincey.\nJan 10, 2023\n— Atlanta, GA\nGeorgia Tech alumni are making a difference in their communities throughout the state, with former Yellow Jackets making up 10% of\nGeorgia Trend ’ s list of the 100 most influential Georgians for 2023.\nJohn Avery, EE 1986 – Director, Advanced Technology Development Center (ATDC)\nBlending his experience as a serial entrepreneur and a corporate executive, Avery — a Georgia Tech alumnus and holder of six patents — is now in his fourth year leading the state’s technology startup incubator, which serves entrepreneurs across Georgia through one-on-one coaching and provides access to resources and networking opportunities. Touting the innovation that occurs within ATDC, Avery has expressed his belief that it is the “center of gravity for this kind of activity anywhere in the Southeast.”\nBrian Blake, EE 1994 – President, Georgia State University\nBefore embarking on a 20-year career in higher education and becoming Georgia State’s first Black president in August 2021, Blake earned his bachelor’s degree at Georgia Tech. In addition to leading the university to new fundraising and research activity records in his first year, Blake implemented four pillars at Georgia State: research and innovation, student success, college to careers, and identity and placemaking.\nÁngel Cabrera, M.S. PSY 1993, Ph.D. PSY 1995 – President, Georgia Institute of Technology\nUnder Cabrera’s leadership, Georgia Tech continues to flourish as one of the premier research institutions in the nation, receiving $1.3 billion in annual research awards. Looking to the future, Cabrera unveiled a 10-year strategic plan in November 2020, followed by the launch of Transforming Tomorrow: The Campaign for Georgia Tech, with an emphasis on “developing leaders who advance technology and improve the human condition.”\nLisa Cupid, ME 2000 – Chair, Cobb County Board of Supervisors\nA member of the board since 2013, Cupid became the first female and first Black chair in 2021. With an “all-in” approach, Cupid continues to promote inclusion and equity for all Cobb County residents and was recently chosen by the National Association of Counties to chair its economic development subcommittee. In addition to her public service, Cupid is an attorney and previously worked as a manufacturing process engineer after earning her degree from Georgia Tech.\nAndre Dickens, ChE 1998 – Mayor, City of Atlanta\nIt’s been just over a year since Dickens was inaugurated as Atlanta’s 61st mayor at Bobby Dodd Stadium. In his first year in office, the Georgia Tech graduate laid the foundation for his term by unveiling a $750 million infrastructure plan. Dickens also continues to highlight affordable housing as a top priority, with a goal of delivering 20,000 units across the city by 2026.\nHear Dickens' May 2022 Georgia Tech Commencement speech.\nJimmy Etheredge, IE 1985 – CEO, Accenture North America\nServing as CEO of the global consulting firm's North American arm, Etheredge leads 80,000 employees. During his time in the role, he’s earned praise for reforming Accenture’s hiring practices — prioritizing skills, experience, and potential over educational background. Etheredge teamed with up Fox Sports' Emmanuel Acho to record the Change Conversations podcast focused on improving equity in the workplace.\nTom Fanning, IM 1979, M.S. IM 1980, HON Ph.D. 2013 – Chair and CEO, Southern Company\nAfter more than 35 years with Southern Company, it was recently announced that Fanning will hand the reins over to Georgia Power President Chris Womack at the end of March. Under Fanning’s direction, the company has added 4,000 megawatts of renewable energy in the past decade, including a 52% emissions reduction in 2020, while also taking on a leadership role in the nation’s nuclear initiative. The two-time Georgia Tech graduate has also served as chair of the Federal Reserve Bank of Atlanta.\nPaul Judge, M.S. CS 2001, Ph.D. CS 2002 – Managing Partner, Panoramic Ventures\nHaving co-founded and sold three companies, Judge is using his experience as a serial entrepreneur to assist others as a managing partner of the “largest tech venture fund headquartered in the Southeast.” With minority and women-led tech startups receiving just 3% of capital investment, according to Panoramic, the firm highlighted their emphasis on backing underrepresented founders when Judge joined in 2021 with a $300 million fund.\nHear Judge's May 2021 Georgia Tech Commencement speech.\nJerald Mitchell, MBA 2011 – President and CEO, Greater Columbus Chamber of Commerce\nHaving served as the vice president of economic development for Atlanta BeltLine Inc. during a period of exponential growth and job creation, Mitchell now leads the Greater Columbus Georgia Chamber of Commerce — the chamber’s first Black president — with the goal of attracting businesses to the area while improving local infrastructure. Mitchell also serves as the president of Leadership Georgia, a statewide leadership development program.\nValerie Montgomery Rice, Chem 1983 – President and Dean, Morehouse School of Medicine\nAs the first female president of the Morehouse School of Medicine, Rice has continued to advocate for equity in the medical field. In 2020, Rice led Morehouse into a historic 10-year, $100 million partnership with CommonSpirit Health to develop and train more Black physicians with a goal of 300 completing their residency each year.\nHear Rice's May 2018 Georgia Tech Commencement speech.\nHonorary Degrees:\nRaphael Bostic, HON Ph.D. 2022 – President and CEO, Federal Reserve Bank of Atlanta\nWhile leading the Federal Reserve Bank of Atlanta, Bostic has also played a vital role on the Federal Open Market Committee — the monetary policymaking body of the Federal Reserve System. In the community, Bostic served as the 2021–22 chair of the board of directors of the United Way of Greater Atlanta and the 2022 chair for the Metro Atlanta Chamber of Commerce.\nHear Bostic's May 2022 Georgia Tech Commencement speech.\nJames Quincey, HON Ph.D. 2020 – Chair and CEO, The Coca-Cola Company\nLeading the global powerhouse since 2017, Quincey has taken The Coca-Cola Company to new heights with $11.05 billion in revenue in the third quarter of the past fiscal year. The quarter also saw the company participate in World Water Week as it continues its commitment to addressing water challenges around the world.\nHear Quincey's December 2020 Georgia Tech Commencement speech.\nAdditional Images\nRelated links\nGeorgia Trend - January 2023 Issue\nContact\nSteven Gagliano\n- Communications Officer\nInstitute Communications\nEmail\nsteven.gagliano@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}