{"text": "International Tech Companies Join New Georgia Tech Internet of Things Research Center | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nInternational Tech Companies Join New Georgia Tech Internet of Things Research Center\nAT&T, Samsung and AirWatch join Center for the Development and Application of Internet-of-Things Technologies.\nFacebook\nTwitter\nEmail\nAug 11, 2015\n— Atlanta, GA\nThe recently established Center for the Development and Application of Internet-of-Things Technologies (CDAIT) at the Georgia Institute of Technology announces that AirWatch®, AT&T and Samsung Electronics constitute the inaugural group of founding members. The involvement of these companies reflects their continuing commitment to the advancement of the transformational capabilities of the Internet of Things (IoT). “Internet of Things” refers to the ability for all types of devices to communicate with each other through networks like the Internet, radio frequencies and other forms of transmission. Devices could include the equipment in cars, homes, trucks, cargo, health care, and other everyday objects. This new area of technological innovation is receiving increasing attention around the world because of its potential impact on all sectors of the economy and society. Together with Georgia Tech and GTRI, the founding members will closely monitor and actively participate in the expansion of the rapidly growing IoT industry. Other leading global companies involved in IoT have indicated their interest in getting engaged with CDAIT. “Having companies of this stature join Georgia Tech in this effort speaks volumes about what we’re trying to accomplish,” said Andrew Gerber, Georgia Tech Senior Vice President and Director of the Georgia Tech Research Institute (GTRI). “We are proud to be recognized as a trusted collaborator in the Internet-of-Things arena. We are eager to harness the unique expertise of our professors, researchers and students throughout the Internet-of-Things value chain.” For more than a century, AT&T has consistently provided innovative, reliable, high-quality products and services. With more than 120 million wireless customers, AT&T’s mission is to connect people with their world, everywhere they live and work, and do it better than anyone else. “We’ve had a long-standing relationship with Georgia Tech for many years as we share a common commitment to pushing the boundaries of innovation and taking education to new levels,” said Chris Penrose, senior vice president, Internet of Things Organization, AT&T Mobility. “The opportunity for IoT is real. It’s already reshaping industries and solving real business issues for companies around the globe. We’ve been a leading participant in the IoT space for nearly eight years and look forward to extending our thought-leadership with innovators in our own backyard.” AirWatch® by VMware® is the leading enterprise mobility management provider. With more than a decade in business, AirWatch continues to develop solutions that empower companies to focus on innovative uses of mobile technology rather than dealing with the complexities of managing mobility. “AirWatch is a longtime supporter of Georgia Tech innovation, and our support of CDAIT furthers our commitment to collaborate on strategic initiatives,” said John Marshall, senior vice president and general manager, AirWatch. “We see an incredible opportunity for the Internet of Things to redefine enterprise mobility and our daily lives. We look forward to working alongside Georgia Tech on building these transformative technologies of tomorrow.” Headquartered in Suwon, South Korea, Samsung Electronics seeks to inspire the world and shape the future with transformative ideas and technologies, redefining the worlds of TVs, smartphones, wearable devices, tablets, cameras, digital appliances, printers, medical equipment, network systems, and semiconductor and LED solutions. Samsung Electronics also leads in the IoT space through, among others, the company’s Smart Home and Digital Health initiatives. “Samsung Electronics is looking forward to working closely with the CDAIT’s outstanding members to drive the IoT research areas and core technologies,” said Jin Wook Lee, Vice President of Software R&D Center at Samsung Electronics. “We will support CDAIT in its efforts toward providing in-depth research into the various aspects of IoT technology.” Housed at the Georgia Institute of Technology in the Georgia Tech Research Institute, the Center for the Development and Application of Internet-of-Things Technologies (CDAIT pronounced\nsedate ) is a global, non-profit, partner-funded center located in Atlanta, Georgia, United States, that fosters interdisciplinary research and education while driving general awareness about the Internet of Things. It aims at efficiently identifying, understanding and solving for its sponsors challenges and problems that may arise along the whole IoT value chain. CDAIT bridges sponsors with Georgia Tech faculty and researchers as well as industry members with similar interests. “Our center will greatly benefit from having a continuous and close dialogue with premier technological companies of the caliber of AirWatch, AT&T and Samsung Electronics,” said Alain Louchez, CDAIT Managing Director. “With their help, we are looking forward to making significant contributions to the IoT industry.” Learn more about CDAIT at\nwww.cdait.gatech.edu .\nRelated links\nCenter for the Development and Application of Internet-of-Things Technologies\nContact\nLance Wallace Director of Communications, Georgia Tech Research Institute\nEmail\nlance.wallace@gtri.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}