{"text": "New Architected Material Shape-Changes to Tune Its Qualities | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nNew Architected Material Shape-Changes to Tune Its Qualities\nA flick of a switch, and this new architected material changes shape and holds it until new current reverses it.\nFacebook\nTwitter\nEmail\nStructures in a new architected material change shape when a very low current is applied. Left is before current is applied, right is after. Credit: CalTech\nOct 04, 2019\n— Atlanta, GA\nLike Transformers, toy cars that change into robots and back, researchers have made a material that can transform its deep structure at the flick of a switch to take on different physical properties. Or it can transition smoothly between those properties.\nArchitected materials are comprised of micron and nanoscale structures like crossbeams, arches, domes, and spirals, much like the elements of a building’s architecture. Researchers from the California Institute of Technology, the Georgia Institute of Technology, and ETH Zurich have made an architected material that shifts the shapes of these structures.\nWhen a slight current is applied, nanoscale beams thicken and bend into arches that increasingly bow as the current is boosted. The material maintains the new shape even when the current is off, and the shape can be changed back by reversing the current. Both are novel characteristics.\nMost materials that are designed to change their internal structure require a persistent external stimulus to remain in the new form. The new nanomaterial deforms through an electrochemical silicon-lithium alloy reaction that holds its form without applied current.\nThe study’s authors describe the material and its variable properties in detail in a\nstudy published in the journal\nNature\non Sept. 12, 2019. The research was funded by the Office of Naval Research and the National Science Foundation.\nBattery chemistry\n“At the core of this accomplishment, you’re changing the geometry not by a little, which would be easy to do, but by a lot and variably, which is hard. And you’re doing it by electrochemistry that works the way a battery does,” said Claudio Di Leo,\nan assistant professor in the Daniel Guggenheim School of Aerospace Engineering at Georgia Tech .\nDi Leo’s team modeled the architectures’ nanoscale mechanics, which are driven by lithium ions and silicon, for the research, which was led by\nCaltech materials science professor Julia Greer . Her lab then created the material using an innovative ultra-high-resolution 3D printing process called\ntwo-photon lithography\nand tested it.\n[Ready for graduate school?  Here's how to apply to Georgia Tech. ]\nArchitectures of this class of materials can be periodic – uniformly tiled or stitched like a lattice – or non-periodic, that is, a tailored knit that molds physical properties. They can also be applied creatively, as the study’s first author, Caltech graduate research assistant Xiaoxing Xia, demonstrated by working structural “defects” into the material. The defects formed Caltech’s logo when current was applied.\n“The most intriguing part of this work to me is the critical role of defects in such dynamically responsive architected materials,” Xia said.\n“I have always had a particular liking for defects, and this time Xiaoxing managed to first uncover the effect of different types of defects on these metamaterials and then used them to program a particular pattern that would emerge in response to electrochemical stimulus,” Greer said.\nIn the future, materials like this could make batteries and other energy storage devices lighter, safer, and more durable. Also, waves of\nphonons\n– special excitations in certain materials that help determine their conductivity – propagate through one architecture in the material, but then the shift in architecture blocks the waves. This was not the study’s main achievement, but still a promising feature and possible opportunity for expanded research.\nAlso READ:\nNanohydrogel Delivers Healing Stem Cells to Injured Elderly Muscles\nCoauthors include Caltech postdoctoral researcher Carlos Portela, as well as Arman Afshar of Georgia Tech, and Dennis M. Kochmann of ETH Zurich in Switzerland. The research was funded by the Vannevar-Bush Faculty Fellowship, the Office of Naval Research, and the National Science Foundation (grant CMMI-1825132). Any findings, conclusions or recommendations are those of the authors and not necessarily of the funding agencies.\nCalTech media relations contact:\nRobert Perkins, rperkins@caltech.edu\nGeorgia Tech media relations contact:  Ben Brumfield, ben.brumfield@comm.gatech.edu\nAdditional Images\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}