{"text": "Size Matters for Marine Protected Areas Designed to Aid Coral | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nSize Matters for Marine Protected Areas Designed to Aid Coral\nFor marine protected areas established to help coral reefs recover from overfishing, size really does seem to make a difference.\nFacebook\nTwitter\nEmail\nFishes and healthy coral show the benefits of marine protected areas designed to protect reef ecosystems. (Credit: Cody Clements, Georgia Tech)\nFeb 06, 2017\n— Atlanta, GA\nFor marine protected areas established to help coral reefs recover from overfishing, size really does seem to make a difference.\nIn a study that may sound a new alarm for endangered corals, researchers have found that small community-based marine protected areas may be especially vulnerable to attack by crown-of-thorns sea stars ( Acanthaster\nspecies) that can devastate coral reefs. The findings, published this week in the journal\nPLOS ONE , don’t diminish the importance of protected areas, but point to a new threat that may emerge from the degraded areas that often surround healthy ecosystems.\n“The marine protected areas that are enforced in the Fiji Islands are having a remarkable effect,” said\nMark Hay , Regents Professor and Harry and Linda Teasley Chair in the\nSchool of Biological Sciences\nat the Georgia Institute of Technology. “The corals and fishes are recovering. But once these marine protected areas are successful, they attract the sea stars which can make the small marine protected areas victims of their own success.”\nThe research, conducted on marine protected areas in the Fiji Islands, was supported by the National Science Foundation, the National Institutes of Health and the Teasley Endowment at Georgia Tech. The findings conflict with earlier studies that showed diminished sea star threats in large-scale marine protected areas.\n“Successful small marine protected areas are like oases in the desert that may attract the sea stars, which can move tens of meters per day from degraded areas into the more pristine areas,” said Cody Clements, a Georgia Tech graduate student who conducted the research. “One of the potential benefits of marine protected areas was supposed to be protection against these outbreaks, but that didn’t seem to be the case in the areas we studied.”\nIn the Fiji Islands and other areas of the tropical Pacific, many villages have established marine protected areas where the local residents don’t allow fishing. Protecting the fish helps control seaweeds that harm the coral, a foundation species whose presence helps ensure a healthy ecosystem. Enforcing the ban on fishing depends on community support for protecting the reefs, which are part of the local culture – and can provide economic benefits through tourism and spillover of fish to the areas where harvest is allowed.\nThe impact of the restored reefs goes beyond the recovered areas, which can contribute coral and fish larvae to help repopulate nearby areas.\nThese sea stars are natural predators that attack coral by climbing onto reefs and turning their stomachs inside out to digest the coral. Large populations of sea stars can rapidly degrade reefs, consuming healthy coral and causing large-scale coral decline in a matter of weeks.\nTo determine the extent of the problem and learn if the sea stars indeed preferred marine protected areas, Clements studied reefs within and immediately surrounding three marine protected areas on the Coral Coast of the Fiji Islands. First, he conducted a survey to determine population densities of the predators on both protected reefs and fished reefs outside their borders.\nThe protected areas, Clements found, had as many as 3.4 times as many of the pests as the fished areas, and their densities were high enough to be considered Acanthaster sea star outbreaks.\nNext, he tagged 40 sea stars and caged 20 on the eastern and 20 on the western borders of each protected area for two days before releasing them. Clements tracked each sea star, recording whether they had entered the protected or fished areas, and how far they moved into each. Nearly three-quarters of the sea stars entered the marine protected areas rather than the fished areas.\n“There seems to be something that is attracting them to the protected areas,” said Clements. “They are picking up on something, but we don’t necessarily know what it is.” The research did not examine chemical cues that may be attracting the sea stars, though other studies have suggested the scent of corals being consumed may draw the crown-of-thorns.\nHay theorizes that the degraded coral reefs may protect the juvenile sea stars, which often hide by day until they reach a certain size. Adult sea stars have poisonous spines to protect them against fish or other potential enemies. Once they reach a certain size, they may move into areas with higher coral density.\nThough the small size of the Fijian protected areas – averaging less than a square kilometer – may be a negative for protecting against the sea stars, they could be a positive in efforts to control the pest. Teams of local residents could capture the predators in periodic harvests to keep populations at lower densities, Hay said.\nThe animals can hide in the reefs, but their feeding habits usually make them visible. “Once you deal with them enough, you don’t have to see them to know where they are,” said Clements. “You can follow the feeding scars they leave on the coral. Where the scar ends, you know you’ll find one nearby.”\nThe sea stars are a natural part of the tropical Pacific environment, and outbreaks have been known for years. But there is concern that the densities of the pests and number of outbreaks have been increasing at a time when the coral reefs are more vulnerable.\n“Reefs are facing many novel stressors today,” said Clements. “They might have been able to tolerate crown-of-thorns attacks in the past that are too much for them now. There are multiple threats facing coral reef ecosystems, and this doesn’t help.”\nCoral conservation efforts can require a decade to show results, and Hay hopes the latest threat will not discourage designation of marine protected areas.\n“Our findings do not negate the value of the protected areas, but raise an issue of concern to the people who manage them,” he said. “This looks like a threat that could be accelerating, and we wanted to raise the awareness.”\nThis research was supported by the National Science Foundation under grant OCE- 0929119, by the National Institutes of Health ICBG grant U19TW007401, and the Teasley Endowment to the Georgia Institute of Technology. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the National Science Foundation or the National Institutes of Health.\nCITATION : Cody S. Clements, Mark E. Hay, “Size matters: Predator Outbreaks Threaten Foundation Species in Small Marine Protected Areas,” (PLOS One, 2017).\nhttp://dx.doi.org/10.1371/journal.pone.0171569\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contacts : John Toon (404-894-6986) (jtoon@gatech.edu) or Ben Brumfield (404-385-1933) (ben.brumfield@comm.gatech.edu).\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}