{"text": "Slieper and Williams Named Faculty Co-Directors of Quality Enhancement Plan | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nSlieper and Williams Named Faculty Co-Directors of Quality Enhancement Plan\nFaculty members Chad F. Slieper and Kate Williams, have been named co-directors of Georgia Tech’s next Quality Enhancement Plan (QEP).\nFacebook\nTwitter\nEmail\nDec 12, 2023\nFaculty members Chad F. Slieper and Kate Williams, have been named co-directors of Georgia Tech’s next Quality Enhancement Plan (QEP).\nAs co-directors, both Slieper and Williams will report to Roberta Berry, associate vice provost for Undergraduate Education in the Office of Undergraduate Education and will contribute to the development and planning for Georgia Tech’s next QEP, Leadership in Progress and Service: Creating Intentional and Transformative Learning Experiences. The topic was chosen in the spring by a provost-appointed committee to advance the\nTransformative Teaching and Learning Initiative\nof the Institute strategic plan. As co-directors, Slieper and Williams will contribute significantly to writing Georgia Tech’s QEP for submission to the Southern Association of Colleges and Schools Commission on Colleges (SACSCOC) in Fall 2024. SACSCOC approval of the QEP is an essential component of the Institute’s reaffirmation of accreditation.\n“At the heart of the new QEP is the creation and implementation of transformative learning experiences that prepare Georgia Tech students for leadership roles,” said Laurence Jacobs, senior vice provost for Education and Learning and search committee co-chair. “During our search, we found that Kate and Chad possess complementary knowledge and experiences for an exciting co-directorship. We thank our search committee for their efforts and believe Chad and Kate’s combined talents, working closely with our QEP Development and Planning Committee and other campus stakeholders, will bring our next QEP successfully to life.”\nSlieper brings years of experience and Since 2019, he’s served as director of the Law, Science, and Technology program in the Ivan Allen College of Liberal Arts and is an academic professional in Georgia Tech’s School of Public Policy. He has won several teaching awards at Georgia Tech. He also serves as the School of Public Policy's faculty liaison to Georgia Tech's LGBTQIA Resource Center. He previously held faculty leadership positions at The University of Texas M.D. Anderson Cancer Center in Houston. Slieper holds a J.D. from Emory University School of Law, and a bachelor’s degree in public policy, with highest honors, from Georgia Tech.\n“I genuinely believe in what we can accomplish with this Quality Enhancement Plan,” said Slieper. “As an alumnus of Georgia Tech, I have always found our motto of Progress and Service to perfectly encapsulate the spirit of what we do at Georgia Tech. I am also eager to put my own background and experience to use in service of this process.”\nA member of the Center for Teaching and Learning faculty since 2015, Williams has more than 25 years of higher education experience in both faculty and leadership roles. As the current interim director of Transformative Teaching and Learning Faculty Initiatives, Williams designed a faculty cohort model to award teaching innovation grants to help faculty integrate experiential learning into their courses. In addition to prior experience as a psychology instructor and department chair, Williams brings expertise in experiential learning, career services, and program assessment. She earned a Ph.D. in industrial-organizational psychology from Clemson University and an M.Ed. in student affairs from the University of South Carolina.\n“My vision is to integrate experiential learning within our traditional undergraduate classroom experience for all students to have access to transformative learning experiences,” said Williams. “I am really excited about the opportunity to collaborate on leading the Institute’s efforts to positively impact the undergraduate experience.”\nSlieper and Williams will assume the co-director roles, which are year-round 75% appointments, effective Jan. 1. They will also retain their respective appointments within the School of Public Policy and the Center for Teaching and Learning. Planning for the new QEP will take place over the next year.\n“We are creating an initiative that will focus on high-impact practices that enhance student success as well as the development of future leaders,” said Steven P. Girardot, vice provost for Undergraduate Education and search committee co-chair. “Successful development and planning of the QEP will require faculty directors who can reach a broad network of students, faculty, and staff across campus. We feel Chad and Kate have the knowledge and experience to accomplish that, and I am excited to work with them in their new roles.”\nFind more information on the\nQEP website .\nWriter: Julian Hills, Senior Writer / Editor - Organizational, Academic, and Research Communications\nRelated links\nGeorgia Tech's Quality Enhancement Plan\nContact\nOffice of Undergraduate Education\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}