{"text": "X-Ray Tomography Lets Researchers Watch Solid-State Batteries Charge, Discharge | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nX-Ray Tomography Lets Researchers Watch Solid-State Batteries Charge, Discharge\nUsing X-ray tomography, a research team has observed the internal evolution of the materials inside solid-state lithium batteries as they were charged and discharged.\nFacebook\nTwitter\nEmail\nSolid-state batteries are charged and discharged in custom-made hardware designed at Georgia Tech. A smaller, modified version of the cell shown here was used to image these materials during cycling. (Credit: Matthew McDowell)\nJan 28, 2021\n— Atlanta, GA\nUsing X-ray tomography, a research team has observed the internal evolution of the materials inside solid-state lithium batteries as they were charged and discharged. Detailed three-dimensional information from the research could help improve the reliability and performance of the batteries, which use solid materials to replace the flammable liquid electrolytes in existing lithium-ion batteries.\nThe\noperando\nsynchrotron X-ray computed microtomography imaging revealed how the dynamic changes of electrode materials at lithium/solid-electrolyte interfaces determine the behavior of solid-state batteries. The researchers found that battery operation caused voids to form at the interface, which created a loss of contact that was the primary cause of failure in the cells.\n“This work provides fundamental understanding of what is happening inside the battery, and that information should be important for guiding engineering efforts that will push these batteries closer to commercial reality in the next several years,” said\nMatthew McDowell , an assistant professor in the\nGeorge W. Woodruff School of Mechanical Engineering\nand the\nSchool of Materials Science and Engineering\nat the Georgia Institute of Technology. “We were able to understand exactly how and where voids form at the interface, and then relate that to battery performance.”\nThe research, supported by the National Science Foundation, a Sloan Research Fellowship, and the Air Force Office of Scientific Research, was reported Jan. 28 in the journal\nNature Materials .\nThe lithium-ion batteries now in widespread use for everything from mobile electronics to electric vehicles rely on a liquid electrolyte to carry ions back and forth between electrodes within the battery during charge and discharge cycles. The liquid uniformly coats the electrodes, allowing free movement of the ions.\nRapidly evolving solid-state battery technology instead uses a solid electrolyte, which should help boost energy density and improve the safety of future batteries. But removal of lithium from electrodes can create voids at interfaces that cause reliability issues, limiting how long the batteries can operate.\n“To counter this, you could imagine creating structured interfaces through different deposition processes to try to maintain contact through the cycling process,” McDowell said. “Careful control and engineering of these interface structures will be very important for future solid-state battery development, and what we learned here could help us design interfaces.”\nThe Georgia Tech research team, led by first author and graduate student Jack Lewis, built special test cells about two millimeters wide. They were designed to be studied at the Advanced Photon Source, a synchrotron facility at Argonne National Laboratory, a U.S. Department of Energy Office of Science facility located near Chicago. Four members of the team studied the changes in battery structure during a five-day period of intensive experiments.\n“The instrument takes images from different directions, and you reconstruct them using computer algorithms to provide 3D images of the batteries over time,” McDowell said. “We did this imaging while we were charging and discharging the batteries to visualize how things were changing inside the batteries as they operated.”\nBecause lithium is so light, imaging it with X-rays can be challenging and required a special design of the test battery cells. The technology used at Argonne is similar to what is used for medical computed tomography (CT) scans. “Instead of imaging people, we were imaging batteries,” he said.\nBecause of limitations in the testing, the researchers were only able to observe the structure of the batteries through a single cycle. In future work, McDowell would like to see what happens over additional cycles, and whether the structure somehow adapts to the creation and filling of voids. The researchers believe the results would likely apply to other electrolyte formulations, and that the characterization technique could be used to obtain information about other battery processes.\nBattery packs for electric vehicles must withstand at least a thousand cycles during a projected 150,000-mile lifetime. While solid-state batteries with lithium metal electrodes can offer more energy for a given size battery, that advantage won’t overcome existing technology unless they can provide comparable lifetimes.\n“We are very excited about the technological prospects for solid-state batteries,” McDowell said. “There is substantial commercial and scientific interest in this area, and information from this study should help advance this technology toward broad commercial applications.”\nIn addition to those already mentioned, co-authors included Francisco Javier Quintero Cortes, Yuhgene Liu, John C. Miers, Jared Tippens, Dhruv Prakash, Thomas S. Marchese, Sang Yun Han, Chanhee Lee, Pralav P. Shetty, and Christopher Saldana from Georgia Tech; Ankit Verma, Bairav S. Vishnugopi, and Partha P. Mukherjee from Purdue University; Hyun-Wook Lee from Ulsan National Institute of Science and Technology; and Pavel Shevchenko and Francesco De Carlo from Argonne National Laboratory.\nThis work is partially supported by the National Science Foundation under Award No. DMR-1652471, a Sloan Research Fellowship in Chemistry, a NASA Space Technology grant, the Colciencias-Fulbright scholarship program cohort 2016, the Ministry of Trade, Industry & Energy/Korea Institute of Energy Technology Evaluation and Planning (MOTIE/KETEP)(20194010000100), the Air Force Office of Scientific Research (AFOSR) under Grant FA9550-17-1-0130, and the Scialog program sponsored jointly by Research Corporation for Science Advancement and the Alfred P. Sloan Foundation that includes a grant to Purdue University by the Alfred P. Sloan Foundation. This research used resources of the Advanced Photon Source, a U.S. Department of Energy (DOE) Office of Science User Facility operated for the DOE Office of Science by Argonne National Laboratory under Contract No. DE-AC02-06CH11357. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the sponsoring agencies.\nCITATION : John A. Lewis, et al., “Linking Void and Interphase Evolution to Electrochemistry in Solid-State Batteries Using Operando X-Ray Tomography.” ( Nature Materials , 2021)\nhttps://doi.org/10.1038/s41563-020-00903-2 .\nResearch News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA\nMedia Relations Contact : John Toon (404-894-6986) (jtoon@gatech.edu)\nWriter : John Toon\nAdditional Images\nContact\nJohn Toon\nResearch News\n(404) 894-6986\nEmail\njtoon@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}