{"text": "Preventing Self-Contamination during Disease Outbreaks | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nPreventing Self-Contamination during Disease Outbreaks\nResearchers have identified risky behaviors of health care workers that may lead to self-contamination.\nFacebook\nTwitter\nEmail\nApr 16, 2018\n— Atlanta, GA\nEbola virus infections that occurred in the U.S. in late 2014 alarmed the public. In the two cases, nurses got the infection from a patient who caught the dreaded virus overseas. Both nurses received treatment and survived. In the aftermath,\nthe Centers for Disease Control and Prevention (CDC) awarded Emory University and Georgia Tech a grant\nto discover ways to protect health care workers from self-contamination when treating patients during outbreaks of deadly infections.\nNow, Georgia Tech researchers and others at Emory and Georgia State University have observed health care workers in a facility that has treated Ebola-infected patients and identified risky behaviors that may lead to self-contamination. Reported in\nClinical Infectious Diseases ,\nthe findings suggest that health care workers can be well-protected from self-contamination under the current guidelines and protocols for health care facilities certified to treat Ebola-infected patients.\nIn the study, School of Psychology Professor and Interim Chair Frank T. Durso and Ph.D. student Joel M. Mumma and coworkers observed how health care workers trained to treat Ebola-infected patients followed procedures for removing protective equipment after contact with a patient.\nPROTECTING HEALTH CARE WORKERS\nAccording to CDC guidelines, protective equipment should provide coverage from head to toe. Coveralls protect the neck to the toe. Underneath are disposable paper scrubs. Neck-to-head protection includes a hood that has three parts: a face shield, a shroud, and a respirator underneath. Hands are covered by two pairs of gloves. Shoes are protected by shoe covers.\nIn addition, a trained observer must be present when donning or doffing protective equipment. The trained observer reminds workers of the proper procedure and signals when a step is not done right.\nThe health care workers participated in simulations in which their protective equipment was contaminated with harmless viruses that served as surrogates for Ebola and for hardier viruses, similar to Norovirus. The workers were video recorded while removing their protective equipment.\nThe Georgia State team sampled critical areas, such as hands and scrubs, for microbial analyses.\nData analyses and modeling – led by Mumma – revealed human behavioral pathways along which pathogens can travel from contaminated outer layers to the clean inner layers of the protective equipment.\nBEHAVIORAL PATHWAYS TO SELF-CONTAMINATION\n“We were interested in the kinds of behaviors that may spread contamination,” Mumma says. “An example is touching the hood’s face shield with the inner pair of gloves when trying to remove the hood. The inner pair of gloves should always remain clean.”\nAnother common failure point is hand hygiene, Mumma says. After each doffing step, workers sanitize their hands with an alcohol-based rub. Sometimes, this step is not carried out as thoroughly as the World Health Organization recommends.\nOften workers don’t allow the sanitizer to dry completely. In that case the effectiveness of hand hygiene becomes limited, Mumma says.\nIn addition, “when they take the gloves off, they don’t get a good grip because the surface is slippery from the alcohol, and they snap their glove,” Durso says. “Every time that happens, you increase the chance of shooting the virus into the room or to the health care worker.”\nThe trained observers can also be a failure point, Mumma says. “Sometimes trained observers cut hand hygiene short by moving health care workers on to the next doffing step.”\nThe bottom line is self-contamination in Ebola facilities may be reduced if trained observers pace themselves to ensure that workers are doffing methodically and if the workers handle protective equipment properly, sanitize and their hands thoroughly and dry them completely, and use the proper technique in removing the hood.\nAlthough the behavioral pathways to contamination revealed by the study may be applicable to Ebola, details may change depending on the virus causing the disease outbreak. For example, hand sanitation with an alcohol-based rub keeps Ebola contained. A virus more robust than Ebola, such as the hardier viruses used in the simulations, may require use of a more potent agent, such as bleach.\n“If we can intervene and improve the process in facilities, we shouldn’t get self-contamination,” Durso says. “What’s really exciting is that hospitals are already implementing changes based on our findings.”\nAdditional Images\nRelated links\nCDC Awards $2.2 Million to Prevent Spread of Infectious Disease in Health Care …\nContact\nA. Maureen Rouhi, Ph.D.\nDirector of Communications\nCollege of Sciences\nEmail\nmaureen.rouhi@cos.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}