{"text": "Innovative IV Sensor Moves Closer to Clinical Trial | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nInnovative IV Sensor Moves Closer to Clinical Trial\nNewly developed device shows the potential to automate the critical task of detecting IV infiltration\nFacebook\nTwitter\nEmail\nSamer Mabrouk and Omer Inan hold prototypes of their device.\nOct 06, 2021\n— Atlanta, GA\nLong before Samer Mabrouk obtained his current position as a postdoctoral scholar at Georgia Tech, he had developed a fear of hospitals: the sickness and disease, the pain. When he was growing up in Egypt, there were several instances where he declined to accompany his relatives to the hospital. But in the last four years, he’s become a regular visitor of\nChildren’s Healthcare of Atlanta\n(Children’s) Egleston Hospital. It’s been a little uncomfortable, but it’s been worth it.\nSince January 2020, he and a team of clinicians and nurses from Children’s have been running a pilot study on a new biomedical safety device they’ve developed. Their device monitors for important safety issues that can occur during intravenous (IV) therapy, the process of delivering liquids or medicines through a needle directly into a patient’s veins.\nTheir initial results have shown that the device has the potential to significantly improve IV safety. It also stands to reduce the workload on nurses, who must manually monitor for IV safety issues.\n“Our stretch goal is that it might be used on every IV site,” said Omer Inan, Linda J. and Mark C. Smith Chair and associate professor in the School of Electrical and Computer Engineering at Georgia Tech, who has guided Mabrouk on the project. Children’s lists checking IVs as a priority “quality initiative”, a vital task for ensuring high-quality patient care.\nNow, the team is raising funds to move to the next phase of device development. This will consist in a formal clinical trial to support application for Food and Drug Administration (FDA) 510k clearance. If the trial is successful, the team will be able to commercialize the device and clinicians will be able to use the technology in real clinical practice.\nResearch began in 2014, when Leanne West, chief engineer of Pediatric Technologies at Georgia Tech, surveyed doctors and nurses at Children’s to determine the biggest issues within pediatric medicine. IV infiltration was cited by many as a major challenge within the field. West’s background in wearable sensor development led to ideation on a medical device that could alert clinicians when an infiltration occurs. She pulled together a team to tackle this problem, led by Inan on the biosensor side with clinical input and support by Children’s nurse, Lynne Pogue. After being inspired by Pogue’s passion for wanting to solve this important problem, Inan immediately had ideas for a technology solution to improve IV safety. Pogue’s passion\nSherry Farrugia, currently the chief executive officer of  Global Center for Medical Innovation  (GCMI) and then the chief operating and strategy officer for the Pediatric Technology Center, fully backed the idea, telling the team: “Omer’s the biosensor guy, and GCMI can support both the pre-clinical testing and product feasibility.”\nImmediately, the team went to work.\nAfter an IV needle has been inserted into a vein, there are various factors that can cause it to leak, either just beneath the skin or even deeper, into surrounding tissues. This painful process of unintended leakage is called infiltration. In a related process called extravasation, the leakage of certain medicines like chemotherapeutic drugs directly causes tissue damage. Nurses are trained to catch these events before harm occurs, but mild cases of clinically insignificant infiltration are thought to happen with surprising frequency, at rates ranging from 23 to 87% in children.\nTo check for issues, the standard nursing procedure is to touch, visually inspect, and compare the IV site to the same location on the other arm. Frequent checks are often needed, posing a substantial burden on nurses. Young children rely completely on checks as they may be unable to indicate when they are experiencing pain. In the absence or failure of such checks, severe infiltration injuries have been recorded, particularly in babies and small children.\nAs Inan began to think about solutions for IV infiltration monitoring, a few ideas came to mind. For a different, Department of Defense-funded project, he had already been investigating how to monitor knee swelling with bioimpedance sensors, which measure the effects on a weak electric current when it is passed through the body. Both knee swelling and IV infiltration involve a similar issue of fluid accumulation under the skin.\nBioimpedance has long been used for a variety of sensing applications, like measuring body fat percentage, but the underlying technology is complex, Inan said. When an alternating current passes through tissues, the signal changes, reflecting various sorts of physiological characteristics such as fluid content.\nInan and Mabrouk considered a few other potential sensing modalities but, after conducting a preclinical study at T3 Labs (GCMI), determined that measuring changes in bioimpedance would be their primary method. After developing the prototype for the study, the next step was to move to testing on humans.\nHuman studies would require a great deal of care, particularly given that people who are undergoing IV therapy are already at risk. Moreover, the researchers sought to test the technology on children, specifically, who have the highest risk for IV infiltration due to the small size of their veins.\nMabrouk and Inan worked with Patrick Strane, an engineer at GCMI, to figure out how to prepare the device for human testing. After analyzing the device, they decided to make improvements to its packaging, which made it safer for children and more resilient to stringent hospital cleaning standards.\nThe current setup of the device is a set of four electrodes connected to an iPod-sized electronics hub. A doctor or nurse places two of these electrodes above the IV site on the arm and two below. The hub contains the computing hardware and sensor circuitry that delivers and processes the bioimpedance signal.\nSince the pilot study began, pediatric cardiac intensivist Zahidee (Saidie) Rodriguez has led the patient testing. Initial deployments identified a few unexpected challenges. Although small, the size of the device makes it ungainly for babies. Toddlers often kick and tear the device off their arms, and older children are little easier. They dislike having one more thing attached to them when they are bored, bedbound, and sick.\n“That was a good learning experience,” Rodriguez said. “That was very humbling,”\nBut when patients wear it, the device has proven its capability. In the 60 patients that the researchers have monitored, nurses have manually detected two overt infiltrations, logging them in the patients’ electronic healthcare records. Retrospective analysis of the sensor data taken from these patients shows that infiltrations were indeed happening, according to Mabrouk and Rodriguez, confirming the device’s ability to detect the events.\nMore notably, data has revealed three other “subclinical” infiltrations that were not formally documented. These were infiltrations that were too minor for nurses to detect by the standard physical and visual inspection methods. However, in each case, the patient, nurse, or doctor had taken action to address minor pain, IV leakage, or IV occlusion, where the IV reports that it is not delivering medicine at the correct rate. Afterwards, data from the devices provided clear evidence that minor infiltrations were in fact occurring in these cases.\n“It certainly seems like it's much more sensitive than what the human touch and eye can pick up on,” said Rodriguez.\nMabrouk and Inan are using the data from the current study to help optimize the device’s algorithms so that it will be able to automatically detect infiltration events as they happen. This is a difficult problem, they said, particularly when trying to achieve high accuracy and a low false positive rate.\n“When somebody rotates their arm, the bioimpedance of the arm changes by 20 to 30 percent,” said Inan. “How do you know the difference between that and infiltration? Our approach to that was using multiple different sensors.”\nIn particular, the researchers have coupled a motion sensor as well as a temperature sensor to the bioimpedance sensor. By analyzing the data from all these together, the researchers have found that their algorithms can reliably distinguish IV infiltration.\nMabrouk says that a full clinical trial will be critical for establishing safety and effectiveness. Rodriguez hopes that the trial will also help the team test the device on more patients, more efficiently.\nThe researchers are currently collaborating with GCMI to move to a clinical trial, with the ultimate goal of FDA clearance. If obtained, it looks possible for the device to become widely adopted. But before they get to that point, the researchers plan to make a variety of improvements, including the addition of wireless connectivity and the achievement of further miniaturization.\nAs for Mabrouk, although he still has qualms about visiting the hospital, he plans to keep going.\n“The first time we saw the data from the infiltrated patient and how it looked, it was clear, yeah, this works,” Mabrouk said. “This is going to work.”\nAdditional Images\nContact\nMordechai Rorvig\nSenior Science Writer\nGeorgia Institute of Technology\nEmail\nmrorvig@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}