{"text": "Looking at El Nino’s past to predict its future | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nLooking at El Nino’s past to predict its future\nA new study shows how this climate system responds to various pressures, such as changes in carbon dioxide and ice cover, in one of the best models used to project future climate change.\nFacebook\nTwitter\nEmail\nThis image shows the peak warming in the tropical Pacific during the last big El Niño event, in the winter of 1997. Credit:  NASA\nDec 02, 2014\n— Atlanta, GA\nThe El Niño Southern Oscillation is Earth’s main source of year-to-year climate variability, but its response to global warming remains highly uncertain. Scientists see a large amount of variability in the El Niño-Southern Oscillation (ENSO) when looking back at climate records from thousands of years ago. Without a clear understanding of what caused past changes in ENSO variability, predicting the climate phenomenon’s future is a difficult task. A new study shows how this climate system responds to various pressures, such as changes in carbon dioxide and ice cover, in one of the best models used to project future climate change. “All of the natural climate fluctuations are in this model, and what we see is that the El Niño responds to every single one of these, significantly,” said\nKim Cobb , an associate professor of Earth and Atmospheric Sciences at the Georgia Institute of Technology in Atlanta. The El Niño-Southern Oscillation phenomenon controls how the climate changes in the tropics (and also influences weather patterns elsewhere, including the United States). The study was sponsored by the National Science Foundation (NSF) and the Department of Energy (DOE). The study was published November 27 in the journal\nNature.\nIn the study, researchers analyzed a series of transient Coupled General Circulation Model simulations forced by changes in greenhouse gases, orbital forcing, meltwater discharge and the ice-sheet history throughout the past 21,000 years. This is farthest in the past that this model has been run continuously, which required supercomputers at Oak Ridge National Laboratory and the National Center for Atmospheric Research to be dedicated to the simulation for months. Some key findings of the new simulations of El Niñoover the past 21,000 years: Strengthening ENSO over the current interglacial period, caused by increasing positive ocean-atmosphere feedbacks ENSO characteristics change drastically in response to meltwater discharges during early deglaciation Increasing deglacial atmospheric carbon dioxide concentrations tend to weaken ENSO Retreating glacial ice sheets intensify ENSO “The model gives some very clear predictions that are very much in line with some of the best understandings of the physics controlling the El Niño system,” Cobb said. “It shows that this climate system in the model is sensitive to a variety of different natural climate changes that occurred over the last 21,000 years.” In order to understand how El Niño responds to various climate forces, researchers test model predictions of past El Niño changes against actual records of past ENSO activity. Kim Cobb published several such records, including a large fossil coral dataset published in\nScience\nlast year. “The more we can close the loop between what this model says happened in the past and what the data say happened in the past, then we can project forward our improved understanding to understand future El Niño,” Cobb said. This research is supported by the National Science Foundation, under award number NSFC41130105, and the Department of Energy, under award number MOST2012CB955200. Any conclusions or opinions are those of the authors and do not necessarily represent the official views of the sponsoring agencies. CITATION : Zhengyu Liu, et al., “Evolution and forcing mechanisms of El Niño over the past 21,000 years.” ( Nature , November 2014).\nhttp://www.nature.com/nature/journal/v515/n7528/full/nature13963.html Research News\nGeorgia Institute of Technology\n177 North Avenue\nAtlanta, Georgia  30332-0181  USA @GTResearchNews Media Relations Contacts : Brett Israel ( @btiatl ) (404-385-1933) ( brett.israel@comm.gatech.edu ) or John Toon (404-894-6986) ( jtoon@gatech.edu ) Writer : Brett Israel\nAdditional Images\nContact\nBrett Israel 404-385-1933 @btiatl\nEmail\nbrett.israel@comm.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}