{"text": "Physics Students’ Trip to Totality | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nPhysics Students’ Trip to Totality\nSparked by a professor’s interest, 55 students from the School of Physics will travel to Illinois to enter the path of totality for the April 8 total solar eclipse.\nFacebook\nTwitter\nEmail\nApr 04, 2024\nA total solar eclipse is a time of scientific discovery, confirming Albert Einstein's theory of general relativity in 1919, but the astronomical phenomenon can also be a time of personal discovery, just as it was for Dragomir Davidovic.\nAn\nassociate professor in the School of Physics\nwhose expertise lies outside of astronomy, Davidovic didn't initially understand the hype surrounding the 2017 eclipse. However, he was instantly captivated as the moon passed between the sun and the Earth to reveal the star's corona.\n\"When I saw my first eclipse, I was surprised by its power. Nature changed around us; the birds became quiet, and all of the animals near the farm were getting ready to go to sleep. It was eerie in a way, and it's a once-in-a-lifetime event that needs to be seen,\" he said.\nUnlike 2017, Georgia will not be in the path of totality for the eclipse occurring on Monday, April 8, so Davidovic and\nEdwin Greco , associate chair for student success, are leading a trip for 55 School of Physics students, primarily graduate students, to experience totality at the Crab Orchard National Wildlife Refuge in Southwest Illinois following an overnight stay in Nashville, Tennessee.\nWhile the eclipse can be viewed in an urban environment,\nsuch as Atlanta , where coverage will reach 85%, Davidovic wanted to give students the opportunity to feel the eclipse's full effect on nature as he experienced it seven years ago.\n\"A rural setting allows you to have this true connection with nature, and it evokes this feeling of almost being a prehistoric human,\" he said.\nIn addition to the reaction of animals, Jim Sowell, director of the Georgia Tech Observatory, explains that as the eclipse reaches its peak, temperatures will drop, and planets may become visible in the darkened sky. To view the eclipse, the group will be bringing safety glasses and a telescope with the appropriate lens for direct sunlight viewing.\nThe idea for the trip came from a spontaneous conversation between Davidovic and School Chair Feryal Özel in August, and initially, Davidovic wondered if enough students would share his enthusiasm for such an adventure.\n\"My biggest worry was that we wouldn't get enough students to sign up, but as it turned out, I was totally wrong,\" he said. \"It goes to show there is a broad interest in this natural phenomenon. You don't have to be an astronomer; we have people signed up across many different fields,” he said.\nAmong those immediately interested in joining the excursion was Nadia Qutob, a graduating physics major with an emphasis in astrophysics and a member of the Georgia Tech Astronomy Club.\n\"Everyone in the world at some point in their lives looks up at the sky and wonders what is up there. Space has an incredible ability to unite us in our shared curiosity. It is deeply inspirational to me that so many people, especially young people, are excited about the eclipse. I hope it will lead to more interest in space research in the future,\" she said.\nStudent interest in the eclipse is evident, with another trip being led by the Astronomy Club, which will be heading to the Ozarks to witness the event.\nFollowing Monday’s total solar eclipse, the continental U.S. will not see another of its kind until 2044. In the meantime, Davidovic's hobby has also influenced his academic work. He is now conducting research into the effects of merging black holes on quantum computers and continues to study additional astrophysical theories.\nAdditional Media\nRelated links\nTotal Solar Eclipse Brings History Within Sight\nSolar Eclipse 2024 Accessible Resources\nContact\nSteven Gagliano\n- Institute Communications\nEmail\nSteven.gagliano@gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}