{"text": "Georgia Tech Breaks Ground on Science Square — Announces Fund Connecting Local Community to Jobs Training and Education Resources | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\nGeorgia Tech Breaks Ground on Science Square — Announces Fund Connecting Local Community to Jobs Training and Education Resources\nThis development is a crucial advancement toward solidifying Atlanta as a core resource for talent in the life sciences sector.\nFacebook\nTwitter\nEmail\nAug 18, 2022\n— Atlanta, GA\nGeorgia Tech, in partnership with Trammell Crow Company (TCC), hosted a groundbreaking ceremony for Science Square. This exciting new project will be a purpose-built district dedicated to biomedical research and technology — the first of its kind in Atlanta. Science Square will attract brilliant innovators and researchers from across the world as Atlanta emerges as a leading hub for talent focused on uncovering groundbreaking medical solutions to save and improve lives.\nAs part of this project, TCC is providing a $500,000 Community Educational Grant to support job training, education, and outreach. With this grant, Science Square will partner with schools in the Washington and Douglass clusters to support life science education with advanced equipment, professional development, and engaging student experiences. The grant will also fund scholarships for local residents to earn associate degrees in bioscience technology from Atlanta Metropolitan College and provide community members with internships and other opportunities to acquire the training credentials they need to work in these industries.\nThis groundbreaking marks the start of a breakthrough to propel Atlanta as a hub for life sciences and biomedical innovation. This development is a key advancement toward solidifying Atlanta as a core resource for talent in this sector allowing us to not only attract thought leaders from around the world but also use these resources to build those leaders here in our own communities.\n“Historically, Atlanta hasn’t enjoyed the same success with startups in the life sciences as we have with other tech sectors,” said Ángel Cabrera, president of Georgia Tech. \"Sometimes, great ideas and companies that start in this city end up elsewhere because Atlanta hasn’t been able to provide the rich, dense biomedical innovation ecosystem that biotech entrepreneurs need to attract talent and develop their ideas into marketable solutions. The purpose of this new development is to reverse that dynamic.”\nThe aim for Science Square is to be a key deciding factor for entrepreneurs coming out of Georgia Tech and other universities to stay in Atlanta because they have a rich environment of talent and other resources that will aid them in success. Reflecting on what we’ve experienced with the Covid-19 pandemic, President Cabrera says we owe so much to medical innovation and hopes that Science Square will be the source of similar solutions in the future.\nThis development also illustrates how Georgia Tech continues to grow and expand its reach with the help of public and private partnerships. “As we have done in the past, we will once again leverage the unique assets of a leading research university to catalyze innovation, create new economic opportunity, and help transform the city around us,” said President Cabrera.\nAs a result of its collaboration with private sector partners like TCC, the Institute has been able to combine its vision and assets with the power of private capital to get the job done.\n“This highlights a central focus for the entire University System of Georgia, and that is our commitment to maintaining and enhancing the connection between world-class public colleges and universities and economic success for the state and all Georgians,” Chancellor Sonny Perdue said. “We’ve seen what Georgia Tech has accomplished with Tech Square, and I look forward to watching Science Square grow into the nation’s best source of research and innovation for the life sciences.”\nScience Square will be built on the south side of Georgia Tech’s campus and in a part of our city that has been traditionally left out of development and investment. Key outcomes from our experience with Tech Square underscore what our investments and our growth can do to revitalize an urban district.\nThis 18-acre development will be a mixed-use community featuring residential and commercial space and a district dedicated to biomedical research and technology. The first phase of the development at Science Square will include TCC’s Science Square Labs, a speculative 364,740-square-foot Class A lab/office tower. The first phase will also include a 280-unit residential building developed by TCC’s multifamily subsidiary, High Street Residential (HSR). The building, HSR’s first residential development in Atlanta, will include shared parking and ground-floor retail space.\nAdditional Images\nContact\nAyana Isles\nMedia Relations Representative\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}