{"text": "‘Barbenheimer’ and What We Can Learn From It | News Center\nSkip to main navigation\nSkip to main content\nMENU\nNews Center\nMain navigation\nCalendar\nCategories\nBusiness and Economic Development\nCampus and Community\nEarth and Environment\nHealth and Medicine\nScience and Technology\nSociety and Culture\nMedia Contacts\nDaily Digest\nWhistle\nWhistle\nWhistle archives\nSocial Media\nSubscribe\nFeatured expert\nFeatures\nFeatures\nFeatures Archive\nFind an expert\nSearch\nSearch\nBreadcrumb\nHome\n‘Barbenheimer’ and What We Can Learn From It\nWith the simultaneous theatrical releases of Oppenheimer and Barbie, three Tech professors share how the \"atomic bomb and the atomic blonde\" remain cultural icons central to the modern American imagination.\nFacebook\nTwitter\nEmail\nIvan Allen experts reflect on 'Barbenheimer.' (Designed with Midjourney)\nJul 27, 2023\nThe simultaneous releases of  Barbie  and  Oppenheimer  in U.S. theaters over the weekend generated an enormous buzz among movie fans enchanted by the seemingly dichotomous nature of the releases, film critics eager to dig into the art of both movies, and cultural critics interested in the baggage and promise inherent in both films. We asked some of our experts on pop culture, representations of technology in media, and feminism to weigh in on the blockbuster event of the summer. Here’s what Professor  Carol Colatrella , Regents’ Professor  Lisa Yaszek , and Assistant Professor  Ida Yoshinaga  had to say:\nThere’s been so much media excitement over the premieres of these two movies in contrast to the opening of other highly anticipated blockbusters this summer, such as  Mission Impossible: Dead Reckoning ,  Spider-Man: Across the Spider Verse , or  The Flash . Why?\nYaszek : Because the Atomic Bomb and the Atomic Blonde are two cultural icons central to the modern American imagination! Oppenheimer and the Manhattan Project ushered in the era of truly world-changing technosciences and catapulted the U.S. into a position of global leadership. Barbie was the first mass-produced doll that invited girls to imagine adult roles for themselves outside of motherhood, emerging in tandem with the beginning of the sexual revolution, the revival of feminism, and the start of modern conversations about sex and gender. These are two the key ways we define ourselves as Americans! It doesn’t matter if you know the details of Oppenheimer’s specific role in the creation of nuclear weapons, or if you ever actually played with Barbie and her pals. Everyone knows that “Oppenheimer” is shorthand for our complex feelings about the promises and perils of modern technologies that both sustain and threaten to end civilization as we know it, and everyone knows that “Barbie” is shorthand for our complex feelings about new social and sex roles that somehow both radically depart from — and yet also still echo — more conservative ones from earlier eras.\nYoshinaga : In the financial context of the ongoing WGA and SAG-AFTRA strikes as well as most of those other franchise films not meeting with summer box-office expectations, I think some industry watchers are hailing Barbenheimer’s killer opening weekend as a sign of hope for the entertainment industry.  Barbie  has enjoyed the largest open for a female-director-led movie in history, and Oppenheimer drew a respectable box office take as well. Both  Barbie  and  Oppenheimer , drawing strongly on the last century’s sociopolitical context, promise some intellectual engagement, some critical thinking, some historical insight of who we are as a society.\nColatrella:  That audiences connect the films — one representing the story of Barbie as documenting varying and shifting views on feminism and the other documenting varying and shifting views about the atomic bomb — resonates with contemporary concerns about women’s independence and with our wartime concerns about developing and using weapons and other technologies that have unforeseen consequences. It is interesting to me that  Barbie  incorporates the doll’s creator as a character and that  Oppenheimer  acknowledges the protagonist’s technological contributions and his subsequent restraint in using what he helped create. The films present revisionist histories demonstrating the force and fluctuations of political ideologies over time.\nPlay Video\nWhy should we see  Barbie ?\nColatrella : It’s great to see a film that celebrates feminism as a force enhancing gender equity, personal development for women and men ( Kenough !), mother-daughter bonding, and community decision-making in BarbieWorld. In developing my book  Toys and Tools in Pink , I met with Lego marketing and production executive in Billund, Denmark, and was impressed with their commitment to design construction and building toys that could appeal to girls as powerfully as Barbie does. They valued that children’s toys could contribute to collaborative play.\nYoshinaga : In the growing landscape of feminist directors, writer-director Greta Gerwig has carved out an intelligent, sensitive approach to portraying women on film—from the delightfully twee  Fr a nces Ha,  which she co-scripted with director (and frequent filmmaking partner) Noah Baumbach, to the critically lauded  Little Women  and autobiographical, regionalist  Lady Bird , all of which display her signature style of gentle observational humor, gender role insight, and quiet yet powerfully accumulating ethics. By making the screen story postmodern and feminist, she’s now viewed as having successfully “cracked” Barbie, a complex and potentially sexist/problematic IP that other skilled female comedy writers, including Diablo Cody and Amy Schumer, had not been able to pitch effectively.\nYaszek : First and foremost, we should all see the Barbie movie now because it promises a bit of hope and fun in a moment when our news cycle has become an endless loop of doom and gloom clickbait headlines. Having said that, I also think we can double or even triple our pleasure by having some serious fun with the  Barbie  film. The history of Barbie is one of changing ideas about sex and gender. The doll debuted in 1959, just as the feminist revival was taking off and women were beginning to challenge simple gender binaries that suggested men were naturally suited to paid labor in the rough and tumble world of the public sphere while women were naturally suited to unpaid nurturing and caretaking in the home. With her many different careers and a Dream Home that originally was all dressing room and no kitchen, Barbie seemed to capture the excitement and possibility of the early Women’s Liberation Movement. In a toy market flooded with baby dolls that demanded their owners act like little mothers, Barbie offered kids whole new imaginative play possibilities and, of course, whole new ways to think about sex and gender beyond the simple, pseudo-Darwinian binaries popular for much of American history. So I think it’s no surprise that while Barbie is always popular, she’s having a real moment right now, as we once again grapple with expanding sex and gender ideals.\nPlay Video\nWhy should the Georgia Tech community, especially, see  Oppenheimer ?\nYaszek : I think members of the Georgia Tech community can use Oppenheimer’s life story as a kind of test case for thinking through technoscientific and ethical dilemmas they might encounter in their own lives. Oppenheimer’s role in the Manhattan Project was to supervise the translation of abstract concepts from theoretical physics into practical applications — in this case, the creation of a working nuclear bomb. Along the way, he had to negotiate some serious moral and ethical issues, including his own excitement at seeing the work progress and misgivings about what would happen if these weapons were really used. While most of our graduates are unlikely to be in that exact position, our students often do go on to work at the intersection between pure science and applied technology and as such, may well grapple with ethical questions and unseen social impacts in relation to their work. It’s always instructive to see and hear stories that engage the issues we face in our own lives; they are virtual laboratories for testing certain courses of action before we act on them in the real world. And they give us ways to keep asking and exploring important questions about the impact of our actions on the world, long after the story itself is over.\nYoshinaga : One of my colleagues who teaches at a private aeronautical university — a Florida science-and-tech school with much less race and gender diversity in its student population than Georgia Tech — taught a section of her science-fiction studies course about the Manhattan Project. And some of her young undergraduates responded by claiming that the bombing of Hiroshima and Nagasaki was “fake news.” This is the kind of dangerous misinformation trend that we faculty and researchers need to address, discuss, and teach/write about.  Oppenheimer ’s focus on scientific ethics in the context of both U.S. and global geopolitical history does just that.\nColatrella:  I want to see it to better understand the man and the historical forces contributing to and judging his work. But I’d also like to read the 2005 biography  American Prometheus  by Kai Bird and Martin J. Sherwin because I wonder if having more women on the Los Alamos team would have made a difference.\nWhat’s your most lasting memory about Barbie and her friends, or about the nuclear age, of the postwar era?\nColatrella:  When I was young, I enjoyed playing with Barbies with cousins and friends; we would sew outfits for our dolls and imagine what decisions they would make about romance, education, and work. When my daughter was growing up, I bought her a Barbie Dreamhouse because I always wanted to have one, and I was reluctant to let it go until I could give it to the daughter of a Georgia Tech alumna who had been one of my students.\nYoshinaga : When I was a very young child, my parents couldn’t afford to buy me a Barbie doll, so I went without one for much of my early years. Besides, I’d always asked for mythology books! So it was my uncle who finally got me a classic Barbie, but by that time, I was in my late elementary-school era and didn’t know what to do with it. I was reading a lot of Marvel comics by then, so I would put Barbie into action-sequence fights with my little brother’s GI Joe. When it comes to the postwar era, I’m too young to remember the nuclear-attack drills and propaganda of the 1950s and ‘60s. Still, all the sci-fi dystopias I saw in the movie theaters involved a nuclear apocalypse as the start of the end of the world. So I always believed a mushroom cloud was just around the corner. There was also a sense that we were the “good” empire and the Soviets were “evil”; that we were helpless, caught between this global battle of geopolitical giants that might end up incinerating all of humanity.\nYaszek : I remember getting in a tussle with my mom over Barbie versus Stephie, the crafty country mom from the Sunshine family of dolls. My mom was a good second-wave feminist, very earnestly devoted to making sure her kids escaped the grip of the American beauty myth, and she thought Stephie, with her trim but realistic proportions and cute but modest clothes, was the role model for us girls. But all I wanted was the Barbie doll with the diamond jewelry and the pink satin jumpsuit! I felt that way in part because I was and still am a big fan of shine and sparkle, but also in part because Stephie’s clothes only seemed appropriate for one role, that of a crafty country mom, while I could imagine Barbie’s clothes taking her anywhere — from paid work as anything from a teacher to astronaut to working on her car in Barbie’s Dream Garage to dinner and dancing, depending on her hairstyle and accessories. To my mom’s credit, she did give in and get me the Barbie of my dreams. Plus, it turned out that my little sister, who was teething, loved chewing on the Sunshine family dolls, so everyone was happy in the end.\nInterested in more?\nHere are some suggestions for pop culture books, films, and TV series to extend your 'Barbenheimer' experience:\nThe atomic age and women’s roles in it:\nYaszek recommends:\nCaroline Herzenberg and Ruth Howes’s  Their Day in the Sun: Women of the Manhattan Project\nMartha Ackman’s  The Mercury 13: The True Story of Thirteen Women and the Dream of Space Flight\nThe writings of postwar science fiction luminary Judith Merril. Her short story “That Only A Mother” is one of the most often-anthologized stories in science fiction history, and her novel  Shadow on the Hearth  was adapted for television as part of the prestigious Motorola story hour as “Atomic Attack!”\nYoshinaga recommends:\nWGN America network’s  Manhattan , which focuses on the wives and families of the scientists behind the bomb\nFeminism and the cultural importance of Barbie\nColatrella recommends:\nHer book,  Toys and Tools in Pink: Cultural Narratives of Gender, Science, and Technology,  as well as her forthcoming  Feminism’s Progress: Gender Politics in British and American Literature and Television since 1830\nYoshianaga recommends:\nSuperstar: The Karen Carpenter Story , a once-banned filmed in part with Barbie dolls by Todd Haynes, a filmmaker of stylish LGBTQIA+-themed movies\nYaszek recommends:\nBreanne Fahs’  Burn It Down! Feminist Manifestos for the Revolution  to better understand the centuries long history of feminist thinking\nThe National Women’s History Museum’s  online exhibits  on the four major waves of modern feminist activism.\nHer own  The Future is Female!  volumes\nAdditional Images\nContact\nMichael Pearson\nIvan Allen College of Liberal Arts\nEmail\nmichael.pearson@iac.gatech.edu\nGeorgia Institute of Technology\nNorth Avenue Atlanta, GA 30332\n+1 404.894.2000\nCampus Map\nGeneral\nDirectory\nEmployment\nEmergency Information\nLegal\nEqual Opportunity, Nondiscrimination, and Anti-Harassment Policy\nLegal & Privacy Information\nHuman Trafficking Notice\nTitle IX/Sexual Misconduct\nHazing Public Disclosures\nAccessibility\nAccountability\nAccreditation\nReport Free Speech and Censorship Concern\n© 2024 Georgia Institute of\nTechnology\nGT LOGIN\nResources\nGeorgia Tech Resources\nOffices and Departments\nNews Center\nCampus Calendar\nSpecial Events\nGreenBuzz\nInstitute Communications\nVisitor Resources\nCampus Visits\nDirections to Campus\nVisitor Parking Information\nGT visitor Wireless Network Information\nGeorgia Tech Global Learning Center\nGeorgia Tech Hotel and Conference Center\nBarnes and Noble at Georgia Tech\nFerst Center for the Arts\nRobert C. Williams Paper Museum\nColleges, Instructional Sites and Research\nColleges\nCollege of Computing\nCollege of Design\nCollege of Engineering\nCollege of Sciences\nIvan Allen College of Liberal Arts\nScheller College of Business\nInstructional Sites\nGeorgia Tech-Europe\nGeorgia Tech-Shenzhen\nGeorgia Tech Online\nProfessional Education\nThe Language Institute\nGlobal Footprint\nGlobal Engagement\nResearch\nGeorgia Tech Research Institute\nResearch at Georgia Tech\nExecutive Vice President for Research\nStudent and Parent Resources\nStudent Resources\nApply\nBuzzPort\nBuzzcard\nCareer Center\nCommencement\nGraduate and Postdoctoral Information\nUndergraduate Information\nLibrary\nStudent Life\nStudent Entrepreneurship\nEducation Abroad\nCanvas\nParent Resources\nParent and Family Programs\nDivision of Student Life\nScholarships and Financial Aid\nEmployee, Alumni, and Other Resources\nEmployees\nAdministration and Finance\nAdvising and Teaching\nFaculty Affairs\nFaculty Hiring\nPostdoctoral Services\nHuman Resources\nStaff Council\nTechWorks\nAlumni and Foundation\nAlumni Association\nAlumni Career Services\nFoundation\nGiving Back to Tech\nOutreach\nStartup Companies\nEconomic Development\nIndustry Engagement\nInstitute Relations\nProfessional Education\n✓ Thanks for sharing! AddToAny More…"}